{"003": ["Split Archive Part 3 File", "Third part of a split archive created by file splitter and combiner programs; contains the data sequentially following the data stored in a .001 and .002 file; may also have corresponding files with the extensions \".004,\" \".005,\" etc. depending on the file size.", "Windows, Mac, Linux, ", "['Smith Micro StuffIt Deluxe for Windows', 'Welltek 001 File Joiner & Splitter', 'Freebyte HJSplit for Java', 'Freebyte HJSplit', 'SplitJoin', '7-Zip', 'OO1 File Manager', 'File Splitter & Joiner']['Incredible Bee Archiver', 'Smith Micro StuffIt Deluxe 16', 'Freebyte HJSplit for Java', 'Split & Concat']['Freebyte HJSplit for Java', 'Freebyte HJSplit for Linux']"], "$01": ["DOS Pipe File", "Text file that contains output \"piped\" to it by a DOS program; often used for debugging programs; can be viewed in a text editor.", "Windows, ", "['Microsoft MS-DOS', 'text editor']"], "$$$": ["Temporary File", "Temp file created by a variety of programs; used as a backup in case original file becomes corrupted.", "Windows, ", "[]"], "001": ["Split Archive File", "First file of a split archive created with various file splitting and joining utilities; used for splitting large archives into smaller, more manageable files; can be used for saving files onto multiple floppy disks or CDs, or for creating smaller e-mail attachments.", "Windows, Mac, Linux, Windows, Windows, Windows, Mac, Linux, Windows, Mac, Linux, ", "['Smith Micro StuffIt Deluxe for Windows', 'Welltek 001 File Joiner & Splitter', 'Freebyte HJSplit for Java', 'Freebyte HJSplit', 'SplitJoin', '7-Zip', 'OO1 File Manager']['Smith Micro StuffIt Deluxe 16', 'Freebyte HJSplit for Java', 'Split & Concat', 'Incredible Bee Archiver']['Freebyte HJSplit for Java', 'Freebyte HJSplit for Linux']['Symantec Ghost Solution Suite']['Clickteam Multimedia Fusion']['Snes9x']['Snes9x']['Snes9x']['j2 Global Communications eFax']['j2 Global Communications eFax']['j2 Global Communications eFax']"], "00": ["The Ur-Quan Masters Saved Game Slot 0 File", "Saved game file created by The Ur-Quan Masters, a space exploration and sci-fi game based on the game Star Control 2; stores game progress in slot 0, which is the first slot of 50 available slots; enables progress to be resumed from the save point.", "Windows, Mac, Linux, ", "['The Ur-Quan Masters']['The Ur-Quan Masters']['The Ur-Quan Masters']"], "$db": ["dBASE Temporary File", "Temporary database file created while working on a dBASE database; may be used to recover changes made to a database if dBASE unexpectedly quits.", "Windows, ", "['dBase']"], "0": ["Shared Library Link File", "A 0 file is a link file used by Linux operating systems.  It contains a reference to a particular version of the library, which may have an extension such as \".0.0.0\" or \".0.0.1,\" depending on the library version.  0 files allow multiple versions of library files to exist while only one of them is referenced and used by the operating system's dynamic library loader.", "Linux, Windows, Windows, ", "[][][]"], "002": ["Split Archive Part 2 File", "Part two of a split archive created by various file splitter and joiner applications; contains the data sequentially following the data stored in a .001 file; may also have corresponding files with the extensions .003, \".004,\" etc.", "Windows, Mac, Linux, ", "['Smith Micro StuffIt Deluxe for Windows', 'Freebyte HJSplit']['The Unarchiver', 'Smith Micro StuffIt Deluxe 16', 'Incredible Bee Archiver', 'Split & Concat']['Freebyte HJSplit for Linux']"], "000": ["Indexing Service Data File", "000 files are created by Indexing Service, a software component of the Windows operating system that creates a searchable file system index from files on the hard drive.  The data stored in a 000 file helps Windows perform quicker searches.", "Windows, Linux, Windows, Windows, ", "['Microsoft Windows']['cabextract']['H+H Software Virtual CD', 'Smart Projects IsoBuster', 'EZB Systems UltraISO']['Microsoft MS-DOS']"], "$er": ["GroupWise Database", "Database used by the Novell GroupWise e-mail program", "Windows, ", "['Novell GroupWise']"], "!ut": ["uTorrent Incomplete Download", "Partial torrent file downloaded with the uTorrent BitTorrent client; appended to all in-progress downloads if the \"Append '.!ut' to incomplete files\" option is selected in uTorrent preferences; the \".!ut\" extension is removed once the file has been fully downloaded.", "Windows, Mac, ", "['uTorrent']['uTorrent']"], "!sync": ["BitTorrent Partially Synced File", "A !SYNC file is a partially synchronized file created by BitTorrent, a P2P file synchronization tool.  It serves as a temporary placeholder for any file that was not downloaded and synced.", "Windows, Mac, Linux, ", "['BitTorrent Sync']['BitTorrent Sync']['BitTorrent Sync']"], "!qb": ["qBittorrent Partial Download File", "Incomplete download file created by qBittorrent, a Torrent client; appends the \".!qB\" extension to a file as it's being downloaded, and the extension is removed when the download is complete; similar to .!BT BitTorrent and .!UT uTorrent files.", "Windows, Mac, ", "['qBittorrent']['qBittorrent']"], "3dl": ["iGO Landmark File", "GPS data file used by the iGO navigation software; contains points of interest, called landmarks; includes the location and associated metadata; saved to the \\iGO\\content\\building\\ directory of the navigation device's storage card.", "Windows, Windows, Windows, ", "[][][]"], "!bt": ["BitTorrent Incomplete Download File", "Partially downloaded file created by BitTorrent, a torrent downloading application; used for all in-progress downloads if the \"Append .!bt to incomplete files\" option is selected in the BitTorrent preferences.", "Windows, ", "['BitTorrent']"], "~cw": ["Circuit Wizard Backup File", "Temporary file created by Circuit Wizard, a circuit design and simulation program; saves a backup of a .CWZ circuit design file as it's being edited in the software; allows the design to be restored in the event of a system crash or program failure.", "Windows, ", "['New Wave Concepts Circuit Wizard']"], "3df": ["3D Format", "Highly compressed, secure three-dimensional image format that is a replica of the original model file; permits assembly part viewing, cut away, cross section, and measurements; includes security options that can limit printing and copying; may also be password protected.", "Windows, ", "[]"], "~hm": ["HostMonitor TestList Backup File", "Backup of a TestList (.HML) file created with HostMonitor, a server monitoring program; contains a list of servers and monitoring tasks; saved as a backup in case the original HML file becomes corrupted or is accidentally deleted.", "Windows, ", "['KS-Soft HostMonitor']"], "{pb": ["Corel WordPerfect Document Index File", "File created by WordPerfect, a word processing program; contains search and index information for referencing WordPerfect documents; used by the program for performing fast lookups through documents.", "Windows, ", "['Corel WordPerfect X8']"], "_nws": ["Windows Live Mail Newsgroup Copy File", "Newsgroup file created by Windows Live Mail (WLM); automatically generated when a user drags a newsgroup post or postings to the desktop; contains the same data as an .NWS file, except uses the \"._nws\" extension; can be renamed with the \".nws\" extension and then opened in WLM.", "Windows, ", "['Microsoft Windows Live Mail']"], "_eml": ["Windows Live Mail Email File", "Email file created by Windows Live Mail (WLM) when a user drags one or more email messages to the desktop; stores the email message data, but cannot be opened directly by WLM until the user changes the extension to .EML.", "Windows, ", "['Microsoft Windows Live Mail']"], "__b": ["File Splitter & Joiner Encrypted Archive File", "Encrypted split archive file created by File Splitter & Joiner (FFSJ), a spanned archive application; stores the second part of a multi-part encrypted archive; enables users to store password-protected data in smaller segments.", "Windows, ", "['File Splitter & Joiner']"], "__a": ["File Splitter & Joiner Encrypted File", "Split archive file created by File Splitter & Joiner (FFSJ), a utility used to break up files into smaller parts and reconstruct them; contains the first part of a multi-part encrypted archive; used for storing password-protected data in smaller segments.", "Windows, ", "['File Splitter & Joiner']"], "^^^": ["Pervasive.SQL Database File", "Database file used by Pervasive.SQL database software; based on the Btrieve transactional database format; created by the database engine when the database is placed in Continuous Operations mode.", "Windows, ", "['Pervasive PSQL']"], "8xv": ["TI-83/84 Plus Variable File", "File used by TI-83 Plus and TI-84 Plus graphing calculators from Texas Instruments; contains a list of variables; commonly used as input to a calculator program, such as mathematical variables for a function.", "Windows, Mac, ", "['Texas Instruments TI Connect']['Texas Instruments TI Connect']"], "8xu": ["TI-83 and TI-84 Plus Operating System File", "File used by the Texas Instruments TI-83 and TI-84 Plus advanced math and science graphing calculators; contains files that operate the calculator; provides periodic updates to the operating system of TI-83 and TI-84 Plus calculators.", "Windows, Mac, Linux, ", "['Texas Instruments TI Connect', 'Texas Instruments TI Connect CE', 'TiLP2']['Texas Instruments TI Connect', 'Texas Instruments TI Connect CE', 'TiLP2']['Texas Instruments TI Connect CE', 'TiLP2']"], "8xs": ["TI-83/84 Plus String File", "String file used by Texas Instruments TI-83 and TI-84 Plus graphing calculators; contains a collection of strings; typically used to store parameters for a calculator application, such as a list of names for an address book program.", "Windows, Mac, ", "['Texas Instruments TI Connect']['Texas Instruments TI Connect']"], "8xp": ["TI-83 Plus Calculator File", "Program or data file used by the Texas Instruments TI-83 Plus and TI-84 series calculators; can be transferred to the calculator from a computer using a TI Connectivity Cable and the included software.", "Windows, Mac, Linux, ", "['Texas Instruments TI Connect']['Texas Instruments TI Connect'][]"], "8xk": ["TI-83 Plus Application Upgrade File", "File used by the Texas Instruments TI-83 calculator, an advanced math and science graphing calculator; contains application upgrades, such as interactive study card and data manipulator programs; used for TI-83 Plus and TI-83 Plus Silver Edition models.", "Windows, Mac, ", "['Texas Instruments TI Connect']['Texas Instruments TI Connect']"], "8svx": ["Amiga 8-Bit Sound File", "Audio file used by the older Amiga personal computers; stores recorded audio in the 8-bit quality 8SVX format, which is a derivative format of the .IFF specification; supports mono and stereo sound.", "Windows, Mac, Linux, ", "['XMPlay', 'DeliPlayer', 'Cloanto Amiga Forever', 'Audacity', 'SoX']['Cloanto Amiga Forever', 'Audacity', 'SoX']['Audacity', 'SoX']"], "8st": ["8start Launcher File", "File used by 8start Launcher, a program used to organize shortcuts from the desktop and Windows start menu into a single user interface; contains settings for the launcher to run an application, such as the program target and window state.", "Windows, ", "[]"], "8xi": ["TI-83/84 Plus Picture File", "Picture file used by Texas Instruments TI-83 and Ti-84 graphing calculators; contains an image that can be displayed on startup or during normal calculator operation; commonly used to embed company logos or other graphics into programs.", "Windows, Mac, ", "['Texas Instruments TI Connect']['Texas Instruments TI Connect']"], "8xg": ["TI-83/84 Plus Group File", "File used by Texas Instruments TI-83 Plus and TI-84 Plus graphing calculators; contains one or more calculator files, such as data sets, program code, matrices, or other calculator data; used to package multiple files together in a single file.", "Windows, Mac, ", "['Texas Instruments TI Connect']['Texas Instruments TI Connect']"], "8pbs": ["Adobe Photoshop Macintosh File", "File created by the Mac version of Adobe Photoshop before Photoshop used file extensions on the Mac; stores graphics that have been created or edited with the software.", "Windows, Mac, ", "['Adobe Photoshop CC 2017']['Adobe Photoshop CC 2017']"], "8med": ["Amiga OctaMed Music File", "Music or sound file created on an Amiga system.", "Mac, ", "[]"], "8li": ["Photoshop Scripting Plug-in", "Photoshop plugin file that adds additional automation features to Photoshop; may add general scripting support (i.e. ScriptListener.8li and ScriptingSupport.8li) or may add a specific automated action, such as creating a Web Contact Sheet (WebContactSheet.8li).", "Windows, Mac, ", "['Adobe Photoshop CC 2017']['Adobe Photoshop CC 2017']"], "8ld": ["Overlord 2 Language File", "Game file used by Overlord 2, a third-person action and adventure game; contains data that localizes the game into different languages; used for items, dialog, and other game information.", "Windows, ", "['Triumph Studios Overlord 2']"], "8cu": ["TI-84 Plus C Operating System File", "Operating system file used by TI-84 Plus C Silver Edition graphing calculators; contains a software update used to update the upgradable operating system.", "Windows, Mac, ", "['Texas Instruments TI Connect CE']['Texas Instruments TI Connect CE']"], "8ca": ["TI-84 Plus C Image Var Format", "Image format, known as Image Var, used by TI-84 Plus C graphing calculators for background images; uses 16-bit color.", "Windows, Mac, ", "['Texas Instruments TI Connect CE']['Texas Instruments TI Connect CE']"], "8by": ["PhotoDeluxe Plug-in", "Adds extra features to Photoshop or PhotoDeluxe; belongs in Plug-ins folder within Photoshop or PhotoDeluxe folder.", "Windows, Mac, ", "['Adobe Photoshop CC 2017', 'Adobe PhotoDeluxe']['Adobe Photoshop CC 2017', 'Adobe PhotoDeluxe']"], "8cm": ["Eight Channel Module", "8 channel audio file created by Starbreeze Studios Fasttracker.", "Windows, ", "['Starbreeze Studios Fasttracker']"], "8ck": ["TI-83 and TI-84 Plus Application File", "Application file used by the Texas Instruments TI-83 and TI-84 Plus advanced math and science graphing calculators; contains an application used by the calculator.", "Windows, Mac, ", "['Texas Instruments TI Connect CE']['Texas Instruments TI Connect CE']"], "8ci": ["TI-84 Plus C Pic Vars Format", "Image format, known as Pic Vars, used by TI-84 Plus C graphing calculators as an overlay on the graph screen area; uses 15-bit color.", "Windows, Mac, ", "['Texas Instruments TI Connect CE']['Texas Instruments TI Connect CE']"], "8bx": ["PhotoDeluxe Plug-in", "Plugin file used by both Adobe Photoshop and PhotoDeluxe (now Photoshop Elements); contains data that adds extra features to then software; should be placed in the /Plug-ins/ directory of the software installation.", "Windows, Mac, ", "['Adobe Photoshop CC 2017', 'Adobe PhotoDeluxe']['Adobe Photoshop CC 2017', 'Adobe PhotoDeluxe']"], "8bs": ["Photoshop 5.0 Selection Plug-in", "Adds additional image selection options to Photoshop; can be used to create or modify image selections or selection masks.", "Windows, Mac, ", "['Adobe Photoshop CC 2017', 'Adobe Photoshop Elements 15']['Adobe Photoshop CC 2017', 'Adobe Photoshop Elements 15']"], "8bl": ["Photoshop Plug-in", "Adds additional features to Photoshop, such as extra image filters and other effects; should be placed in Plug-ins Folder within the Photoshop application folder.", "Windows, Mac, ", "['Adobe Photoshop CC 2017', 'Adobe Photoshop Elements 15']['Adobe Photoshop CC 2017', 'Adobe Photoshop Elements 15']"], "8bi8": ["Photoshop Plug-in", "Adds additional features, such as extra filters or effects, to Photoshop software; should be placed in Plug-ins Folder within Photoshop folder.", "Windows, Mac, ", "['Adobe Photoshop CC 2017', 'Adobe Photoshop Elements 15']['Adobe Photoshop CC 2017', 'Adobe Photoshop Elements 15']"], "8bi": ["Photoshop Plug-in", "Adds additional features, such as extra filters or extra format support, to Adobe Photoshop; should be placed in the Plug-ins Folder within the Photoshop application folder.", "Windows, Mac, ", "['Adobe Photoshop CC 2017', 'Adobe Photoshop Elements 15', 'Corel PaintShop Pro X9']['Adobe Photoshop CC 2017', 'Adobe Photoshop Elements 15']"], "8bf": ["Photoshop Filter Plug-in", "Adds extra functionality, such as new image filters, to Photoshop and compatible programs; should be installed in the \"Plugins\" subfolder inside the Photoshop directory.", "Windows, Mac, Windows, Mac, ", "['Adobe Photoshop CC 2017', 'Adobe Photoshop Elements 15', 'Adobe Illustrator CC 2017']['Adobe Photoshop CC 2017', 'Adobe Photoshop Elements 15', 'Adobe Illustrator CC 2017']['Corel PaintShop Pro X9'][]"], "8ba": ["Photoshop Plug-in", "An 8BA file is a Photoshop plug-in that adds additional features or capabilities to Photoshop or Paint Shop Pro (PSP).  It may provide new image effects, add new photo filters, or add support for extra file formats.  Some 8BA plug-ins are included with Photoshop, while many others can be purchased from third-party developers.", "Windows, Mac, ", "['Adobe Photoshop CC 2017', 'Corel PaintShop Pro X9']['Adobe Photoshop CC 2017']"], "8be": ["PhotoDeluxe Plug-in", "Adds additional capabilities to PhotoDeluxe photo-editing software; should be placed in Plug-ins Folder within PhotoDeluxe folder.", "Windows, Mac, ", "['Adobe PhotoDeluxe']['Adobe PhotoDeluxe']"], "8bc": ["Photoshop 5.0 Plug-in", "Adds extra capabilities, such as additional image effects, to Photoshop; belongs in Plugins folder within Photoshop application folder.", "Windows, Mac, ", "['Adobe Photoshop CC 2017']['Adobe Photoshop CC 2017']"], "89k": ["TI-89 Application", "Application file used by Texas Instruments TI-89 graphing calculators; contains a small program that can be run on the calculator; can be uploaded using TI Connect calculator management software.", "Windows, Mac, ", "['Texas Instruments TI Connect']['Texas Instruments TI Connect']"], "890": ["Cavena Subtitles File", "Movie subtitles file format created by Cavena, an organization that develops subtitle preparation, transmission, and postproductions solutions; saves a list of subtitles with timestamps that synchronize the closed captions with video.", "Windows, ", "['Cavena Toolbox', 'EZTitles', 'Subtitle Edit']"], "83p": ["TI-83 Calculator File", "Calculator program or data file used by the Texas Instruments TI-83 calculator; can be transferred calculator from a computer to the calculator using a TI Connectivity Cable and the included software; the original TI-GRAPH LINK software has been replaced by TI Connect.", "Windows, Mac, Linux, ", "['Texas Instruments TI Connect']['Texas Instruments TI Connect'][]"], "73l": ["TI-73 Data List File", "Data file created by TI DataEditor, a utility included with TI Connect graphing calculator management software; saves a list of values that can be used in mathematical and plotting operations on the TI-73 calculator.", "Windows, Mac, ", "['Texas Instruments TI Connect']['Texas Instruments TI Connect']"], "7z": ["7-Zip Compressed File", "A 7Z file is a compressed archive created with Igor Pavlov's 7-Zip file compression utility.  It uses open-source LZMA compression, which has a high compression ratio and can include strong AES-256 (256-bit) encryption.  The file supports Unicode file names, archive header compression, and file sizes up to 16,000,000,000 GB.", "Windows, Mac, Linux, Android, ", "['File Viewer Plus', '7-Zip', 'Corel WinZip 21', 'Smith Micro StuffIt Deluxe for Windows', 'B1 Free Archiver', 'WinRAR 5', 'PeaZip', 'WinInizio ZipGenius', 'ConeXware PowerArchiver']['Corel WinZip Mac 5', 'Smith Micro StuffIt Deluxe 16', 'Incredible Bee Archiver', 'B1 Free Archiver', 'Sixty Five 7zX', 'The Unarchiver', 'p7zip', 'EZ7z', 'Zipeg']['B1 Free Archiver', 'p7zip', 'PeaZip', 'Zipeg']['File Viewer for Android', 'RARLAB RAR', 'ZDevs ZArchiver']"], "73u": ["TI-73 Explorer Operating System File", "File used by the Texas Instruments TI-73 Explorer advanced math and science graphing calculators; stores low-level system data that operates the calculator; used for applying periodic updates to the base operating system.", "Windows, Mac, ", "['Texas Instruments TI Connect']['Texas Instruments TI Connect']"], "787": ["AVTECH CCTV Video File", "Video file recorded by an AVTECH closed circuit television (CCTV) system or a digital video recorder (DVR); saves the video in a proprietary format that can only be played back by the AVTECH software; used for reviewing and archiving security videos.", "Windows, ", "[]"], "73k": ["TI-73 Application", "Application file used by Texas Instruments TI-73 graphing calculators; can be uploaded to a TI calculator using TI Connect calculator management software; used for running small programs on the device.", "Windows, Mac, ", "['Texas Instruments TI Connect']['Texas Instruments TI Connect']"], "73i": ["TI-73 Screenshot File", "Image created by TI ScreenCapture, a program included with TI Connect, a suite of programs used for interacting with Texas Instruments graphing calculators; saves a screenshot of the TI-73 device's screen taken when the calculator was connected to the computer.", "Windows, Mac, ", "['Texas Instruments TI Connect']['Texas Instruments TI Connect']"], "73c": ["TI-73 Constant File", "Data file used by Texas Instruments graphing calculators; stores variables such as a single number or multiple number values; can be saved and edited using TI Connect, the utility used for managing applications on a TI graphing calculator.", "Windows, Mac, ", "['Texas Instruments TI Connect']['Texas Instruments TI Connect']"], "68k": ["SEGA Mega Drive & Genesis Classics ROM File", "A 68K file is a game ROM used by SEGA Mega Drive and Genesis Classics, an emulation program available on Steam.  It stores the contents of a game cartridge and is used for running older games on the PC.", "Windows, ", "['SEGA Mega Drive and Genesis Classics', 'MAME']"], "73b": ["TI-73 Backup File", "Backup file created by TI Connect, a program used for interfacing with Texas Instruments graphing calculators; saves all device data for a TI-73 device; can be used to restore the calculator state when the backup was performed.", "Windows, Mac, ", "['Texas Instruments TI Connect']['Texas Instruments TI Connect']"], "6cm": ["Six Channel Module", "6 channel audio file created by Starbreeze Studios Fasttracker.", "Windows, ", "['Starbreeze Studios Fasttracker']"], "669": ["UNIS Composer 669 Module", "8 channel tracker module; similar to a .MOD file; uses sound samples for instruments.", "Windows, Mac, Linux, ", "['Nullsoft Winamp', 'OpenMPT', 'Schism Tracker']['CocoModX', 'Schism Tracker']['Schism Tracker']"], "5xs": ["Line 6 POD HD500X Edit Setlist File", "Set list created by Line 6 POD HD500X Edit, an application that enables you to edit instrument effects (DAW); contains up to 64 presets that are used to change the settings for \"FX,\" \"AMPS,\" \"Mixer,\" and \"Controllers,\" which customize the sound of your instrument; when loaded, replaces the currently loaded Set list within the application.", "Windows, Mac, ", "['Line 6 POD HD500X Edit']['Line 6 POD HD500X Edit']"], "60d": ["CCTV Video Clip", "Closed-circuit television (CCTV) format used for recording surveillance video; used by Digital Video Multiplexer Recorders, which can capture feeds from several different cameras at once; may contain several video clips in a single file.", "Windows, ", "[]"], "555": ["Black & White Weather Settings File", "Properties file used by Black & White, a strategy game where players control villages as a god; stores settings for different weather system states, such as day, dusk, and night, as well as good and evil weather.", "Windows, Mac, ", "['Lionhead Studios Black and White']['Lionhead Studios Black and White']"], "5xb": ["Line 6 POD HD500X Edit Bundle", "Bundle file created by Line 6 POD HD500X Edit, a DAW program that enables you to edit and create instrument sound effects; contains up to 8 setlists with presets; once loaded, will change the settings for \"FX,\" \"AMPS,\" \"Mixer,\" and \"Controllers,\" which create different sounds from your interment depending on how you customize them.", "Windows, Mac, ", "['Line 6 POD HD500X Edit']['Line 6 POD HD500X Edit']"], "4ui": ["ForeUI Plot File", "Project file created by ForeUI, a user interface prototyping application; contains a \"plot,\" which is a user interface mockup that contains layout elements; used for saving and loading interface projects.", "Windows, ", "['EaSynth Solution ForeUI']"], "4th": ["Forth Language File", "Language file created for Forth programming language, which is supported by several different text editors that enable features such as syntax highlighting; contains Forth programming code similar to how .C files contain C or C++ source code; same format as the .FORTH file. ", "Windows, Mac, Linux, ", "['GNU Gforth', 'Kate Editor']['KDevelop', 'Kate Editor']['KDevelop', 'GNU Gforth', 'Kate Editor']"], "4dv": ["4D View Ultrasound File", "Ultrasound data file generated by a GE Healthcare Voluson ultrasound machine; can be viewed using GE's 4D View software or ViewPoint with the 4D View plug-in.", "Windows, ", "[]"], "4mp": ["4-MP3 Database File", "Database of audio files organized by 4-MP3, a database manager for storing and searching information on collections of sound files; supported formats include .MP3, .WAV, and .VQF; allows large collections of audio files to be searched and browsed efficiently.", "Windows, ", "[]"], "4fs": ["Puppy Linux Save State File", "File system save file used by the fourth extended file system (EXT4) of Puppy Linux; stores the state of the file system at a specific point in time and can be used for resetting the file system back to that state; saved to an external file system partition, since Puppy Linux can run standalone off of a CD or .ISO file.", "Linux, ", "['Puppy Linux']"], "4dl": ["4th Dimension Database Log File", "Log file that stores a record of changes to a 4D database (.4DD) file; saved along with the database file and uses a similar filename; designed to keep track the updates made to the database.", "Windows, Mac, ", "['4D 4th Dimension']['4D 4th Dimension']"], "4dd": ["4th Dimension Database Data File", "Data file saved by 4th Dimension, a software development program; stores the actual data referenced by a 4D database structure (.4DB) file; can be compacted by 4D Developer or 4D Server using the \"Compact data file\" command.", "Windows, Mac, ", "['4D 4th Dimension']['4D 4th Dimension']"], "477": ["MNS Shape Definition Companion File", "File used by Master Navigation Software, a GIS navigation program used on laptops and mobile devices; saved with a corresponding ESRI shapefile (.SHP extension) and contains the the type definition for the PROJ.4 cartographic projection data.", "Windows, ", "['Sapper Oy Master Navigator Software']"], "4db": ["4th Dimension Database Structure File", "Database structure created with 4th Dimension, a software development application; contains 4D code, forms, and resource data; used during the development-cycle within 4D's integrated software development framework.", "Windows, Mac, ", "['4D 4th Dimension']['4D 4th Dimension']"], "411": ["Mavica Thumbnail Image", "Thumbnail image created by Sony Mavica cameras; contains a 64x48 pixel preview of its corresponding full-size image; used with a .HTM file to display previews of images.", "Windows, Mac, ", "['XnViewMP']['XnViewMP']"], "3w": ["XYZprinting Sliced Model File", "A 3W file is a model created by XYZware, software bundled with XYZprinting printers such as da Vinci Pro.  It contains a sliced model of a 3D object in Base64 Encode G-code.  3W files are created by XYZware then transmitted to a 3D printer for printing.", "Windows, ", "['XYZprinting XYZware']"], "3pe": ["TurboTax 2008 Form File", "Form used by TurboTax 2008; contains data used for displaying tax forms within TurboTax; includes form text and layout information, as well as instructions that may be included with each form.", "Windows, Mac, ", "['Intuit TurboTax Deluxe']['Intuit TurboTax Deluxe']"], "3p2": ["3GPP Multimedia File", "Multimedia format created by the 3rd Generation Partnership Project (3GPP); designed to transmit multimedia files over the Internet; used capture and playback video on mobile phones; more commonly seen with the .3GP extension.", "Windows, Mac, Linux, ", "['Adobe Flash Professional CC', 'Apple QuickTime Player', 'Roxio Creator NXT Pro 5', 'VideoLAN VLC media player', 'RealNetworks RealPlayer Cloud', 'MPlayer']['Adobe Flash Professional CC', 'Apple QuickTime Player', 'Roxio Toast 15', 'VideoLAN VLC media player', 'RealNetworks RealPlayer Cloud']['VideoLAN VLC media player', 'MPlayer']"], "3mm": ["3D Movie Maker Movie Project", "Movie or animation created with 3D Movie Maker (3DMM) for Windows; includes a 3D scene with three-dimensional characters and objects; may also contain music, sound effects, speech, and special effects.", "Windows, ", "[]"], "3me": ["TurboTax Form File", "Tax form used by TurboTax tax preparation software; contains form data displayed within the program and may also include instructions and comments associated with the form.", "Windows, Mac, ", "['Intuit TurboTax Deluxe']['Intuit TurboTax Deluxe']"], "3mf": ["3D Manufacturing File", "A 3MF file is a 3D manufacturing file format used to build and print 3D models with Windows apps such as 3D Builder.  It contains a 3D model, which includes textures, mesh, colors, materials, scale, and a print ticket that contains recommended print options.", "Windows, ", "['Microsoft 3D Builder']"], "3gpp2": ["3GPP2 Multimedia File", "Audio and video container format created in the 3GPP2 (3rd Generation Partnership Project 2) format; contains both audio and video data; designed to extend several of the specifications from the 3GPP standard (.3GP files) for CDMA-based mobile phones.", "Windows, Mac, ", "['Microsoft Windows Video', 'Apple QuickTime Player', 'Adobe Flash Professional CC']['Apple QuickTime Player', 'Adobe Flash Professional CC']"], "3gpp": ["3GPP Media File", "Audio and video format developed by the 3rd Generation Partnership Project (3GPP); designed for transmitting multimedia files over the Internet; also a common format for saving cell phone videos.", "Windows, Mac, Linux, Web, Android, ", "['Microsoft Windows Video', 'CyberLink PowerDVD 16', 'Adobe Flash Professional CC', 'Apple QuickTime Player', 'Roxio Creator NXT Pro 5', 'VideoLAN VLC media player', 'MPlayer', 'Xilisoft Video Converter Ultimate', 'Applian Replay Converter']['Apple QuickTime Player', 'Adobe Flash Professional CC', 'Roxio Toast 15', 'Wondershare Video Converter Pro for Mac 4', 'MPlayer', 'VideoLAN VLC media player']['VideoLAN VLC media player', 'MPlayer']['Google Drive']['PANDORA.TV KMPlayer']"], "3gpa": ["3GPP Multimedia File", "A 3GPA file is a multimedia file developed by the 3rd Generation Partnership Project (3GPP).  It stores video and audio streams that are saved in an audio and video container format.  3GPA files are used for transmitting audio and video between 3G mobile phones and over the Internet.", "Windows, Mac, Linux, ", "['Microsoft Windows Video', 'Microsoft Groove Music', 'Xilisoft Video Converter Ultimate', 'VideoLAN VLC media player', 'MPlayer']['Apple QuickTime Player', 'Roxio Toast 15', 'VideoLAN VLC media player', 'MPlayer', 'Eltima Elmedia Player']['VideoLAN VLC media player', 'MPlayer']"], "3gp2": ["3GPP Multimedia File", "Multimedia video and audio file created in the 3rd Generation Partnership Project (3GPP) format; developed for transmitting multimedia files over the Internet, especially on mobile devices; more commonly seen with the .3GP extension.", "Windows, Mac, Android, ", "['Microsoft Windows Video', 'Apple QuickTime Player', 'Adobe Flash Professional CC', 'KMPlayer', 'video player']['Apple QuickTime Player', 'Adobe Flash Professional CC', 'Eltima Elmedia Player', 'video player']['PANDORA.TV KMPlayer']"], "5xe": ["Line 6 POD HD500X Edit Preset File", "Preset file created by Line 6 POD HD500X Edit, an application that enable you to edit instrument effects; contains settings for different effects such as \"FX,\" \"AMPS,\" \"Mixer,\" and \"Controllers;\" different settings that can be customized within the effects include bass, tone, treble, tempo, channel volume, parameters, speed, and tempo sync.", "Windows, Mac, ", "['Line 6 POD HD500X Edit']['Line 6 POD HD500X Edit']"], "3gp": ["3GPP Multimedia File", "A 3GP file is a multimedia file saved in an audio and video container format developed by the 3rd Generation Partnership Project (3GPP).  It stores video and audio streams that are transmitted between 3G mobile phones and over the Internet.", "Windows, Mac, Linux, iOS, Android, ", "['File Viewer Plus', 'Microsoft Windows Video', 'Microsoft Groove Music', 'Xilisoft Video Converter Ultimate', 'VideoLAN VLC media player', 'MPlayer']['Apple QuickTime Player', 'Roxio Toast 15', 'VideoLAN VLC media player', 'MPlayer', 'Eltima Elmedia Player']['VideoLAN VLC media player', 'MPlayer']['olimsoft OPlayer']['File Viewer for Android', 'PANDORA.TV KMPlayer', 'BIT LABS Simple MP4 Video Player', 'J2 Interactive MX Player']"], "3ga": ["3GPP Audio File", "Audio file saved in the 3GPP format, which was developed by the 3rd Generation Partnership Project; most commonly used on cell phones for capturing, playing, and transmitting audio data.", "Windows, Mac, Linux, ", "['File Viewer Plus', 'Apple QuickTime Player', 'DVDVideoSoft Free 3GP Converter', 'VideoLAN VLC media player', 'FFmpeg']['Apple QuickTime Player', 'VideoLAN VLC media player', 'FFmpeg']['VideoLAN VLC media player', 'FFmpeg']"], "3g2": ["3GPP2 Multimedia File", "A 3G2 file is a multimedia file saved in an audio and video format developed by the 3rd Generation Partnership Project 2 (3GPP2).  3G2 files are designed for transmitting multimedia content over the Internet and are used by cell phones to save video files.", "Windows, Mac, Linux, Android, ", "['File Viewer Plus', 'Microsoft Windows Video', 'Microsoft Groove Music', 'Corel VideoStudio Pro X10 Ultimate', 'CyberLink PowerDirector 15 Ultra', 'VideoLAN VLC media player', 'Inmatrix Zoom Player 8']['Apple QuickTime Player', 'VideoLAN VLC media player', 'Aiseesoft Video Converter Ultimate']['RealNetworks RealPlayer Cloud', 'VideoLAN VLC media player']['PANDORA.TV KMPlayer']"], "3fs": ["Puppy Linux Save State File", "File containing a file system snapshot saved in the third extended file system (EXT3) in Puppy Linux; stores the state of the file system at a certain point in time and can be used for resetting the file system back to that state; saved to an external file system partition, since Puppy Linux can run off of a CD or .ISO file.", "Linux, ", "['Puppy Linux', 'GNOME Disk Utility']"], "3fr": ["Hasselblad 3F RAW Image", "Digital photo captured by a Hasselblad digital camera; saves the photo in a RAW format as captured directly by the digital camera's CCD; used for saving photos natively before applying touch-ups, such as white balance or color corrections.", "Windows, Mac, iOS, Android, ", "['File Viewer Plus', 'Corel PaintShop Pro X9', 'Microsoft Windows Photos', 'Adobe Photoshop Elements 15', 'CyberLink PhotoDirector 8 Ultra', 'Engelmann Media Photomizer Pro']['Adobe Photoshop Elements 15', 'Apple Preview', 'Apple Photos', 'MacPhun ColorStrokes', 'CyberLink PhotoDirector 8 Ultra']['Adobe Photoshop Express']['Adobe Photoshop Express']"], "3dz": ["Nintendo 3DS ROM", "A 3DZ file is a game file used by Gateway 3DS, a microSD card for Nintendo 3DS used to play 3DS, DS, and homebrew games.  It contains a copy of the data from an original 3DS game cartridge. \r\n 3DZ files are saved in the same format as the more popular .3DS files but contain a header which indicates to Gateway that it is compatible for online play.", "Windows, Mac, Linux, Windows, ", "[][][]['DzSoft Easy 3D Creator']"], "3dxml": ["Dassault Systemes 3D XML File", "File created in the proprietary Dassault Systemes 3DXML format; contains meshes, textures, lighting effects, and other 3D object properties; used to specify an XML-based 3D object.", "Windows, Mac, Linux, ", "['Adobe Acrobat DC', 'GLC_Player']['Adobe Acrobat DC', 'GLC_Player']['GLC_Player']"], "3dw": ["3D World Studio File", "3D scene created by Leadwerks' 3D World Studio, a program used for creating 3D environments for games run with the Leadwerks game engine; contains buildings, terrain, lighting information, and other environment details.", "Windows, ", "[]"], "3dx": ["Rhino 3D Model File", "Three-dimensional model created with the Rhino (Rhinoceros) 3D modeling program; uses NURBS (Non-Uniform Rational B-Splines) to represent 3D geometry.", "Windows, ", "[]"], "3dv": ["3D VRML World", "3D \"virtual reality\" world saved in the VRML format; contains scenes and objects that make up a virtual world; allows users to walk through virtual areas, such as buildings and various landscapes.", "Windows, Mac, ", "['IMSI TurboCAD Pro 2017']['IMSI TurboCAD Deluxe v10']"], "3dt": ["3D Topicscape File", "Firebird relational database in which the metadata of a 3D Topicscape is held; collection of information organized by a user in a 3D mind map or concept map.", "Windows, ", "['3D Topicscape']"], "3dsx": ["Homebrew Launcher File", "A 3DSX file is a homebrew launcher file used by 3DS software exploits such as ninjhax, ironhax, or tubehax to run homebrew.  It contains executable code that is run to launch homebrew applications, which are unofficial software created by amateur developers for closed gaming systems.", "Windows, Mac, ", "['Microsoft Windows Explorer']['Apple Finder']"], "3ds": ["3D Studio Scene", "A 3DS file is a 3D image format used by Autodesk 3D Studio.  It contains mesh data, material attributes, bitmap references, smoothing group data, viewport configurations, camera locations, and lighting information.  3DS files may also include object animation data.", "Windows, Mac, Linux, Windows, Mac, Linux, ", "['Autodesk 3ds Max 2017', 'IMSI TurboCAD Pro 2017', 'Trimble SketchUp', 'MeshLab', 'MAXON Cinema 4D', 'pmG messiahStudio', 'CADSoftTools ABViewer', 'Adobe Photoshop CC 2017', 'GLC_Player']['IMSI TurboCAD Deluxe v10', 'Trimble SketchUp', 'Cheetah3D', 'MeshLab', 'MAXON Cinema 4D', 'pmG messiahStudio', 'Adobe Photoshop CC 2017', 'GLC_Player']['GLC_Player']['Citra', 'TronDS']['Citra']['Citra']"], "3dr": ["3D Rad Project File", "Project file created by 3D Rad, a free application used to create 3D games; stores a 3D scene with objects and their properties; also stores links between objects, which allows them to interact with physical constraints.", "Windows, Windows, ", "['3D Rad']['Futuremark 3DMark']"], "3don": ["Scrutinize 3D Mesh File", "3D image file used by Scrutinize, a graphical debugging program for 3D algorithms; contains 3D mesh data for a debugging session in a JSON (JavaScript Object Notation) format; used for rendering 3D model data while debugging.", "Windows, ", "[]"], "3dmk": ["123D Make Project File", "Model design created by 123D Make, a program used for turning 3D models into cutout plans; stores a 3D model that is used to generate cutout instructions for building the model with paper, wood, or other materials; used for DIY (do-it-yourself) home model construction projects and can be shared with other users online through the 123D gallery.", "Windows, Mac, iOS, ", "['Autodesk 123D Make']['Autodesk 123D Make']['Autodesk 123D Make']"], "3dp": ["3DMark2011 SE Project File", "File created by 3DMark2011 SE, a program used for benchmarking PCs with DirectX 8; saves the system specs, a list of tests to run, and the results after running the benchmarks; allows the results to be saved and reviewed.", "Windows, Windows, ", "['Futuremark 3DMark']['Autodesk 123D Catch']"], "3dmf": ["QuickDraw 3D Metafile", "Three-dimensional image format based on Apple QuickDraw 3D (QD3D) technology; may be a 3D representation of an individual object or a complete three-dimensional scene; can be viewed from different angles with supporting 3D programs.", "Windows, Mac, ", "['Pedagoguery Poly Pro', 'Okino Computer Graphics PolyTrans']['AlphaOmega 3DMF Viewer', 'Cheetah3D']"], "3dm": ["Rhino 3D Model", "A 3DM file is an open-source 3D model format and native file format for Rhinoceros.  It contains a 3D model which includes surface, points, and curve information.  3DM files allow CAD, CAM, CAE, and computer graphics software to accurately save and exchange 3D geometry using both NURBS and polygon mesh representations.", "Windows, Mac, ", "['McNeel Rhino', 'Autodesk Fusion 360']['McNeel Rhino OSX', 'IMSI TurboCAD Deluxe v10']"], "3dd": ["ArcGlobe Document", "GIS data file created by ArcGlobe, a visualization application used to view 3D GIS datasets; stores a reference to a geodatabase, which contains the spatial content and output results created by the software's geoprocessing operations; can store GIS data as a collection of three-dimensional layers; used for saving and loading views of 3D GIS datasets.", "Windows, ", "['ESRI ArcGIS for Desktop']"], "3dc": ["RacerMate 3D Course File", "Training course file used by Computrainer 3D, a simulation software for RacerMate's CompuTrainer and Velotron electronic bicycle ergometers/trainers; contains a racing track, including road and elevation characteristics; used for storing actual real-world courses, as well as rehabilitation courses for physical therapy.", "Windows, Windows, Windows, Windows, Windows, ", "['RacerMate CompuTrainer'][]['Amabilis 3DCrafter'][]['3D Compression Technologies 3DCT', '3D Compression Technologies 3DCT Viewer', 'McNeel Rhino']"], "3dmdef": ["3DMark Definition File", "Settings file used by 3DMark, an application that enables users to benchmark the 3D gaming capability of a Windows computer; contains settings that define the 3DMark test; includes command-line options, number of benchmark loops, and scaling modes.  ", "Windows, ", "['Futuremark 3DMark']"], "3d4": ["Stereo CAD-3D 2.0 Image File", "3D image created by the second version of Atari's Stereo CAD-3D for storing three-dimensional objects; may contain up to 40 objects and includes the colors and lighting associated with the object.", "Windows, ", "['quick3D']"], "3dmark-result": ["3DMark Results File", "Results file used by 3DMark, an application used to benchmark the 3D gaming capability of a Windows computer; contains a computer's DirectX performance results initiated by the 3DMark test. ", "Windows, ", "['Futuremark 3DMark']"], "3d2": ["Stereo CAD-3D 2.0 Image File", "Three-dimensional image used by the second version of Stereo CAD-3D, an application for the Atari ST system; stores up to forty 3D objects; includes object color and lighting information; used as an earlier format for computer animation.", "Windows, ", "['quick3D']"], "386": ["Windows Virtual Device Driver", "Device driver file used by Windows 3.x systems; allows one or more hardware devices to communicate with the computer; may also add support for internal components; \"386\" comes from the type of processor used in many early Windows machines.", "Windows, ", "[]"], "360": ["360desktop Panorama File", "Image file used by 360desktop, a program that enables a panoramic desktop environment; stores a 360 degree panoramic wallpaper image; can be comprised of multiple digital photos that have been stitched together.", "Windows, ", "['360desktop']"], "32x": ["Sega 32X ROM", "Game ROM used by emulation software for the Sega 32X, an add-on component for the original Sega Genesis console; stores a copy of the original cartridge's data; used for playing older games on the PC.", "Windows, Mac, Linux, ", "['Kega Fusion']['Kega Fusion']['Kega Fusion']"], "323": ["H.323 Internet Telephony File", "File used by some video conferencing programs, such as Microsoft's Conferencing Utility Dll (msconf.dll, included with some older versions of Windows) or Intel's Video Phone Container; contains information used for setting up an online audio and video conference; not commonly used anymore.", "Windows, ", "[]"], "2sflib": ["Nintendo DS Audio Library File", "File used by some Nintendo DS games; saves sound information used for playing audio during the game; referenced by .MINI2SF files, which point to the parts of the library to play during the game.", "Windows, ", "['Nullsoft Winamp with vio2sf plug-in']"], "3d": ["Survex 3D Cavern File", "3D file created by Survex, a program used for recording and visualizing cave system data; contains data that allows the software to visualize a 3D cave system; was generated from an .SVX file using the cavern program included with Survex.", "Windows, Mac, Linux, Windows, ", "['Survex', 'Therion']['Survex']['Survex']['quick3D']"], "2sf": ["Nintendo DS Sound File", "Game audio file used by some Nintendo DS games; saves audio data in a format similar to MIDI; can be played by Winamp or Foobar2000 with the vio2sf plug-in.", "Windows, ", "['Nullsoft Winamp with vio2sf plug-in', 'Foobar2000 with vio2sf plug-in']"], "2mg": ["Apple IIGS Disk Image", "Disk image created from a floppy disk formatted for the Apple IIGS, a 16-bit Apple II computer; may contain applications, games, or other files that can be used by an Apple IIGS system.", "Windows, Mac, Linux, ", "[][][]"], "2fs": ["Puppy Linux Save State File", "Operating system (OS) snapshot saved by Puppy Linux, an easy-to-use Linux variant; stores the state of the OS at a point in time and can be used for resetting the OS back to that state; saved to an external file system partition, since Puppy Linux can run standalone off of a CD or .ISO file.", "Linux, ", "['Puppy Linux']"], "208": ["ASUS Notebook BIOS 208 Update File", "BIOS update file used to \"flash\" the BIOS to ASUS computers running Windows; contains settings and instructions for the \"208\" BIOS update, which is intended to update the Embedded Controller (EC) firmware on an ASUS notebook motherboard.", "Windows, ", "['ASUS Winflash']"], "2d": ["VersaCAD 2D Drawing File", "Two-dimensional drawing created by VersaCAD, a drafting and dimensioning CAD application; contains drawn objects and their measurements; used to store drafted buildings plans before construction.", "Windows, Mac, ", "['Archway Systems VersaCAD']['Archway Systems VersaCAD']"], "2bp": ["Pocket PC Bitmap Image File", "Bitmap or raster image format used for storing images on Pocket PC PDA devices; may be created by converting images saved in other formats using Microsoft ActiveSync; can be viewed on PCs and directly on a Pocket PC device with various software programs.", "Windows, Mac, Linux, ", "['Microsoft ActiveSync', 'Newera Graphics Converter Pro', 'XnViewMP']['XnViewMP']['XnViewMP']"], "264": ["Ripped Video Data File", "Temporary video file generated by video ripping and conversion programs, such as StaxRip and RipBot264; contains extracted video data that can be repurposed and encoded into other video formats; typically stored with MPEG-4/H.264 encoding.", "Windows, Mac, ", "['StaxRip', 'RipBot264']['Roxio Toast 15']"], "256": ["Descent 2 Color Palette File", "File used by Descent 2, a first person shooter game where players battle as ships in outer space; contains a color palette with RGB values; describes colors used by .PIG texture files.", "Windows, Mac, ", "['Interplay Descent 2']['Interplay Descent 2']"], "1st": ["Readme File", "Readme text file sometimes bundled with applications; contains important information or instructions for operating the software; uses the \"1st\" extension so that users know to open the readme first before running the application for the first time.", "Windows, ", "['Microsoft Notepad', 'text editor']"], "3da": ["3D Assembly File", "Three-dimensional model created by various 3D modeling programs; stores a model in a plain text format, where each line of text specifies the vertices that determine the shape of the object.", "Windows, ", "['Delcam ArtCAM', 'AeroHydro SurfaceWorks', 'Zanoza ZModeler']"], "1ph": ["TurboTax File", "Tax return prepared by TurboTax tax preparation software.", "Windows, Mac, ", "['Intuit TurboTax Deluxe']['Intuit TurboTax Deluxe']"], "1pe": ["TurboTax Form File", "Tax forms used by TurboTax tax preparation software.", "Windows, Mac, ", "['Intuit TurboTax Deluxe']['Intuit TurboTax Deluxe']"], "123dx": ["123D Design Model File", "3D model created by 123D Design, a program used for designing models for print or fabrication; stores the 3D geometry of the model, as well as materials that define the surface appearance of the model.", "Windows, Mac, iOS, ", "['Autodesk 123D Design']['Autodesk 123D Design']['Autodesk 123D Design']"], "123d": ["Autodesk 123D Drawing", "CAD drawing created by 123D, a free 3D CAD design application provided by Autodesk; may contain multiple parts that together comprise the model; can be published to standard raster image formats or to Autodesk's .DWG format.", "Windows, ", "['Autodesk 123D']"], "123c": ["Autodesk 123C Drawing", "CAD model created by 123D, a free 3D CAD drawing program developed by Autodesk; can include multiple parts that make up the overall model; used for drafting and prototyping mesh models, props, and scenery.", "Windows, ", "['Autodesk 123D']"], "123": ["Lotus 1-2-3 Spreadsheet", "Spreadsheet created by Lotus 1-2-3, part of IBM Lotus SmartSuite; organizes data in rows and columns; functions can be applied to the data in various cells, which can automatically populate the data in other cells.", "Windows, Mac, Linux, Windows, ", "['IBM Collaboration Solutions', 'Corel Quattro Pro X8', 'Apache OpenOffice', 'Gnumeric']['Planamesa NeoOffice', 'Apache OpenOffice']['Apache OpenOffice', 'Gnumeric']['Sunstone Circuits PCB123']"], "1": ["Unix Section 1 Man Page", "Manual page (or \"man page\") used by the Man utility, a Unix program used to view user manuals; contains plain text documentation separated into several segments and delimited by standard markers; used for storing a level 1 user manual.", "Linux, ", "['GNU Emacs', 'text editor']"], "0xe": ["F-Secure Renamed Virus File", "Virus file detected by F-Secure, an antivirus program; stores a renamed .EXE file that has a virus which could not be disinfected; renamed from an EXE file to an OXE file so that a virus will not execute when double-clicking it in Windows.", "Windows, ", "['F-Secure Internet Security']"], "0cc": ["0CC-FamiTracker Module", "An 0CC file is a module used by 0CC-FamiTracker, a backwards compatible extension of the FamiTracker program used to produce music for Nintendo (NES) Famicom systems.  It contains module data such as instruments and patterns, which are notes that comprise the melody.", "Windows, ", "['0CC-FamiTracker']"], "113": ["Iomega Backup File", "Backup of data typically stored on an Iomega removable storage device.", "Windows, Mac, ", "[][]"]}