{"a": ["Static Library", "Contains a library of functions and headers that may be referenced by a C/C++ source file; may contain only a few functions or may include an entire library of functions, such as a 3D modeling engine.", "Windows, Mac, Linux, ", "['Microsoft Visual Studio 2017', 'Microsoft Notepad', 'gVim', 'text editor']['GNU Compiler Collection (GCC)', 'Apple TextEdit', 'Bare Bones BBEdit', 'MacVim', 'text editor']['GNU Compiler Collection (GCC)', 'GNU Emacs', 'text editor']"], "a8s": ["Anim8or Script", "Script created for Anim8or, a free 3D modeling and character animation program for Windows; saved in a plain text format and contains source code written in the ASL (Anim8or Scripting Language) syntax.", "Windows, ", "['Anim8or', 'Microsoft Notepad', 'text editor']"], "aa3": ["ATRAC Audio File", "Compressed audio file that uses Sony's ATRAC (Adaptive Transform Acoustic Coding) compression; supported by Sony audio devices and the Connect Music Services online store, which has been discontinued; AA3 files do not include any copy protection or digital rights management (DRM).", "Windows, ", "['Sony SonicStage', 'MAGIX Sound Forge Pro 11', 'MAGIX Vegas Pro 14', 'MAGIX ACID Pro 7', 'Sony ACID Xpress', 'MAGIX ACID Music Studio 10']"], "aaui": ["Acrobat User Interface File", "User interface component, referred to as a \"Tool Set,\" used by Adobe Acrobat, a program used for creating and editing PDFs; acts like a plugin and may store a custom panel or other interface component; used by Acrobat users for distributing and installing custom third-party Tool Sets.", "Windows, Mac, ", "['Adobe Acrobat DC']['Adobe Acrobat DC']"], "aaf": ["Advanced Authoring Format File", "File used by Avid audio editing and production software products such as Avid Pro Tools and Avid Media Composer; contains links to audio and video files as well as editing decisions that are applied to the audio and video data.", "Windows, Mac, ", "['Avid Pro Tools', 'Avid Media Composer', 'Avid Xpress', 'Adobe After Effects CC 2017']['Avid Pro Tools', 'Avid Media Composer', 'Avid Xpress', 'Adobe After Effects CC 2017', 'Apple Logic Pro X']"], "aao": ["America's Army Map File", "Map file used by America's Army (AA), a multi-player shooter game released by the US Army; contains a game map, including terrain, buildings, and other objects; used to create and share custom maps. ", "Windows, Windows, ", "[][]"], "aa": ["Audible Audio Book File", "Digital audio format used by Audible to store audio books; designed for storing spoken word audio and supports chapter markers, bookmarks, etc. ", "Windows, Mac, Windows, ", "['Audible AudibleManager', 'Apple iTunes', 'Nero 2017', 'Audials Tunebite 2017', 'SoundTaxi Media Suite', 'TuneCab', 'CoolUtils Total Audio Converter']['Apple iTunes']['Smart Projects IsoBuster']"], "aam": ["Authorware Map File", "File created by Authorware, a program used to develop multimedia e-learning applications; contains references to resources that are required to play the Authorware application, such as movies and images; also contains the names and locations of developer libraries, file segments, and external files.", "Windows, Mac, ", "['Adobe Authorware']['Adobe Authorware']"], "aac": ["Advanced Audio Coding File", "Compressed audio file similar to an .MP3 file, but offers several performance improvements; examples include a higher coding efficiency for both stationary and transient signals, a simpler filterbank, and better handling of frequencies above 16 kHz; maintains quality nearly indistinguishable from the original audio source.", "Windows, Mac, Linux, iOS, Android, ", "['File Viewer Plus', 'Microsoft Groove Music', 'Nullsoft Winamp', 'Apple iTunes', 'Media Player Classic', 'VideoLAN VLC media player', 'Audials One 2017', 'Roxio Creator NXT Pro 5', 'RealNetworks RealPlayer Cloud', 'Adobe Audition CC 2017', 'MPlayer', 'Applian Replay Converter', 'Xilisoft Video Converter Ultimate']['Apple iTunes', 'VideoLAN VLC media player', 'Roxio Toast 15', 'RealNetworks RealPlayer Cloud', 'Adobe Audition CC 2017', 'MPlayer']['VideoLAN VLC media player', 'RealNetworks RealPlayer Cloud', 'MPlayer', 'XMMS with AAC plugin']['olimsoft OPlayer']['File Viewer for Android', 'Videolabs VLC for Android']"], "a7p": ["Authorware 7 Project", "Project created with Authorware 7, a program used to create media-rich, e-learning applications; contains a project that can be published as an Authorware application; includes the flowline and associated icons, which represent functions such as Interaction, Display, and Motion.", "Windows, Mac, ", "['Adobe Authorware']['Adobe Authorware']"], "a6p": ["Authorware 6 Program", "Compiled Authorware application created with Authorware 6.x, a visual authoring program for creating media-rich e-learning applications; playable in the full version of Authorware or the free Authorware Player.", "Windows, Mac, ", "['Adobe Authorware']['Adobe Authorware']"], "a65": ["Authorware 6.5 File", "Authorware project created with Authorware 6.5; editable project format that has not yet been packaged or compiled for distribution.", "Windows, Mac, ", "['Adobe Authorware']['Adobe Authorware']"], "a5w": ["Alpha Five Webpage File", "Server-side webpage used by Alpha Five, a rapid application development (RAD) tool used for creating Web applications; similar to an .ASP or .PHP page but is written using Alpha Five syntax; often contains dynamic webpage components such as dialogs and forms; used for developing desktop-like applications that run in a Web browser.", "Windows, Windows, ", "['Alpha Software Alpha Anywhere', 'text editor']['Adobe Authorware']"], "a5l": ["Authorware 5 Library", "Contains objects such as images, sounds, icons, and controls referenced by an Authorware project; Authorware is a software program used for creating e-learning content.", "Windows, ", "['Adobe Authorware']"], "a52": ["Atari 5200 ROM", "Game ROM used by Atari 5200 console emulators; saves the data for the game exactly as it was represented on the game cartridge; used for storing old games and playing them using emulation software that supports the Atari 5200 BIOS.", "Windows, Mac, Windows, Mac, Linux, ", "['MESS', 'kat5200', 'Rainbow 2.0']['MacMESS']['VideoLAN VLC media player']['VideoLAN VLC media player']['VideoLAN VLC media player']"], "azz": ["AZZ Cardfile Database File", "File created by AZZ Cardfile, a free program used for organizing personal information; may contain addresses, phone numbers, personal contacts, references, notes, and recipes; may also be password protected.", "Windows, ", "['AZZ Cardfile']"], "azw4": ["Amazon Print Replica eBook", "eBook created for Kindle desktop software and Kindle eReader devices; used primarily for creating textbooks called \"Print Replicas;\" uses both MOBI and PDF technologies and includes DRM protection.", "Windows, Mac, Linux, ", "['Amazon Kindle for PC', 'Calibre']['Amazon Kindle for Mac', 'Calibre']['Calibre']"], "azw3": ["Amazon KF8 eBook File", "eBook created in the Kindle Format 8 (KF8), Amazon's successor to the .AZW format; supports newer features such as HTML5 and CSS3 support as well as many other formatting capabilities; often includes DRM protection; used as the download format for newer Amazon eBooks.", "Windows, Mac, Linux, ", "['Amazon Kindle for PC', 'Kindle Previewer', 'Calibre']['Amazon Kindle for Mac', 'Kindle Previewer', 'Calibre']['Calibre']"], "azw2": ["Kindle Active Content App File", "Game or other app used by Kindle eReading devices; differs from an .AZW or .AZW3 file since it supports active content; used for for games such as chess and solitaire, as well as for other applications like a notepad; downloaded to the Kindle when you purchase apps on the Kindle store.", "Windows, ", "['7-Zip']"], "azw1": ["Amazon Topaz eBook", "eBook file used by Amazon Kindle devices and the Amazon Kindle desktop software; stores an eBook in the Kindle Topaz format (.TPZ format); used for storing downloaded eBooks from Amazon's 3G Whispernet network.", "Windows, Mac, ", "['Amazon Kindle for PC']['Amazon Kindle for Mac']"], "azw": ["Amazon Kindle eBook File", "An AZW file is a digital eBook formatted for the Amazon Kindle, a wireless reading device.  It contains formatted book text and chapter markers and is similar to a Mobipocket .PRC file.  AZW files can be transferred from a PC to the Kindle via a standard USB connection and can also be read using the Kindle desktop software.", "Windows, Mac, Linux, Android, ", "['Amazon Kindle for PC', 'Cool Reader']['Amazon Kindle for Mac']['Cool Reader']['Cool Reader']"], "a7r": ["Authorware 7 Runtime File", "Package created by Authorware 7, an application used to create educational applications; contains a packaged .A7P file without runtime; cannot be edited.", "Windows, Mac, ", "['Adobe Authorware']['Adobe Authorware']"], "az!": ["Vuze Partial Download File", "File created by Vuze, a cross-platform BitTorrent client; contains data for a file as it is being downloaded (e.g., \".avi.az!\" for an .AVI file); used for marking the file as a download in progress, and the \".az!\" file extension is removed when the download is complete.", "Windows, Mac, Linux, ", "['Vuze']['Vuze']['Vuze']"], "ay": ["AY Chiptune File", "Audio file used by games from older computer systems that had a General Instruments AY series sound chip; contains a \"chiptune,\" which specifies a sound format that enables the sound card chip to create sounds in real time; can be played back using a program that emulates the AY sound chip.", "Windows, Mac, Linux, ", "['Audio Overload', 'Ay_Emul', 'Micro Speccy']['Audio Overload']['Audio Overload']"], "axx": ["AxCrypt Encrypted File", "File created by AxCrypt, a free personal privacy and security utility for Windows; contains a password-protected file encrypted with AES encryption; also incorporates file compression; requires the password and optionally a key file to open.", "Windows, ", "['Axantum AxCrypt']"], "axd": ["ASP.NET Web Handler File", "File used by ASP.NET applications for handling embedded resource requests; contains instructions for retrieving embedded resources, such as images, JavaScript (.JS) files, and .CSS files; used for injecting resources into the client-side Web page and access them on the server in a standard way.", "Windows, ", "['Microsoft Visual Studio 2017']"], "axt": ["Adobe Photoshop Extract File", "Color extraction file created by Photoshop, an image-editing application developed by Adobe Systems; contains information for replacing one color with another color; can specify the replacement's fuzziness as well as the hue, saturation, and lightness of the replacement color.", "Windows, Mac, Windows, ", "['Adobe Photoshop CC 2017']['Adobe Photoshop CC 2017']['Microsoft AutoRoute']"], "axm": ["AXMEDIS Object", "Media file saved in the AXMEDIS format, used for multichannel content distribution; may contain multiple types of media, such as images, video, audio, and metadata in a single package; may also include DRM copy-protection information.", "Windows, ", "[]"], "axe": ["AutoRoute Map File", "Locations file created by Microsoft AutoRoute, a map navigation and trip planning program for Eastern and Western Europe; contains \"pushpins,\" which are Points of Interest (POI) on the map; can also contain navigation data.", "Windows, Windows, ", "['Microsoft AutoRoute']['Codalogic LMX']"], "ax": ["DirectShow Filter", "Used by various video playback programs to process video data streams; provides decoding and encoding capabilities, file parsing, audio and video de-multiplexing, video decompression, and rendering of video files; may also be used in the video recording and editing process.", "Windows, Mac, Linux, ", "['Microsoft Windows Media Player', 'Apple QuickTime Player', 'VideoLAN VLC media player', 'video player']['Apple QuickTime Player', 'video player']['VideoLAN VLC media player']"], "aww": ["Ability Write Document", "Document created by Ability Write, the word processor included with the Ability Office productivity suite; similar to a Microsoft Word document and supports text, images, and advanced page formatting.", "Windows, ", "['Ability Office']"], "awt": ["AbiWord Template", "Document template created by AbiWord, a free word processing program; stores preset page layout and style settings for a document; enables users to author multiple .ABW documents with the same formatting.", "Windows, Mac, Linux, ", "['AbiSource AbiWord']['AbiSource AbiWord']['AbiSource AbiWord']"], "aws": ["AutoCAD Work Space File", "XML settings file used by AutoCAD, a 3D design and documentation application; stores the visibility and location of user interface elements, such as tool palettes; used for customizing and personalizing the AutoCAD workspace.", "Windows, Windows, ", "['Autodesk AutoCAD 2017']['Ability Office']"], "awm": ["AllWebMenus Project File", "Project file created by AllWebMenus, a Web menu builder program; contains properties for a dynamic HTML drop-down menu; can include themes and other appearance settings; compiled by the software into a self-contained Web package that can be inserted into websites.", "Windows, ", "['Likno AllWebMenus']"], "awp": ["Ability Write Template", "Document template created by Ability Write, the word processing application included with the Ability Office suite; used for creating Ability Write documents (.AWW files) with the same styles and page formatting; useful for company letterheads and memo templates.", "Windows, ", "['Ability Office']"], "awg": ["Activeworlds Object Group File", "Contains a group of objects saved by Activeworlds, a 3D virtual reality design program; used for creating interactive 3D content that can be displayed on the Web; AWG files allow several objects to be opened at once.", "Windows, Windows, ", "['Web browser']['Ability Office']"], "awdb": ["Access Walker Database File", "Database file created by Access Walker, a program used to manage passwords and login information; securely stores sensitive data using AES and Blowfish encryption algorithms; used for storing confidential data that can only be retrieved with a single master password.", "Windows, ", "['ISS Data Security Access Walker']"], "awk": ["AWK Script", "Script created for awk, a text processing program that is included with Unix and Linux operating system distributions; contains instructions for matching, replacing, and printing text from an input string or file; used for producing formatted text and reports.", "Mac, Linux, ", "['awk', 'MacVim', 'Apple TextEdit', 'text editor']['awk', 'Vim', 'text editor']"], "azzx": ["Uncompressed AZZ Cardfile Data File", "File created by AZZ Cardfile, a program used for organizing personal information; saves the personal database in an uncompressed format, which is an alternative to the compressed .AZZ format.", "Windows, ", "['AZZ Cardfile']"], "awd": ["Microsoft Fax Document", "Fax image, also called an \"At Work Document,\" created by Microsoft Fax software; stores the content of a received fax, including the text and page structure information; can be converted to a .TIF file by executing the program awdvstub.exe, which is located in the i386\\win9xmig\\fax\\ directory on the Windows XP/2000 installer CD.", "Windows, Windows, Windows, ", "['Polybytes PolyView'][]['Boris Eyrich Artweaver', 'XnViewMP with the AWD plugin']"], "awcav": ["ActiveWorlds Custom Avatar File", "Virtual avatar file created by ActiveWorlds Browser, a 3D online chatting application; saves properties that specify the gender and appearance of a 3D character; can customize the face, hair, skin, clothes, and other features of a person's avatar.", "Windows, ", "['ActiveWorlds Browser']"], "aw": ["Answer Wizard File", "File created by Answer Wizard Builder, a program used for creating help topic add-ons to Microsoft Office programs; contains an index, keywords, and related help topics; used to browse and locate a help topic associated with a search term or question.", "Windows, ", "['Microsoft Word 2016', 'Microsoft Excel 2016', 'Microsoft PowerPoint 2016', 'Microsoft Access 2016', 'Microsoft Project 2016']"], "avx": ["Avid Plugin File", "Software extension used by Avid products such as Media Composer and Xpress; adds functionality to the software such as custom video effects or new file format importing; enables third-party developers to extend the base application features.", "Windows, Mac, Windows, ", "['Avid Media Composer', 'Avid Xpress']['Avid Media Composer', 'Avid Xpress']['ESRI ArcGIS for Desktop']"], "awb": ["AMR-WB Audio File", "Audio format known as \"Adaptive Multi Rate - WideBand\" (AMR-WB) that uses a patented speech coding standard; similar to an .AMR file, but supports a wider frequency bandwidth of 50 Hz to 7 KHz; supports nine different bit rates, from 6.6 kbps to 23.85 kbps.", "Windows, ", "[]"], "awbr": ["WriteOnline WordBar File", "An AWBR file is a WordBar file used by WriteOnline, a literacy tool used to help struggling writers in middle school through college.  The file contains one or more word banks about subjects such as clothing, countries, and food.", "Windows, Mac, iOS, ", "['Crick Software Clicker']['Crick Software Clicker']['Crick Software WriteOnline']"], "avv": ["Avid Volume Bin File", "Library or \"bin\" of media files created by Avid Media Composer, a professional video editing application; bundles media files in a single location so that they can be organized and managed more easily; allows multiple versions of input files (e.g., English and Spanish audio) to be stored simultaneously.", "Windows, Mac, ", "['Avid Media Composer']['Avid Media Composer']"], "avs": ["AVS Preset File", "Configuration file used by Advanced Visualization Studio (AVS), an audio visualizer for Winamp; contains settings for animations that are created based on the music played within Winamp.", "Windows, Windows, Mac, Windows, Windows, Windows, Mac, ", "['Nullsoft Winamp with the Advanced Visualization Studio plugin']['Avid Media Composer', 'Avid Xpress']['Avid Media Composer', 'Avid Xpress'][]['Avisynth', 'Nero 2017', 'Microsoft Notepad', 'text editor']['Adobe Photoshop CC 2017']['Adobe Photoshop CC 2017']"], "avp": ["Avid Project File", "Project file created by Avid Technology's professional video editing applications; contains references to video and audio clips, as well as the edits such as transitions and effects; used for saving projects for motion pictures.", "Windows, Mac, Windows, ", "['Avid Media Composer', 'Avid Xpress']['Avid Media Composer', 'Avid Xpress']['Avira Antivirus Pro 2016']"], "avl": ["ArcView Legend File", "Contains a legend or key for a map created with ESRI ArcView GIS (Graphic Information System) mapping software; includes symbology information used in the corresponding map file; saved in a standard text format and may be referenced by a ArcView project (.APR) file.", "Windows, Windows, ", "['ESRI ArcGIS for Desktop']['Avira Antivirus Pro 2016']"], "avj": ["AntiVir Job File", "File used by AntiVir antivirus software for Windows; saved in a plain text format and contains the configuration information for a scheduled job, which may be for an antivirus scan or a software update.", "Windows, ", "['Avira Antivirus Pro 2016']"], "avhdx": ["Automatic Virtual Hard Drive File", "An AVHDX file is a disk image checkpoint used by Windows Server and its Microsoft Hyper-V technology, which bootstraps virtual machines (VM) using disk images.  It contains the state, data, and hardware configuration of a VM at the time of the file creation.  AVHDX files are created to save a specific state of a .VHDX virtual hard drive.", "Windows, ", "['Microsoft Windows Server 2016']"], "avi": ["Audio Video Interleave File", "An AVI file is a file saved in a multimedia container format created by Microsoft.  It stores video and audio data that may be encoded in a variety of codecs such as DivX and XviD.  AVI files typically use less compression than similar formats such as .MPEG and .MOV.", "Windows, Mac, Linux, iOS, Android, ", "['File Viewer Plus', 'Microsoft Windows Video', 'Microsoft Windows Media Player', 'CyberLink PowerDirector 15 Ultra', 'Xilisoft Video Converter Ultimate', 'VideoLAN VLC media player', 'Nullsoft Winamp', 'Kodi']['Apple QuickTime Player', 'Eltima Elmedia Player', 'VideoLAN VLC media player', 'ShedWorx Smart Converter', 'Kodi']['xine', 'Kodi', 'RealNetworks RealPlayer Cloud', 'VideoLAN VLC media player']['olimsoft OPlayer', 'VideoLAN VLC for iOS 2', 'Google Drive']['BIT LABS Simple MP4 Video Player', 'Google Drive', 'Videolabs VLC for Android']"], "avhd": ["Hyper-V SnapShot File", "File created by Hyper-V, a virtualization program included with Microsoft Windows Server; saves a snapshot of the virtual machines instances and allows the state of the virtual machines to be restored; may be very large in size.", "Windows, ", "['Microsoft Windows Server 2016']"], "avgdx": ["AVG Diagnostics File", "File run by AVG Diagnostics, a diagnostics collection program included with AVG antivirus software; uses the filename runner.avgdx and runs the diagnostics tool when opened; collects system information that is used by an AVG technical support representative to resolve an application issue.", "Windows, ", "['AVG AntiVirus FREE']"], "avery": ["Avery Design & Print Label File", "An AVERY file is a label file created with Avery Design & Print or Design & Print Online.  It contains one or more printable labels, which may include text, graphics, and page layout information.  AVERY files are used for printing business cards, name tags, binder inserts, address labels, disc labels, greeting cards, and other labels.", "Windows, Mac, Web, ", "['Avery Design & Print']['Avery Design & Print']['Avery Design & Print Online']"], "ave": ["Avid User File", "Settings file used by Avid Media Composer, Avid Xpress, and other Avid video editing software; typically saved alongside a project .AVS settings file and contains user settings; enables user-specific preferences to be saved.", "Windows, Mac, ", "['Avid Media Composer', 'Avid Xpress']['Avid Media Composer', 'Avid Xpress']"], "avchd": ["High Definition Video File", "A file-based format for digital recording and playback of high-definition video; its name is an acronym which stands for Advanced Video Coding High Definition.", "Windows, Mac, Linux, ", "['VideoLAN VLC media player']['VideoLAN VLC media player']['VideoLAN VLC media player']"], "avc": ["Kaspersky Virus Database", "Update file used by Kaspersky Lab's Anti-Virus and Internet Security computer security software; stores antivirus definitions for the program; used for downloading protection information that keeps the software up-to-date.", "Windows, Windows, Mac, ", "['Kaspersky Anti-Virus 2017', 'Kaspersky Internet Security 2017']['Avid Media Composer']['Avid Media Composer']"], "avb": ["Avid Bin File", "Library or \"bin\" of files used by an Avid video-editing project; stores references to media clips, sub-clips, sequences, titles, effects, EQ templates, etc.", "Windows, Mac, Windows, ", "['Avid Media Composer', 'Avid Xpress']['Avid Media Composer', 'Avid Xpress']['Microsoft Comic Chat 2.5']"], "avatar": ["Google Talk Avatar File", "Profile picture used by Google Talk, an online chatting application; stores a bitmap image in a .JPG or .PNG image format; used for displaying an image alongside each name in a user's friends list, as well as during chatting sessions.", "Windows, ", "['Google Talk']"], "avastlic": ["Avast! License File", "Licence file used by commercial versions of avast! antivirus software; contains subscription and authorization information that registers the application on the computer; includes the license holder name, the product name, and the license expiration date; uses the filename License.avastlic.", "Windows, ", "['avast! Pro Antivirus', 'avast! Internet Security']"], "av": ["Final Draft AV Script", "An AV file is a document created by Final Draft AV (version 1), a word processor used to create screenplays for commercials, corporate videos, and documentaries.  It contains a script, which includes dialogue, character information, scenes, and video and audio columns.  AV files also include information about the script, such as the title, length, writer, director, and draft version. ", "Windows, Mac, ", "[][]"], "aux": ["LaTeX Auxiliary File", "File created by TeX and LaTeX, which are typesetting standards often used to generate academic papers and other technical documentation; contains information about a document such as footnotes, bibliography entries, and cross-references.", "Windows, Mac, Linux, Windows, ", "['MiKTeX', 'TeXworks', 'proTeXt', 'LaTeX Editor']['LyX/Mac', 'TeXworks']['TeX Live']['ESRI ArcGIS for Desktop', 'ERDAS IMAGINE']"], "avastsounds": ["Avast! Soundpack File", "Audio pack file used by avast! antivirus and internet protection software; stores an archive of .WAV sounds that are played when certain events occur in the software, such as a threat detection or completion of a virus scan; can be double-clicked to install the soundpack.", "Windows, ", "['avast! Pro Antivirus', 'avast! Internet Security']"], "autoplay": ["AutoPlay Media Studio Project File", "Project file created by AutoPlay Media Studio, a rapid application development tool used for creating games, CD menus, and multimedia applications; stores the application's user interface information as well as the actions to take when the user interacts with the program.", "Windows, ", "['Indigo Rose AutoPlay Media Studio']"], "au3": ["AutoIt v3 Script", "Automated script created with AutoIt v3, a freeware scripting program that uses a programming language similar to BASIC; designed for automating commands within Windows and for other general scripting purposes.", "Windows, ", "['File Viewer Plus', 'AutoIt', 'SciTE4AutoIt3 ']"], "automaticdestinations-ms": ["Windows Jump List File", "An AUTOMATICDESTINATIONS-MS file is a Jump List file used by Windows 7, a Microsoft Windows operating system (OS).  It contains information about the application used that is pinned on a user's taskbar, timestamps, and the paths to items (documents, webpages, images, etc.) recently accessed by a program pinned on a user's taskbar.", "Windows, ", "['Microsoft Windows']"], "aut": ["AutoIt Script File", "File used by AutoIt, a program originally developed to automate the setup of large numbers of Windows PCs; contains BASIC-like program code that interacts with processes and simulates keystrokes and mouse movements; can be used to create Windows GUIs.", "Windows, ", "['AutoIt']"], "au": ["Audacity Audio File", "Audio file created by Audacity, a free, cross platform audio editor; uses a proprietary format that can only be opened by Audacity; saved as one of multiple audio data files for an Audacity project (.AUD).", "Windows, Mac, Linux, Windows, Mac, Linux, ", "['Audacity']['Audacity']['Audacity']['File Viewer Plus', 'Nullsoft Winamp', 'Microsoft Windows Media Player', 'Apple QuickTime Player', 'RealNetworks RealPlayer Cloud', 'Adobe Audition CC 2017', 'VideoLAN VLC media player']['Apple QuickTime Player', 'RealNetworks RealPlayer Cloud', 'Adobe Audition CC 2017', 'VideoLAN VLC media player']['VideoLAN VLC media player']"], "aup": ["Audacity Project File", "Audio project file created by Audacity, a free sound editor and recorder; saved in an XML format and contains references to audio files as well as any applied sound edits; used for saving audio editing work.", "Windows, Mac, Linux, ", "['Audacity']['Audacity']['Audacity']"], "aud": ["Video Game Compressed Audio File", "Audio file or sound clip compressed using AUD compression; used in computer games developed by Westwood Studios, such as Command & Conquer and Red Alert; also used by Sierra's Laura Bow 2: The Dagger of Amon Ra.", "Windows, ", "[]"], "atz": ["Atomic Time Zone File", "Contains a list of active Atomic Time Zone servers from around the world; keeps track of the current time by checking with several \"atomic clocks\" via the Internet.", "Windows, Windows, ", "[]['Gladiators Aston']"], "ats": ["Advanced ETL Transformation Script", "Script created by Advanced ETL Processor, a data integration and conversion tool; saves rules for data readers, transformers, and writers; transforms data between source and destination formats when run; can be edited visually as a data flow diagram in the software.", "Windows, ", "['DB Software Laboratory Advanced ETL Processor']"], "atx": ["ArcGIS Attribute Index File", "GIS file created by ArcGIS mapping and spatial analysis software; saves an attribute index for a shapefile (.SHP) or a corresponding .DBF file. ", "Windows, Windows, Mac, ", "['ESRI ArcGIS for Desktop'][][]"], "att": ["Web Form Post Data File", "File created by Web forms when users submit data in a Web browser; contains contents from a Web form that have been emailed to the designated recipient; attached to email messages with the filename postdata.att.", "Windows, Windows, ", "['Weaver Software PostData Spider', 'Microsoft Notepad', 'text editor'][]"], "atr": ["Atari Disk Image", "Disk image created on an Atari computer system; contains an exact copy of an Atari 8-bit formatted disk; may be a single or double density image containing 720 or 1440 sectors.", "Windows, ", "[]"], "atom": ["Atom Syndication Format", "XML-based syndication format, similar to .RSS files; designed to be a universal publishing standard for personal content and weblogs", "Windows, Mac, ", "['NewzCrawler', 'FeedDemon', 'RssReader']['Apple Safari', 'NewsGator NetNewsWire']"], "atn": ["Photoshop Actions File", "Contains one or more actions recorded in Photoshop; used for automating common editing steps and for batch processing images; can be saved and loaded using the pop-up menu in the Photoshop Actions palette.", "Windows, Mac, ", "['Adobe Photoshop CC 2017', 'Adobe InCopy CC 2017']['Adobe Photoshop CC 2017', 'Adobe InCopy CC 2017']"], "atm": ["Vue Atmospheres File", "3D scene file created by Vue, a 3D environment modeling application; stores properties for the sun, light, clouds, the sky, fog, haze, wind, and effects; used for establishing the ambience and backdrop of a 3D scene.", "Windows, Mac, Windows, ", "['E-on Vue']['E-on Vue']['Microsoft Windows with USB connection']"], "ath": ["Alienware AlienFX Theme File", "Theme file used by AlienFX, a computer customization program included with Alienware Command Center computer management software; specifies lighting, color, and transition settings for different zones on the computer, such as the keyboard, touchpad, and Alienware logo; used for customizing the computer's appearance; saved in an XML format and can be edited using the Alienware Command Center interface.", "Windows, Linux, ", "['Dell Alienware Command Center', 'Microsoft XML Notepad', 'text editor']['AlienFX Lite']"], "atf": ["Axon Text File", "Data format used by GenePix microarray analysis software; uses a plain text, tab-delimited format and contains records, each with one or more fields; can be used interchangeably with GenePix software, text editors, and spreadsheet programs, such as Microsoft Excel.", "Windows, Web, Windows, Mac, ", "['Molecular Devices GenePix Pro Software', 'Microsoft Excel 2016', 'text editor']['AlternativaPlayer']['Adobe Photoshop CC 2017']['Adobe Photoshop CC 2017']"], "atl": ["Artlantis 3D Scene File", "3D image file created by Artlantis Studio & Render, which are programs used by designers and architects for creating high-resolution 3D images; saves a 3D scene and may include multiple Artlantis objects (.AOF files); used for rendering building interiors, landscapes, and other architectural scenes.", "Windows, ", "['Abvent Group Artlantis Studio', 'Abvent Group Artlantis Render']"], "atc": ["AutoCAD Tool Catalog File", "Tool catalog file used by the AutoCAD design and documentation CAD software; contains definitions for all of the tools in a user interface palette; used for storing tool configurations and customizing the AutoCAD workspace.", "Windows, ", "['Autodesk AutoCAD 2017', 'Autodesk AutoCAD Civil 3D 2017']"], "at5": ["Lowrance Map File", "Map file used by Lowrance navigation devices, which are used for marine, outdoor, automotive, and aviation activities; contains a map that can be loaded into the device through Lowrance software; used for storing pre-fabricated and custom maps.", "Windows, ", "[]"], "at3": ["ATRAC3 Audio File", "Audio file created with Sony's Adaptive Transform Acoustic Coding 3 (ATRAC3) compression algorithm; designed for storage and playback on portable media devices, including Sony CD and MP3 players, the PlayStation Portable (PSP), and Sony Ericsson mobile phones.", "Windows, ", "['Sony SonicStage', 'MAGIX Sound Forge Pro 11', 'MAGIX ACID Pro 7', 'MAGIX Vegas with ATRAC plugin']"], "auz": ["Ableton Authorization File", "Software license file used by Ableton Live, an audio production application often used for creating electronic mixes; contains a software registration key that allows users to authorize a legal copy of the software; can be double-clicked to complete the authorization.", "Windows, Mac, ", "['Ableton Live']['Ableton Live']"], "asx": ["Microsoft ASF Redirector File", "Multimedia playlist or shortcut to an audio/video file (often an .ASF file); references one or more URLs that point to the locations of the audio and video files; used for storing multimedia playlists.", "Windows, Mac, Linux, Windows, ", "['Microsoft Windows Media Player', 'Nullsoft Winamp', 'Roxio Creator NXT Pro 5', 'Ventis Media MediaMonkey 4', 'GRETECH GOM Player', 'VideoLAN VLC media player']['VideoLAN VLC media player']['VideoLAN VLC media player']['Alpha Software Alpha Anywhere']"], "asy": ["Asymptote Module", "File used by Asymptote, a vector graphics language and program used for specifying and generating technical drawings; can specify complex data structures as well as the logic used for generating the vector graphic; used for typesetting mathematical figures.", "Windows, Mac, Linux, Windows, ", "['Asymptote']['Asymptote']['Asymptote']['Linear Technology LTspice']"], "aswcs": ["Avast! Compressed Skin File", "Skin file used by avast!, an antivirus program; contains a compressed .ASWS file, which stores a graphic design skin for avast!; used for compressing skins for faster upload and download.", "Windows, Mac, ", "['avast! Pro Antivirus', 'avast! Internet Security', 'Softshape Development ActiveSkin']['Avast Free Mac Security']"], "asw": ["ACDSee Slideshow Wizard File", "An ASW file is a slideshow project file created by ACDSee Photo Manager, a photo-viewing and editing application.  It contains references to slideshow image and audio files as well as transitions and effects.  ASW files can be exported to .SWF, .SCR, or .EXE formats.", "Windows, ", "['ACD Systems ACDSee 20']"], "asv": ["Finale Auto-save File", "File created by Finale, a music note creation application for playing instruments, vocals, etc.; replaced by the .ASVX file, which was released in Finale 2014; contains backup data for .MUS files similarly to .BAK files; created when MUS files are auto-saved by Finale.", "Windows, Mac, Windows, Mac, ", "['MakeMusic Finale']['MakeMusic Finale']['Adobe Photoshop CC 2017']['Adobe Photoshop CC 2017']"], "asvx": ["Finale Auto-save File", "File created by Finale, a music notation program for instruments, vocals, and more; similar to the Finale .BAKX file; contains auto-save backup data for .MUSX files; updated 2014 version of the Finale .ASV file used in previous releases.", "Windows, Mac, ", "['MakeMusic Finale']['MakeMusic Finale']"], "asvf": ["Asphyre Sphinx Archive File", "Compressed file created to store data used by Asphyre Sphinx, a framework for developing 2D/3D video games; contains fonts, images, and other media intended for developing games; common files found in ASVF files include .JPEG and .XML files. ", "Windows, Mac, Linux, ", "['Afterwarp Development Asphyre Sphinx']['Afterwarp Development Asphyre Sphinx']['Afterwarp Development Asphyre Sphinx']"], "ass": ["Aegisub Advanced Substation Alpha File", "Subtitles file created by Aegisub, a cross-platform video typesetting application; stores the subtitle text formatted using the Advanced Substation Alpha syntax; used for storing edited movie subtitles.", "Windows, Mac, Linux, iOS, Android, Windows, ", "['Aegisub', 'MPlayer', 'VideoLAN VLC media player']['Aegisub', 'MPlayer', 'VideoLAN VLC media player']['Aegisub', 'MPlayer', 'VideoLAN VLC media player']['olimsoft OPlayer']['J2 Interactive MX Player']['Ubisoft Splinter Cell Blacklist']"], "ast": ["ClarisWorks Assistant File", "Assistant for creating a new document in ClarisWorks; similar to a template, but offers additional assistance in composing the file; can be used to create business cards, calendars, newsletters, presentations, etc.", "Windows, Mac, Windows, Mac, Windows, ", "['Apple AppleWorks']['Apple AppleWorks']['Adobe Photoshop CC 2017', 'Adobe Illustrator CC 2017', 'Adobe Acrobat DC']['Adobe Photoshop CC 2017', 'Adobe Illustrator CC 2017', 'Adobe Acrobat DC']['Ability Office']"], "asset": ["Unity Asset File", "3D scene file created by Unity, a program used for developing 3D games; stores generated assets, which are typically meshes, textures, and shaders for 3D models; created when building the Unity development project into an executable game deliverable.", "Windows, Mac, ", "['Unity Technologies Unity']['Unity Technologies Unity']"], "aspx": ["Active Server Page Extended File", "An ASPX file is a server-generated web page that may contain VBScript or C# code.  It is often written with Microsoft Visual Web Developer and designed for the Microsoft ASP.NET framework.  ASPX files contain scripts that are processed on the web server and the resulting HTML is sent to the user's web browser.", "Windows, Mac, Linux, ", "['File Viewer Plus', 'Microsoft Visual Web Developer', 'Microsoft Visual Studio 2017', 'ES-Computing EditPlus', 'Web browser']['Web browser']['Web browser']"], "asp": ["Active Server Page", "An ASP file is a webpage created by a web developer that resides on a web server and may contain scripts written in VBScript or JavaScript.  It is parsed on the server, which generates HTML that is sent to the client's browser.  ASP files are commonly used by ASP.NET sites and websites hosted on Windows servers running Microsoft IIS.", "Windows, Mac, Windows, Mac, ", "['File Viewer Plus', 'Web browser', 'text editor', 'Microsoft IIS', 'Adobe Dreamweaver CC 2017', 'Adobe Fireworks', 'Microsoft Visual Studio 2017', 'Microsoft Visual Web Developer', 'ES-Computing EditPlus']['Web browser', 'text editor', 'Adobe Dreamweaver CC 2017', 'Adobe Fireworks']['Adobe Photoshop CC 2017', 'Adobe Illustrator CC 2017', 'Adobe Acrobat DC']['Adobe Photoshop CC 2017', 'Adobe Illustrator CC 2017', 'Adobe Acrobat DC']"], "asnd": ["Adobe Sound Document", "File created by Adobe SoundBooth, a program used for audio editing; contains the original audio files, audio edits, effects, and other audio settings; can store nondestructive modifications to audio clips.", "Windows, Mac, ", "['Adobe Audition CC 2017', 'Adobe Flash Professional CC']['Adobe Audition CC 2017', 'Adobe Flash Professional CC']"], "asl": ["Photoshop Style", "File used by Photoshop, a professional graphics editing application; contains a style that can be applied to an object or layer; may include effects such as a drop shadow, bevel, gradient, or color overlay; enables the same appearance settings to be applied to multiple objects.", "Windows, Mac, ", "['Adobe Photoshop CC 2017']['Adobe Photoshop CC 2017']"], "asmx": ["ASP.NET Web Service File", "Defines Web services called by an Active Server Page (.ASP file); automatically compiled by ASP.NET when a request to the service is made; can be accessed over the Internet or from a local network.", "Windows, ", "['Microsoft Visual Web Developer', 'Microsoft Visual Studio 2017']"], "ask": ["askSam Database", "File created by askSam, a program used for organizing digital information; stores a searchable database of webpages, email messages, .PDF files, and text documents; used by researchers and business professionals.", "Windows, Windows, Mac, ", "['askSam']['Ableton Live']['Ableton Live']"], "asi": ["Grand Theft Auto Mod Library", "A .DLL based file loaded when beginning the video game series Grand Theft Auto; contains customized plugins and scripts referenced by the game to modify gameplay.", "Windows, Windows, ", "['GTA IV Asi Loader']['Alpha Software Alpha Anywhere']"], "ashx": ["ASP.NET Web Handler File", "An ASHX file is a webpage that is part of an ASP.NET web server application.  It contains references to other pages hosted on the web server that are sent to the user's web browser.  ASHX files are processed by the server's ASP.NET HTTP Handler when a client web browser requests the page.", "Windows, Mac, ", "['Microsoft Visual Web Developer', 'Microsoft Visual Studio 2017', 'Web browser', 'text editor']['MacroMates TextMate', 'Web browser']"], "ashprj": ["Ashampoo Burning Studio Project", "Disc burning project created by Burning Studio, a data, audio, and video disc burning application; stores the settings for a disc burning project, including referenced files, target disc media, and disc metadata; can be reused for burning multiple discs with the same properties.", "Windows, ", "['Ashampoo Burning Studio 18']"], "ashdisc": ["Ashampoo Burning Studio Image", "Disc image file created by Ashampoo Burning Studio, a program used to burn audio, video, and data discs; stores all data for the disc as well as the table of contents; used for ripping and archiving data into a file which can be edited and burned.", "Windows, ", "['Ashampoo Burning Studio 18', 'EZB Systems UltraISO', 'PowerISO', 'WinArchiver']"], "ashbak": ["Ashampoo Backup Archive", "Backup file created by Ashampoo Burning Studio, a backup and recovery and disc burning application; contains all backed up file contents; commonly used for archiving data such as digital photos, music, and professional work.", "Windows, ", "['Ashampoo Burning Studio 18']"], "ash": ["Nintendo Wii System Menu File", "System file used by the Nintendo Wii game console; contains data used for the display and layout of the Wii System Menu; may use U8 archive compression; sometimes decompressed and modified by the homebrew community.", "Windows, Windows, Mac, Linux, Windows, ", "['Easy CSM']['KoLmafia']['KoLmafia']['KoLmafia']['Audiosurf']"], "asf": ["Advanced Systems Format File", "An ASF file is a media file stored in the Advanced Systems Format (ASF), a proprietary video and audio container format.  It contains audio and video data and optional metadata, such as title, author, and copyright bibliographic data.  ASF files are developed by Microsoft primarily for streaming media.", "Windows, Mac, Linux, iOS, ", "['File Viewer Plus', 'Microsoft Windows Media Player', 'Nullsoft Winamp', 'CyberLink PowerProducer 6', 'VideoLAN VLC media player', 'Applian Replay Converter']['VideoLAN VLC media player', 'ShedWorx Smart Converter', 'Aiseesoft Video Converter Ultimate']['VideoLAN VLC media player']['PentaLoop PlayerXtreme Media Player']"], "asws": ["Avast! Skin File", "File used by avast!, an antivirus program for desktop computers; contains program display properties for colors, textures, scale, animation, transparency, and pop-ups; used for creating custom design skins for avast! windows.", "Windows, Mac, ", "['avast! Pro Antivirus', 'avast! Internet Security', 'Softshape Development ActiveSkin']['Avast Free Mac Security']"], "asef": ["Adobe Swatch Exchange File", "File used by Adobe InCopy, InDesign and Illustrator, professional page layout and graphic designing applications; similar to the more common .ASE swatch file extension; contains a saved collection of colors; enables sharing between illustrators and publishers in order to use different color swatches.", "Windows, Mac, ", "['Adobe Illustrator CC 2017', 'Adobe InDesign CC 2017']['Adobe Illustrator CC 2017', 'Adobe InDesign CC 2017']"], "asec": ["Android Secure Application File", "File introduced with Froyo, the version 2.2 release of the Android mobile operating system; stores mobile application data using proprietary encryption; saved to the .android_secure folder of a device's SD card; can be run with the Android SDK emulator.", "Windows, Mac, ", "['Google Android SDK']['Google Android SDK']"], "asr": ["ActionScript Remote Document", "Server-side ActionScript file created with Adobe Dreamweaver or Contribute; uses the same language and syntax as a standard ActionScript (.AS) file, but can access access built-in server-based features in ColdFusion; the \"Default.asr\" file installed with Dreamweaver and Contribute is located in the NewDocuments folder.", "Windows, Mac, Windows, Windows, Mac, ", "['Adobe Dreamweaver CC 2017', 'Adobe Contribute 6.5']['Adobe Dreamweaver CC 2017', 'Adobe Contribute 6.5']['Rebellion Sniper Elite', 'offzip']['Adobe Photoshop CC 2017']['Adobe Photoshop CC 2017']"], "ase": ["Adobe Swatch Exchange File", "File used by Adobe InDesign and Illustrator professional page layout and graphics applications; also used by Adobe Color, a touch app for Android and iOS devices; contains a color swatch, which is a saved collection of colors; allows illustrators and publishers to share color swatches.", "Windows, Mac, Windows, Mac, Windows, ", "['Adobe Illustrator CC 2017', 'Adobe InDesign CC 2017', 'Adobe InCopy CC 2017', 'Adobe Photoshop CC 2017']['Adobe Illustrator CC 2017', 'Adobe InDesign CC 2017', 'Adobe InCopy CC 2017', 'Adobe Photoshop CC 2017']['Autodesk AutoCAD 2017', 'Autodesk 3ds Max 2017', 'text editor']['text editor'][]"], "asd": ["Word AutoSave File", "File created by Microsoft Word, a word processing program used to author documents; contains a snapshot copy of the currently opened Word document; used for automatic backup and recovery of documents in Word in case of an unplanned disruption or program crash.", "Windows, Windows, Mac, ", "['Microsoft Word 2016']['Ableton Live']['Ableton Live']"], "ascx": ["ASP.NET User Control File", "Web page that can be used as a component by other Web pages; for example, a navigation bar called \"navbar.ascx\" might be referenced by all pages within a ASP-driven website; a single change to the navbar.ascx file will change the navigation bar in all the other pages.", "Windows, Mac, ", "['Microsoft Visual Studio 2017', 'Microsoft Visual Web Developer', 'Adobe Dreamweaver CC 2017']['Adobe Dreamweaver CC 2017', 'MacroMates TextMate']"], "ascs": ["ActionScript Communication Server File", "File created by Adobe Device Central, a program used for testing and deploying Flash games and other content to mobile devices; contains code written in ActionScript for Flash Communication server; used for developing live or streamed content within deployed applications.", "Windows, Mac, ", "['Adobe Device Central CS5.5']['Adobe Device Central CS5.5']"], "asm": ["Assembly Language Source Code File", "Program written in assembly language, a low level programming language that can be converted to machine language; may be edited with a text editor and run using an assembler program, such as HLA, MASM, FASM, NASM, or GAS.", "Windows, Mac, Linux, Windows, Windows, Windows, ", "['File Viewer Plus', 'Microsoft Notepad', 'gVim', 'text editor']['MacroMates TextMate', 'MacVim', 'text editor']['Vim', 'Pico', 'GNU Emacs', 'text editor']['Parametric Technology Creo', 'Okino Computer Graphics PolyTrans', 'Autodesk Fusion 360']['Microsoft Visual Studio 2017']['Siemens Solid Edge']"], "asc": ["PGP ASCII Armored File", "An ASC file is an armored ASCII file used by Pretty Good Privacy (PGP), an encryption program used for secure communication.  It contains a digitally signed message and may store plain-text written information, as well as binary information encoded as text.  ASC files also include a key as clear-signed text, which can be verified using PGP authentication methods.", "Windows, Mac, Linux, Windows, Mac, Windows, Mac, Windows, Windows, Mac, Linux, ", "['PGP Desktop', 'PGP Desktop Email Encryption', 'Mozilla Thunderbird with Enigmail plug-in', 'Mozilla SeaMonkey with Enigmail plug-in', 'Gpg4win']['PGP Desktop', 'PGP Desktop Email Encryption', 'Mozilla Thunderbird with Enigmail plug-in', 'Mozilla SeaMonkey with Enigmail plug-in']['GnuPG', 'Mozilla Thunderbird with Enigmail plug-in', 'Mozilla SeaMonkey with Enigmail plug-in']['Autodesk AutoCAD 2017', 'Autodesk 3ds Max 2017', 'text editor']['text editor']['Adobe Flash Professional CC']['Adobe Flash Professional CC']['Linear Technology LTspice']['text editor']['text editor']['text editor']"], "asb": ["Alphacam Stone VB Macro File", "Visual Basic macro file used by Alphacam, a CAD program for the woodworking industry; stores a user-defined macro written in the Visual Basic language; used for executing custom tasks with stone and marble cutting projects.", "Windows, ", "['Planit Alphacam']"], "asa": ["ASP Configuration File", "Contain object declarations, variables, constants, and functions that can be accessed by .ASP pages; often named Global.asa and accessed by multiple pages with in an ASP-based website; allows several pages to access the same functions and variables so they do not have to be rewritten for each page.", "Windows, Mac, ", "['Microsoft Notepad', 'text editor']['MacroMates TextMate', 'text editor']"], "as3proj": ["FlashDevelop ActionScript 3 Project File", "Project file created by FlashDevelop, a free source code development software often used for Flash and Web programming; saved using XML formatting and contains project information such as included source code files, build settings, and output .SWF options.", "Windows, Mac, Linux, ", "['FlashDevelop']['FlashDevelop']['FlashDevelop']"], "as2proj": ["FlashDevelop ActionScript 2 Project File", "Project file created by FlashDevelop, an free and open source development IDE commonly used for Flash programming; saved in an XML format and contains build settings, references to project source code files, and output .SWF options.", "Windows, Mac, Linux, ", "['FlashDevelop']['FlashDevelop']['FlashDevelop']"], "as": ["ActionScript File", "An AS file is a source code file written in ActionScript, a scripting language originally developed by Macromedia but now developed by Adobe Systems.  It contains variables, functions, and references to other files.  AS files are typically used for creating interactive Flash applications.", "Windows, Mac, Windows, Mac, Linux, Mac, ", "['File Viewer Plus', 'Adobe Animate CC 2017', 'Adobe Dreamweaver CC 2017', 'FlashDevelop', 'Microsoft Notepad', 'Notepad++', 'text editor']['Adobe Animate CC 2017', 'Adobe Dreamweaver CC 2017', 'MacroMates TextMate', 'Apple TextEdit', 'text editor']['AngelScript', 'text editor']['AngelScript', 'text editor']['AngelScript', 'text editor']['Mac Binary Converter']"], "arx": ["AutoCAD Runtime Extension File", "Extension file created for AutoCAD, a design and engineering application for 2D and 3D products; contains an application component written using Autodesk's ObjectARX, an object-oriented API that allows developers to customize and extend AutoCAD using C++, C#, and VB.NET program code.", "Windows, ", "['Autodesk AutoCAD 2017', 'Autodesk ObjectARX SDK']"], "arw": ["Sony Digital Camera Image", "Digital photograph captured by a Sony digital camera, and based on the TIFF specification; contains raw, uncompressed image data as captured by the camera's CCD; can be adjusted using image-editing software before exporting to common raster formats such as .JPG or .TIFF.", "Windows, Mac, iOS, Android, Windows, Android, ", "['File Viewer Plus', 'Microsoft Windows Photos', 'Microsoft Windows Live Photo Gallery', 'Adobe Photoshop CC 2017', 'Adobe Photoshop Elements 15', 'Corel PaintShop Pro X9', 'ACD Systems ACDSee 20', 'ImageMagick', 'Sony RAW Driver', 'Sony Image Data Converter SR']['Adobe Photoshop CC 2017', 'Adobe Photoshop Elements 15', 'Snap Converter', 'MacPhun ColorStrokes']['Adobe Photoshop Express']['File Viewer for Android', 'Adobe Photoshop Express'][]['File Viewer for Android']"], "artproj": ["Artifacts Project", "Bug tracking project created with Artifacts, a file-based and version control friendly bug tracking program; includes a list of artifacts (.ART files), which contain bugs, labels, tests, and ToDo lists.", "Windows, ", "[]"], "article": ["Twixl Publisher Article", "Article created by Twixl Publisher, a program that allows users to create interactive content apps for mobile devices; contains an article, which includes its content, title, taglines, and layout dimensions.", "Windows, Mac, iOS, Android, ", "['Twixl Publisher']['Twixl Publisher']['Twixl Viewer']['Twixl Viewer']"], "artb": ["Artboard Document", "Vector drawing created by Artboard, a program used to make vector illustrations; may be a custom drawing or a drawing created from one of the various templates included with the software; can be exported to .PDF, .JPG, .PNG, and .TIF formats.", "Mac, ", "['Mapdiva Artboard']"], "art": ["ArtCAM Model", "CAD model created by ArtCAM, a CNC (computer numerical control) program used for artistic design and manufacturing; saves a 2D or 3D model as well as instructions for a machine to cut or engrave the design; used for signs, woodworking, engraving, and jewelry.", "Windows, Windows, Windows, Mac, Windows, Windows, Mac, ", "['Delcam ArtCAM']['BERNINA ArtLink']['AOL', 'ACD Systems ACDSee 20']['AOL'][]['Adobe Illustrator CC 2017', 'CorelDRAW Graphics Suite X8']['Adobe Illustrator CC 2017']"], "arscript": ["ArtRage Script", "Script created by ArtRage, a digital painting application; saves a macro, which contains a recording of user inputs while in recording mode; used for automating common painting tasks.", "Windows, Mac, ", "['Ambient Design ArtRage Studio']['Ambient Design ArtRage Studio']"], "arsc": ["Android Package Resource File", "Application resource file used by programs developed for Google's Android mobile operating system; contains compiled resources in a binary format; may include images, strings, or other data used by the program; usually included in an .APK package file.", "Windows, Mac, Linux, ", "['Google Android SDK']['Google Android SDK']['Google Android SDK']"], "ars": ["After Effects Render Settings File", "Settings file created by After Effects, a program used for creating motion graphics and cinematic visual effects; saves properties that define the quality of the output video; can be a settings file included with After Effects or a custom profile created by the user; enables settings to be reused across multiple rendering sessions.", "Windows, Mac, Windows, ", "['Adobe After Effects CC 2017']['Adobe After Effects CC 2017']['Stainless Games Carmageddon']"], "arr": ["Amber Graphic File", "Raster image used by microscopes; supports gray-scale images with up to 256 different shades; can be opened with Lemkesoft GraphicConverter and then exported to more common raster graphic formats.", "Mac, Windows, Windows, ", "['Lemkesoft GraphicConverter']['Clickteam Multimedia Fusion'][]"], "arp": ["Advanced RAR Password Recovery Setup", "Preference file that contains the program setup for Advanced RAR Password Recovery (ARPR), a password recovery program; can be saved by pressing the \"Save setup\" button and loaded by pressing the \"Read setup button.\"", "Windows, Windows, ", "[]['Redbana Audition']"], "aro": ["SteelArrow Web Application File", "Web page that includes SteelArrow code; usually contains mostly HTML with a small portion of SteelArrow tags and scripts; processed on the server before being sent to a user's Web browser, similar to a .PHP or .ASP page.", "Windows, Mac, ", "['Web browser']['Web browser']"], "arn": ["Autoruns Data File", "Native Autoruns binary file format used to display everything that runs automatically when Windows starts; contains all the captured data results; does not include omitted rows.", "Windows, ", "['Microsoft Autoruns']"], "arj": ["ARJ Compressed File Archive", "File archive compressed by ARJ, a file archiver program that uses Robert Jung compression; includes long filename support, file version management, data integrity protection, and multiple volume archives.", "Windows, Mac, Android, ", "['File Viewer Plus', 'ARJ Software ARJ32', 'Smith Micro StuffIt Deluxe for Windows', '7-Zip', 'Zipeg', 'ExtractNow']['Smith Micro StuffIt Deluxe 16', 'Incredible Bee Archiver', 'Zipeg', 'The Unarchiver']['RARLAB RAR']"], "ariax": ["Chipsounds XML Sound File", "File created by chipsounds, a program used to create sounds like those on older arcade machines, game consoles, and computers; stores the sound settings using XML formatting instead of the binary formatting used with .ARIA files.", "Windows, Mac, ", "['Plogue chipsounds']['Plogue chipsounds']"], "aria2": ["aria2 Control File", "Control file format created and used by aria2, a command-line download utility; stores the progress information of a download; not meant to be opened.", "Windows, Linux, ", "['aria2', 'uGet Download Manager']['uGet Download Manager']"], "aria": ["Chipsounds Sound File", "File created by chipsounds, a program used for generating sounds similar to those on older computers, arcades, and game consoles; stores advanced sound settings for chip music; used for saving and loading audio presets.", "Windows, Mac, ", "['Plogue chipsounds']['Plogue chipsounds']"], "ari": ["ARRIRAW Image", "Image captured by an ARRI digital video camera; stores one still frame from a sequence of images that together comprise a recorded video; used in professional video production and may have color alterations and other adjustments applied before finalizing the video.", "Windows, Mac, Windows, ", "['File Viewer Plus', 'Adobe SpeedGrade CC 2017', 'Microsoft Windows Photos']['Adobe SpeedGrade CC 2017', 'Apple Final Cut Pro with Glue Tools Cineon/DPX Pro plugin'][]"], "arg": ["AutoCAD Profile", "Settings file used by AutoCAD, a 2D and 3D CAD drafting application; contains backed up user profile information (application options data) that was stored in the system registry; can be exported and imported to transfer settings between computers; can also be migrated between versions of AutoCAD.", "Windows, ", "['Autodesk AutoCAD 2017']"], "arff": ["Attribute-Relation File Format", "File used by Weka, a machine learning application; saved in the the Attribute Relation File Format (ARFF) and contains a header section with a list of types (numeric, nominal string, date) and a data section with the values.", "Windows, Mac, Linux, ", "['Weka', 'text editor']['Weka', 'text editor']['Weka', 'text editor']"], "asax": ["ASP.NET Server Application File", "File used by ASP.NET Web applications; contains program code that is used to respond to application-level events raised by ASP.NET or HttpModules; parsed and compiled at application runtime; used for handling events during application initialization and shutdown, as well as processing global exceptions and errors.", "Windows, ", "['Microsoft Visual Studio 2017', 'Microsoft Visual Web Developer']"], "arf": ["WebEx Advanced Recording File", "Recording of an online meeting downloaded from WebEx; recorded using Network-Based Recording (NBR); contains the video data, a table of contents, an attendee list, and other information on separate panels.", "Windows, Mac, ", "['Cisco WebEx Network Recording Player']['Cisco WebEx Network Recording Player']"], "arduboy": ["Arduboy Game Package", "An ARDUBOY file is a game package used by Arduboy, an open source 8-bit gaming platform.  It contains a compiled game, a banner image (700px x 192px), one or more screenshots (128px x 64px) and a .JSON (info.json) file that stores metadata such as title, version, author, and button configuration information.", "Windows, Mac, ", "['Arduboy Manager', 'Team A.R.G. Game Loader']['Arduboy Manager']"], "ard": ["ArtiosCAD Workspace File", "Drawing or 3D design created with ArtiosCAD, a structural design program for creating packaging designs; may be saved by ArtiosCAD or exported by other Esko software programs that support the ArtiosCAD Export Plug-in.", "Windows, ", "[]"], "arcut": ["Prelude Rough Cut File", "Video collection file created by Adobe Prelude, a program used for organizing video footage files; contains a timeline of video clips and subclips that comprise a movie \"rough cut;\" can be sent to Premiere Pro or Final Cut Pro for final editing.", "Windows, Mac, ", "['Adobe Prelude CC 2017', 'Adobe Premiere Pro CC 2017']['Adobe Prelude CC 2017', 'Adobe Premiere Pro CC 2017', 'Apple Final Cut Pro X']"], "archiver": ["Archiver Compressed File Archive", "Compressed file archive created by Archiver, a utility that helps users create and extract archives and compress files; contains an image or audio file compressed to reduce large file sizes.", "Mac, ", "['Incredible Bee Archiver']"], "arch00": ["F.E.A.R. Game Archive", "Data archive format used by F.E.A.R. (First Encounter Assault Recon), a first-person shooter video game; includes game data referenced by the F.E.A.R. and required for the program to run; typically should not be opened manually, but can be modified using a third-party archive tool.", "Windows, ", "[]"], "arc": ["Norton Backup Archive", "Backup file created by Norton software products, such as Norton 360 and Norton Online Backup; contains a backup of computer files created automatically by the software; may include personal user files as well as system files.", "Windows, Mac, Windows, Mac, Linux, Windows, Windows, Windows, ", "['Symantec Norton 360 Version 6.0', 'Symantec Norton Online Backup']['Symantec Norton Online Backup']['Smith Micro StuffIt Deluxe for Windows', 'Corel WinZip 21', '7-Zip', 'PeaZip', 'FreeArc', 'E-merge WinAce', 'Acubix PicoZip', 'ConeXware PowerArchiver']['Smith Micro StuffIt Deluxe 16', 'The Unarchiver']['FreeArc'][]['Nokia PC Suite', 'Nokisoft Noki', 'NbuExplorer']['Reggie! Level Editor', 'SZS Modifier']"], "ara": ["Archivaldo Resource Archive", "Archive created by Archivaldo, a program used for packaging files together into archives; saves a collection of files and supports cross-platform use as well as unlimited file sizes; supports archival of any file type.", "Mac, ", "[]"], "ar": ["Midtown Madness Data File", "Game data file used by the Midtown Madness and Midtown Madness 2 racing games; stores data referenced by the game in a compressed format; includes in-game menus, car models, textures, tracks, and 3D objects.", "Windows, Mac, Linux, ", "['Microsoft Midtown Madness 2', 'deAR', 'deAR2', '7-Zip', 'Corel WinZip 21', 'WinRAR 5']['GNU Compiler Collection (GCC)']['GNU Compiler Collection (GCC)']"], "aqm": ["AlpineQuest Map File", "GIS file used by AlpineQuest, a mapping and navigation app for Android devices; includes roads, land features, points of interest, and other map information; used for offline navigation, often for hiking, hunting, geocaching, and other outdoor activities.", "Windows, Mac, Linux, Android, ", "['Mobile Atlas Creator']['Mobile Atlas Creator']['Mobile Atlas Creator']['Psyberia AlpineQuest']"], "apz": ["Autoplay Media Studio Exported Project", "Project that has been exported by AutoPlay Media Studio, a rapid application development program; saved in a compressed archive format that can easily be transferred to another system, shared with other users, or serve as a backup file.", "Windows, ", "['Indigo Rose AutoPlay Media Studio']"], "apx": ["Ability Photopaint Studio Image", "Image created by Ability Photopaint Studio, a drawing program included with Ability Office; support multiple editing layers as well as brushes, fills, shapes, and other standard raster graphic editing features; can be used for generating graphics used in Ability Write documents (.AWW files).", "Windows, ", "['Ability Office']"], "aps": ["Visual C++ Resource File", "File created by Microsoft Visual C++, a software development application; stores the binary representation of a resource included with the project; enables the application to load resources more quickly.", "Windows, Windows, ", "['Microsoft Visual Studio 2017']['AMS Greeting Card Studio']"], "apr": ["ArcView Project File", "Mapping project created with ArcView, a GIS (Geographical Information System) program for visualizing, managing, creating, and analyzing geographic data; saved as an Object Database in a standard text format.", "Windows, Windows, ", "['ESRI ArcGIS for Desktop', 'TatukGIS Viewer', 'text editor'][]"], "appxupload": ["Windows 8 App Upload Package", "App package format introduced with Windows 8; used by developers when packaging Windows 8 apps and submitting them to the Windows Store; contains both the .APPX package as well as symbol debugging information that allows the app to report app crashes back to the developer for debugging and bug fixes.", "Windows, ", "['Microsoft Visual Studio 2017']"], "appxsym": ["Windows 8 App Package Symbols File", "File format introduced as part of the Windows 8 app packaging system for the Windows Store; contains public symbol information for the app that allows crash reporting details to be sent back to the developer (via the Window's Store developer dashboard) when the app crashes on a user's computer.", "Windows, ", "['Microsoft Visual Studio 2017']"], "appx": ["Windows 8 App Package", "App package format introduced with Windows 8; used by developers when packaging and submitting Windows 8 apps (formerly referred to as Metro Style apps) for sale on the Windows Store.", "Windows, ", "['Microsoft Visual Studio 2017']"], "appup": ["Erlang Application Upgrade File", "File used by applications that use Erlang, a technology used for building large, scalable software systems such as computer telephony and instant messaging applications; saved in a plain text format and contains instructions for how to upgrade or downgrade an application.", "Windows, Mac, Linux, ", "['Erlang']['Erlang']['Erlang']"], "appref-ms": ["Microsoft Application Reference File", "Application reference file used by ClickOnce, a Microsoft platform used to deploy and run remote Web applications; contains a local or remote link to an application; commonly used to enable links from the Windows Start Menu.", "Windows, ", "['Microsoft Visual Studio 2017', 'Microsoft ClickOnce']"], "application": ["ClickOnce Deployment Manifest File", "File created for ClickOnce, a Microsoft framework used to deploy Windows applications over the Web; stores program deployment properties in an XML format, including name, version, description, deployment options, and dependencies; may also contain a digital signature.", "Windows, ", "['Microsoft Visual Studio 2017', 'Microsoft .NET Framework']"], "applet": ["Eclipse Java Applet Policy File", "Developer file created by Eclipse, a software development application; generated by Eclipse automatically when creating a new applet project and saved to the project root folder as the file java.security.policy; contains security permissions for the applet.", "Windows, Mac, Linux, ", "['Eclipse']['Eclipse']['Eclipse']"], "applescript": ["AppleScript File", "Script written in AppleScript, an automation and scripting language used by Macintosh computers; can be edited or automatically generated using the Apple Script Editor; may also be run within the Script Editor program.", "Mac, ", "['Apple AppleScript Editor']"], "appdownload": ["Mac App Store Partially Downloaded App", "File created by App Store, a program included with Mac OS X 10.6.6 or later that allows users to purchase Mac OS X software; saves the contents of a purchased .APP file as it's being downloaded from the store.", "Mac, ", "['Apple App Store']"], "appcache": ["HTML5 Cache Manifest File", "File used by web browsers to enable accessibility of web applications when there is no network connection; contains copies of resources that make up web applications, such as image (.PNG, .GIF, etc.), .CSS, and .JS files, and are identified by URLs. ", "Windows, Mac, Linux, ", "['Web browser']['Web browser']['Web browser']"], "app": ["Mac OS X Application", "An app file is an application bundle that runs under Mac OS X.  APP files are executable files similar to .EXE files in Windows and run when double-clicked.", "Mac, Windows, Windows, ", "['Apple OS X'][]['Microsoft Visual FoxPro']"], "apnx": ["Amazon Page Number Index File", "Pagination file used by Amazon Kindle devices starting with the 3.1 firmware version; maps page numbers of the digital book to the page numbers of the original print book; allows Kindle readers to see page numbers; saved on the device and not meant to be opened or edited manually.", "Windows, Mac, ", "['Amazon Kindle for PC']['Amazon Kindle for Mac']"], "apng": ["Animated Portable Network Graphic", "Unofficial extension to the Animated Portable Network Graphic (APNG) format; contains multiple frames (.PNG images) used for an animation sequence; similar to an animated .GIF file, but also supports 24-bit images and 8-bit transparency.", "Windows, Mac, Linux, ", "['XnViewMP', 'Opera', 'Mozilla Firefox', 'Google Chrome with APNG extension', 'Bandisoft Honeyview']['XnViewMP', 'Opera', 'Mozilla Firefox', 'Google Chrome with APNG extension']['Opera', 'Mozilla Firefox', 'KSquirrel', 'Google Chrome with APNG extension']"], "apm": ["Aldus Placeable Metafile Image", "Metafile image created by many Windows programs originally designed to scale images on output devices; contains an image and metafile header information; similar to .WMF file except that it contains a preceding 22-byte header.", "Windows, Mac, Linux, ", "['fCoder Group Image Converter Plus', 'GIMP']['GIMP']['GIMP']"], "aplp": ["Audials Plug-in Package", "Plugin package used for downloading and installing plugins (.APLG files) for Audials Internet stream recording software; contains a plugin pack that adds features to the software, such as new search and recording functions.", "Windows, ", "['Audials Radiotracker 2017', 'Audials Tunebite 2017', 'Audials One 2017']"], "aplibrary": ["Aperture Library", "Library created by Aperture, a professional photo editing application; contains images edited in the Aperture application. ", "Mac, ", "['Apple Photos']"], "aplg": ["Audials Plug-in", "Plugin file used by Audials Internet stream recording software; adds features to the software such as new search and recording functions for capturing Internet music and video streams.", "Windows, ", "['Audials Radiotracker 2017', 'Audials Tunebite 2017', 'Audials One 2017']"], "apk": ["Android Package File", "An APK file is an app created for Android, Google's mobile operating system.  Some apps come pre-installed on Android devices, while other apps can be downloaded from Google Play.  Apps downloaded from Google Play are automatically installed on your device, while those downloaded from other sources must be installed manually.", "Windows, Mac, Linux, Android, ", "['File Viewer Plus', 'Google Android SDK', 'BlueStacks', 'Corel WinZip 21', '7-Zip', 'WinRAR 5', 'Genymotion']['Google Android SDK', 'Apple Archive Utility', 'Smith Micro StuffIt Deluxe 16', 'Genymotion', 'BlueStacks']['Google Android SDK', 'Genymotion']['Google Android']"], "api": ["Adobe Photoshop Inks File", "Settings file used by Photoshop, a raster graphics editing program; stores color settings for ink colors that are used for printing images; enables users to save and load calibrated color settings, which is useful when establishing printing properties for a specific inkjet or laser printer.", "Windows, Mac, Windows, Mac, ", "['Adobe Photoshop CC 2017']['Adobe Photoshop CC 2017']['Adobe Acrobat DC', 'Adobe Reader']['Adobe Acrobat DC', 'Adobe Reader']"], "apl": ["Monkey's Audio Track Information File", "Track information file created by Monkey's Audio, a lossless audio compressor; contains metadata for an audio track, including the start and end location of the track within a source .APE file; may also include the artist, album, song name, length, and other track information.", "Windows, Windows, Windows, ", "[\"Monkey's Audio\", \"Nullsoft Winamp with Monkey's Audio plug-in\", 'Microsoft Windows Media Player with K-Lite Codec Pack']['ACD Systems ACDSee 20']['ESRI ArcGIS for Desktop']"], "aph": ["Ability Album File", "Image album created by Ability Photoalbum, a photo management application included with Ability Office; stores information about a group of photos and allows the user to sort, filter, and convert the images; can be used for personal digital photo management.", "Windows, ", "['Ability Office']"], "apf": ["Adobe Profile File", "Certificate file used by Adobe Acrobat as well as other Adobe programs; contains a digital certificate that is used to authorize and identify a source of information.", "Windows, Mac, Linux, Windows, Mac, ", "['Adobe Acrobat DC']['Adobe Acrobat DC']['Adobe Acrobat DC']['Sony Ericsson PC Suite']['Sony Ericsson PC Suite']"], "ape": ["AVS Plugin Effects File", "Component referenced by the Advanced Visualization Studio (AVS) plugin for Winamp; used for creating programmable visual animations based on the music played by Winamp.", "Windows, Windows, Mac, Linux, ", "['Nullsoft Winamp with the Advanced Visualization Studio plugin']['File Viewer Plus', \"Monkey's Audio\", 'MPlayer', 'Foobar2000', 'NCH WavePad', 'Adobe Audition CC 2017', 'SoftRM Ape Ripper', 'DT Soft DAEMON Tools', 'Lightning UK! ImgBurn', 'JRiver Media Center', \"Nullsoft Winamp with Monkey's Audio Plugin\", 'JMAC', 'AIMP']['MPlayer', 'Adobe Audition CC 2017', 'ShedWorx Smart Converter', 'Max', 'Cog', 'JMAC']['MPlayer', 'JMAC']"], "apd": ["Eclipse Plugin Descriptor File", "XML-based file that describes the pseudocode of a class or program developed in the Eclipse programming environment; referenced by the Eclipse plugin and is used to generate program source code; may contain code written in the ActionScript programming language.", "Windows, Windows, Mac, ", "[]['ACDSee Photo Editor 10', 'ACD Systems ACDSee 20']['ACD Systems ACDSee Mac Pro 3']"], "apalbum": ["Aperture Album File", "Photo album created by Aperture, Apple's commercial digital photo editing application; saves an album of imported photos, which can be part of a larger Aperture project; usually has a cryptic filename prefix since Aperture handles the image data using a proprietary format behind the scenes.", "Mac, ", "['Apple Aperture 3.5']"], "ap": ["Active Page", "Active Web page that contains HTML as well as JavaScript, .FGL code, or code written in another scripting language; requires supporting software on the Web server to run; can be used to generate dynamic Web pages.", "Windows, Mac, Linux, Mac, ", "['Web browser', 'text editor']['Web browser', 'text editor']['Web browser', 'text editor']['Esko ArtPro']"], "apa": ["RSView Development Project Archive", "Archive of a software development project created with RSView Studio or RSView ME (Machine Edition); used for creating HMI (Human Machine Interface) applications.", "Windows, ", "[]"], "ap_": ["ADT Android Developer Package", "Developer file created by Android Development Tools (ADT), a set of plug-ins for the Eclipse IDE that facilitate app developement for the Android platform; similar to an Android package (.APK file) but contains the development resources before they are built into a final package; uses the filename resources.ap_ and is automatically created by ADT.", "Windows, Mac, Linux, ", "['Eclipse with Google ADT plug-in', '7-Zip']['Eclipse with Google ADT plug-in']['Eclipse with Google ADT plug-in']"], "aom": ["After Effects Output Module", "Video output settings file created by After Effects, a motion graphics and video effects application; saves video output options such as the file format, color profile, and compression; used for processing rendered video into a final output format; also enables output module settings to be reused.", "Windows, Mac, ", "['Adobe After Effects CC 2017']['Adobe After Effects CC 2017']"], "aos": ["ARCHOS PCtablet Firmware File", "Firmware file used by ARCHOS tablet PCs and netbooks; contains updates for the operating system, new features, feature improvements, and bug fixes; used for periodically updating and securing ARCHOS devices.", "Windows, ", "['Microsoft Windows']"], "aoi": ["Art of Illusion 3D Scene", "3D image file created by Art of Illusion, a free, open source 3D modeling program; may contain 3D objects, textures, animations, and other scene elements; references external images but does not store them in the AOI file itself.", "Windows, Mac, Linux, Windows, ", "['Art of Illusion']['Art of Illusion']['Art of Illusion']['Microsoft Dynamics AX']"], "aof": ["Artlantis Object File", "3D image file used by Artlantis Render & Studio software, which are used by architects and designers for generating 3D renderings; saves a 3D object that can be used as part of an Artlantis scene (.ATL project file).", "Windows, ", "['Abvent Group Artlantis Studio', 'Abvent Group Artlantis Render']"], "aod": ["Dynamics AX Object Data File", "Application object data file created with Microsoft Dynamics AX business management software; contains the Application Object Layer list; used for selecting layers of the application to modify.", "Windows, ", "['Microsoft Dynamics AX']"], "aob": ["DVD-Audio Audio Object File", "Audio file that stores audio data on DVD-Audio discs; saved in an MPEG format and contains LPCM (Linear Pulse Code Modulation) data; stored in the AUDIO_TS folder in the root directory of a DVD-Audio disc.", "Windows, Mac, Linux, ", "['CyberLink PowerDVD 16', 'Corel WinDVD 11', 'ArcSoft TotalMedia Theatre', 'VideoLAN VLC media player', 'Foobar2000']['VideoLAN VLC media player']['VideoLAN VLC media player']"], "ao": ["ActionOutline Outline File", "Outline created and used by ActionOutline, an application used to organize a user's thoughts and ideas; stores an outline layout, which includes information about text, styles, images and other items.", "Windows, ", "['Green Parrots Software ActionOutline']"], "any": ["AnyRail Layout Plan", "Railroad design file created by AnyRail, a model railway design application; contains railroad track layouts, custom drawn objects, and scenery such as trees and signals; used for planning a model railway before construction; also used by hobbyists for creative design.", "Windows, ", "['DRail Modelspoor AnyRail']"], "ansym": ["Adobe Edge Animate Library File", "Library file used by Adobe Edge Animate, a program used for making animated Web content; contains symbols, which are typically vector or bitmap graphics that can be reused in Edge Animate Web animations.", "Windows, Mac, ", "['Adobe Edge Animate CC']['Adobe Edge Animate CC']"], "anx": ["HotDocs Answer File", "Data file created by HotDocs, a document preparation application; saves \"answers,\" which are used to fill the fields in a HotDocs form document (.HFD or .HPD file); saved using XML formatting and enables reuse of answers for multiple documents.", "Windows, Windows, Mac, Linux, ", "['HotDocs', 'text editor']['VideoLAN VLC media player']['Macgo Mac Media Player', 'VideoLAN VLC media player']['VideoLAN VLC media player']"], "ans": ["ANSI Text File", "Text document graphic based on the ANSI text standard; may also be used to store text graphics, which uses characters to display images in a text document.", "Windows, Mac, Linux, Windows, ", "['Microsoft Notepad', 'text editor']['Bare Bones TextWrangler', 'text editor']['Vim', 'text editor']['HotDocs']"], "anme": ["Anime Studio Document", "Animation project created with Anime Studio, a drawing and animation program; stores the character model and graphics as well as a timeline and animation keyframes; also supports imported audio, simulated physics, and special effects.", "Windows, Mac, ", "['Smith Micro Anime Studio Debut 11', 'Smith Micro Anime Studio Pro 11']['Smith Micro Anime Studio Debut 11', 'Smith Micro Anime Studio Pro 11']"], "anm": ["3D Animation File", "Contains detailed instructions for a 3D animation; typically references one or more 3D object files which are animated using the directives in the ANM file; used by several older video games as well as newer ones, such as those built for the Crytek CryENGINE.", "Windows, Mac, Linux, ", "['Crytek CryENGINE SDK'][][]"], "anjuta": ["Anjuta IDE Project File", "Project file created by Anjuta IDE, a graphical software development application for Linux; organizes source code and resources for a development project; also includes targets and project properties for building the source files into a program.", "Linux, ", "['Anjuta IDE']"], "animset": ["FaceFX Animation Set File", "Facial animation file created by FaceFX, a program used for animating facial expressions in video games; often stores an animation that is synchronized with human speech audio; enables realistic lip-synching for virtual video game characters.", "Windows, ", "['OC3 Entertainment FaceFX']"], "anim": ["Maya Animation File", "3D animation file created by Maya, a professional 3D modeling application; saves references to objects and their animation properties; includes keyframes that specify anchor points of the animation; also includes rotations and the timeline.", "Windows, Windows, Mac, Windows, Windows, ", "['Autodesk Maya 2017']['Unity Technologies Unity']['Unity Technologies Unity'][]['Hidden Temple Studios Antibody']"], "ani": ["Windows Animated Cursor", "Cursor animation file used by the Windows operating system; contains image frames for the animation sequence as a collection of .ICO files; similar to a .CUR file, but contains multiple images used for animation.", "Windows, Mac, Linux, ", "['Axialis CursorWorkshop', 'RealWorld Cursor Editor', 'G.D.G. AniTuner', 'Aha-Soft ArtCursors', 'ACD Systems ACDSee 20', 'Inkscape', 'IcoFX']['Inkscape']['Inkscape']"], "anh": ["Project ROME File", "File created by Project ROME, an all-in-one content creating and publishing application; contains a project, which consists of a document for print or screen; may contain text, images, media, and graphics inserted by the user; includes templates for brochures, websites, business cards, flyers, certificates, and presentations.", "Windows, Mac, ", "['Adobe Project ROME']['Adobe Project ROME']"], "ang": ["Anghami Audio File", "Audio file used by Anghami, an Arabic digital music application for Android; contains encrypted audio used for playback; often downloaded by the user to play music without an Internet connection.", "Android, ", "['Anghami']"], "ane": ["Adobe AIR Native Extension", "Developer file used by Adobe AIR, a component that enables HTML, JavaScript, and Flash to run as standalone desktop or mobile applications; allows system specific functions, such as device vibration, to be invoked using Adobe ActionScript code.", "Windows, Mac, Android, ", "['Adobe AIR 3']['Adobe AIR 3']['Adobe AIR 3']"], "an8": ["Anim8or File", "Animation created with Anim8or, a 3D modeling and character animation program; supports texture mapping, shadows, lighting, fog, and other OpenGL effects.", "Windows, Windows, Mac, ", "['Anim8or']['Vector NTI Advance', 'Genome Compiler']['Genome Compiler']"], "an1": ["Street Atlas USA Draw File", "User-edited drawing file that acts as a layer on top of a Street Atlas USA Map (.SAF) file; may contain several different layers, each with different types of content.", "Windows, ", "['DeLorme Street Atlas USA']"], "an": ["Adobe Edge Animate Project File", "Project file created by Adobe Edge Animate, a program used for making animated webpage content; contains a multitrack timeline for animating webpage elements; incorporates jQuery (a JavaScript library) for enabling animations; can be used as an alternative to creating webpages with Flash.", "Windows, Mac, ", "['Adobe Edge Animate CC']['Adobe Edge Animate CC']"], "amz": ["Amazon MP3 Downloader File", "File used by Amazon MP3 Downloader, a program used for downloading .MP3 files from Amazon; contains data used for activating Amazon MP3 Downloader to initiate the download of MP3 files; stored in an encrypted XML format.", "Windows, Mac, Linux, ", "[][]['Clamz']"], "amxx": ["AMX Mod X Plugin File", "Plug-in created for AMX Mod X, a metamod plugin for Half-Life and other similar games; designed for server administration; used for adding custom features to the game, such as statistics tracking and gameplay modifications.", "Windows, Linux, ", "[][]"], "amxd": ["Ableton Max Patch File", "Audio device settings file created by Ableton Max for Live, a program used for creating custom devices for Ableton Live audio software; may be an audio effect, a MIDI effect, or a custom instrument; allows music producers to extend the default Ableton Live devices.", "Windows, Mac, ", "['Ableton Max for Live', 'Ableton Live']['Ableton Max for Live', 'Ableton Live']"], "amx": ["AMX Mod Plugin File", "Custom plugin written for AMX Mod, a metamod plugin for Valve Half-Life and related games; adds additional features and functionality to the game.", "Windows, Linux, Windows, ", "[][]['Adobe After Effects CC 2017']"], "amv": ["Anime Music Video File", "Compressed video format used by Chinese portable media players; typically saved in low resolutions (from 94x64 to 160x120) to fit the screens of the media players; can usually be played on a PC using the software included with the portable media player.", "Windows, ", "['File Viewer Plus']"], "amsorm": ["OnLine Ringman Auction Client File", "Auction client file created by OnLine Ringman, a program that allows users to participate in live online auctions from remote locations; contains data to connect to live auctions; opens with program \"RingStart.exe\"; AMSORM stands for Auction Management Systems Online Ringman.", "Windows, ", "[]"], "ams": ["Adobe Monitor Setup File", "Stores monitor calibration settings defined in Photoshop's Color Settings preferences; used for modifying the way colors are displayed on different monitors and determines how RGB/CMYK conversions are done.", "Windows, Mac, Windows, Mac, Windows, Mac, ", "['Adobe Photoshop CC 2017']['Adobe Photoshop CC 2017'][][][][]"], "amr": ["Adaptive Multi-Rate Codec File", "Compressed audio format developed by Ericsson; used by many 3G cell phones for voice recordings such as MMS messages; incorporates the Algebraic Code Excited Linear Prediction (ACELP) algorithm, which is designed to efficiently compress human speech audio.", "Windows, Mac, Linux, ", "['File Viewer Plus', 'Microsoft Groove Music', 'Apple QuickTime Player', 'RealNetworks RealPlayer Cloud', 'ArcSoft TotalMedia Theatre', 'VideoLAN VLC media player']['Apple QuickTime Player', 'RealNetworks RealPlayer Cloud', 'ShedWorx Smart Converter', 'VideoLAN VLC media player']['VideoLAN VLC media player']"], "amm": ["All My Movies Database File", "File created by All My Movies, a personal movie organizer for Windows; saves a catalog of information about video files, DVDs, Blu-ray movies, and VHS tapes; used for keeping an inventory of a personal collection of movies.", "Windows, ", "['Bolide All My Movies']"], "aml": ["ACPI Machine Language File", "System file written in the ACPI (Advanced Configuration and Power Interface) Machine Language (AML), a low-level language used for configuring hardware properties; often used to boot Mac OS X on non-Apple hardware (\"Hackintosh\" systems), such as P55 motherboards; also used for enabling greater hardware compatibility and improving system performance.", "Windows, Mac, Linux, Windows, Windows, Mac, Linux, Windows, ", "['DSDTSE']['iasl']['iasl']['ESRI ArcGIS for Desktop'][][][]['Microsoft Sandcastle', 'Microsoft Visual Studio with DocProject plug-in']"], "amfm": ["Adobe Multiple Font Metrics File", "Specifies the control data and global font information for a group of Adobe Font Metrics (.AFM) files; also includes one AFM file for each of the master designs in the font program; typically about 1.5KB in size.", "Windows, Mac, ", "[][]"], "amf": ["Additive Manufacturing File", "An AMF file is an additive manufacturing file used by CAD programs to describe objects for 3D printing purposes.  It contains one or more objects, which include the geometry, color, and material of the volumes that make up the object(s).  AMF files also store the constellation (arrangement) of multiple objects and metadata that specifies the author, name, copyright, and special instructions for the object(s).", "Windows, Mac, Linux, Windows, Mac, Linux, ", "['Autodesk Meshmixer']['Autodesk Meshmixer']['Autodesk Meshmixer']['Nullsoft Winamp', 'ModPlug Player', 'Schism Tracker', 'MikMod', 'Open Cubic Player']['CocoModX', 'MikMod', 'Schism Tracker', 'Open Cubic Player']['MikMod', 'Schism Tracker', 'Open Cubic Player']"], "animset_ingame": ["FaceFX In-Game Animation Set File", "Animation file used by FaceFX, an application used for designing facial expressions for video games; saves a stripped down version of an .ANIMSET file suitable for use in the target game; removes all non-essential data so that the animation is run efficiently by FaceFX.", "Windows, ", "['OC3 Entertainment FaceFX']"], "amc": ["AMC Video File", "An AMC file is a video file created in the Adaptive Modulation and Coding (AMC) format.  It is designed for transmitting multimedia data between mobile devices.", "Windows, Mac, Windows, ", "['Apple QuickTime Player', 'PEGASYS TMPGEnc MovieStyle']['Apple QuickTime Player']['Ant Movie Catalog']"], "amb": ["All My Books Database File", "File created by All My Books, a personal book organizer for Windows; saves a catalog of information about both hard copy books and eBook files (e.g., .MOBI, .AZW, .PRC, .FB2, .LRF, etc.); used for keeping an inventory of personal book collections.", "Windows, Windows, Linux, ", "['Bolide All My Books'][][]"], "am7": ["AutoPlay Media Studio 7 Project", "Software project created with AutoPlay Media Studio 7, an easy-to-use rapid application development program; used for creating custom autorun menus, multimedia applications, interactive presentations, and other custom software programs.", "Windows, ", "[]"], "am6": ["AutoPlay Media Studio 6 Project", "Project created with AutoPlay Media Studio, a rapid application development program; used for creating multimedia applications, interactive presentations, and other custom software programs.", "Windows, ", "[]"], "am5": ["AutoPlay Media Studio 5 Project File", "Software application developed with AutoPlay Media Studio, version 5; can include various types of media and custom autorun menus; may be used for creating multimedia programs, interactive presentations, and other custom applications.", "Windows, ", "[]"], "am4": ["AutoPlay Media Studio 4 Project File", "Custom software program created with AutoPlay Media Studio, version 4; can incorporate text, images, videos, and other media; often used for creating interactive presentations and multimedia applications.", "Windows, ", "[]"], "am1": ["Adventure Maker", "File created by Adventure Maker, a program used for creating point-and-click games for Windows and the Sony PlayStation Portable (PSP), iPhone, and iPod touch; contains all packaged game files, including images and game scripts.", "Windows, ", "[]"], "am": ["Automake Makefile Template", "File used by Automake, a program used for generating Makefiles; contains a Makefile template, which includes the information required to generate valid Makefile syntax; helps programmers define a Makefile using a higher-order language instead of having to write low-level Makefile syntax.", "Linux, Windows, ", "['Automake']['Anark Media Studio']"], "alz": ["ALZip Archive", "Proprietary compressed file format developed by ESTsoft; uses an algorithm similar to .ZIP compression, but is optimized for compressing large archives; also supports self-extracting and spanned archives.", "Windows, Mac, ", "['ESTsoft ALZip']['The Unarchiver']"], "alx": ["BlackBerry Application Loader XML File", "File used by BlackBerry Desktop Software, a program used for synchronizing and managing data for BlackBerry mobile devices; contains XML application description data, including name, ID, description, loader version, vendor, copyright, language, and file set; used for loading applications onto a BlackBerry smartphone.", "Windows, Mac, Linux, Windows, Windows, ", "['Eclipse IDE for Java Developers', 'text editor']['Eclipse IDE for Java Developers', 'text editor']['Eclipse IDE for Java Developers', 'text editor']['Microsoft ActiveX Control Pad', 'Microsoft Internet Explorer', 'text editor']['Alpha Software Alpha Anywhere']"], "alv": ["Adobe Photoshop Levels File", "Color levels file used by Adobe Photoshop, a program used to create and edit raster graphics; contains settings for adjusting red, green, and blue (RGB) color levels of an open image; can be accessed in Photoshop using the \"Levels Presets\" option in the Adjustments panel.", "Windows, Mac, ", "['Adobe Photoshop CC 2017']['Adobe Photoshop CC 2017']"], "alt": ["Dynamics AX Temporary File", "Application label temporary file generated by Microsoft Dynamics AX; contains new labels created within program; saved as a standard label data (.ALD) file once the Dynamics AX Application Object Server has shut down.", "Windows, ", "['Microsoft Dynamics AX']"], "als": ["Ableton Live Set File", "An ALS file is an audio project, or \"live set,\" file created by Ableton Live, a program used for creating electronic mixes.  It saves the arrangement of clips on a multitrack timeline with mix settings and references to the clips, but not the clip files themselves.  ALS files also support sampled instruments and looping.", "Windows, Mac, ", "['Ableton Live']['Ableton Live']"], "alp": ["AnyLogic Project File", "Project file created by AnyLogic, an IDE used for developing simulation models; may store one of several types of supported AnyLogic model types, such as a discrete event simulation model, a system dynamics model, or an agent based model; saves all project information, including the model design canvas, configured simulation experiments, model parameters, and references to external project resources.", "Windows, Mac, Windows, Mac, ", "['AnyLogic']['AnyLogic']['Ableton Live']['Ableton Live']"], "all": ["Java RMI Policy File", "Security policy file used by Java RMI-enabled technologies such as Apache River (formerly Jini) and GigaSpaces; stores data access permissions and allows all entities full permissions; often used for development configurations, where developers are in a secure environment.", "Windows, Mac, Linux, Windows, Mac, ", "['Apache River', 'GigaSpaces']['Apache River', 'GigaSpaces']['Apache River', 'GigaSpaces']['Steinberg Cubase']['Steinberg Cubase']"], "ali": ["Dynamics AX Label Index File", "Index of label (.ALD) files used by Microsoft Dynamics AX business management software; contains all label values, arranged by language.", "Windows, Windows, ", "['Microsoft Dynamics AX']['Adobe RoboHelp']"], "alf": ["ACT! Lookup File", "Database file used by ACT!, a customer relationship management (CRM) program; contains lookup information used for navigating, backing up, and restoring an ACT! database; includes reference information for the CRM data stored in an .ADF file.", "Windows, ", "['Swiftpage Act!']"], "ale": ["Avid Log Exchange File", "Film database file created in the Avid Log Exchange (ALE) format; saved in a tab-delimited ASCII text format and contains a shot log of film, video, and audio data; used in the process of transferring film data between systems.", "Windows, Mac, ", "['Avid Media Composer', 'Avid Xpress', 'text editor']['Avid Media Composer', 'Apple Final Cut Pro X', 'text editor']"], "aldf": ["Aldfaer Genealogy File", "An ALDF file is a genealogy file created by Aldfaer, a free Dutch program for Windows used to organize and view genealogy information.  It contains a person's heritage including parents, marriages, siblings, children, notes, family events, and photos.", "Windows, Mac, ", "['Aldfaer']['Aldfaer']"], "album": ["GLC_Player Album File", "Album file created and used by GLC_Player, an application used to view 3D models; contains a collection of 3D models; can be closed and opened for viewing 3D models at a later time.", "Windows, Mac, Linux, ", "['GLC_Player']['GLC_Player']['GLC_Player']"], "ald": ["Dynamics AX Application Label Data File", "Contains text for forms within Microsoft Dynamics AX, a business management solution; may be used for field labels, messages, and other purposes; a separate ALD file exists for each supported language of the Dynamics AX user interface.", "Windows, ", "['Microsoft Dynamics AX']"], "alc": ["Ableton Live Clip File", "Audio clip file created by Ableton Live, an audio production application; saves an audio segment that was imported and edited in the software; often created when cropping or trimming audio; used for saving custom audio segments.", "Windows, Mac, Windows, ", "['Ableton Live']['Ableton Live']['Microsoft Dynamics AX']"], "alb": ["Alpha Five Library", "Library used by Alpha Five, an IDE that allows users to develop Web applications; stores data dictionary information for an .ADB file, including settings, script pointers, menus, user-defined functions, bitmaps, toolbars, and import definitions.", "Windows, ", "['Alpha Software Alpha Anywhere']"], "alaw": ["A-Law Compressed Sound Format", "Standard audio compression algorithm used in European digital communications, such as telephones; optimizes the dynamic range of an audio signal.", "Windows, Mac, ", "['Apple QuickTime Player']['Apple QuickTime Player', 'ShedWorx Smart Converter']"], "akp": ["Akai Sampler File", "Digital audio sample created by an Akai S5000, S6000, Z4, or Z8 sampler.", "Windows, Mac, Linux, ", "['Propellerhead ReCycle', 'FMJ-Software Awave Studio']['Propellerhead ReCycle'][]"], "ajp": ["CCTV Video File", "Video recording created by closed-circuit television (CCTV) security cameras and DVR (Digital Video Recorder) equipment; created when backing up a JPEG2000 DVR to CDs, DVDs, or USB external drives; can be played with the AJP Player (also called \"Backup CD Player\"), which is available from the JPEG 2000 Support website.", "Windows, ", "[]"], "ait": ["Adobe Illustrator Template", "Template created by Adobe Illustrator, a vector graphics drawing program; contains the default settings, images, and layout for a drawing; used to create multiple .AI drawing files with the same styles and formatting.", "Windows, Mac, ", "['Adobe Illustrator CC 2017']['Adobe Illustrator CC 2017']"], "aiu": ["Advanced Installer Updates Configuration File", "Configuration file that contains information about an update to a program installed with Advanced Installer; typically provided to clients via a software company's website; used to check if users have the latest version of the software installed and provides updates if necessary.", "Windows, ", "['Caphyon Advanced Installer']"], "air": ["Adobe AIR Installation Package", "Installer file format used for distributing Adobe AIR applications; AIR stands for \"Adobe Integrated Runtime\" and is a multi-platform environment for running Internet-based applications on the desktop.", "Windows, Mac, Linux, Windows, ", "['Adobe AIR 3', 'Adobe Flash Professional CC']['Adobe AIR 3', 'Adobe Flash Professional CC']['Adobe AIR 3']['Elecbyte M.U.G.E.N.']"], "aip": ["Illustrator Plug-in", "Plugin file used by Adobe Illustrator, a vector graphics editing program; stores an extension that adds new features and capabilities to the software; needs to be placed in the /Plug-ins/ folder of the installation folder to be active.", "Windows, Mac, Windows, Windows, ", "['Adobe Illustrator CC 2017']['Adobe Illustrator CC 2017']['Caphyon Advanced Installer']['Softeza Actual Installer']"], "ain": ["Source Engine Compiled AI Nodegraph File", "Game data file used by games developed with Source, a first-person shooter (FPS) game engine developed by Valve; stores a navigation mesh, which consists of points and connected lines that make up potential traversal paths for artificial intelligence (AI) non-player characters (NPCs), or \"bots;\" used for real-time navigation and movement for AI computer players.", "Windows, Windows, ", "['Valve Source', 'Valve Hammer Editor'][]"], "aimppl": ["AIMP Playlist File", "Music playlist created by AIMP 3, a free music player for Windows; saved in a plain text format and contains a list of song files to play; can organize songs into groups and may also include song metadata.", "Windows, ", "['AIMP']"], "aim": ["AIMMS ASCII Model File", "AIMMS (Advanced Integrated Multidimensional Modeling Software) model saved in a text format; contains an operations model created using the AIMMS modeling language; similar to an .AMB file, but saved as an ASCII text file instead of a binary file.", "Windows, Linux, Windows, Mac, ", "['Paragon AIMMS', 'text editor']['Paragon AIMMS', 'text editor']['AOL Instant Messenger']['AOL Instant Messenger']"], "aiff": ["Audio Interchange File Format", "High-quality audio file created using the (AIFF) file format; contains CD-quality audio stored in a non-compressed, lossless format, similar .WAV files; commonly used to burn audio CDs.", "Windows, Mac, ", "['File Viewer Plus', 'Nullsoft Winamp', 'Apple iTunes', 'Apple QuickTime Player', 'Microsoft Windows Media Player', 'Roxio Creator NXT Pro 5', 'Adobe Audition CC 2017']['Apple iTunes', 'Apple QuickTime Player', 'Roxio Toast 15', 'Adobe Audition CC 2017']"], "aifc": ["Compressed Audio Interchange File", "Compressed .AIFF audio file used by media players and gaming consoles; contains CD-quality audio; similar to a .WAV file, but uses audio compression to reduce file size; may incorporate ULAW, ALAW, or G722 compression; commonly referred to as an AIFF-C file.", "Windows, Mac, Linux, ", "['File Viewer Plus', 'Apple iTunes', 'Apple QuickTime Player', 'Microsoft Windows Media Player', 'Adobe Audition CC 2017', 'vgmstream', 'audio player']['Apple iTunes', 'Apple QuickTime Player', 'Adobe Audition CC 2017', 'audio player']['vgmstream']"], "aifb": ["AIF Builder Project File", "Project created with AIF Builder, an application for creating Symbian Application Information (.AIF) files; may also produce an additional text (.txt) file that specifies the Java Virtual Machine location for Java applications.", "Windows, ", "[]"], "aif": ["Audio Interchange File Format", "An AIF file is an audio file created using the Audio Interchange File Format (AIFF).  It contains uncompressed CD-quality audio similar to a .WAV file and is commonly used to store standard CD audio.", "Windows, Mac, Windows, ", "['File Viewer Plus', 'Nullsoft Winamp', 'Apple QuickTime Player', 'Apple iTunes', 'Microsoft Windows Media Player', 'Adobe Audition CC 2017', 'Roxio Creator NXT Pro 5', 'DVDVideoSoft Free Audio Converter']['Apple QuickTime Player', 'Apple iTunes', 'Roxio Toast 15', 'Adobe Audition CC 2017', 'Apple GarageBand 10'][]"], "aidl": ["Android Interface Definition Language File", "An AIDL file is used by Android app developers to enable communication between different apps.  It contains Java source code that defines an interface, or contract, for how apps can communicate with each another.", "Windows, Mac, Linux, ", "['Google Android SDK', 'text editor']['Google Android SDK', 'text editor']['Google Android SDK', 'text editor']"], "aic": ["Advanced Image Coding File", "Bitmap image file encoded with Advanced Image Coding; uses a compression algorithm that combines the JPEG and H.264 standards; similar to the JPEG 2000 (.JP2) format, but offers higher compression efficiency and scalability.", "Windows, ", "[]"], "aia": ["MIT App Inventor Source Code File", "Source code file created and used by App Inventor, web program used by beginning developers to create applications for Android devices; contains the source code blocks of an application project in development.", "Web, Windows, Mac, ", "['MIT App Inventor']['Adobe Illustrator CC 2017']['Adobe Illustrator CC 2017']"], "ai": ["Adobe Illustrator File", "An AI file is a drawing created with Adobe Illustrator, a vector graphics editing program.  It is composed of paths connected by points, rather than bitmap image data.  AI files are commonly used for logos and print media.", "Windows, Mac, Linux, Windows, ", "['File Viewer Plus', 'Adobe Illustrator CC 2017', 'ideaMK Ai Viewer', 'Adobe Acrobat DC', 'Adobe Photoshop CC 2017', 'Serif DrawPlus', 'IMSI TurboCAD Pro 2017', 'ACD Systems Canvas X 2017', 'CorelDRAW Graphics Suite X8', 'Inkscape']['Adobe Illustrator CC 2017', 'Adobe Acrobat DC', 'Adobe Photoshop CC 2017', 'IMSI TurboCAD Deluxe v10', 'Apple Preview', 'Inkscape']['Inkscape', 'sK1', 'GIMP']['Electronic Arts Battlefield 2']"], "ahx": ["WinAHX Tracker Module", "File created in Abyss' Highest Experience (AHX) format, an audio format for creating synthesized music similar to that played on Commodore 64 systems; supports C64 waveforms including the triangle, sawtooth, square, and white noise.", "Windows, Mac, Linux, ", "['Audio Overload', 'Nullsoft Winamp with WinAHX plug-in', 'WinAHX']['CocoModX', 'Audio Overload']['Audio Overload']"], "ahu": ["Adobe Photoshop HSL File", "Hue Saturation Lightness (HSL) file used by Adobe Photoshop, a raster graphics editing application; contains preset values for the hue (0 to 360), saturation (0 to 100), and lightness (-100 to 100) components of color appearance; used for applying color adjustments to images. ", "Windows, Mac, ", "['Adobe Photoshop CC 2017']['Adobe Photoshop CC 2017']"], "ahs": ["Adobe Halftone Screen File", "Contains settings for creating a halftone image in Photoshop; created by first converting an image to Grayscale, then to Bitmap and selecting Use: \"Halftone Screen...\" as the method.", "Windows, Mac, ", "['Adobe Photoshop CC 2017']['Adobe Photoshop CC 2017']"], "ahk": ["AutoHotkey Script", "An AHK file is a script created with AutoHotkey, a program used for automating repetitive tasks in Windows.  It is saved as a plain text file and contains lines of code that can be executed by AutoHotkey (AutoHotkey.exe).", "Windows, ", "['File Viewer Plus', 'AutoHotkey']"], "agp": ["ArtGem Project File", "32-bit layered image file created with ArtGem; includes editing features similar to Photoshop, but uses a more basic interface; supports paint tools, selections, multiple undos, and filters.", "Windows, ", "[]"], "ahl": ["eMule Metadata File", "Configuration file used by eMule, a peer-to-peer (P2P) file sharing program; replaces eDonkey, an earlier file sharing client.", "Windows, ", "['eMule']"], "ahi": ["Dynamics AX Online Help Index File", "Index of help data (.AHD) files used by Microsoft Dynamics AX, a business management program; provides faster access to help documentation and search capabilities for Dynamics AX online help.", "Windows, ", "['Microsoft Dynamics AX']"], "ahd": ["Dynamics AX Online Help Data File", "Contains application help data used by Microsoft Dynamics AX, a business management program; stores the information referenced by the Dynamics AX online help system.", "Windows, ", "['Microsoft Dynamics AX']"], "agr": ["Ableton Groove File", "File used by Ableton Live, a program used for making electronic mixes and drum beats; defines the \"feel\" of a groove using timing definitions; used to modify audio clips so that they have a swing, drive, or other rythmic feel.", "Windows, Mac, ", "['Ableton Live']['Ableton Live']"], "agm": ["DTS Multi-channel Pro Packer File", "File used by DTS Pro Series Surround Encoder, a program used to package and encode audio files; contains a collection of compatible audio files and their file length, bit rate, session data, and sampling rate metadata; used for encoding audio that can be written to a CD or DVD.", "Windows, Mac, ", "[][]"], "agif": ["Active GIF Creator Project", "GIF animation created with Active GIF Creator, a program for creating and optimizing animated .GIF images; contains a sequence of images that can be viewed and edited with Active GIF Creator.", "Windows, ", "[]"], "aggr": ["Adobe Captivate Aggregate File", "File created by Adobe Captivate, a screen recording and multimedia publishing application; contains an aggregate of multiple .CPTX or .CP Captivate projects that were published as .SWF files; used for combining projects together into a single .SWF or standalone .EXE deliverable.", "Windows, Mac, ", "['Adobe Captivate']['Adobe Captivate']"], "age3ysav": ["Age of Empires 3: The Asian Dynasties Save File", "Save file used by Age of Empires 3: The Asian Dynasties, a real-time strategy game expansion pack; stores game progress, such as constructed buildings, explored terrain, and generated units.", "Windows, ", "['Microsoft Age of Empires 3']"], "agi": ["Asterisk Gateway Interface File", "Script used by Asterisk, an extensible open source telephony system; can be used to automate processes or add additional functionality to the Asterisk program; typically written in Perl, but may also be written in PHP, C, Pascal, or using the Bourne Shell.", "Windows, Mac, Linux, ", "[][][]"], "age3yrec": ["Age of Empires 3: The Asian Dynasties Recording", "Game file used by The WarChiefs, which is an expansion pack for the real-time strategy game, Age of Empires 3; stores a recording of a player's gameplay that can be replayed.", "Windows, ", "['Microsoft Age of Empires 3']"], "age3xsav": ["Age of Empires 3: The WarChiefs Save File", "Save file used by Age of Empires 3: The WarChiefs, an expansion pack for the real-time strategy game series; contains game progress, such as resources, buildings, and settlers.", "Windows, ", "['Microsoft Age of Empires 3']"], "age3xrec": ["Age of Empires 3: The WarChiefs Recording", "Game file used by The WarChiefs, which is an expansion pack for the real-time strategy game, Age of Empires 3; stores a recording of a player's gameplay that can be replayed.", "Windows, ", "['Microsoft Age of Empires 3']"], "age3scn": ["Age of Empires 3 Scenario File", "Game file used by Age of Empires III (AoE3), a real-time strategy game; contains a scenario, which is a custom map created by the user, or a map included with the game; used for loading the map starting point, as well as executing scripted events.", "Windows, ", "['Microsoft Age of Empires 3']"], "age3sav": ["Age of Empires 3 Save File", "Save file used by Age of Empires 3 (AoE3), a real-time strategy game; contains saved game progress, such as experience level and unlocked units, which the player can load to resume gameplay.", "Windows, ", "['Microsoft Age of Empires 3']"], "age3rec": ["Age of Empires 3 Recording", "Game file used by Age of Empires 3, a real-time strategy game; contains a recording of gameplay that can be viewed by the player.", "Windows, ", "['Microsoft Age of Empires 3']"], "agd": ["AgileGraph Data File", "Data file created by AgileGraph, a program that imports and visualizes data from a variety of sources including Microsoft Excel and .CSV files; contains raw imported data that can be filtered by AgileGraph; may be displayed as charts, graphs, or tables within the program.", "Windows, Windows, ", "[]['Oracle Agile PLM']"], "afx": ["Auto FX PhotoGraphic Edges Image", "Image file used by Auto FX PhotoGraphic Edges, a program used for enhancing digital images with photographic effects; contains a raster image that can be overlaid onto another image as an effect; used for creating presentable photographs for clients.", "Windows, Mac, ", "['Auto FX PhotoGraphic Edges', 'Corel PaintShop Pro X9', 'Adobe Photoshop CC 2017']['Auto FX PhotoGraphic Edges', 'Adobe Photoshop CC 2017']"], "aft": ["Ancestry.com Family Tree Database", "Contains genealogy information, such as names and information about relatives; used for building an Ancestry.com family tree; can be updated with data from the Ancestry.com website.", "Windows, ", "['Software MacKiev Family Tree Maker']"], "afploc": ["Apple Filing Protocol Location", "Contains the location of a system that can be accessed via an Apple Filing Protocol (AFP) connection; stores the location, such as an IP address, in an XML format; provides one-click access to a server or other machine on a network. ", "Mac, ", "['Apple Finder']"], "afp": ["Advanced Function Presentation File", "Data format used for transactional printing purposes; formatted using an object-oriented page description language (PDL) called the Mixed Object Document Content Architecture, also known as the AFP Data Stream (AFPDS).", "Windows, Windows, ", "['Web browser'][]"], "afi": ["AOMEI Backupper File Backup File", "Backup image format used by AOMEI Backupper, a Windows backup and recovery program; contains a backup of a file that can be used to restore a file when the file is corrupted or lost.", "Windows, ", "['AOMEI Backupper']"], "afm": ["Adobe Font Metrics File", "ASCII text-based font format developed by Adobe; stores font metric data for a Type 1 PostScript file; contains the master design of a specific font, which defines the way each character of the font looks.", "Windows, Mac, Windows, Linux, ", "[][]['AFFLIB', 'PassMark OSForensics']['AFFLIB']"], "aff": ["Spellcheck Dictionary Description File", "Dictionary file used by Kingsoft Writer, a free Windows application similar to Word; stores information that describes the accompanying .DIC spellcheck dictionary file.", "Windows, Windows, Linux, ", "['Kingsoft Writer']['AFFLIB', 'PassMark OSForensics', 'GetData Mount Image Pro']['AFFLIB']"], "aetx": ["After Effects XML Project Template", "XML project template file created by After Effects, a video production application; saves a video composition template, which may be used as the starting point for making multiple .AEPX video projects with the same properties.", "Windows, Mac, ", "['Adobe After Effects CC 2017']['Adobe After Effects CC 2017']"], "aex": ["After Effects Plug-in", "An AEX file is a plug-in used by Adobe After Effects, a professional video-editing application.  It stores content that extends the functionality of the After Effects application, such as support for camera raw files or video filters. AEX files are written in the C/C++ programming language.", "Windows, Mac, Windows, ", "['Adobe After Effects CC 2017']['Adobe After Effects CC 2017']['Alpha Software Alpha Anywhere']"], "afe": ["Avid File Exchange File", "Metadata file used by Avid video editing and finishing applications; contains the information necessary for transferring digital media assets between Avid systems, such as between Avid Media Composer and Avid DS.", "Windows, Mac, ", "['Avid Media Composer', 'Avid Xpress']['Avid Media Composer', 'Avid Xpress']"], "afdesign": ["Affinity Design Document", "Design document created by Affinity Designer, a vector graphics design application; may contain multiple image layers, shapes, text, pencil or pen drawings, paint strokes, and other Affinity Designer elements.", "Mac, ", "['Serif Affinity Designer']"], "afd": ["Alphacam Flame Drawing", "CAD file created by Alphacam, a CAD woodworking application; contains a flame drawing, which specifies a 3D design that will be cut using a flame tool; can be used for cutting simple parts or complex five-axis 3D components.", "Windows, Windows, Linux, ", "['Planit Alphacam']['AFFLIB', 'PassMark OSForensics']['AFFLIB']"], "afc": ["Mass Effect 2 Audio File", "An AFC file is an audio file used by Mass Effect 2, a shooter game based in outer space that uses the Unreal Engine 3 gaming engine.  it contains one or more game audio tracks, such as dialog audio or music.  AFC files may be converted to .WAV files using ww2ogg.", "Windows, ", "['Electronic Arts Mass Effect 2', \"Gibbed's Audio Extractor\", 'ww2ogg', 'afcextr', 'Afc2ogg']"], "aet": ["After Effects Project Template", "Project template file created by After Effects, a video production application; stores a video composition template, which can be used as the starting point for making multiple .AEP video projects.", "Windows, Mac, ", "['Adobe After Effects CC 2017']['Adobe After Effects CC 2017']"], "aes": ["AES Crypt Encrypted File", "File encrypted by AES Crypt, a program used for securing files with AES encryption; stores a file that has been protected by a 256-bit encryption algorithm and a password; requires the password that was used to encrypt the file in order to decrypt the file back to the original.", "Windows, Mac, Linux, Mac, ", "['Packetizer AES Crypt']['Packetizer AES Crypt']['Packetizer AES Crypt']['ooVoo']"], "aepx": ["After Effects XML Project", "An AEPX file is a project file created by Adobe After Effects, a video-editing application.  It contains a video composition, which includes references to video assets, motion graphics settings, and visual effects.  AEPX files are used for creating professional-quality video productions.", "Windows, Mac, ", "['Adobe After Effects CC 2017']['Adobe After Effects CC 2017']"], "aepkey": ["Advanced Encryption Package Key File", "File created by Advanced Encryption Package (AEP), a program used for securing files for storage and transfer; may store a public or private key created by the software; generated by the PKI Keys Manager window, which can be opened by choosing Tools → RSA Key Generator....", "Windows, ", "['InterCrypto Advanced Encryption Package']"], "aep": ["After Effects Project", "Video editing project created with Adobe After Effects; contains a video composition that includes audio and video clips, a timeline, and various effects that can be applied to the movie.", "Windows, Mac, Windows, Windows, ", "['Adobe After Effects CC 2017']['Adobe After Effects CC 2017'][]['InterCrypto Advanced Encryption Package']"], "aec": ["Cinema 4D After Effects Composition", "File exported by Cinema 4D, a program used for video production; saves a rendered video in a format that can be imported into Adobe After Effects, but only if the proper plug-in has been installed for After Effects; used for transferring video projects from Cinema 4D to After Effects.", "Windows, Mac, ", "['Adobe After Effects CC 2017']['Adobe After Effects CC 2017']"], "adz": ["Compressed Amiga Disk File", "Amiga Disk (.ADF) file compressed using Gzip (.GZ) compression; contains an exact copy of an Amiga disk, such as a video game or application; can be opened using an Amiga emulation program.", "Windows, Mac, Linux, ", "['WinUAE', 'WinFellow', 'Cloanto Amiga Forever']['The Unarchiver', 'Cloanto Amiga Forever', 'E-UAE']['E-UAE']"], "adx": ["Approach Index File", "Stores the indexing information for a Lotus Approach relational database", "Windows, Windows, Mac, Linux, ", "[]['FFmpeg']['FFmpeg']['FFmpeg']"], "advs": ["Adobe Device Central Device Set", "Data file created by Adobe Device Central, a program used for testing and deploying Flash content to mobile devices; saves information about a group of mobile devices (phones, tablets, etc.) that are being targeted for Flash application deployment; can be shared between a team of developers.", "Windows, Mac, ", "['Adobe Device Central CS5.5']['Adobe Device Central CS5.5']"], "adv": ["Ableton Device Preset File", "Settings file created by Ableton Live, an audio production program often used for creating electronic mixes; saves device presets, which act as an audio filter for generating unique sounds; can be applied to a \"live set\" (.ALS file) for creating low-fi, warping, or other sound effects.", "Windows, Mac, Windows, Windows, ", "['Ableton Live']['Ableton Live'][][]"], "adu": ["Addict User Dictionary File", "File generated by Addict, a tool used to add spell checking capabilities to applications; contains a user dictionary for the target program; used by various applications for both spell checking and thesaurus capabilities.", "Windows, ", "['Addictive Software Addict']"], "adts": ["Audio Data Transport Stream File", "Audio file created in the Audio Data Transport Stream (ADTS) format; stores a series of audio frames, each of which includes a segment of the overall audio data to be transported; often used for streaming .AAC audio on the Internet.", "Windows, Mac, Linux, ", "['Microsoft Windows Media Player', 'VideoLAN VLC media player']['ShedWorx Smart Converter', 'VideoLAN VLC media player']['VideoLAN VLC media player']"], "adt": ["ACT! Document Template", "Template for creating a new word processing document in ACT! contact management software; used for creating multiple documents with a similar layout.", "Windows, Windows, Mac, Windows, Mac, Linux, Windows, ", "['Swiftpage Act!']['Blizzard World of Warcraft']['Blizzard World of Warcraft']['Microsoft Windows Media Player', 'VideoLAN VLC media player']['VideoLAN VLC media player']['VideoLAN VLC media player']['Autodesk AutoCAD 2017', 'text editor']"], "adr": ["Opera Bookmarks File", "List of bookmarks created by the Opera Web browser.", "Windows, Mac, Linux, ", "['Opera']['Opera']['Opera']"], "adpp": ["Adobe Device Profile Package", "Mobile device profile created by Adobe Device Central, a program used for deploying Flash content to mobile devices; saves information about a device, such as the installed Flash version, the display size, the color depth, and other device capabilities.", "Windows, Mac, ", "['Adobe Device Central CS5.5']['Adobe Device Central CS5.5']"], "adp": ["Access Project", "Access project file that connects directly to database tables and other database objects; does not contain actual tables or queries, but is connected directly to a MSDE or SQL Server database, which stores the actual tables and database diagrams.", "Windows, ", "['Microsoft Access 2016']"], "ads": ["Ada Specification File", "Package specification or \"spec file\" for an Ada programming project; contains definitions and declarations referenced by an Ada body (.ADB) file; typically has the same filename as the corresponding ADB file except for the extension.", "Windows, Mac, Linux, ", "['File Viewer Plus', 'text editor']['MacroMates TextMate', 'text editor']['text editor']"], "adoc": ["AsciiDoc File", "Text document that contains plain text; may include special syntax, such as square brackets, periods, and colons that allow the file to be displayed with custom formatting; may also be converted to a different format, such as .HTML or .EPUB, using a text processor like Asciidoctor.", "Windows, Mac, Linux, ", "['text editor']['text editor']['text editor']"], "af3": ["Micrografx ABC FlowCharter 3/4 File", "Flowchart created with versions 3 and 4 of Micrografx ABC FlowCharter, a program designed to help organizations improve business processes; may include maps, diagrams, charts, and spreadsheets; used for business process modeling and analysis.", "Windows, ", "['iGrafx FlowCharter', 'iGrafx Process']"], "admx": ["Group Policy Administrative Template File", "Configuration file used by Windows Group Policy, a software technology used to manage groups of computers; contains settings for user accounts, operating system configurations, and applications; used for storing configurations for the centralized management of many computer systems.", "Windows, ", "['Microsoft Group Policy Object Editor', 'Microsoft Group Policy Management Console', 'Microsoft Windows Server 2003 Resource Kit Tools', 'Microsoft Local Group Policy Editor', 'Microsoft Local Security Policy']"], "adg": ["Ableton Device Group", "Contains a group of virtual audio devices that can be loaded by Ableton Live, a music production program; may include software instruments or audio effects; provides an easy way to load multiple devices at one time.", "Windows, Mac, ", "['Ableton Live']['Ableton Live']"], "addism": ["Addism Data File", "An ADDISM file is a data file created by Addism, a calcualtor app for OS X.  It is used to store calculation data, which includes calculation steps recorded automatically by the app or an optional title.  ", "Mac, ", "['Max Langer Addism']"], "adml": ["Group Policy Language-Specific Administrative Template", "Settings file used by the Group Policy Object Editor, an administrative application used to manage permissions for groups of computers; contains localization information for a corresponding .ADMX file.", "Windows, ", "['Microsoft Group Policy Object Editor']"], "ade": ["Access Project Extension", "Database project file created by Microsoft Access, a desktop database program; contains all data saved in a .ADP project, except the modules written in the Visual Basic for Applications (VBA) programming language are compiled and the source code is removed.", "Windows, ", "['Microsoft Access 2016']"], "adm": ["Administrative Template File", "Template used by Microsoft Group Policies that describes where registry-based policy settings are stored in the registry; also defines the user interface that administrators see in the Group Policy Object Editor when creating or modifying Group Policy objects (GPOs)", "Windows, Windows, Mac, ", "['Microsoft Group Policy Object Editor']['Extensis Portfolio']['Extensis Portfolio']"], "adi": ["Active@ Disk Image Backup File", "Disk image created by Active@ Disk Image, a backup and recovery program; may contain a backup of a hard drive, media disc, or other external storage device; can be part of a split archive or a full backup.", "Windows, Windows, Windows, Windows, ", "['Active@ Data Recovery Active@ Disk Image']['AOMEI Backupper']['Autodesk AutoCAD 2017']['Microsoft Dynamics AX']"], "adf": ["Amiga Disk File", "Disk image created on an Amiga system; stores an exact copy of an Amiga-formatted disk in fixed-width AmigaDOS data tracks; can be mounted as a physical disk using an Amiga emulation program.", "Windows, Mac, Linux, Windows, Windows, ", "['Cloanto Amiga Forever', 'ADF Opus', 'WinUAE', 'WinFellow']['Incredible Bee Archiver', 'Cloanto Amiga Forever', 'MaxUAE', 'E-UAE', 'The Unarchiver']['unADF', 'E-UAE']['Swiftpage Act!']['ESRI ArcGIS for Desktop', 'TatukGIS Editor', 'GDAL']"], "aea": ["Ae Timer Alarm Document", "Contains settings for an alarm created with Ae Timer, an alarm clock and scheduling program; includes the alarm time, alarm text, and the song or video that is played for the alarm; can be edited and saved by the user.", "Windows, Windows, Mac, Linux, ", "[]['Google AdWords Editor', 'Google Translator Toolkit']['Google AdWords Editor', 'Google Translator Toolkit']['Google Translator Toolkit']"], "addin": ["Visual Studio Add-in Definition File", "Add-in definition file created by Microsoft Visual Studio, a Windows software development IDE; generated automatically when a new add-in project is created using the Add-In Wizard; contains data used to display the add-in information when using Visual Studio's Add-In Manager component.", "Windows, ", "['Microsoft Visual Studio 2017']"], "add": ["Dynamics AX Developer Documentation File", "Application developer documentation data file used by Microsoft Dynamics AX, a business management application; contains development help documentation for using the program; arranged by language.", "Windows, ", "['Microsoft Dynamics AX']"], "adcp": ["Adobe Device Central Project File", "Project file created by Adobe Device Central, a program used for developing Flash content for mobile devices; contains a list of target devices (e.g., Sony Ericsson, Samsung, BlackBerry, LG, Nokia, etc.) as well as Flash files used for deploying applications to the devices.", "Windows, Mac, ", "['Adobe Device Central CS5.5']['Adobe Device Central CS5.5']"], "adb": ["Ada Body File", "Programming file containing source code written in the Ada programming language; stores the body of an Ada program; typically saved along with a corresponding \"Spec file\" that has an .ADS extension.", "Windows, Mac, Linux, Windows, Windows, Windows, Mac, ", "['File Viewer Plus', 'text editor']['MacroMates TextMate', 'text editor']['text editor']['Alpha Software Alpha Anywhere']['Ability Office']['Now Contact']['Now Contact']"], "adadownload": ["Adobe Download Assistant Partial Download File", "Partially downloaded file created by Adobe Download Assistant, a program that helps users download Adobe software products; saves the contents of a file (typically a software installer) as it's being downloaded by the program.", "Windows, Mac, ", "['Adobe Download Assistant']['Adobe Download Assistant']"], "acz": ["AppCraft Project", "Project created and used by AppCraft, an iOS application designed to help users learn basic programming skills; contains exported project data, such as scene(s) settings, objects, control settings, and images, that can be shared between AppCraft users.", "iOS, ", "['BeyondApp CodingKids']"], "acx": ["Atari ST Program", "Program written for an Atari ST system; saved as an executable file that can be run on a PC using an Atari ST emulator; may be a game or other type of application.", "Windows, ", "['Gemulator']"], "acww": ["Animal Crossing Wild World Pattern File", "Pattern file used by Animal Crossing Wild World (ACWW), a lifestyle-simulation Nintendo DS game that consists of catching bugs, fishing, and performing other tasks in a neighborhood of animals; contains a pattern that appears as grass, beach, flowerbeds, bricks, and other gameplay environment elements.", "Windows, ", "['ACWW Pattern Tool', 'PattView']"], "acw": ["Windows Accessibility Wizard File", "Settings file created by the Accessibility Wizard, a component of Windows XP; saves settings that customize the operating system for different vision, hearing, or mobility needs; may include settings for the magnifier, narrator, on-screen keyboard, and other functions.", "Windows, ", "['Microsoft Windows Accessibility Wizard']"], "acv": ["Photoshop Curves File", "Adjustment curve created by Photoshop, a professional image-editing application; stores modifications that can be applied to digital photos and other images; commonly used to fine tune RGB colors and tonality before printing, or for correcting images for digital publishing.", "Windows, Mac, ", "['Adobe Photoshop CC 2017']['Adobe Photoshop CC 2017']"], "action": ["Automator Action", "Action used by Automator, a program for creating automations in Mac OS X; contains a specific action that can be combined with other actions to create an automated process; these processes are saved as .WORKFLOW documents.", "Mac, ", "['Apple Automator']"], "actc": ["Action(s) Collection File", "An ACTC file is an archive used by Action(s), a program that allows users to build workflows to automate repetitive computer tasks without scripting knowledge.  It contains a collection of files, including class and resource files, required to perform an action.  ACTC files also store a manifest file (.MF) that contain information about the files stored in the ACTC file.", "Windows, Mac, Linux, ", "['Action(s)']['Action(s)']['Action(s)']"], "act": ["ADPCM Compressed Audio File", "Audio format recorded by some voice recorders and MP3 players; compressed using Adaptive Differential Pulse Code Modulation.", "Windows, Windows, Windows, Mac, Windows, Windows, Windows, ", "['Logipole Konvertor']['Alma act/cut 3D', 'Alma act/weld', 'Alma act/tubes']['Adobe Photoshop CC 2017', 'Adobe Illustrator CC 2017']['Adobe Photoshop CC 2017', 'Adobe Illustrator CC 2017']['chUmbaLum sOft MilkShape 3D', 'Autodesk 3ds Max 2017']['Microsoft Visual FoxPro']['Invisionsoft DS Game Maker']"], "acsm": ["Adobe Content Server Message File", "An ACSM file is a message file served by the Adobe Content Server to Adobe Digital Editions, a program used to manage and read eBooks as well as other digital publications.  It contains data to activate and download an eBook but does not contain the eBook itself.  ACSM files are used to authorize, legally download, and read purchased eBooks in Digital Editions.", "Windows, Mac, ", "['Adobe Digital Editions']['Adobe Digital Editions']"], "acs": ["Agent Character File", "Animated character created with Microsoft Agent; can interact with the user using text-to-speech and speech recognition technologies; may be implemented in both applications and Web pages.", "Windows, ", "['Microsoft Agent', 'Microsoft Agent Character Editor']"], "acroplugin": ["Adobe Acrobat Plug-in", "Plug-in file used by Adobe Acrobat, a page layout and PDF publishing program; contains data that adds extra functionality to the software; used for expanding the capabilities of the application.", "Windows, Mac, ", "['Adobe Acrobat DC']['Adobe Acrobat DC']"], "acrodata": ["Acrobat Data File", "Data file referenced by Adobe Acrobat, a program that allows users to create and edit .PDF files; contains user settings is typical stored in the Security folder within the Acrobat User Data directory.", "Windows, Mac, ", "['Adobe Acrobat DC']['Adobe Acrobat DC']"], "acrobatsecuritysettings": ["Adobe Acrobat Security Settings File", "File created by Adobe Acrobat, a program used for creating and viewing .PDF files; contains security properties used for creating PDFs, such as access restrictions; must be digitally signed to verify the identity of the security settings issuer.", "Windows, Mac, Linux, ", "['Adobe Acrobat DC']['Adobe Acrobat DC']['Adobe Acrobat DC']"], "acr": ["Audio Comparer Results File", "File generated by Image Comparer, a program used for identifying duplicate audio files on the hard drive; saves the results of comparing audio files (i.e., songs and music) with each other; enables users to review the comparisons later without having to re-process them again.", "Windows, Windows, Windows, Windows, Mac, Linux, ", "['Bolide Audio Comparer'][][]['XnViewMP']['XnViewMP']['XnViewMP']"], "acq": ["AcqKnowledge Data Graph File", "An ACQ file is a data graph file created by AcqKnowledge, a program used to simulate physiological data recorded from different systems and transducers.  It contains physiological data recorded from an organism that is displayed in waveforms in AcqKnowledge.  ACQ files also store information about how the data was collected, including the rate and duration of the collection.", "Windows, Mac, ", "['BIOPAC AcqKnowledge']['BIOPAC AcqKnowledge']"], "acp": ["Alfresco Content Package", "File used by Alfresco, an open source Enterprise Content Management (ECM) software package; contains data exported from an Alfresco repository; includes XML metadata files and the content files, which may be documents, web files, images, records, or any other type of data supported by the Alfresco repository model.", "Windows, Mac, Linux, Windows, Mac, Linux, Windows, ", "['Alfresco']['Alfresco']['Alfresco']['RealNetworks RealPlayer Cloud']['RealNetworks RealPlayer Cloud']['RealNetworks RealPlayer Cloud']['ES-Computing EditPlus']"], "acorn": ["Acorn Image", "Image file created by Acorn, an image editor for Mac; supports multiple layers and vector objects as well as raster graphics; often used for enhancing existing digital images with text and shapes.", "Mac, ", "['Flying Meat Acorn']"], "aco": ["Adobe Photoshop Color Swatch File", "An ACO file is a color file used by Adobe Photoshop, a raster graphics editing program.  It stores a color swatch, which is a collection of predefined colors, along with the name of each color, which is displayed when hovering the mouse over the color in the color palette.  ACO files are used for creating images that conform to certain color standards.", "Windows, Mac, Web, ", "['Adobe Photoshop CC 2017']['Adobe Photoshop CC 2017']['ACO File Viewer']"], "acm": ["Interplay Audio File", "Compressed audio file used by Interplay video games, such as Baldur's Gate and Fallout; contains compressed audio stored in a proprietary format; may be converted to other audio file types, such as .WAV files.", "Windows, ", "['BioWare Infinity Engine', 'NullSoft Winamp with ACM Plug-in', 'ACM/WAVC to WAV Converter', 'Acm2wav']"], "acl": ["AutoCorrect List File", "Stores a list of corrections used by the AutoCorrect feature in Microsoft Office programs; used for automatically correcting grammar and spelling mistakes; AutoCorrect lists can be customized within Microsoft Office programs and are not meant to be edited manually.", "Windows, Mac, ", "[][]"], "acg": ["Audio Comparer Group File", "File created by Audio Comparer, a program used for finding duplicate audio files on the hard drive; saves a group of audio files together that can be compared with each other or against other files on the hard drive.", "Windows, Windows, ", "['Bolide Audio Comparer']['Microsoft Agent']"], "acfm": ["Adobe Composite Font Metrics File", "Defines the structure of a composite font program; specifies the global metrics of the font program and the metrics of the immediate descendent font programs; metrics of individual characters in the font program are described within the associated .AFM file.", "Windows, Mac, ", "[][]"], "acf": ["Steam Application Cache File", "An ACF file is a cache file used by Valve Steam, a software package used for downloading games.  It saves information related to the downloaded software and is used for the original download as well as game updates.", "Windows, Mac, Windows, Mac, Linux, Windows, Windows, Mac, ", "['Valve Steam']['Valve Steam']['X-Plane']['X-Plane']['X-Plane']['Microsoft Agent', 'Microsoft Agent Character Editor']['Adobe Photoshop CC 2017']['Adobe Photoshop CC 2017']"], "ace": ["WinAce Compressed File", "File archive compressed by WinAce; uses a proprietary compression algorithm that offers a high compression ratio and fast compression speed; may be decompressed using WinAce for Windows or MacUnace for Mac OS X.", "Windows, Mac, ", "['E-merge WinAce', 'ESTsoft ALZip', 'PeaZip', 'IZArc']['The Unarchiver', 'MacUnace']"], "acd-zip": ["Sony ACID Project With Embedded Media File", "Audio project created by Sony ACID Xpress, MAGIX ACID Music Studio, or MAGIX ACID Pro; saved in a .ZIP format and contains an .ACD project file as well as the music compilation audio files; differs from an ACD file, which only stores references to the audio files.", "Windows, ", "['MAGIX ACID Pro 7', 'MAGIX ACID Music Studio 10', 'Sony ACID Xpress']"], "acd-bak": ["MAGIX ACID Project Backup File", "Backup file created by MAGIX ACID Pro, Music Studio, or Xpress; stores a backup copy of the currently open .ACD project; saves the real-time copy of the project while editing a music compilation.", "Windows, ", "['MAGIX ACID Pro 7', 'MAGIX ACID Music Studio 10', 'Sony ACID Xpress']"], "acd": ["ACID Project File", "Project created with MAGIX ACID, an audio production program; contains audio tracks and references to loops and other audio files used by the project; may also include effects, volume and pan adjustments, and other settings saved within the project.", "Windows, Windows, ", "['MAGIX ACID Pro 7', 'MAGIX ACID Music Studio 10', 'Sony ACID Xpress'][]"], "accountpicture-ms": ["Windows 8 Account Picture File", "File used by the Windows 8 operating system; saves the user's account picture, which is the image that appears on the Windows 8 Start screen in the upper right-hand corner; often contains a picture of the person captured with the computer's webcam.", "Windows, ", "['Microsoft Windows']"], "accft": ["Microsoft Access Data Type Template", "Database file used by Microsoft Access, a desktop relational database program; saves a template for a data type, which stores a preconfigured set of fields for a database table; can be used for re-inserting the same fields across multiple tables.", "Windows, ", "['Microsoft Access 2016']"], "accdu": ["Access Add-in File", "Plugin file used by Microsoft Access, a relational database management application for the desktop; stores an application component written in Visual Basic for Applications; more commonly uses the .ACCDA extension.", "Windows, ", "['Microsoft Access 2016']"], "accdt": ["Microsoft Access Database Template", "Template database file created by Microsoft Access, a desktop relational database management system (RDMBS); contains pre-defined tables, data, reports, and other database elements; saved as a hierarchy of XML and text files and compressed with Zip compression.", "Windows, ", "['Microsoft Access 2016']"], "accdr": ["Access Runtime Application", "\"Locked-down\" database file created by the Microsoft Access relational database software; stores an .ACCDB database, except with the extension renamed to \".accdr;\" allows the database to be opened and run in a read-only mode so that no changes are made to the database.", "Windows, ", "['Microsoft Access 2016']"], "accde": ["Access Execute Only Database", "Database file created by Microsoft Access, a desktop relational database program; saves a \"locked-down\" version of an .ACCDB file so that all Visual Basic for Applications (VBA) code is saved in a compiled format and is not viewable or editable; allows custom database code to be protected.", "Windows, ", "['Microsoft Access 2016']"], "accdc": ["Microsoft Access Signed Package", "Packaged database file created by Microsoft Access, a desktop relational database management system (RDBMS) application; contains a digitally-signed database package that was created from an original .ACCDB database file.", "Windows, ", "['Microsoft Access 2016']"], "accdb": ["Access 2007 Database File", "An ACCDB file is a database created with Microsoft Access 2007 or later.  It typically contains data organized into tables and fields.  ACCDB files may also include custom forms, SQL queries, and other data.", "Windows, Mac, ", "['Microsoft Access 2016', 'Microsoft Visual Studio 2017', 'MDB Viewer Plus']['MDB Viewer']"], "acc": ["Graphics Accounts Data File", "Contains financial account information for Graphic Accounts, a program for creating an maintaining personal budgets; may include data for one or more bank accounts.", "Windows, Windows, ", "[]['Gemulator']"], "acb": ["ADX Audio Package File", "An ACB file is an audio package used by by various Sega Dreamcast, PlayStation 2, GameCube, and Wii video games developed by CRI Middleware.  It contains ADX formatted audio that is used for sound effects, music, and dialogue featured in a game.", "Windows, Windows, Mac, Windows, Mac, Windows, Mac, ", "['VGMToolbox']['Adobe Photoshop CC 2017', 'Adobe InDesign CC 2017', 'Adobe Illustrator CC 2017', 'ACB2XML']['Adobe Photoshop CC 2017', 'Adobe InDesign CC 2017', 'Adobe Illustrator CC 2017']['Autodesk AutoCAD 2017']['Autodesk AutoCAD 2017'][][]"], "aca": ["Agent Character Animation File", "Animation file created for Microsoft Agent, an interactive character animation technology developed by Microsoft; contains animation data that defines how the character moves and speaks; saved along with a corresponding .ACF file, which contains the character data.", "Windows, ", "['Microsoft Agent', 'Microsoft Agent Character Editor']"], "ac3": ["Audio Codec 3 File", "Audio file saved in the AC-3 (Dolby Digital) audio format; can include up to six channels of audio (DD 5.1 surround sound with subwoofer output); uses lossy compression and often used as the format for DVDs, cinema theaters, and game consoles.", "Windows, Mac, Linux, iOS, ", "['File Viewer Plus', 'Microsoft Windows Media Player', 'Microsoft Groove Music', 'Apple QuickTime Player with AC3 Codec', 'Nero 2017', 'Nullsoft Winamp', 'CyberLink PowerDVD 16', 'MPlayer']['Apple QuickTime Player with AC3 Codec', 'ShedWorx Smart Converter', 'Aiseesoft Video Converter Ultimate']['MPlayer']['PentaLoop PlayerXtreme Media Player']"], "ac$": ["AutoCAD Temporary File", "Temporary file generated by AutoCAD, a 2D/3D drawing and design program; contains information used by various commands, including \"UNDO\" and \"HIDDEN LINES.\"", "Windows, ", "['Autodesk AutoCAD 2017']"], "accda": ["Access Add-in File", "Add-in file used by Microsoft Access, a desktop relational database program; stores an application component written in Visual Basic for Applications (VBA); enables users to extend the software's features.", "Windows, ", "['Microsoft Access 2016']"], "ac": ["Autoconf Script", "Automatic configuration script produced by GNU Autoconf; automatically configures software source code packages to adapt to several types of Posix-like systems; created by testing a software package for each feature the program might need in order to run a specific system; Autoconf then builds a list of system features that the package requires.", "Linux, Windows, Mac, Linux, ", "[]['Inivis AC3D', 'Blender', 'X-Plane', 'FlightGear']['Inivis AC3D', 'Blender', 'X-Plane', 'FlightGear']['Inivis AC3D', 'Blender', 'X-Plane']"], "aby": ["AOL Address Book File", "File created by AOL, a program used as a portal to the Internet; contains address book entries saved in a proprietary format; used to store and synchronize online address book information on a local computer.", "Windows, ", "['AOL']"], "abw": ["AbiWord Document", "Word processing document created with AbiWord, a free word processor developed by the AbiSource community; supports rich text formatting, advanced document layouts, images, tables, lists, and footnotes.", "Windows, Mac, Linux, ", "['AbiSource AbiWord']['AbiSource AbiWord']['AbiSource AbiWord']"], "abs": ["Absolute Database File", "Database file created by Absolute Database, a database engine for the Delphi software development IDE; stores data in a structured, relational format and supports encrypteion and in-memory performance; used by software developers for storing data with their applications.", "Windows, Windows, Windows, Windows, ", "['ComponentAce Absolute Database']['FileStream TurboZIP']['Avant Force Avant Browser']['AB SuDoKu']"], "abr": ["Adobe Photoshop Brushes File", "Contains a collection or brushes that can be used by the Brush tool in Adobe Photoshop; includes shape, texture, dynamics, and other data for each brush style.", "Windows, Mac, ", "['Adobe Photoshop CC 2017', 'ACD Systems ACDSee 20']['Adobe Photoshop CC 2017']"], "abp": ["AVS Barcode Profile", "Barcode, such as a UPC, created with Alver Valley Software (AVS) Barcode Source; includes the barcode format, size, print options, and source data; can produce a barcode image that may be exported in a standard bitmap format.", "Windows, ", "[]"], "abm": ["Music Album", "Digital music album that contains a collection of songs or other audio files; typically includes references to the audio files rather than the songs themselves.", "Windows, Windows, Mac, ", "['Redbana Audition']['ArcSoft PhotoStudio', 'Serif PhotoPlus']['ArcSoft PhotoStudio']"], "abkprj": ["Ashampoo Backup Project", "File backup project created by Burning Studio, a backup and recovery and disc burning program; stores the settings for a backup project, including reference to the files and folders to backup; can be used for creating .ASHBAK files or burning backup discs.", "Windows, ", "['Ashampoo Burning Studio 18']"], "abk": ["Automatic Backup File", "Backup file created by various programs, including CorelDRAW, Ability Office Write, and PrintMaster Gold; contains a backup of the a currently opened document or project; used to recover program data in the event of a computer crash or file corruption.", "Windows, Windows, Windows, ", "['CorelDRAW Graphics Suite X8', 'Broderbund PrintMaster v7 Platinum'][]['Electronic Arts Need for Speed: Underground']"], "abi": ["DNA Chromatogram File", "Contains DNA sequence information recorded by a DNA analysis instrument; also known as a electropherogram file or DNA trace file; can be be viewed graphically by a ABI file viewer to analyze and compare DNA sequences.", "Windows, Mac, Linux, Windows, Mac, Linux, ", "['GSL Biotech SnapGene', 'Heracle BioSoft DNA Baser', 'BioEdit', 'Nucleics QualTrace', 'Geospiza FinchTV', 'Technelysium Chromas', 'Gene Codes Sequencher']['GSL Biotech SnapGene', 'Applied Biosystems EditView or 3100 Conversion Utility', 'Geospiza FinchTV', 'Gene Codes Sequencher', '4Peaks']['EMBOSS abiview', 'Nucleics QualTrace']['AbiSource AbiWord']['AbiSource AbiWord']['AbiSource AbiWord']"], "abf": ["Adobe Binary Screen Font File", "Binary encoding of Adobe's character bitmap distribution formation, which is an ASCII text-encoded font format; each ABF file consists of a sequence of 8-bit bytes; character bitmaps are stored in a \"strike\" format, which is a rectangular pixel array; the height of the rectangle is the height of the tallest character in the font and the width is the sum of all the character widths.", "Windows, Mac, Windows, ", "[][]['Microsoft SQL Server 2016']"], "abcd": ["AudioVisual Book Data File", "Digital book containing text, audio, and video data; stored in an encrypted XML format; can also save highlighting, bookmarks, and annotations added by the user; used in education, corporate communication, and general reading.", "Windows, ", "[]"], "abc": ["ActionScript Byte Code File", "Encoded file created by the Flash compiler when compiling ActionScript scripts (.AS files); contains bytecode for the script, which is compiled code that is readable and executable by the ActionScript Virtual Machine (AVM or AVM2); often dynamically generated by the runtime compiler, so the user may not ever see the ABC file.", "Windows, Mac, Windows, Windows, Mac, Windows, Mac, Linux, Web, ", "['Adobe Flash Professional CC', 'Adobe Flash Player']['Adobe Flash Professional CC', 'Adobe Flash Player']['iGrafx FlowCharter', 'iGrafx Process'][][]['MuseScore', 'Myriad Melody Assistant', 'Myriad Harmony Assistant', 'TablEdit']['MuseScore', 'Myriad Melody Assistant', 'Myriad Harmony Assistant']['MuseScore', 'Myriad Melody Assistant', 'Myriad Harmony Assistant']['Abc2xml']"], "abbu": ["Address Book Backup", "Backup file exported from the Apple Address Book (included with Mac OS X); used to restore the default address book if needed.", "Mac, ", "['Apple Contacts']"], "aba": ["Palm Address Book Archive", "Address book archive file created by Palm mobile devices; contains contacts entries with name, organization, email address, phone number, title, and photos; use to backup and synchronize personal and professional contacts between computers and mobile devices.", "Windows, Mac, Windows, ", "['Palm Desktop']['Palm Desktop']['Avant Force Avant Browser']"], "ab3": ["PhotoImpact 3 Album File", "Picture album created with the third version of Ulead PhotoImpact; used for cataloging images in an organized format; contains references to the images in the album, but not the images themselves.", "Windows, ", "[]"], "ab1": ["DNA Electropherogram File", "Raw DNA data taken from a scientific instrument and output from Applied Biosystems' Sequencing Analysis Software; contains an electropherogram and the DNA base sequence, which can be viewed using a DNA viewer program.", "Windows, Mac, ", "['GSL Biotech SnapGene', 'Applied Biosystems Sequencing Analysis Software', 'BioEdit', 'Geospiza FinchTV', 'Technelysium Chromas', 'Genome Compiler', 'Heracle BioSoft DNA Baser']['GSL Biotech SnapGene', 'Applied Biosystems EditView or 3100 Conversion Utility', 'Geospiza FinchTV', 'Genome Compiler']"], "ab": ["Android ADB Backup File", "Backup file created by adb (Android Debug Bridge), a command-line tool included with the Android SDK; can include both apps, system, and user data from an Android 4.0 or later device; used for saving and restoring device snapshots.", "Windows, Mac, Linux, Android, Linux, Windows, ", "['Google Android SDK']['Google Android SDK']['Google Android SDK']['Ambling BookPlayer'][]['Heracle BioSoft DNA Baser']"], "aaxplugin": ["Avid Audio eXtension Plugin File", "Avid Audio eXtension (AAX) plugin format used by Pro Tools, a digital audio workstation (DAW); adds extra sound processing and audio effects to the application; examples include vintage compressor emulations, convolution reverbs, and noise reduction tools.", "Windows, Mac, ", "['Avid Pro Tools']['Avid Pro Tools']"], "aax": ["Audible Enhanced Audiobook File", "Multimedia digital audiobook format developed by Audible; may be used by audiobooks available from Audible.com, AudibleKids, and the iTunes Store; similar to the standard .AA audiobook file type, but may include other features such as images and links.", "Windows, Mac, ", "['Apple iTunes']['Apple iTunes']"], "aawdef": ["Ad-Aware Definitions File", "Contains definitions of adware, spyware, and viruses for Ad-Aware, an anti-spyware program; used for locating and removing malware from a system; should be updated regularly to protect against new types of system attacks.", "Windows, ", "['Lavasoft Ad-Aware']"], "a4p": ["A4Desk Pro Project File", "Project file created by A4Desk Pro, a program used for making Flash websites without requiring in-depth knowledge of Flash; created from one of the templates included with A4Desk Pro and includes Flash animations and interactive website content.", "Windows, ", "['Avanquest A4Desk Pro']"], "a3d": ["Alternativa Player 3D Export File", "File created by AlternativaPlayer, an online 3D models viewer; contains a 3D model exported from the online program; located within the \"model\" folder of the folder in the .ZIP file created by the program. ", "Web, ", "['AlternativaPlayer']"], "a2w": ["Alice World", "3D world created with Alice, a Java-based educational programming tool used for creating animations and interactive game; defines a three-dimensional space, or \"world,\" that contains 3D objects; compressed in a standard .ZIP format.", "Windows, Mac, Linux, Windows, ", "['Alice']['Alice']['Alice']['Adlib Tracker II']"], "a2theme": ["Aston 2 Theme File", "Windows theme used by Aston, a program that replaces the Windows desktop and shell with customized appearances; stores visual settings for the start menu, desktop, and panels; saved in a compressed .ZIP format.", "Windows, ", "['Gladiators Aston']"], "a2m": ["TS-AudioToMIDI Settings File", "Configuration file that stores preferences for TS-AudioToMIDI, an audio to MIDI conversion program; can be opened or saved within the program by clicking the \"Open Settings\" or \"Save Settings\" buttons at the bottom of main window.", "Windows, Windows, ", "[]['Nullsoft Winamp with AdPlug plugin', 'Adlib Tracker II']"], "a2i": ["Adlib Tracker II Instrument File", "File created by Adlib Tracker II, an 18 channel FM audio tracking application; contains instrument samples accessed by Adlib Tracker II to create compositions.", "Windows, ", "['Adlib Tracker II']"], "a2l": ["ASAP2 ECU Description File", "Standard file format specified by the ASAM MCD-2MC (ASAP2) workgroup; describes the interfaces, measurements, and parameters of an Electronic Control Unit (ECU), an electronics component that is used to control various parts of a motor vehicle; helps in the process of transforming an ECU model design into a physical ECU; also helps in the process of calibrating and testing the ECU.", "Windows, ", "['File Viewer Plus', 'AVL CRETA Calibration Data Management', 'HEXplorer', 'NI ECU Measurement and Calibration Toolkit']"], "a2c": ["Alice Object File", "3D model used by Alice, a 3D programming environment designed for educational purposes; saved in a compressed 3D mesh  format can include vertices, edges, and polygons; may be viewed and edited as a three-dimensional object within Alice.", "Windows, Mac, ", "['Alice']['Alice']"], "a2b": ["Adlib Tracker II Instrument Bank", "Instrument banks accessed by Adlib Tracker II, an audio tracking application; contains instruments used to create compositions in the Adlib Tracker II program.", "Windows, ", "['Adlib Tracker II']"], "a26": ["Atari 2600 ROM", "Game file used by Atari 2600 emulators, which can play Atari 2600 games as if they were run on the original system; stores an exact copy of the original game cartridge; used for playing older Atari games on computers.", "Windows, Mac, Linux, ", "['Stella', 'z26']['Stella']['Stella', 'z26']"], "a02": ["ALZip Fourth Split Archive File", "Fourth file of a spanned archive created with ALZip, a Windows file compression utility; saved in the proprietary ALZ compressed format along with an .ALZ file and other parts of split archive; additional files have file extensions .A01, .A02, etc.", "Windows, ", "['ESTsoft ALZip']"], "a00": ["ALZip Second Split Archive File", "Second file of a spanned archive created with ALZip, a multi-format file compression utility; saved in the compressed ALZ format along with an .ALZ file and other split archives; additional files have file extensions .A01, .A02, etc.", "Windows, ", "['ESTsoft ALZip']"], "a01": ["ALZip Third Split Archive File", "Third file of a spanned archive created with ALZip, a file compression utility for Windows systems; uses proprietary ALZ compression and is saved along with other split archives; preceded by the .ALZ and .A00 files and is followed by the .A02 file.", "Windows, ", "['ESTsoft ALZip']"]}