{"b": ["Grand Theft Auto 3 Saved Game File", "A B file is a saved game file created by Grand Theft Auto III (GTA3), an automotive-based action game.  It saves gameplay information so the game can be resumed from the save point at a later time.  B files are used by multiple editions of GTA3, including Vice City and San Andreas.", "Windows, Windows, Mac, Windows, Mac, ", "['Rockstar Games Grand Theft Auto 3', 'Rockstar Games Grand Theft Auto: Vice City', 'Rockstar Games Grand Theft Auto: San Andreas']['text editor']['text editor']['Microsoft Visual Studio', 'FreeBASIC', 'PureBasic', 'PowerBASIC', 'text editor']['text editor']"], "bafl": ["BurnAware File List", "Text file created with BurnAware disc burning software; contains a list of data files that can be burned to a CD, DVD, or Blu-ray disc; saved in an XML format with one file per line.", "Windows, ", "['Burnaware Technologies BurnAware']"], "bad": ["Exchange Badmail File", "E-mail message that could not be delivered by Microsoft Exchange Server; includes the message sender, message recipient(s), subject, and body, just like the original message.", "Windows, ", "['Microsoft Exchange Server']"], "band": ["GarageBand Project File", "Audio project created with Apple's GarageBand software; may contain both MIDI and audio data; often includes Apple Loops and software instruments included with GarageBand.", "Mac, ", "['Apple GarageBand 10']"], "bap": ["Blaze Audio Wave Information File", "Audio information file created automatically when an audio file is opened in a Blaze Audio program; contains information about the audio file that allows it to open faster in the editing program.", "Windows, ", "[]"], "bak2": ["Backup File", "Backup file created by a variety of programs, including games such as Crytek Crysis; contains a copy of the original file, such as a map or scene; similar to the .BAK file extension.", "Windows, Mac, ", "['Crytek Crysis', 'Crytek Crysis Warhead', 'E-on Vue']['E-on Vue']"], "bak3": ["Backup File", "Backup file created by multiple programs, including games such as Crytek Crysis; contains a copy of the original file, such as a scene; similar to the .BAK and .BAK2 file extensions.", "Windows, Mac, ", "['Crytek Crysis', 'Crytek Crysis Warhead', 'E-on Vue']['E-on Vue']"], "backupdb": ["Time Machine Backup Folder", "Backup folder created by Apple Time Machine, a backup utility included with Mac OS X 10.5 (Leopard); named \"Backups.backupdb\" and is often the only folder on the backup drive.", "Mac, ", "['Apple Time Machine']"], "bakx": ["Finale Backup File", "File created by Finale, a music notation program for instruments, vocals, and more; contains backup data for .MUSX files; updated 2014 version of the Finale .BAK file used in previous releases.", "Windows, Mac, ", "['MakeMusic Finale']['MakeMusic Finale']"], "bak": ["Firefox Bookmarks Backup", "Backup of the Firefox bookmarks file; can be used to replace saved bookmarks in case the main bookmarks file becomes corrupted; automatically generated by the Firefox Web browser; typically named \"bookmarks.bak\"", "Windows, Mac, Windows, Mac, Windows, Windows, Mac, ", "['Mozilla Firefox']['Mozilla Firefox']['Autodesk AutoCAD 2017', 'Microsoft SQL Server 2016'][]['Swiftpage Act!']['MakeMusic Finale']['MakeMusic Finale']"], "backup": ["Android Backup File", "Backup file created by some Android phones and other Android mobile devices; created through the advanced startup mode when pressing and holding the power button and volume button and then choosing the option to backup user information; saved to the Android device's SD card when the backup is complete.", "Android, ", "['Google Android']"], "bac": ["Backup File", "Backup of a file or group of files created by Backup Plus, a file backup program from Avantrix; may be a standalone backup file or part of a split archive, which uses the \".b01,\" \".b02,\" etc. extensions; can be restored using the Backup Plus Restore Manager.", "Windows, ", "[]"], "ba2": ["Bethesda Softworks Archive", "A BA2 file is a compressed game data archive used by Bethesda Softworks video games, such as Fallout 4.  It contains 3d models, textures, meshes, sounds, and other data referenced by each game.  BA2 files replaced .BSA files.", "Windows, ", "['Bethesda Archive Extractor']"], "ba6": ["TaxAct 2016 Tax Return Backup File", "A BA6 file is a backup file of a 2016 tax return created with the 2016 version of TaxAct, a tax-preparation program.  It contains tax data for the 2016 tax year, which is used for archival purposes and in case the .TA6 file is lost or becomes corrupt.  BA6 files include federal IRS and state tax form data along with the user's basic information. ", "Windows, ", "['TaxAct 2016']"], "ba_": ["Renamed BAT File", "Renamed .BAT executable file that uses an underscore (\"_\") instead of the \"t\" so that the file cannot be accidentally run when double-clicked in Windows; can be renamed back to a \".bat\" file and then run.", "Windows, ", "['Microsoft Windows Command Prompt', 'Microsoft Expand']"], "bzip2": ["Bzip2 Compressed Archive", "Compressed archive containing one or more files that have been compressed using the bzip2 compression algorithm; typically reduced to 10-15% of the original file size; bzip2 is a standard file compression program included with many Unix/Linux distributions.", "Windows, Mac, Linux, Android, ", "['File Viewer Plus', 'Smith Micro StuffIt Deluxe for Windows', 'WinRAR 5', 'bzip2']['Apple Archive Utility', 'Smith Micro StuffIt Deluxe 16', 'The Unarchiver']['bzip2']['File Viewer for Android', 'RARLAB RAR']"], "bzw": ["BZFlag World File", "World file used by BZFlag, a 3D multi-player first person tank simulation game; contains a game world, or map, that defines 3D objects in plain text; supports land, water, meshes, and 3D shapes, such as boxes, cones, and spheres; may also be used to define game elements including teleporters and weapons. ", "Windows, Mac, Linux, ", "['BZFlag', 'pyBZEdit', 'iBZServer', 'blender with BZWTools Plug-in']['BZFlag', 'iBZEdit', 'pyBZEdit', 'iBZServer', 'Blender with BZWTools Plug-in']['BZFlag', 'BZEdit', 'BzfEd', 'pyBZEdit', 'Blender with BZWTools Plug-in']"], "bzplug": ["AfterShot Pro Plugin Bundle", "A BZPLUG file is a plugin bundle file used by Corel AfterShot Pro, a professional image editor.  It stores content, which may be multiple files, that extends the functionality of the AfterShot application.  Some examples of capabilities added through the plugin are color grading tools, perspective correction, advanced vignetting, and nostalgiac classic film simulator.", "Windows, Mac, Linux, ", "['Corel AfterShot Pro 3']['Corel AfterShot Pro 3']['Corel AfterShot Pro 3']"], "bzip": ["Bzip Compressed Archive", "File archive compressed with Bzip, a file compression tool included with some Unix systems; combines Run-Length Encoding (RLE) with the Burrows-Wheeler compression algorithm; slower than .GZIP compression, but compresses files more.", "Windows, Mac, Linux, ", "['Smith Micro StuffIt Deluxe for Windows', 'Corel WinZip 21', 'WinRAR 5']['Apple Archive Utility', 'Smith Micro StuffIt Deluxe 16'][]"], "bzabw": ["Compressed AbiWord Document", "Compressed document created by AbiWord, a free, cross-platform word processor; contains a .ABW document compressed with Bzip2 (.BZ2 files) compression; helps reduce the size of an ABW document, which is stored using XML formatting.", "Windows, Mac, Linux, ", "['AbiSource AbiWord']['AbiSource AbiWord']['AbiSource AbiWord']"], "bza": ["IZArc BGA Archive", "Archive file created by IZArc, a file compression and decompression program; contains one or more files that are compressed using BGA compression, which is an uncommon compression format; can be extracted to the original files using IZArc.", "Windows, ", "['IZArc']"], "bz2": ["Bzip2 Compressed File", "Compressed archive created by bzip2, a file compression program often found on Unix-based systems; incorporates the Burrows-Wheeler compression algorithm as well as Run-Length Encoding (RLE) for high levels of compression; often used for Linux software package distributions.", "Windows, Mac, Linux, Android, ", "['File Viewer Plus', 'Corel WinZip 21', 'Smith Micro StuffIt Deluxe for Windows', 'WinRAR 5', 'PeaZip', '7-Zip']['Apple Archive Utility', 'Corel WinZip Mac 5', 'Incredible Bee Archiver', 'Smith Micro StuffIt Deluxe 16', 'The Unarchiver', 'bzip2']['bzip2', 'PeaZip']['File Viewer for Android', 'RARLAB RAR']"], "bytes": ["Binary Text Asset Data File", "File used by Unity, a 3D game development application; contains binary data from the text asset (commonly using but not limited to the .TXT extension) file; loaded as a text asset and accessed through the bytes property; extension must be manually changed to BYTES.", "Windows, Mac, ", "['Unity Technologies Unity']['Unity Technologies Unity']"], "bz": ["Bzip Compressed File", "File archive compressed with Bzip compression; often created on Unix systems with the standard bzip utility; incorporates the Burrows-Wheeler algorithm as well as Run-Length Encoding (RLE), which compresses better than Gzip (.GZIP files), although it does not compress as quickly.", "Windows, Mac, Linux, ", "['Corel WinZip 21', 'Smith Micro StuffIt Deluxe for Windows', 'WinRAR 5', '7-Zip']['Apple Archive Utility', 'Smith Micro StuffIt Deluxe 16', 'The Unarchiver']['bzip2']"], "bxx": ["BS Contact Parameter File", "Parameter file used by BS Contact, a Web browser plug-in or standalone viewer that enables multi-user 3D collaborative and social environments leveraging DirectX and OpenGL; contains parameters for layout and connection information in text format. ", "Windows, Linux, ", "[][]"], "byu": ["Brigham Young University Movie File", "Animation file that incorporates vector images, polygons, and coordinates; based on a proprietary format created at Brigham Young University (BYU) and is commonly referred to as the \"Movie.BYU\" format; often also named \"movie.byu\" by default.", "Windows, ", "[]"], "bxl": ["Accelerated Designs PCB Library File", "Electronics data file created in Accelerated Designs' BXL format (referred to as the Xlator DataBase format); can specify both PCB footprints and schematic symbols; used for distributing PCB information in a vendor neutral format.", "Windows, ", "['Accelerated Designs Ultra Librarian Reader']"], "bwz": ["WinImage Batch Configuration File", "Batch configuration file created with WinImage, a disk image creation utility; contains settings that can be loaded into the WinImage Batch Assistant; used for automating the creation of multiple disk images.", "Windows, ", "['Gilles Vollant WinImage']"], "bww": ["Bagpipe Player File", "File used by Bagpipe Player, a program used for playing bagpipe music written in BWW files; can be displayed as a musical chart in the Bagpipe Player and can also be played with MIDI or PC Speaker sound; uses a plain text format.", "Windows, ", "['Bagpipe Player']"], "bwt": ["BlindWrite 4 Track Information FIle", "A BWT file is a track information file created by BlindWrite 4.x, a Windows program used to copy games and backup discs.  It contains information that describes the structure of a disc image saved in a .BWI file.  BWT files include information such as the artist and length of audio tracks on a CD or length of features on a DVD.", "Windows, ", "['VSO Software BlindWrite', 'EZB Systems UltraISO']"], "bws": ["BlindWrite Sub Code File", "Supplementary disk image file created with BlindRead or BlindWrite software; contains sub codes, or sub channel data, related to a specific disc image; optionally saved along with a .BWI and .BWT file.", "Windows, ", "['VSO Software BlindWrite']"], "bwp": ["BuRg3r Web Page", "Web page script written in BuRg3r, a programming language and game engine developed by Fluffy Smoke Entertainment; may contain HTML code as well as sections of BuRg3r source delimited by <?b and ?> tags.", "Windows, Mac, ", "['text editor']['text editor']"], "bwi": ["BlindWrite CD/DVD Disc Image", "Disc image originally created by BlindWrite and now also supported by other disc imaging applications; stores a copy of a CD or DVD disc; design for creating game disc backups.", "Windows, ", "['VSO Software BlindWrite', 'H+H Software Virtual CD', 'DT Soft DAEMON Tools', 'EZB Systems UltraISO']"], "bwg": ["BrainWave Generator Audio File", "Audio file used by BrainWave Generator (BWG), a program that uses sound and visual stimulation to try and help users relax, meditate, and focus better; saves audio in the form of a \"binaural beat,\" which attempts to change brain frequencies toward a desired state.", "Windows, ", "['Noromaa Solutions BrainWave Generator']"], "bwf": ["Broadcast Wave File", "Audio wave .WAV file with extra information, such as timestamps and other metadata, contained in the header.", "Windows, Mac, ", "['Adobe Audition CC 2017', 'Cakewalk SONAR X3', 'Avid Pro Tools']['Adobe Audition CC 2017', 'Apple Logic Pro X', 'Apple Final Cut Pro X', 'Avid Pro Tools']"], "bwa": ["BlindWrite Disk Information File", "Contains information about the physical characteristics of a CD or DVD; generated after scanning a disc with BWA Builder, a companion program for BlindWrite disc burning software; referenced when burning a copy of the disc.", "Windows, Windows, ", "['VSO Software BlindWrite']['PopCap Games Bookworm Adventures Deluxe']"], "bw": ["Black and White SGI Image File", "Silicon Graphics (SGI) image file format; used for saving black and white images; native format on SGI workstations; can be uncompressed or run-length encoded (RLE).", "Windows, Mac, Linux, ", "['File Viewer Plus', 'FFmpeg', 'ImageMagick']['FFmpeg', 'ImageMagick']['FFmpeg', 'ImageMagick']"], "bvr": ["Blue Iris Video", "Video file recorded by Blue Iris security video recording software; often used in stores, malls, and other commercial sites; allows video to be played back and scrolled based on motion events (e.g., a customer walking by) captured in the video.", "Windows, ", "['Perspective Software Blue Iris']"], "bvp": ["VodaHost BlueVoda Project File", "Project file created by BlueVoda, an application used to build and publish Web pages; contains the HTML, CSS, and other code, as well as references to project images and other page content; also stores the visual structure of the project laid out by the user in the design mode.", "Windows, ", "['VodaHost BlueVoda']"], "bvd": ["Bitdefender Vault File", "Encrypted virtual drive created by Bitdefender, an antivirus and Internet security application; often stores important and sensitive user documents, but may store any other kind of file as well; incorporates both encryption and password protection for security.", "Windows, ", "['Bitdefender Total Security 2017']"], "bus": ["OMSI Bus Configuration File", "File created by OMSI The Bus Simulator, an omnibus driving simulator; contains configuration data for buses that appear during gameplay, such as speed and appearance; similar to other OMSI configuration files like .HUM, .SLI, .SCO, and .OVH files; can be customized.", "Windows, Windows, ", "['MR Software OMSI The Bus Simulator 2']['VirtualBus']"], "bvh": ["Biovision Hierarchy Animation File", "ASCII file that contains motion capture data for three-dimensional characters; used by 3ds Max's Character Studio and other 3D animation programs to import rotational joint data; developed by Biovision as a standard format to save biped character motion data.", "Windows, Mac, Linux, ", "['Autodesk 3ds Max 2017', 'Autodesk Maya 2017', 'Smith Micro Poser 11', 'DAZ 3D DAZ Studio 4', 'pmG messiahStudio', 'Blender']['Smith Micro Poser 11', 'Autodesk Maya 2017', 'DAZ 3D DAZ Studio 4', 'pmG messiahStudio', 'Blender']['Autodesk Maya 2017', 'Blender']"], "bur": ["BuRg3r Source Code File", "Source code file written in BuRg3r, a proprietary programming language developed by The BuRg3r Team for their BuRg3r game engine; similar to C/C++ but incorporates different functions; can be used to generate standalone programs.", "Windows, Mac, ", "['text editor']['text editor']"], "bup": ["McAfee Quarantined File", "Quarantined file created by McAfee anti-virus products; saves a backup of a file that was moved from another location on the computer because a virus or other malware was detected; saved to the following directory in Windows Vista and Windows 7:", "Windows, Windows, Mac, Windows, ", "['McAfee Total Protection', 'McAfee Internet Security', 'McAfee Antivirus Plus']['Nero 2017', 'CyberLink PowerDVD 16', 'Corel WinDVD 11']['Apple DVD Studio Pro', 'Roxio Popcorn', 'Roxio Toast 15'][]"], "bundle": ["Mac OS X Application Bundle", "Bundle file or plug-in that adds extra features to the operating system or an application in Mac OS X; examples include support for audio and video cards, custom printer filters, extensions for Dreamweaver, and additional effects in iMovie.", "Mac, Windows, ", "['Apple OS X']['Electronic Arts Burnout Paradise', 'EA Need for Speed: Most Wanted']"], "bun": ["Cakewalk Bundle File", "Audio project archive created with Cakewalk audio production software; saves project (.WRK) data all related audio data in a single file, called a \"bundle.\"", "Windows, ", "['Cakewalk SONAR X3']"], "bul": ["I4 Bullseye Data File", "A BUL file is a data file saved in the I4 Bullseye data format.  It contains static and dynamic cardiac data that is represented in 2D and 3D representations.  BUL files can be opened by the I4 and JSim programs developed by the National Simulation Resource (NSR) Physiome Project.", "Windows, Mac, Linux, ", "['NSR Physiome Project I4', 'NSR Physiome Project JSim']['NSR Physiome Project JSim']['NSR Physiome Project JSim']"], "buildsetting": ["Twixl Publisher Builder Build Setting", "Build settings package created by Twixl Publisher, a program that enables users to create interactive content apps for mobile devices; stores the settings used to build a mobile app, which includes the application icon, info.plist file, and other app resources. \r\n", "Windows, Mac, ", "['Twixl Publisher']['Twixl Publisher']"], "buildpath": ["Eclipse Build Path File", "Developer file created by Eclipse, a free IDE supporting Java, C/C++, PHP, and many other programming languages; created as part of a project using the filename .buildpath (no filename prefix); uses XML formatting.", "Windows, Mac, Linux, ", "['Eclipse', 'Zend Studio']['Eclipse', 'Zend Studio']['Eclipse', 'Zend Studio']"], "buf": ["Buffer File", "A BUF file is a buffer file used by various programs, such as SQL*Plus and GNU Emacs.  It contains data for a short time and then is erased.  BUF files are not meant to be opened.", "Windows, Mac, ", "[][]"], "bud": ["Binary Printer Description File", "Binary file generated by the Windows operating system when sending documents to the printer in Microsoft Windows 2000 or XP; increases the spooler efficiency of the print driver; most often created from .GPD files so when the GPD parser is updated, the associated BUD file must be regenerated.", "Windows, ", "['Microsoft Windows']"], "bu": ["Samsung CCTV Video File", "Video file created with a Samsung DVR, such as a CCTV (closed circuit television) recording system; contains surveillance video in a proprietary Samsung format that can only be played back on Samsung devices or with Samsung's video software.", "Windows, ", "['Samsung SmartViewer']"], "btw": ["BarTender Label", "Barcode label created with BarTender, a professional barcode creation program; may include bar codes, text, and graphics that can be combined in a custom layout; may also be used for encoding RFID tags.", "Windows, ", "[]"], "btsearch": ["BitTorrent Search Engine File", "Search engine definition file used by BitTorrent applications, such as BitTorrent and uTorrent; saved in an XML format and contains search engine information that can be added to a BitTorrent application user interface; includes the name, description, and URL of each search engine.", "Windows, ", "['BitTorrent', 'uTorrent']"], "btr": ["Btrieve Database File", "Database file created by Btrieve, a transactional database program designed for speed; contains a collection of records stored in the Btrieve database format; used to store and retrieve data as well as generate reports.", "Windows, ", "[]"], "btn": ["AutoPlay Media Studio Button File", "Button file used by AutoPlay Media Studio, a rapid application development tool used to create CD menus, games, and multimedia applications; stores the button styles and can specify a scripted action to take when the button is clicked.", "Windows, ", "['Indigo Rose AutoPlay Media Studio']"], "btm": ["BizTalk Map File", "Data mapping file used by BizTalk Server, an application designed to integrate systems and automate processes across global supply chains; contains relationships between different schemas, or databases of information.", "Windows, Windows, ", "[]['JP Software Take Command']"], "btinstall": ["uTorrent Installer File", "Installer file used by uTorrent, a popular .TORRENT download application; contains an installation package for installing a new component in uTorrent; similar to a .BTAPP file.", "Windows, Mac, ", "['uTorrent']['uTorrent']"], "btoa": ["Binary-to-ASCII Encoded File", "Encoded file that has been converted from a binary file to a text file with btoa (Binary to ASCII) encoding; may be used to send a binary file over a protocol that only support text files.", "Windows, Mac, Linux, ", "['Smith Micro StuffIt Deluxe for Windows']['Smith Micro StuffIt Deluxe 16'][]"], "btif": ["NationsBank Check Image File", "Check image format used by NationsBank that contains compressed image data and ASCII text; includes information that describes the check issue date, paid date, and amount of each check in the file.", "Windows, ", "['Web browser']"], "bto": ["Bryce Tree File", "3D object used by Bryce, a program used for 3D modeling and scene generation; contains a 3D model of a tree that can be added to a larger scene; used for generating landscapes with specific types of trees, such as pine, birch, or maple trees.", "Windows, Mac, ", "['DAZ 3D Bryce 7 Pro']['DAZ 3D Bryce 7 Pro']"], "bti": ["Nintendo Texture File", "Texture file used by Nintendo GameCube, Wii and Nintendo DS games such as Zelda and Mario series games; sometimes altered by the modding community to change the look of virtual characters or the environment.", "Windows, ", "['MKDS Course Modifier', 'Wiimms SZS Tools']"], "btf": ["NationsBank Check Images", "Contains check images and ASCII text; image data may be compressed using G4, JPEG, ABIC, or IOCA/ABIC compression; the text describes the issue date, paid date, amount, etc. for each check in the file.", "Windows, ", "['Web browser']"], "bt!": ["BitSpirit Incomplete Download File", "Partially downloaded file created by BitSpirit, a torrent downloading program; used for all in-progress downloads if the \"Add .bt! extension to unfinished files\" option is selected in the BitSpirit preferences under \"File Options.\"", "Windows, ", "['BitSpirit']"], "btd": ["Business-in-a-Box Document", "Document created by Business-in-a-Box, a program used for authoring business documents; often is created from one of the numerous templates included with the software; can contain legal notices, human relations memos, financial documents, and many other document types.", "Windows, Mac, ", "['Biztree Business-in-a-Box']['Biztree Business-in-a-Box']"], "bsp": ["Quake Engine Game Map File", "Map file used by games developed with one of the Quake game engines; contains the layout information, objects, and resources for a level map; used by many games, including Quake, Quake 2, Quake 3, Half-Life, Half-Life 2, Team Fortress, Counter-Strike, Counter-Strike: Condition-Zero, Portal, and Call of Duty: World at War.", "Windows, Mac, Linux, ", "['id Software GtkRadiant', 'GCFScape', 'Q3Map2', 'QuArK', 'Irrlicht', 'BSP']['id Software GtkRadiant', 'Irrlicht']['id Software GtkRadiant', 'Irrlicht']"], "btapp": ["uTorrent App", "Application written for uTorrent, a popular .TORRENT download program; contains HTML and JavaScript code and can be displayed in an embedded browser window; may be added to the uTorrent client from within the program by selecting the BTAPP file and clicking \"Add\" (or \"Install\" in some versions).", "Windows, Mac, ", "['uTorrent']['uTorrent']"], "bt": ["Binary Terrain File", "GIS file created in the Binary Terrain (BT) format, a binary file format used for storing elevation grids; created as part of the Virtual Terrain Project and designed a a simple, compact elevation grid storage format; used for displaying topographical maps.", "Windows, ", "['Blue Marble Geographics Global Mapper', 'AutoDEM']"], "bst": ["BibTeX Style Document", "Specifies the formatting of a BibTeX (.BIB) document; referenced by the LaTeX document and used by the BibTeX program \"bibtex\" when generating items for the bibliography; may also be used to create HTML output from a BibTeX file.", "Windows, Mac, Linux, ", "['TeXworks', 'TeXnicCenter', 'proTeXt']['TeXworks', 'LyX/Mac']['TeXworks']"], "bss": ["Resident Evil Background Images File", "Graphics file used by games in the PlayStation version of the Resident Evil zombie horror series; saves multiple 2D background images that are used for showing rooms from different camera angles in the game; can be viewed on a PC with the Reevengi tools.", "Windows, ", "['Capcom Resident Evil', 'Reevengi']"], "bsk": ["Nero SecurDisc Private Key File", "Private key file used by Nero SecurDisc, a tool included with Nero software that allows discs to be digitally signed; contains a key code that is used to secure the disc; used to protect sensitive data such as documents, photos, and confidential data.", "Windows, Windows, Mac, ", "['Nero 2017', 'Nero SecurDisc Viewer']['DAZ 3D Bryce 7 Pro']['DAZ 3D Bryce 7 Pro']"], "bsh": ["BeanShell Script", "Script written for BeanShell, an open source, lightweight scripting language that extends Java with scripting features; contains text source code written in the BeanShell Scripting Language; allows developers to script commands in Java instead of standard shell languages.", "Windows, Mac, Linux, ", "['BeanShell', 'Microsoft Notepad', 'Eclipse IDE for Java Developers', 'gVim']['BeanShell', 'MacroMates TextMate', 'Eclipse IDE for Java Developers', 'MacVim']['BeanShell', 'Eclipse IDE for Java Developers']"], "bsdiff": ["BSDiff Patch File", "Patch format used to update video game ROMs and produce patches for binary files; contains the differences that are to be applied to a source file in order to create a target file. ", "Windows, Mac, Linux, ", "['bsdiff/bspatch']['MultiPatch', 'bsdiff/bspatch']['bsdiff/bspatch']"], "bsf": ["Blu-ray AVC Video File", "High-definition video format used to store Blu-ray video data; encoded with Advanced Video Coding (AVC) and uses H.264 video compression; may be found on a Blu-ray video disc.", "Windows, Mac, ", "['Roxio Creator NXT Pro 5', 'CyberLink PowerDVD 16', 'Nero 2017']['Roxio Popcorn']"], "bsdl": ["Boundary Scan Description Language File", "Electronics specification file saved in the BSDL (Boundary Scan Description Language) format, a subset of the VHDL language and an IEEE standard; describes the pins and registers of an integrated circuit (IC); used for JTAG-compliant electronics testing.", "Windows, ", "['Xilinx ISE Design Suite', 'Microsoft Notepad', 'text editor']"], "bsd": ["BSDL File", "Electronics specification file created in the Boundary Scan Description Language (BSDL) format, an IEEE standard used for testing the functionality of JTAG-compliant integrated circuits (ICs); defines an IC in terms of its pins and registers; often provided by IC manufacturers for customers; uses a plain text format.", "Windows, ", "['Xilinx ISE Design Suite', 'Microsoft Notepad', 'text editor']"], "bsc": ["Visual Studio Source Browser Information File", "Symbol information file generated by Visual Studio, an SDK developed by Microsoft; contains information about symbols in the application, which were generated through an intermediate .SBR file from the original source code.", "Windows, ", "['Microsoft Visual Studio 2017']"], "bsb": ["BioShock Saved Game File", "Save game file created by BioShock, a first-person shooter game where players battle against biologically modified beings; contains a saved state during gameplay; used to save and load in-game progress.", "Windows, Mac, ", "['Take-Two Interactive BioShock']['Take-Two Interactive BioShock']"], "bsa": ["Bethesda Softworks Archive", "Compressed game data archive used by Bethesda Softworks video games; contains 3d models, textures, sounds, and other data referenced by each game.", "Windows, ", "['BSA Commander', 'Fallout mod manager', 'FO3Archive', 'Bethesda Archive Extractor']"], "bs7": ["Windows 7 Boot Updater Skin", "Skin file created by Windows 7 Boot Updater, a third-party Windows program used for updating the appearance of the Windows 7 boot screen; can incorporate background colors, images, animations, and various fonts; may also include replacement messages for the \"Starting Windows\" and \"© Microsoft Corporation\" text.", "Windows, ", "['Windows 7 Boot Updater']"], "bs4": ["Mikogo Session Video Recording", "Video file created by Mikogo, a cross-platform desktop sharing tool used for web conferencing, remote support, and other online meetings; contains video data recorded from a shared screen during an online session.", "Windows, Mac, ", "[][]"], "bs2": ["BASIC Stamp 2 Code File", "Program code for a Parallax BASIC Stamp module or microcontroller; often used for educational hardware programming projects; saved in a text format that can be opened in a text editor.", "Windows, Mac, Linux, ", "[][][]"], "bs1": ["VirtualBus Vehicle Configuration File", "Game file used by VirtualBus, a free bus driving simulation game; contains configuration parameters for the 3D bus driven by the player; stores settings such as the vehicle colors, tire specifications, and the models used by each bus segment.", "Windows, ", "['VirtualBus']"], "brx": ["BREW Application Resource File", "Deprecated application resource file used by older BREW 3.x and 4.x mobile application development programs; contains descriptions of assets used by the application; replaced by the newer .CAR format.", "Windows, Mac, Linux, Windows, ", "['Qualcomm Brew MP SDK']['Qualcomm Brew MP SDK']['Qualcomm Brew MP SDK']['Systeam Beam Report']"], "brw": ["Calyx Point Borrower File", "File used by Calyx Point, a program used to create and manage mortgage loans; contains loan financial data for the borrower; used to track loan status information between a lender and borrower.", "Windows, ", "['Calyx Point']"], "brushvariant": ["Painter Brush Variant File", "Brush category file created and used by Corel Painter, a digital artwork application; contains settings that dictate what a brush looks like.", "Windows, Mac, ", "['Corel Painter 2017']['Corel Painter 2017']"], "brushlibrary": ["Painter Brush Library", "Brush library created and used by Corel Painter, a digital artwork application; stores a collection of brushes grouped into different categories depending on the brush type, such as the Chalk, Crayons, and Felt Pens categories.", "Windows, Mac, ", "['Corel Painter 2017']['Corel Painter 2017']"], "brushcategory": ["Painter Brush Category File", "Brush category file created and used by Corel Painter, a digital artwork application; contains a collection of brush variants, which are specific brushes and brush settings.", "Windows, Mac, ", "['Corel Painter 2017']['Corel Painter 2017']"], "brtex": ["Wii BRTEX Texture File", "Game texture file used by select Nintendo Wii games such as Super Smash Bros. Brawl and Mario Kart Wii; similar to the .BRRES package; contains texture data for characters and objects that is referenced for gameplay.", "Windows, ", "['BrawlBox']"], "brr": ["SNES Sample File", "A BRR file is a sound sample file used by Super Nintendo Entertainment System (SNES) games.  It stores instruments and voices in a compressed format which are used to make up .SPC SNES soundtrack files.", "Windows, ", "['AddmusicK', 'BRR Player', 'BRR tools']"], "brt": ["Bryce Textures File", "Image file used by Bryce, a program used to created 3D models and landscapes; contains a 2D graphic that can be fitted to the skeleton of a 3D model; used for painting, or texturizing, 3D models.", "Windows, Mac, ", "['DAZ 3D Bryce 7 Pro']['DAZ 3D Bryce 7 Pro']"], "brstm": ["BRSTM Audio Stream File", "Audio file used by some Nintendo Wii games; may save a sound effect or background music that is looped during gameplay; sometimes copied from a Wii memory card and converted to more common audio formats.", "Windows, ", "['BrawlBox', 'Brawl Custom Song Maker']"], "brsar": ["Wii BRSAR Audio Package", "Audio resource file used by some Nintendo Wii games such as Mario Kart Wii; saves a package of audio files and may include sound effects, music, and Wii audio streams (.BRSTM files).", "Windows, ", "['BrawlBox']"], "brs": ["RoboHelp Browse Sequence File", "File created by RoboHelp, an application used for creating Windows help documentation; saves a browse sequence, which allows the help readers to move through a series of help topics; included as part of a RoboHelp project (.XPJ).", "Windows, ", "['Adobe RoboHelp']"], "brres": ["Wii BRRES Resource Package", "Game resource file used by some Nintendo Wii games such as Mario Kart Wii; saves models, textures, and animation files; can be opened with BrawlBox on the PC, which allows the contents to be extracted; similar to the .SZS format.", "Windows, ", "['BrawlBox']"], "browser": ["ASP.NET Browser Definition File", "File file used by ASP.NET Web applications; contains definitions for individual Web browsers, including the browser type and capabilities; used by ASP.NET to determine the browser type, as well as to display different Web page content depending on what Web browser was detected.", "Windows, ", "['Microsoft Visual Web Developer', 'Microsoft Visual Studio 2017']"], "bro": ["Broadleaf Tree Model", "Three-dimensional model of a tree or bush created with OnyxTREE BROADLEAF software; used for modeling broadleaf trees, bushes, and plants; supports lighting effects, shadows, wind settings, and leaf textures.", "Windows, Mac, Windows, Windows, Windows, Mac, ", "[][]['Broderbund PrintMaster v7 Platinum']['Avanquest Design & Print']['DAZ 3D Bryce 7 Pro']['DAZ 3D Bryce 7 Pro']"], "brn": ["BrainStorm Data File", "File created by BrainStorm, a program used for capturing ideas in a structured manner; contains a title for an idea and subpoints, which together comprise a tree of information; may store references to files, pictures, hyperlinks, and other information; can be viewed from different perspectives in the software.", "Windows, Windows, Windows, ", "['BrainStorm']['Brn Converter']['GK3 Barn Browser', 'Sierra Entertainment Gabriel Knight 3']"], "brmdl": ["Wii BRMDL Model File", "Wii game model file used by select Nintendo Wii games such as Super Smash Bros. Brawl; saved in the BRMDL format, which is similar to the .BRRES package format; contains model data used to make up the appearance of characters.", "Windows, ", "['BrawlBox']"], "brm": ["Bryce Plug-in File", "Plug-in file used by multiple versions of Bryce, a 3D modeling program; contains data that adds new functions to the software; often used for adding support for new 3D image and video formats.", "Windows, Mac, ", "['DAZ 3D Bryce 7 Pro']['DAZ 3D Bryce 7 Pro']"], "bridgecache": ["Adobe Bridge Cache Export File", "Cache file generated by Adobe Bridge, an Adobe Creative Cloud (CC) file management application; contains exported metadata for the files held in the same folder; similar to .BCM, .BC, and .BCT files.", "Windows, Mac, ", "['Adobe Bridge CC']['Adobe Bridge CC']"], "brlyt": ["Wii Textures and Material Lists File", "File used by some Nintendo Wii games; defines textures and material lists often used for in-game menu graphics and animations; can be edited with Benzin, a homebrew program.", "Windows, ", "['Benzin']"], "brl": ["MicroBraille File", "File saved in the MicroBraille (BRL) format; encodes contracted braille characters (Grade 2 Braille) in braille ASCII, which uses 64 characters from the ASCII character set to represent dot combinations in six-dot braille; can be read by software that supports braille to speech functionality or braille embossers used for printing.", "Windows, ", "['CASC Braille 2000', 'Duxbury Braille Translator', 'Duxbury MegaDots']"], "brk": ["Brooktrout Fax Document", "Fax document created in the Brooktrout fax format; contains the contents of a fax sent via modem or fax machine; used to store digital copies of faxes.", "Windows, ", "['Corel PaintShop Pro X9', 'ACD Systems Canvas X 2017']"], "bri": ["Bryce Plug-in File", "Plug-in file used by Bryce, an application used for 3D modeling; stores functionality that adds additional features to the program; commonly used for enabling import or export support for new file formats.", "Windows, Mac, ", "['DAZ 3D Bryce 7 Pro']['DAZ 3D Bryce 7 Pro']"], "brg": ["ProjectWise User Settings File", "File used by older versions of ProjectWise business collaboration software; contains client software settings such as dialog window positions and data source login information; used for remembering client configuration information; can also be used for configuring multiple clients with the same settings.", "Windows, Windows, ", "['Bentley Systems ProjectWise']['Microsoft Age of Mythology', 'AOM Edit']"], "breft": ["Wii Effects File", "Effects file used by Super Smash Bros. Brawl for the Wii; contains information that describes the appearance of different gameplay effects, such as the texture width and height of fire from falling bombs.", "Windows, ", "['BrawlBox']"], "breff": ["Wii Effect Controls File", "Game file created for Nintendo Wii games such as Mario Kart and Super Smash Bros. Brawl; contains control information for the behavior of different gameplay effects, such as fire from falling bombs and smoke from vehicles drifting around turns.", "Windows, ", "['BrawlBox']"], "brain": ["PersonalBrain Mind Map File", "Mind map project created by PersonalBrain, a program used to visualize ideas; saved using XML formatting and contains nodes, links, and properties that make up the conceptual mind map; enables users to save ideas and expand them later.", "Windows, Mac, Linux, ", "['TheBrain Technologies PersonalBrain']['TheBrain Technologies PersonalBrain']['TheBrain Technologies PersonalBrain']"], "br7": ["Bryce 7 Scene File", "3D scene file created by Bryce 7, a 3D modeling application; often includes environmental elements such as water, terrain, trees, leaves, and skies, but can also 3D models such as humans and animals; may also contain lighting properties and other visual effects.", "Windows, Mac, ", "['DAZ 3D Bryce 7 Pro']['DAZ 3D Bryce 7 Pro']"], "brf": ["Braille Ready Format File", "Document saved in the ASCII-based Braille Ready Format (BRF); encodes contracted Braille characters using a numbering system; can be displayed on a Braille embosser or printed on a Braille printer; may also be spoken by software that supports Braille to speech functionality.", "Windows, ", "['Duxbury Braille Translator', 'ViewPlus Tiger Software Suite']"], "brd": ["EAGLE Circuit Board File", "CAD file created by EAGLE, an application used for schematic capture and PCB design; created with the EAGLE Layout Editor and used for developing design templates for circuitry; can be saved in the Gerber drill data format, which may be used by CAM (computer aided manufacturing) programs.", "Windows, Mac, Linux, Windows, Windows, Mac, Linux, ", "['CadSoft EAGLE', 'CadSoft EAGLE Light Edition']['CadSoft EAGLE']['CadSoft EAGLE', 'CadSoft EAGLE Light Edition']['Cadence Allegro PCB Designer', 'Cadence Allegro Free Physical Viewer']['KiCad']['KiCad']['KiCad']"], "br6": ["Bryce 6 Scene File", "3D scene created by version 6 or later of Bryce, a 3D modeling application; may include elements such as water, terrain, trees, leaves, and skies; can also include objects, such as humans and animals, as well as lighting properties and other effects.", "Windows, Mac, ", "['DAZ 3D Bryce 7 Pro']['DAZ 3D Bryce 7 Pro']"], "br5": ["Bryce 5 Scene File", "3D scene or animation created with Bryce 5, a program for creating virtual three-dimensional environments; Bryce is commonly used to create landscapes with realistic natural elements, such as water, ground, and sky, all with real-world lighting effects.", "Windows, Mac, ", "['DAZ 3D Bryce 7 Pro']['DAZ 3D Bryce 7 Pro']"], "br3": ["Bryce 3 Scene File", "Three-dimensional scene or animation created with Bryce 3 software; may contain 3D objects and landscapes, including mountains, water, trees, etc; includes textures and realistic lighting effects.", "Windows, Mac, ", "['DAZ 3D Bryce 7 Pro']['DAZ 3D Bryce 7 Pro']"], "br4": ["Bryce 4 Scene File", "3D scene or animation created with Bryce 4 3D modeling software; often used to create three-dimensional landscapes with realistic natural elements, such as hills, mountains, water, trees, clouds, sky, etc; may also be used to create basic 3D models of people or other objects.", "Windows, Mac, ", "['DAZ 3D Bryce 7 Pro']['DAZ 3D Bryce 7 Pro']"], "br": ["Brotli Compressed File", "A BR file is a file compressed with Brotli, an open source data compression algorithm.  It contains webpage assets, such as .CSS, .XML, .SVG, and .JS files, compressed in the Brotli Compressed Data Format.  BR files are used by web browsers such as Chrome and Firefox to increase page loading speeds.", "Windows, Mac, Linux, ", "['Google Chrome', 'Mozilla Firefox']['Google Chrome', 'Mozilla Firefox']['Google Chrome', 'Mozilla Firefox']"], "bpz": ["Easy Blue Print Symbol Library", "Collection of objects or \"symbols\" used by Easy Blue Print, a floor plan design application; contains a set of related images that can be loaded into the program.", "Windows, ", "['Easy Blue Print']"], "bpw": ["Bitser Password File", "Encrypted password list created with Bitser, a Windows utility designed for creating and managing compressed archives; contains a list of usernames and passwords entered by the user.", "Windows, Windows, ", "['Bitser']['ESRI ArcGIS for Desktop', 'Microsoft Notepad', 'text editor']"], "bqy": ["Brio Query File", "File used by Brio Insight, an Internet Explorer plug-in used for displaying reports generated from Brio business intelligence software; contains a query that generates a client-side report from a server when executed.", "Windows, ", "['Microsoft Internet Explorer with Brio Insight plug-in', 'Oracle Hyperion Planning']"], "bpr": ["Borland C++Builder Project File", "Project file created by Borland C++Builder 6, an older IDE now replaced by Embarcadero C++ Builder; saves the project information for a C++ development project; cannot be converted to the newer C++Builder format without performing the conversion manually.", "Windows, ", "['File Viewer Plus', 'Embarcadero C++Builder']"], "bps": ["BPS Virus File", "File used by \"BPS\" malware programs such as \"SpywareCops,\" \"AdwareBlaster,\" or \"Spyware and Adware Remover;\" contains data for the virus to run and infect the computer; should be quarantined with the remaining malware files using an anti-virus program.", "Windows, Windows, Mac, Mac, ", "['Symantec Norton Security 2017', 'Kaspersky Anti-Virus 2017']['Microsoft Works', 'Microsoft Word 2016']['Microsoft Word 2016']['MultiPatch']"], "bpn": ["ArchiCAD Project Backup File", "Autosaved backup file created by ArchiCAD, a BIM (Building Information Modeling) program used for the designing and construction of buildings; saves a backup copy of the current project (.PLN file); automatically created by the software if the backup option is set in the application's Data Safety Preferences.", "Windows, Mac, ", "['GRAPHISOFT ArchiCAD']['GRAPHISOFT ArchiCAD']"], "bpnueb": ["PNU eBook File", "eBook format used by PNUEB, a program used for reading eBooks distributed by PNU (Payame Noor University); used for distributing academic resources and is typically localized in Persian; can be read with the PNU Reader application.", "Windows, ", "['PNUEB Reader']"], "bpm": ["PowerDesigner Business Process Model", "Business model created with PowerDesigner, an enterprise data modeling tool; describes the internal tasks and processes of a business and the way customers might interact with the business.", "Windows, Windows, Windows, ", "[]['SDL Trados Studio']['Bizagi Process Modeler']"], "bpl": ["Bore Plan Log", "A BPL file is a log used by TSR Mobile, an Android and iOS app for managing underground pipe and drilling data.  It contains plan information for horizontal directional drilling (HDD) that includes the bore path.", "iOS, Android, Windows, Windows, ", "['Subsite Electronics TSR Mobile']['Subsite Electronics TSR Mobile']['Embarcadero Delphi']['Autodesk AutoCAD 2017']"], "bpmc": ["Bizagi Process Modeler Collaboration", "File created by Bizagi Process Modeler, a business process modeling application; contains diagrams in Team Collaboration Mode; holds processes that consist of diagram images, objects, flow connectors, etc.; may contain more than one diagram. ", "Windows, ", "['Bizagi Process Modeler']"], "bpk": ["Nero SecurDisc Public Key File", "Disc key file created by Nero products, including BackItUp & Burn and Burning ROM; contains a public key that can be used to verify the source and contents of a burned disc; typically distributed by the author of the disc so users can verify that the disc is authentic.", "Windows, ", "['File Viewer Plus', 'Nero 2017', 'Nero SecurDisc Viewer']"], "bpj": ["Boxsim Simulation Project", "A BPJ file is a simulation project created by Boxsim, an application used to simulate and test HiFi loudspeakers.  It contains simulation results from testing speakers, such as frequency response and directions, directivity, phase response, and maximum SPL and input voltage.", "Windows, ", "['VISATON Boxsim']"], "bpf": ["Baan ERP Document", "Document generated by Baan ERP (Enterprise Resource Planning) software; specifies the structure and content of the document in a propritary markup language; can be printed using the BWPRINT.EXE file included with the Baan software.", "Windows, ", "['NAZDAQ B2Win']"], "bpg": ["BPG Image", "Better Portable Graphics (BPG) image format created to replace the JPEG format; provides the same quality as JPEG images but in a smaller file size; supports lossless compression; natively supports 8 to 14 bits per channel.", "Windows, Linux, Windows, ", "['BPGviewer', 'Simple BPG Image viewer']['Simple BPG Image viewer']['Embarcadero Delphi']"], "bphys": ["Blender Cache File", "Cache file created by Blender, an open source 3D modeling program; contains particle point data, such as a particle's velocity vector, location vector, and rotation quaternion; created when rendering animations or scenes in Blender.", "Windows, Mac, Linux, ", "['Blender']['Blender']['Blender']"], "bpb": ["PowerDesigner Business Process Backup File", "Backup copy of a Business Process Model (.BPM) file created with Sybase PowerDesigner; automatically created with a model or multi-model report is saved; can be used to restore the Process Model if the original file cannot be used.", "Windows, ", "[]"], "bpdx": ["Acrobat Batch PDX File", "File used by Adobe Acrobat .PDF document creation software; saves a list of Acrobat index (.PDX) files, option flags, and a schedule for when to rebuild, purge, or update the index; enables PDX files to be updated in batch.", "Windows, Mac, Windows, ", "['Adobe Acrobat DC']['Adobe Acrobat DC']['Palo Alto Software Business Plan Pro']"], "bpd": ["Business Plan Pro Document", "File created by Business Plan Pro, a program used for creating business plans; saves information such as an executive summary, market analyses, timelines, and financial/funding data; can be used for generating forecasts and for printing business plan documents.", "Windows, Web, Windows, ", "['Palo Alto Software Business Plan Pro']['Pao Alto Software Online Conversion Utility'][]"], "bpa": ["StorageSync Backup Archive", "Backup file archive created with StorageSync, a backup program included with certain SimpleTech storage devices; may contain specific files and folders or a complete hard disk backup.", "Windows, ", "[]"], "bp3": ["AutoCAD Batch Plot File", "Batch plotting lists saved from AutoCAD 2000, 2000i, 2002, or 2004", "Windows, ", "['Autodesk AutoCAD 2017']"], "bp2": ["AutoCAD Batch Plot File", "Batch plotting lists saved from AutoCAD Release 14 or previous versions", "Windows, ", "['Autodesk AutoCAD 2017']"], "bos": ["Build Options Specification File", "A BOS file is a build options specification file used by clearmake, a utility that comes with Rational ClearCase used to build executable programs.  It contains macro definitions and ClearCase special targets saved in plain text.  BOS files are commonly used to store temporary macros (like CFLAGS=/Zi) that should not be permanently included in the makefile.", "Windows, Linux, ", "['IBM Rational ClearCase']['IBM Rational ClearCase']"], "box": ["E-mail Mailbox", "Mailbox format used by various e-mail programs; stores collections of e-mail messages that can be opened individually; replaced by .MBOX and .DBX files in newer e-mail programs.", "Windows, Windows, Windows, Windows, ", "['IBM Lotus Notes'][][][]"], "bootskin": ["Stardock Bootskin File", "Raster image used for the Windows boot screen; displayed when the computer starts up; can be viewed and modified using Stardock's BootSkin program.", "Windows, ", "[]"], "bookexport": ["BookSmart Backup Book File", "A BOOKEXPORT file is a backup book created by BookSmart, a free tool used to create photo books, notebooks, and planners.  it contains a .BOOK file and the images included in the book.  BOOKEXPORT files are used to backup a book and to share books with other BookSmart users.", "Windows, Mac, ", "['Blurb BookSmart']['Blurb BookSmart']"], "boot": ["InstallShield Boot File", "File used by InstallShield, a program that creates Windows installers; contains settings for an installation; stored in a plain text format.", "Windows, ", "['Flexera InstallShield']"], "bookwormdeluxesavedgame": ["Bookworm Deluxe Saved Game", "File created by Bookwork Deluxe, a Big Fish Games turn-based arcade puzzle game in which the user links letters and builds words; contains saved game data that can be used to continue gameplay at a later time.", "Windows, ", "['Big Fish Games Bookworm Deluxe']"], "booktemplate": ["iBooks Author Document Template", "Book design template created by iBooks Author, a digital book authoring application; includes design presets for the page layout, text settings, and other book properties; used as the starting point for a book project (.BOOK file).", "Mac, Windows, Mac, ", "['Apple iBooks Author']['Blurb BookSmart']['Blurb BookSmart']"], "bonk": ["Bonk Audio File", "Audio file created in the Bonk format; supports both lossless and lossy compression and uses speech compression techniques to achieve a higher compression ratio than .MP3, but it is not supported by standard audio players.", "Windows, Mac, Linux, ", "['freac']['freac']['freac']"], "boo": ["Booasm Compressed Archive", "ASCII archive encoded with Microsoft Booasm.arc compression.", "Windows, ", "[]"], "book": ["iBooks Author Document", "Book design project created by iBooks Author, a program used for authoring digital books for the Apple iPad; stores the sections and chapters of an iBook; can be exported to the .IBOOKS format and directly uploaded to an iPad, or may be published to the Apple iBookstore using the .ITMSP format.", "Mac, Windows, Mac, Windows, Windows, ", "['Apple iBooks Author']['Blurb BookSmart']['Blurb BookSmart']['Adobe FrameMaker']['Microsoft Notepad', 'text editor']"], "bom": ["Mac OS X Bill of Materials File", "\"Bill of Materials\" (BOM) file created by the Mac OS X Installer; used to determine which files to install, update, or remove during a software update; contains files that have been installed and information about each file; may include Unix permissions, owner and group data, file size, last modified date, and a checksum for each file.", "Mac, ", "['CharlesSoft Pacifist', 'Echo One File Juicer']"], "bok": ["TestGen Testbank File", "Compressed \"book\" of questions for creating tests with TestGen; used by teachers and other educational instructors; often included on CDs that come with textbooks published by Pearson Education; may also be downloaded from the Internet.", "Windows, Mac, Windows, Mac, ", "['Pearson Education TestGen']['Pearson Education TestGen']['Web browser']['Web browser']"], "bo2": ["Minecraft BO2 Object File", "Minecraft BO2 object file used by TerrainControl, a Minecraft modding application used to generate worlds; stores Minecraft terrain objects; also contains settings that control when sunlight, darkness, water, and lava are spawned in the world.", "Windows, ", "['TerrainControl']"], "boc": ["EasyWord Big Document", "Document saved with EasyWord, the word processor included with the EasyOffice office suite; used for saving large files created with EasyWord; can also be exported to a .DOC file, which can be opened by Microsoft Word.", "Windows, ", "[]"], "bnz": ["The Bingo Maker Card Template File", "Bingo card templates file used by The Bingo Maker, an application used to print customized bingo cards; contains several bingo board templates, including each board's size, words, and other settings, such as the font, card grid, and color settings.", "Windows, ", "['The Bingo Maker']"], "bns": ["Portal Bonus Map Script", "Game file used by Portal, a first-person puzzle solving game; stores a plain text script that defines information about a Portal map (.BSP file); includes the map name, thumbnail image file references, comments about the map, and a list of challenges to complete.", "Windows, Mac, ", "['Valve Portal 2', 'Valve Portal']['Valve Portal 2', 'Valve Portal']"], "bnp": ["Sony Camcorder Video Data File", "Data file created by some Sony digital camcorders; stored within the AVF_INFO directory on the camcorder and contains metadata about the recorded videos; used for displaying information on the camcorder such as the dates and number of videos recorded.", "Windows, ", "['Sony Picture Motion Browser']"], "bo3": ["Minecraft BO3 Object File", "Minecraft BO3 object file used by TerrainControl, a Minecraft modding application used to generate worlds; contains Minecraft terrain objects; also stores settings that control when sunlight, darkness, water, and lava are spawned in the world.", "Windows, ", "['TerrainControl']"], "bnk": ["Adlib Instrument Bank", "Instrument banks accessed by Adlib Visual Composer, a music composition program; designed to be loaded with .ROL files; contains custom instrument data to accompany the ROL files that contain the notes to play the instruments that make up the scores.", "Windows, Windows, Mac, Linux, iOS, Android, Windows Phone, Windows, ", "['AdLib Visual Composer', 'Adlib Tracker II']['Spotify']['Spotify']['Spotify']['Spotify']['Spotify']['Spotify'][]"], "bng": ["The Bingo Maker Card File", "Bingo card created by The Bingo Maker, a program used to create and print customized bingo cards; stores the bingo board, size (number of rows and columns), words, and other properties; supports custom words, text colors, and fonts.", "Windows, ", "['The Bingo Maker']"], "bndl": ["Game Data Bundle File", "File extension used for bundle files, which are data archives used in some applications or computer games, notably the Need For Speed: Most Wanted racing game titles; in the Need For Speed title, BNDL files include audio streams and other game sounds such as engine and siren sounds and other sound effects.", "Windows, ", "[]"], "bnd": ["DB2 CLI Bind File", "Database bind file created by IBM DB2 database software; used for binding DB2 CLI (Call Level Interface) packages to databases that are created or migrated within DB2; stored on the database server and is required for accessing universal databases.", "Windows, Linux, ", "[][]"], "bna": ["Barna Word Processor Document", "Text document created with Barna, a word processing program for the Bangla language; uses the Bangla (\"Bengali\") font and supports Munir, Bijoy, and Easy keyboards as well as custom keyboard layouts.", "Windows, ", "[]"], "bmz": ["Portal Bonus Map Zip File", "Game map created for Portal, a first-person 3D puzzle-solving game; stores a bonus map, which can be created by third-party community developers; stores a .ZIP archive of .BSP (map), .TGA (logo), and .BNS (script) files.", "Windows, Mac, Windows, ", "['Valve Portal 2', 'Valve Portal']['Valve Portal 2', 'Valve Portal']['Gilles Vollant WinImage']"], "bmx": ["Siemens Mobile Animations File", "Bitmap graphic used by some Siemens mobile phones; saves four bitmap images joined together vertically (e.g., four 16x16 pixel images as a 16x64 image); used for animating the four frames in sequencefor simple animations on the phone; similar to an animated .GIF, which is also supported on Siemens mobile phones.", "Windows, ", "['Microsoft Windows Photo Viewer', 'Microsoft Paint']"], "bms": ["BeatMania Song File", "Song file used by BeatMania, a rhythm video game with a DJ controller interface; saved in a text format and stores data referenced during the playback of song; includes the song title, artist, genre, BPM (beats per minute), number of players, note positions, references to sound effect files, and other information.", "Windows, Mac, Linux, Windows, ", "['StepMania']['StepMania']['StepMania'][]"], "bmp": ["Bitmap Image File", "A BMP file is an uncompressed raster image comprised of a rectangular grid of pixels.  It contains a file header (bitmap identifier, file size, width, height, color options, and bitmap data starting point) and bitmap pixels, each with a different color.", "Windows, Mac, Web, iOS, Android, ", "['File Viewer Plus', 'Adobe Photoshop CC 2017', 'Adobe Photoshop Elements 15', 'Adobe Illustrator CC 2017', 'Corel PaintShop Pro X9', 'CorelDRAW Graphics Suite X8', 'ACD Systems Canvas X 2017', 'Microsoft Windows Photos', 'Microsoft Windows Photo Viewer', 'image viewer']['Apple Preview', 'Apple Photos', 'ACD Systems ACDSee Mac Pro 3', 'Adobe Photoshop CC 2017', 'Adobe Illustrator CC 2017', 'MacPhun ColorStrokes', 'image viewer']['Google Drive']['Google Drive']['Google Drive']"], "bmq": ["Re-Volt Mipmap File", "Mipmap image used by Re-Volt, an old RC car racing game for the PC; contains a low-resolution image in the BMP format that is used for object textures viewed from afar in the game in order to keep the frame rate stable.", "Windows, ", "['Acclaim Entertainment Re-Volt', 'Microsoft Paint']"], "bmml": ["Braille Music Markup Language File", "File saved in the BMML format and opened by Braille Music Reader, a music creation tool for visually impaired persons; contains a braille musical score; includes score data, such as notes, pitch, and octaves.", "Windows, Windows, Mac, ", "['Braille Music Reader']['Balsamiq Mockups']['Balsamiq Mockups']"], "bml": ["Bean Markup Language File", "Web page written in the Bean Markup Language (BML); based on the Bean Scripting Framework (BSF), which is a set of Java classes that provide scripting language support within Java applications.", "Windows, Mac, Linux, Windows, ", "['Web browser', 'text editor']['Web browser', 'text editor']['Web browser', 'text editor']['CASC Braille 2000']"], "bmk": ["PowerDVD MovieMark File", "Bookmark file created by PowerDVD, an advanced video player for HD and 3D movies; contains a bookmark, called a MovieMark, for a video, including a timestamp, video information, and user comments.", "Windows, iOS, Windows, Mac, Windows, ", "['CyberLink PowerDVD 16']['return7 BillMinder']['Microsoft Notepad', 'text editor']['Apple TextEdit', 'text editor']['Microsoft Windows Help']"], "bmi": ["3ds Max Plug-in", "Plug-in used by 3ds Max, a 3D modeling and animation program; stores a function or procedure that adds a new feature to the software; sometimes used for supporting new file format import or export options.", "Windows, ", "['Autodesk 3ds Max 2017']"], "bmg": ["Nintendo DS On-Screen Text File", "File used by some Nintendo DS, Wii, and GameCube games including Mario Kart DS and Super Mario Sunshine; saves on-screen text such as dialog or game level text; sometimes altered, or \"modded,\" using MKDS Course Modifier.", "Windows, ", "['MKDS Course Modifier']"], "bmf": ["FloorPlan File", "Floor plan developed with IMSI TurboFLOORPLAN software; used for creating 2D and 3D home and landscape designs.", "Windows, Mac, Windows, ", "['IMSI TurboCAD Pro 2017']['IMSI TurboCAD Deluxe v10'][]"], "bme": ["BeatMania 7-Key Song File", "Song file used by BeatMania, a rhythm video game that uses a DJ interface as the controller; similar to a .BMS file, but designed for BeatMania controllers with 7 keys rather than 5 keys.", "Windows, Mac, Linux, ", "['StepMania']['StepMania']['StepMania']"], "bmd": ["MU Online Game Data File", "Game data file used by MU Online, a medieval MMORPG (Massively Multiplayer Online Role-Playing Game); may contain 3D models, textures, animations, maps, in-game text, or other game data.", "Windows, Windows, ", "['Webzen MU Online']['bmdview']"], "bmc": ["Bitmap Cache File", "Cached bitmap file created by the Windows Remote Desktop Client (RDC), which is part of Windows Terminal Services; stores multiple bitmaps that would otherwise be repeatedly sent from the terminal server to the client.", "Windows, Windows, Windows, Mac, Linux, ", "['Microsoft Windows Remote Desktop']['Bolide Movie Creator']['XnViewMP']['XnViewMP']['XnViewMP']"], "bm3": ["Sony Ericsson Backup File", "Mobile phone backup file created by Sony Ericsson PC Suite, a program used for syncing mobile data with the PC; saves contacts, messages, notes, and other data on the phone; can be used to restore the phone's state.", "Windows, ", "['Sony Ericsson PC Suite']"], "bm2": ["Boardmaker Interactive Board File", "Lesson board created by Boardmaker, a program used to teach students with special needs; contains interactive visual elements and sounds; may include quizzes, visual scenes, object lessons, and other teaching elements.", "Windows, Mac, Windows, ", "[][][]"], "blz": ["N-Gage Mobile Video Game File", "Video game container file that stores a game developed by N-Gage, a game distribution service for Nokia mobile phones; contains all packaged data for the game; may be installed after transferring the file to the phone with the Nokia PC Suite software.", "Windows, Windows, ", "['Nokia PC Suite'][]"], "blw": ["Adobe Photoshop Black and White Presets File", "Settings file used by Adobe Photoshop, an application used for creating and editing raster graphics; contains color settings for converting an image to a black and white format; contains the percentages of red, yellow, green, cyan, blue, and magenta colors to include in the resulting image, as well as hue and saturation values.", "Windows, Mac, ", "['Adobe Photoshop CC 2017']['Adobe Photoshop CC 2017']"], "bluej": ["BlueJ Package File", "Package file created by BlueJ, a Java development environment; holds the BlueJ package so when you click on it, the BlueJ program opens; also contains the date when the project it accompanies was created.", "Windows, Mac, Linux, ", "['BlueJ']['BlueJ']['BlueJ']"], "bluebutton": ["VA Blue Button Data File", "A BLUEBUTTON file is a data file created by VA Blue Button, a web tool that allows U.S. veterans to manage their health records.  It contains a patient's complete personal health information recorded at a VA medical facility.  BLUEBUTTON files include test results, allergies, medical treatment from doctors and hospital visits, prescribed medications, and health insurance claims information.", "Web, ", "['Health IT VA Blue Button']"], "blu": ["FileMaker Pro Runtime Extension", "Extension created by walkingtoyou.com for FileMaker Pro.", "Windows, Mac, ", "['FileMaker Pro']['FileMaker Pro']"], "blt": ["AIM Buddy List", "Stores a list of user's friends for AOL Instant Messenger (AIM), a popular instant messaging program; contains usernames and other information about friends that appear in the program's \"buddy list;\" the buddy list provides an easy way to contact friends and see what friends are online.", "Windows, Mac, ", "['AOL Instant Messenger']['AOL Instant Messenger']"], "bls": ["Blockland Saved Game File", "3D brick creation built with Blockland, an online multiplayer building game; contains a saved 3D scene built from bricks similar to Legos; saved in text format that includes the location and style of each brick.", "Windows, Mac, ", "[][]"], "blp": ["Blizzard Texture File", "Image texture format used by Blizzard games, such as Warcraft 3 and World of Warcraft; can be applied to 3D objects, such as adding a face to a character; formatted similarly to a .TGA files, but used specifically by Blizzard games.", "Windows, Mac, Windows, ", "['Addon Studio for World of Warcraft', 'Warcraft 3 Model Editor', 'XnViewMP']['XnViewMP']['eGames Speedy Eggbert']"], "blockplt": ["LEGO MINDSTORMS NXT Block Palette File", "Application support file used by LEGO MINDSTORMS NXT Software, which provides an interface for programming LEGO MINDSTORMS robots; stores a block palette, which provides programmable blocks that can be inserted into the program of a robot.", "Windows, Mac, ", "['LEGO MINDSTORMS NXT']['LEGO MINDSTORMS NXT']"], "blob": ["Valve Steam Archive", "Data file referenced by Valve Corporation's Steam, an online software distribution program; stores user registry information for the Steam client in the file ClientRegistry.blob, as well as application update information in the file AppUpdateStats.blob.", "Windows, Mac, Linux, ", "['Valve Steam']['Valve Steam']['Valve Steam']"], "blorb": ["Interactive Fiction Package Game File", "Package used by Interactive Fiction (IF) interpreters such as Zoom and Spatterlight; contains the story game and other files that enhance gameplay, such as .JPG files for cover art, .AIFF files for sound effects, and .MOD files for music.", "Windows, Mac, Linux, ", "['Windows Frotz']['Zoom', 'Spatterlight']['Zoom']"], "blogthis": ["Windows Live Writer Data File", "File used by Windows Live Writer, a blogging application that is part of the Windows Live Essentials pack; saves blog post information for uploading to various blogger websites.", "Windows, ", "['Microsoft Windows Live Writer']"], "bln": ["Golden Software Blanking File", "Comma-delimited ASCII text file used by Golden Software's visualization and mapping software products; defines polygon, polyline, and point boundaries; can be used for \"blanking\" out regions in a grid file (e.g., a blanked region on a contour map will not show contour lines).", "Windows, ", "['Golden Software Surfer', 'Golden Software Grapher', 'Golden Software Strater', 'Golden Software Voxler', 'Golden Software MapViewer', 'Golden Software Didger']"], "blkrt": ["Block Artist Image File", "Bitmap image created with Block Artist, an image creation and editing program; saved in a proprietary format that can only be opened by Block Artist.", "Windows, ", "[]"], "blf": ["CLFS Base Log File", "Log file created by the Common Log File System (CLFS), a Microsoft Windows component used for creating transaction logs; contains metadata that is used to manage access to the log data; can be created using the CLFS (API); used with \"containers,\" which are associated files that hold the log data.", "Windows, Windows, ", "['Microsoft Common Log File System'][\"Designer's Gallery MasterWorks\"]"], "blk": ["AutoCAD Block Template File", "Attribute extraction template used by AutoCAD, a 2D and 3D CAD design and documentation application; stores selected drawing elements used for publishing a drawing to a .PDF, .DWF, or .DWFX format; specifically stores the drawing blocks and their properties.", "Windows, Windows, Mac, ", "['Autodesk AutoCAD 2017']['ABBYY FineReader 12']['ABBYY FineReader 14']"], "bli": ["Thomson Speedtouch Firmware File", "File created for Thomson Upgrade Tool, which is part of the firmware package of Thomson's Speedtouch Series WLAN modems and routers; contains firmware updates for Speedtouch devices and, with updated versions, adds features, repair bugs and perform other miscellaneous tasks. ", "Windows, ", "['Thomson Upgrade Tool']"], "blend2": ["Blender Document Backup 2 File", "Automatically generated backup file created by Blender, an open source 3D modeling application; stores a backup copy of a .BLEND document from the past save operation two saves ago; contains the saved version prior to the .BLEND1 backup file, which is the immediate backup version of the BLEND document.", "Windows, Mac, Linux, ", "['Blender']['Blender']['Blender']"], "blend1": ["Blender Document Backup File", "A BLEND1 file is a backup file automatically generated by Blender, a free 3D modeling program.  It stores a copy of the previously saved version of the currently opened .BLEND file and is  used for recovering the previous version of a BLEND file.  BLEND1 files can be renamed with the \".blend\" extension and opened normally.", "Windows, Mac, Linux, ", "['Blender']['Blender']['Blender']"], "blg": ["Windows Binary Performance Log File", "A BLG file is a log file created by Windows performance tracking tools.  It is used to analyze server and computer loads and discover resource bottlenecks.  BLG files contain a history of the computer resource utilization and performance, such as the amount of CPU, memory, and disk resources used by different programs.", "Windows, Windows, Mac, Linux, ", "['Microsoft Performance Monitor', 'Microsoft Windows Administrative Tools']['MiKTeX', 'TeXworks', 'LaTeX Editor']['BibDesk', 'TeXworks']['TeXworks', 'TeX Live']"], "blend": ["Blender 3D Data File", "3D image or animation project created with Blender, an open source 3D modeling program; contains 3D mesh data, lighting information, vertex painting, animation keyframes, NURBS objects, procedural textures, uvmapping layout, and realtime interactivity data; may also store multiple scenes in a single file.", "Windows, Mac, Linux, ", "['Blender']['Blender']['Blender']"], "bld": ["Envisioneer Building Project File", "Project file created by Envisioneer, a Building Information Modeling (BIM) program used by home and professional users to design and remodel buildings; contains 2D and 3D building objects, such as framing, furniture, roofs, rooms, and lighting.", "Windows, Windows, ", "['Cadsoft Envisioneer']['Skyscraper Simulator']"], "blb": ["Interactive Fiction Package Game File", "Game package file used by Interactive Fiction (IF) interpreters such as Zoom or Spatterlight; similar to a .BLORB file; contains the story and other files that enhance gameplay; includes resource files for sound effects, cover art, and music.", "Windows, Mac, Linux, Windows, Mac, Windows, ", "['Windows Frotz']['Zoom', 'Spatterlight']['Zoom'][][]['BLB Extractor']"], "blackhawkstriker2": ["Blackhawk Striker 2 Saved Game", "File created by Blackhawk Striker 2, an arcade helicopter game developed by WildTangent in which the user pilots a 365 Assault Helicopter Co and needs to rapidly fuel it up; contains saved game data which is accessed and used so that the user can continue their flying mission from where they left off without losing any saved progress.", "Windows, ", "['WildTangent Blackhawk Striker 2']"], "blasterball3savedgame": ["BlasterBall 3 Saved Game", "File created by BlasterBall 3, an arcade game that involves using a ball to break through patterns of bricks; contains saved game data that can be loaded by BlasterBall 3, allowing the user to continue gameplay where they left off without losing any progress.", "Windows, ", "['WildTangent BlasterBall 3']"], "bkz": ["FileFort Backup File", "Backup file created by FileFort, a program used for backing up data to discs, external drives, and remote storage locations via FTP or a Google Drive; can be double-clicked to restore the backed up files to their original location.", "Windows, Windows, ", "['NCH FileFort']['BaKoMa TeX']"], "bkup": ["Backup File", "Generic backup file used by various programs and scripts for creating backups; may be a backup of critical data files or of other files such as logs; used for restoring the original files in case an unexpected event occurs.", "Linux, ", "['cPanel']"], "bks": ["NTBackup Settings File", "File used by NTBackup, a Windows program used to create backups; stores a list of backup directories and file names in a plain text format; may specify directory or file inclusions and exclusions; may also specify to backup the system state.", "Windows, Windows, ", "[]['Microsoft Works', 'Microsoft Excel 2016']"], "bkp": ["Backup File", "Backup file that may be created by various programs; often created automatically to provide a backup in case the original file becomes corrupted; the \".bkp\" extension is often appended to the file's original extension and may need to be removed in order for the file to open correctly.", "Windows, Mac, Windows, ", "[][][]"], "bkmk": ["Yummy FTP Bookmark File", "Bookmark file created by Yummy FTP, an FTP client for Mac OS X; saves an FTP Internet location such as a Web server directory for uploading files; used for saving shortcuts that can be accessed through the program interface.", "Mac, ", "['Yummy FTP']"], "bkk": ["BookBuddi eBook File", "Electronic book format that can be read back using Microsoft Text to Speech Agent; may include multiple pages and may contain images as well as text; when text is being read the current section is highlighted and each page is turned automatically.", "Windows, ", "[]"], "bkf": ["Windows Backup Utility File", "Catalog of files backed up using Windows Backup Utility; included with Windows NT and XP Pro (located in Programs → Accessories → System Tools); must be installed from the XP Home installation disc to be used with Windows XP Home Edition.", "Windows, ", "['Microsoft Windows Backup Utility', 'Microsoft Windows NT Backup - Restore Utility']"], "bk2": ["Windows Indexing Service Data File", "System file used by Microsoft Windows' Indexing Service component, which indexes file system information for searching; often created in the C:\\System Volume Information\\catalog.wci\\ directory and stores data used for performing file system searches.", "Windows, ", "['Microsoft Windows']"], "bk1": ["Autodesk Backup File", "Backup file created by Autodesk products, including AutoCAD Mechanical, Mechanical Desktop, and AutoCAD Map; stores a .BAK file that has been renamed with the \".bk1\" extension; renamed when the Autodesk program terminates unexpectedly.", "Windows, Windows, Windows, ", "['Autodesk AutoCAD 2017', 'Autodesk AutoCAD Mechanical 2017']['Microsoft Windows'][]"], "bk": ["FrameMaker Book File", "Book created with Adobe FrameMaker publishing software; contains pages that are formatted for print; may include text as well as raster and bitmap images.", "Windows, Linux, ", "['Adobe FrameMaker']['Adobe FrameMaker']"], "biz": ["Broderbund Business Card File", "Business card project created with one of Borderbund's card creation programs; may include text and images; often built from a template through can also be created from a custom design.", "Windows, Mac, ", "['Broderbund The Print Shop', 'Broderbund PrintMaster v7 Platinum']['Broderbund The Print Shop for Mac']"], "bkc": ["Backup4all Backup Catalog", "Backup catalog file created by Backup4all; contains a list of files and folders backed up using the Backup4all backup utility; BKC files can be restored to the original location or another hard drive using the Restore Wizard.", "Windows, ", "[]"], "bjo": ["TabRite Tablature File", "File used by TablRite, a program used to create stringed instrument tablatures; contains music notes, rhythm, time signature, and other musical notations; used for creating, playing, and sharing music; commonly used for banjo or guitar tablatures.", "Windows, Mac, Linux, iOS, ", "['TabRite', 'TablEdit', 'TEFview']['TablEdit', 'TEFview']['TablEdit']['TEFview']"], "bix": ["Civilization 3 Scenario File", "Game file created by \"Sid Meier's Civilization III\" (Civ3), an empire-building strategy game; may be a saved game or a scenario that describes the world conditions under which the player plays against other empires.", "Windows, Mac, Windows, ", "[]['Take-Two Interactive Civilization 3'][]"], "bitpim": ["BitPim Configuration File", "File used by BitPim, a program used for viewing and changing data on Samsung, Sanyo, and other cell phones; saved in a plain text format and contains information about the phone and the data on the phone.", "Windows, Mac, Linux, ", "['BitPim']['BitPim']['BitPim']"], "bit": ["Xilinx Bitstream File", "File generated by BitGen, a program used for generating bitstreams required by Xilinx FPGAs (field-programmable gate arrays); saved in a binary format and contains the configuration information for the circuit; used for uploading the configuration data to the FPGA device, which can be completed using the iMPACT GUI provided with the Xilinx software.", "Windows, ", "['Xilinx ISE Design Suite']"], "bionix": ["BioniX Wallpaper Playlist File", "Playlist file created by BioniX Wallpaper, a program used for changing desktop backgrounds; contains a list of desktop background images that can be rotated through at periodic intervals, based on the program settings.", "Windows, ", "['BioniX Wallpaper']"], "bio": ["BIOS File", "BIOS file used by various PC computers; contains settings and instructions to load computer hardware; used to recognize and prime computer hardware during the booting process; stored in the computer's ROM.", "Windows, Windows, Windows, Mac, Linux, ", "[]['Bethesda Softworks Fallout 2']['Autodesk Mudbox 2017']['Autodesk Mudbox 2017']['Autodesk Mudbox 2017']"], "biq": ["Civilization 3 Scenario File", "Game file used by \"Sid Meier's Civilization III\" (Civ3), an empire-building strategy game; can contain data for a scenario or a saved game; used by Civilization III: Complete version 12.06 and later.", "Windows, Mac, ", "[]['Take-Two Interactive Civilization 3']"], "bip": ["Character Studio Biped File", "Motion capture file created with Character Studio; records the motion of a biped (typically a human) and saves individual frames to a file; allows human motion to be accurately reproduced in video games, movies, and other media where special effects are used.", "Windows, ", "['Autodesk 3ds Max 2017']"], "binarycookies": ["Safari Cookies File", "A BINARYCOOKIES file is a cookies file used by the desktop and mobile versions of the Safari web browser.  It contains persistent cookies, also known as persistent or stored cookies, that allow the Safari browser to remember your information and settings when you visit websites to decrease loading times.", "Mac, iOS, ", "['Apple Safari']['Apple Safari']"], "bin": ["Generic Binary File", "A BIN file is a file that stores data in a binary format.  It is different than a text-based file, which can be edited in a text editor.  BIN files may be created by a variety of different programs but typically cannot be manually edited.", "Windows, Mac, Windows, Mac, Linux, Windows, Mac, Linux, Linux, Windows, Mac, Windows, Mac, Windows, Mac, Windows, Mac, Linux, Windows, Mac, Linux, Windows, Mac, Linux, Windows, Mac, Linux, Windows, ", "[][]['Microsoft Windows', 'Apache OpenOffice']['Apple OS X', 'Apache OpenOffice']['Linux', 'Apache OpenOffice']['Kega Fusion', 'DGen', 'Gens+', 'HazeMD', 'Ages']['Genesis Plus', 'Kega Fusion']['Kega Fusion'][]['Smith Micro StuffIt Deluxe for Windows']['Apple Archive Utility', 'Smith Micro StuffIt Deluxe 16', 'The Unarchiver']['Roxio Creator NXT Pro 5', 'DT Soft DAEMON Tools', 'Smart Projects IsoBuster', 'PowerISO', 'Lightning UK! ImgBurn', 'EZB Systems UltraISO']['Roxio Toast 15', 'NTI Dragon Burn 4']['Research In Motion BlackBerry Desktop Manager']['Research In Motion BlackBerry Desktop Manager']['VideoLAN VLC media player', 'Lightning UK! ImgBurn']['VideoLAN VLC media player', 'MPlayer']['VideoLAN VLC media player']['PCSX', 'ePSXe', 'PCSX-Reloaded']['PCSX-Reloaded']['ePSXe', 'PCSX-Reloaded']['NO$GBA', 'DeSmuME', 'DSOrganize']['DeSmuME']['DeSmuME']['Stella', 'z26']['Stella']['Stella', 'z26'][]"], "bimx": ["BIM Explorer File", "A BIMX file is a BIMx file created by GRAPHISOFT ArchiCAD, an architectural CAD program.  It contains a virtual architectural project that includes 3D models and 2D drawing sheets.  BIMX files are created in ArchiCAD when a user exports the project to the BIMx format.", "Windows, Mac, iOS, Android, ", "['GRAPHISOFT BIMx Desktop Viewer']['GRAPHISOFT BIMx Desktop Viewer']['GRAPHISOFT BIMx', 'GRAPHISOFT BIMx PRO']['GRAPHISOFT BIMx', 'GRAPHISOFT BIMx PRO']"], "bil": ["ESRI BIL File", "GIS file created in ESRI's BIL (binary interleaved) format, a raster image format used for representing surfaces and terrain elevations; can be georeferenced by another file to map the image data to the real world location.", "Windows, ", "['ESRI ArcGIS for Desktop', 'Blue Marble Geographics Global Mapper', 'GDAL']"], "bim": ["Bytessence InstallMaker Document", "Installation project file created by Bytessence InstallMaker, a program used to create Windows installers; stores product information, installation requirements, uninstaller information, installer file compression options, and the look and feel of the installer user interface; also stores references to the files that will be built into the final installer file.", "Windows, ", "['Bytessence InstallMaker']"], "big": ["Electronic Arts Game Data File", "Game data format used by Electronic Arts (EA) video games; contains individual assets used by the game and zipped to save space; similar to a .ELF file, but modified and saved in a proprietary EA format; can be imported as a MOD file into certain games to alter the gameplay.", "Windows, ", "[]"], "bifx": ["Get Backup Project", "Project file created by Get Backup, a Mac OS X backup application; saves a project backup for the Mac user's iPhoto library, Apple Mail email, iTunes library, Documents folder, or Address Book; enables backup options to be saved.", "Mac, ", "['BeLight Get Backup']"], "bif": ["Get Backup Project File", "Backup project file created by Get Backup, a backup and restore application for Mac OS X; stores settings for a backup that may be for the user's iPhoto library, Apple Mail email, iTunes library, Documents folder, or Address Book; allows the original files to be restored.", "Mac, Windows, Windows, ", "['BeLight Get Backup']['MagicISO', 'EZB Systems UltraISO', 'Acronis Disk Director 12', 'Acronis True Image 2017']['CD Projekt The Witcher', 'WinBiff', 'BIFRip', 'UnBIF']"], "bidule": ["Bidule Layout File", "Sound layout file created by Bidule, a modular music generation program; stores the visual layout of sound components and their connections; may include digital MIDI devices, mixers, filters, effects, and other sound components.", "Windows, Mac, ", "['Plogue Bidule']['Plogue Bidule']"], "bik": ["Bink Video File", "Proprietary video format developed by RAD Game Tools; used for playing movie clips in video games on both PCs and console systems; allows standard video to be highly compressed while optimizing video quality for the target platform.", "Windows, Mac, Linux, Windows, Mac, ", "['File Viewer Plus', 'The RAD Video Tools', 'Microsoft Windows Media Player with Windows 7 Codec Pack', 'SPlayer', 'Rebellion Aliens vs. Predator', 'VideoLAN VLC media player']['The Bink Video Player for MacOS X', 'VideoLAN VLC media player']['The Bink Video Player for GNU/Linux', 'VideoLAN VLC media player']['Take-Two Interactive Civilization 4']['Take-Two Interactive Civilization 4']"], "bic": ["Neverwinter Nights Character File", "Game file created by Neverwinter Nights, a third person role-playing game; saves character information including gender, race, class, abilities, namde, and inventory items; can store single player characters or characters on multiplayer realms.", "Windows, Windows, Mac, ", "['BioWare Neverwinter Nights'][]['Take-Two Interactive Civilization 3']"], "bh": ["BlakHole Archive", "File or group of files compressed with BlakHole compression, a ZipTV algorithm; uses proprietary compression, but is supported by a number of Windows file decompression programs.", "Windows, ", "['ESTsoft ALZip', 'ConeXware PowerArchiver', 'Linos LS Archiver', 'Spadix ClikView', 'Acubix PicoZip', 'IZArc']"], "bibtex": ["BibTeX Bibliography Database", "Document containing information in the BibTeX format; contains one or more references and enables bibliographies to be searched and published using standard commands.", "Windows, Mac, Linux, ", "['MiKTeX', 'JabRef', 'TeXnicCenter', 'Bib2x']['BibDesk', 'JabRef', 'MacroMates TextMate']['Bib2x', 'Pybliographer', 'JabRef', 'RefTeX']"], "bgz": ["Blood Frontier Map File", "Game map file used by Blood Frontier, a first-person shooter (FPS) game previously developed as Red Eclipse; contains data for a game level, such as terrain definitions, waypoints, weapons, and other map settings; can be used for storing single and multiplayer maps.", "Windows, Mac, Linux, ", "['Blood Frontier']['Blood Frontier']['Blood Frontier']"], "bgt": ["Graphics Accounts Data File", "Contains budget information used by Graphic Accounts, a personal financial budgeting program; may be visualized with graphs, tables, and charts; used for personal finance management and financial planning.", "Windows, ", "[]"], "bib": ["Bibliography Document", "Bibliography saved in ASCII text format; contains a list of references cited within an article, book, or other publication.", "Windows, Mac, Windows, Mac, Linux, ", "['text editor']['text editor']['MiKTeX', 'JabRef', 'TeXnicCenter', 'Bib2x', 'TeXworks']['BibDesk', 'JabRef', 'MacroMates TextMate', 'TeXworks']['Bib2x', 'Pybliographer', 'JabRef', 'RefTeX']"], "bhx": ["BinHex Encoded File", "Compressed file encoded using BinHex (binary-to-hexadecimal) encoding; often used for compressing and converting Macintosh files from binary to a text format; same as the more commonly used .HQX extension.", "Windows, Mac, ", "['Smith Micro StuffIt Deluxe for Windows', 'Corel WinZip 21', 'ESTsoft ALZip']['Smith Micro StuffIt Deluxe 16']"], "bho": ["Behold Organize File", "File created by Behold, a program used for viewing genealogy data; references GEDCOM (.GED) files and specifies family and genealogy display formatting information; used for presenting family trees and other genealogies in different ways.", "Windows, ", "['Behold']"], "bgl": ["Babylon Glossary File", "Glossary file used by Babylon, a program that supports online translation in many different languages; contains terms and definitions that can be loaded into Babylon; can be translated on-the-fly into different languages by the Babylon application.", "Windows, Mac, Windows, ", "['Babylon', 'Babylon Glossary Builder']['Babylon Mac']['Microsoft Flight Simulator X Gold Edition']"], "bgi": ["BgInfo Configuration File", "Preference file for BgInfo, a utility that keeps track of computer configuration information; stores custom settings chosen by the user within BgInfo.", "Windows, ", "[]"], "bfs": ["FlatOut Game Data File", "A BFS file is a data file used by FlatOut stunt racing video games.  It contains various types of game data, such as car models and racing tracks.  BFS files are often used for altering, or \"modding,\" game content.", "Windows, ", "['Bugbear Entertainment FlatOut']"], "bfm": ["Terminal Reality Model File", "Game 3D model file used by games created by Terminal Reality, the makers of titles such as Bloodrayne and The Walking Dead: Survival Instinct; saves model information for 3D objects in the game; can be extracted from a .POD file, which is the game data container format for Terminal Reality games.", "Windows, ", "['BR2PodTools']"], "bfa": ["Blowfish Encrypted File", "Secure file encrypted using the Blowfish encryption method; uses a symmetric block cipher and a variable-length key, from 32 bits to 448 bits, to encrypt the file.", "Windows, Mac, Linux, ", "[][][]"], "bfg": ["Big Fish Games Application File", "Application configuration file used by the Big Fish Games (BFG) Game Manager, a program that runs games downloaded from the Big Fish Games online service; saved using XML formatting and contains configuration information used for launching the game.", "Windows, ", "['Big Fish Games Game Manager']"], "bff": ["Backup File Format", "Backup file created by AIX \"backup,\" a tool used for creating backups on IBM AIX computers; contains an archive of files which can be restored using the AIX \"restore\" utility; stored in a format similar to .TAR archives.", "Linux, ", "[]"], "bfc": ["Windows Briefcase File", "Folder containing files that can be synchronized between multiple computers (often a desktop and a laptop) using MS Briefcase.", "Windows, ", "['Microsoft Windows Briefcase']"], "bfx": ["Bitware Fax Document", "Fax created by Bitware, a once-popular digital fax program sold by Cheyenne; contains a digital fax that can be sent via a modem; can be converted into .PDF or .JPEG files using various programs. ", "Windows, ", "[]"], "bet": ["BETA Source File", "Program file containing source code written in BETA, a modern object-oriented programming language; based off of Simula and developed within the Scandinavian School of object-orientation.", "Windows, Mac, Linux, ", "['text editor']['text editor']['text editor']"], "bf": ["CryoBF Game Data File", "Game data archive format used by games developed by Cryo Interactive Entertainment; contains game data, such as objects, maps, sounds, and music in a single archive.", "Windows, ", "[\"XpoZed's Unpakke\"]"], "bejeweled2deluxesavedgame": ["Bejeweled 2 Deluxe Saved Game", "File created by Bejeweled 2, a puzzle matching arcade game; contains saved game data such as level and point progress; accessed by the program so that the user can resume playing where they left off.", "Windows, Mac, ", "['Big Fish Games Bejeweled 2 Deluxe ']['Big Fish Games Bejeweled 2 Deluxe ']"], "bed": ["UCSC BED Annotation Track File", "Tab-delimited text file that stores genome annotation track data in the UCSC (University of California, Santa Cruz) BED format; used in human and animal bioinformatics research; can be uploaded and processed on the UCSC Genome Browser webpage.", "Windows, Mac, Linux, Web, ", "['Integrated Genome Browser', 'text editor']['Integrated Genome Browser']['Integrated Genome Browser']['UCSC Genome Browser']"], "bean": ["Bean Rich Text Document", "Word processing document created with Bean, a free word processor for Mac OS X powered by the same engine as Apple Text Edit; supports live word count, text styles, graphics, and custom printed margin settings.", "Mac, ", "['Bean']"], "beam": ["Compiled Erlang File", "Executable file generated by the Erlang compiler, a program used for building BEAM files from .ERL source code files; saved in a binary format, called bytecode, and can be run with the Erlang virtual machine (VM).", "Windows, Mac, Linux, ", "['Erlang', 'Erjang']['Erjang']['Erjang']"], "bdt3": ["BEEDOCS Timeline 3D 3 Document", "Document created by BEEDOCS Timeline 3D version 3, an application used for creating interactive 3D historical timelines; stores historical events, each of which is mapped on the timeline; can include pictures, dates, sounds, video, notes, and other event information; can be shared on the Web, through iTunes or YouTube video, or as an insert in an Apple Keynote presentation.", "Mac, ", "['BEEDOCS Timeline 3D']"], "bdt2": ["BEEDOCS Timeline 3D 2 Document", "Document created by BEEDOCS Timeline 3D 2, a program used for capturing timelines and historical events; may include pictures, dates, sounds, video, notes, and other event information; used for sharing timelines through videos or interactive presentations.", "Mac, ", "['BEEDOCS Timeline 3D']"], "bdr": ["Exchange Non-Delivery Report Body File", "Body of an e-mail non-delivery report (NDR); contains information about why an e-mail message was not delivered; includes the error code, message sender, and message recipients.", "Windows, Windows, ", "['Microsoft Exchange Server']['Microsoft Publisher 2016']"], "bdsproj": ["Borland Developer Studio Project", "Project file used by Borland Developer Studio, a software development application that was the predecessor to Delphi; used for saving and loading the project and contains compiler settings, references to project source code files, and other project settings.", "Windows, ", "['Embarcadero Delphi']"], "bdp": ["Exchange Diagnostic Message", "Diagnostic file generated by Microsoft Exchange when an e-mail message cannot be delivered; points to a local .EML file that typically contains a non-delivery report (NDR).", "Windows, ", "['Microsoft Exchange Server']"], "bdoc": ["Binary DigiDoc Signature File", "A BDOC file is a binary digital document (DigiDoc) created with qDigiDoc, an open source software used to authenticate Estonian and Finnish government issued ID cards and signed documents.  It is a .ZIP compressed container that stores the files that have been signed by a government employee, the signatures related to each file, and the protocol control information.", "Windows, Mac, Linux, ", "['qDigiDoc']['qDigiDoc']['qDigiDoc']"], "bdmv": ["Blu-ray Disc Movie Information File", "File used by Blu-ray discs to describe the contents of a Blu-ray disc directory; uses a well-defined filename and directory location and is seen with one of the following file names on a Blu-ray disc:\r\n\r\nindex.bdmv: describes the file contents in the BDMV directory; found in the BDMV and BDMV/BACKUP directories.\r\nMovieObject.bdmv: describes one or more movie objects; located in the BDMV and BDMV/BACKUP directories.\r\nsound.bdmv: optional file that relates one or more sounds associated with HDMV Interactive Graphic streams applications; located in the BDMV/AUXDATA directory.\r\n", "Windows, Mac, Linux, ", "['Roxio Creator NXT Pro 5', 'CyberLink PowerDVD 16', 'VideoLAN VLC media player', 'JRiver Media Center', 'Nero 2017']['VideoLAN VLC media player', 'JRiver Media Center', 'Macgo Mac Blu-ray Player']['VideoLAN VLC media player']"], "bdm": ["AVHCD Information File", "Disc information file created by AVHCD video recordings; contains information about the file contents in a specific directory; commonly seen as index.bdm and movieobj.bdm; located in the AVCHD/BDMV directory of a media storage device.", "Windows, Mac, ", "['Roxio Creator NXT Pro 5', 'CyberLink PowerDVD 16', 'Nero Video 2017']['Roxio Toast 15']"], "bdl": ["CoCreate Bundle File", "File created by CoCreate CAD software programs such as CoCreate Modeling, SolidDesigner, and OneSpace Designer; stores a bundle of all data for a 2D or 3D design; used to save and load model data.", "Windows, Mac, ", "['Adobe Acrobat DC']['Adobe Acrobat DC']"], "bdic": ["Chrome Dictionary File", "Dictionary file used by Google Chrome, a Web browser developed by Google; contains a dictionary of words that are used by Chrome's spell-checker for identifying misspelled words; can be used for spell-ckecking different languages.", "Windows, ", "['Google Chrome']"], "bdf": ["Binary Data File", "Binary data format readable by forensic data analysis programs; used for identifying raw data recovered from blocks of unallocated space on a hard drive.", "Windows, Windows, Mac, Linux, Windows, Linux, Windows, Mac, Linux, Linux, ", "['Hot Pepper Technology E-mail Detective']['FontForge', 'Fontlab FONmaker']['FontForge']['FontForge']['MSC Nastran', 'pynastran']['MSC Nastran']['bsdiff/bspatch']['MultiPatch', 'bsdiff/bspatch']['bsdiff/bspatch']['ESO-MIDAS']"], "bdd": ["CARA Sound Radiation Data File", "Contains sound radiation information required for creating room acoustic calculations; used by CARA (Computer Aided Room Acoustics) software to simulate the auditory characteristics of a room or other type of space; saved along with the .BOX file when creating a customized CARA loudspeaker model.", "Windows, ", "[]"], "bdc": ["Babylon Dictionary File", "Dictionary file used by Babylon, an online translation tool; contains terms and definitions for a specific language, such as the Oxford English dictionary; used to lookup and search for the definitions of words within Babylon.", "Windows, Mac, Windows, Mac, ", "['Babylon']['Babylon Mac']['West Point Bridge Designer']['West Point Bridge Designer']"], "bdb": ["Microsoft Works Database Backup File", "Backup of a database (.WDB file) created with MS Works; generated automatically by Microsoft Works as a backup in case the original database file becomes corrupted.", "Windows, ", "['Microsoft Works', 'Microsoft Access 2016']"], "bdae": ["Gameloft Game Data File", "Data file used by Gameloft mobile games such as Modern Combat 2: Black Pegasus and Gangstar: West Coast Hustle; contains game data such as weapon and visual effects information.", "iOS, Android, ", "['Gameloft Modern Combat 2: Black Pegasus', 'Gameloft Gangstar: West Coast Hustle']['Gameloft Modern Combat 2: Black Pegasus', 'Gameloft Gangstar: West Coast Hustle']"], "bct": ["Adobe Bridge Thumbnail Cache File", "Cache file generated by Adobe Bridge, an Adobe Creative Suite (CS) file management application; contains thumbnails created automatically by the application when browsing images; used for providing quick access to image summary information.", "Windows, Mac, ", "['Adobe Bridge CC']['Adobe Bridge CC']"], "bcstm": ["BCSTM Audio Stream File", "A BCSTM file is an audio file used by various Nintendo 3DS games.  It contains audio such as a sound effect or background music that is looped during gameplay.  ", "Windows, ", "['BrawlBox', 'Foobar2000']"], "bcs": ["Batch Compiler Specification File", "Configuration file used by Batch Compiler, a program used for compiling custom maps for games such as Half-Life and Quake; saves parameters that fill the Batch Compiler interface with the fields and parameters that can be specified for building a map.", "Windows, Windows, Windows, ", "[\"Nem's Tools Batch Compiler\"]['MAGIX Sound Forge Pro 11']['Microsoft Notepad', 'text editor']"], "bcp": ["BlackMagic Custom Palette", "Palette of custom colors used by BlackMagic, a Photoshop plug-in for colorizing black-and-white, sepia, and IR photos; stored by default in the palettes folder within the BlackMagic directory; can be loaded and saved using the Load and Record buttons in the BlackMagic Image window.", "Windows, Mac, Windows, Windows, Windows, ", "['Adobe Photoshop with the BlackMagic plugin']['Adobe Photoshop with the BlackMagic plugin'][]['Borland C++ Compiler'][\"Nem's Tools Batch Compiler\"]"], "bcmx": ["Business Contact Manager Customization", "Stores custom data from user-defined fields in an Outlook Business Contact Manager (.BCM) file; can only be imported by the database owner or an administrator of the computer where the database is stored.", "Windows, ", "['Microsoft Outlook 2016']"], "bcm": ["Business Contact Manager File", "Stores data from Business Contact Manager for Outlook; includes accounts, business contacts, projects, and business opportunities; also stores the communication history from previous versions of Business Contact Manager for Outlook.", "Windows, Windows, Windows, Mac, ", "['Microsoft Outlook 2016']['Microsoft Works']['Adobe Bridge CC']['Adobe Bridge CC']"], "bcl": ["Illumina Base Call File", "File generated by Illumina DNA sequencing instruments, including HiSeq and MiSeq; saves base call and quality score information for each cycle that was processed; can be analyzed using CASAVA and converted to the QSEC format with Illumina BCL Converter.", "Windows, ", "['Illumina CASAVA', 'Illumina BCL2FASTQ Conversion Software']"], "bckp": ["Ad-Aware Quarantined File", "Archive of unsafe or questionable files detected by Ad-Aware, a malware protection program for PCs and networks; collects possible malicious files and quarantines them to a safe location; created during the auto-quarantine process.", "Windows, ", "['Lavasoft Ad-Aware']"], "bck": ["VMX Backup File", "A BCK file is a VMS/VAX BaCKup file created on a VMS VAX or VMS Alpha system.  It contains a saveset of a file or volume of files on a VMS VAX or VMS Alpha system.  BCK files are created to protect against the loss or corruption of data.", "Windows, ", "['HP OpenVMS']"], "bci": ["Belarc Advisor Report File", "Report generated by Belarc Advisor, a PC auditing program; includes a detailed profile of system hardware, installed software, anti-virus information, missing Microsoft hotfixes, and CIS (Center for Internet Security) benchmarks.", "Windows, ", "['Web browser']"], "bcf": ["Business Card Designer Pro File", "Business card design created with Business Card Designer Pro, a program for creating custom business cards; may be built from a template or created from scratch; can include raster images, shapes, and text.", "Windows, ", "[]"], "bcd": ["Windows Boot Configuration Data File", "Windows boot configuration format introduced with Windows Vista; replaces the older boot.ini format used by the NTLDR program; supports underlying firmware abstraction so that multiple systems can be supported.", "Windows, Windows, ", "['Microsoft Registry Editor', 'NeoSmart Technologies EasyBCD']['ARM Development Studio']"], "bcc": ["Calendar Creator File", "File saved by Calendar Creator, a program used to create personalized calendars; contains a calendar template that can be displayed in a daily, weekly, monthly or yearly format; also includes graphics and stores important dates, such as holidays and other personal events.", "Windows, ", "['Broderbund Calendar Creator']"], "bc5b": ["Ransomware Encrypted File", "A BC5B file is a file encrypted by ransomware, a virus utilized by cybercriminals.  It contains a user's file, such as a .JPG, .WMV, or .DOCX file, which is encrypted by the malware.", "Windows, ", "[]"], "bc!": ["BitComet Incomplete File", "Unfinished download started with BitComet, a BitTorrent program; created when the download begins and changes to the correct file type when the download is completed.", "Windows, ", "['BitComet']"], "bc": ["BitComet Partially Downloaded File", "Incomplete file downloaded by BitComet, a BitTorrent P2P file sharing program; may be a download in progress or a download that has been stopped by the user.", "Windows, Windows, Mac, ", "['BitComet']['Adobe Bridge CC']['Adobe Bridge CC']"], "bbz": ["BerryBuzz Backup File", "Backup file created by BerryBuzz, a program used for assigning LED colors for handheld BlackBerry devices; saves a backup of the LED configuration data and is stored on the BlackBerry's media card; can be transferred to the PC and viewed with a text editor.", "Windows, ", "['Microsoft Notepad', 'text editor']"], "bbs": ["Bulletin Board System Text", "Text stored and displayed by an online bulletin board system (BBS); typically a standard text file that can be accessed by users who connect to the bulletin board using BBS software.", "Windows, Mac, Linux, ", "['text editor']['text editor']['text editor']"], "bbprojectd": ["BBEdit Project Document", "Project document created by BBEdit, a source code text editor and development tool for Mac; includes references to project source code and resource files; enables programmers to organize development project files during software development.", "Mac, ", "['Bare Bones BBEdit']"], "bblm": ["BBEdit Language Module", "Plug-in file used by BBEdit, a source code development tool for Mac OS X; contains a language module, which provides syntax highlighting for a particular programming language; may be a third-party module or a module included with the software.", "Mac, ", "['Bare Bones BBEdit', 'Bare Bones TextWrangler']"], "bbl": ["BibTeX Generated Bibliography File", "Plain text file used by BibTeX, a program used to generate bibliographies; contains references defined in the LaTeX typesetting language; may be created manually or generated by BibTeX from a corresponding .BIB file.", "Windows, Mac, Linux, ", "['MiKTeX', 'TeXworks', 'proTeXt', 'Bib2x']['TeXworks', 'BibDesk']['TeXworks', 'TeX Live']"], "bbcd": ["BobCAD-CAM Document", "CAD document created by BobCAD-CAM, a CAD design application for Windows; saves a manufacturing part design and may include various geometry and dimensioning data; may also include instructions for milling the part.", "Windows, ", "['BobCAD-CAM']"], "bbc": ["BBC BASIC Data File", "BASIC program created with BBC BASIC, a development program based on the BASIC programming language; can be used to create standalone executable (.EXE) files.", "Windows, ", "['BBC BASIC for Windows']"], "bbb": ["BlackBerry Mobile Phone Backup File", "Backup file created by the Mac version of BlackBerry Desktop Manager, a program used for syncing, backing up, and restoring data with BlackBerry mobile devices; stores contacts, the calendar, applications, and other data from the device.", "Windows, Mac, ", "['Reincubate BlackBerry Backup Extractor', 'BlackBerry Desktop Software']['Research In Motion BlackBerry Desktop Manager', 'BlackBerry Desktop Software']"], "bb3": ["BlasterBall 3 Level File Support", "File created by BlasterBall 3, an arcade game in which the user plays by breaking through patterns of bricks; contains level file support data; used for allowing the game to quickly load player progress as well as custom levels created by the user in the Level Editor feature of BlasterBall 3.", "Windows, ", "['WildTangent BlasterBall 3']"], "bbproject": ["BBEdit Project File", "Project file created by BBEdit, a source code text editor for Mac; saved in an XML format and contains references to files included in the project; allows developers to group and organize source code for software projects.", "Mac, ", "['Bare Bones BBEdit']"], "bb": ["Blitz Source Code File", "Source file written in Blitz, a game-programming language; compiled using a Blitz compiler included with BlitzMax, Blitz3D, or BlitzPlus development software.", "Windows, Mac, Linux, ", "[]['Blitz Research BlitzMax']['Blitz Research BlitzMax']"], "bay": ["Casio RAW Image", "A BAY file is a digital photograph captured by a Casio digital camera.  It contains raw image data from the camera in a proprietary format that is unprocessed and uncompressed.", "Windows, ", "['File Viewer Plus', 'Microsoft Windows Photos', 'Corel PaintShop Pro X9', 'ACD Systems ACDSee 20']"], "bav": ["AVG AntiVirus The Bat! Plugin File", "Plugin for AVG AntiVirus developed by RITLABS; provides e-mail spam filtering and other additional e-mail features; similar to the standalone program \"The Bat,\" but works within the AVG AntiVirus interface.", "Windows, ", "['AVG AntiVirus FREE']"], "bau": ["Apache OpenOffice AutoText File", "File used by Apache OpenOffice, a program suite used for word processing and creating presentations, spreadsheets, and databases; contains a collection of text key phrases and their replacement strings; used to automatically recognize and replace phrases while typing", "Windows, Linux, ", "['Apache OpenOffice']['Apache OpenOffice']"], "bat": ["DOS Batch File", "A BAT file is a DOS batch file used to execute commands with the Windows Command Prompt (cmd.exe).  It contains a series of line commands that typically might be entered at the DOS command prompt.  BAT files are most commonly used to start programs and run maintenance utilities within Windows.", "Windows, Mac, ", "['File Viewer Plus', 'Microsoft Windows Command Prompt', 'Microsoft Windows', 'text editor']['Parallels Desktop for Mac with Windows installed', 'text editor']"], "bashrc": ["Bash Non-Interactive Login Shell File", "Shell file used by Linux and Mac OS X terminal applications; contains setup instructions for the shell, such as declarations for environment variables and default scripts to run; often used for setting user command prompt preferences as well as paths for common directories and program executables.", "Mac, Linux, ", "['Apple Terminal', 'MacroMates TextMate', 'GNU Bash']['GNU Bash']"], "bash_profile": ["Bash Interactive Login Shell File", "Shell file used by Mac OS X and Linux terminal programs; stores setup instructions for the shell environment, such as environment variables and default scripts to execute; commonly used for setting user command prompt preferences as well as file system paths for directories and program binaries.", "Mac, Linux, ", "['Apple Terminal', 'MacroMates TextMate', 'GNU Bash']['GNU Bash']"], "bash_history": ["Bash History File", "File created by Bash, a Unix-based shell program commonly used on Mac OS X and Linux operating systems; stores a history of user commands entered at the command prompt; used for viewing old commands that have been executed.", "Mac, Linux, ", "['Apple Terminal', 'GNU Bash']['GNU Bash']"], "basex": ["BaseX Data File", "File used by BaseX, an XML database engine used for storing and managing structured XML data; may be used for the main database table file (tbl.basex) or as a file extension for a BaseX configuration file.", "Windows, Mac, Linux, ", "['BaseX']['BaseX']['BaseX']"], "baserproj": ["DNA Baser Project File", "File created by DNA Baser, a program used for assembling, aligning, and analyzing DNA sequences; saves the result of a sequencing job and includes multiple sequences and their assemblies; allows the job results to be revisited.", "Windows, ", "['Heracle BioSoft DNA Baser']"], "bas": ["BASIC Source Code File", "Program source code written in the BASIC programming language; BASIC stands for \"Beginner's All-purpose Symbolic Instruction Code,\" and is available in several different versions that have modified since the language's inception in the 1960s.", "Windows, Mac, Linux, ", "['File Viewer Plus', 'Microsoft Visual Studio 2017', 'FreeBASIC', 'PureBasic', 'SoftMaker Office', 'BBC BASIC for Windows', 'Blitz Research BlitzMax', 'PowerBASIC', 'True BASIC']['Blitz Research BlitzMax']['Blitz Research BlitzMax']"], "bar": ["Age of Empires 3 Data File", "Data file used by Age of Empires III, a strategy game where players control units and build empires; may include game data, such as textures, music, fonts, text, and other game settings; serves as a file container that holds game data.", "Windows, Windows, Windows, Mac, Linux, ", "['Microsoft Age of Empires 3', 'Dragon UnPACKer']['Microsoft Age of Mythology', 'Dragon UnPACKer', 'AOM Edit']['Qualcomm Brew MP SDK']['Qualcomm Brew MP SDK']['Qualcomm Brew MP SDK']"], "ba": ["Scifer External Header Archive", "Data archive that contains compressed binary data; references header information stored in a separate .XML file; created with Scifer, a data archiving program that uses a Universal Common Logic (UCL) compression algorithm.", "Windows, ", "[]"], "b6t": ["BlindWrite 6 Track Information File", "Information file created by BlindWrite 6, a game software backup program; contains track information for a disc image generated by BlindWrite.", "Windows, ", "['VSO Software BlindWrite']"], "b6i": ["BlindWrite 6 Disc Image", "Disc image created with BlindWrite, a disc authoring program designed for backing up computer game discs; contains an exact copy of the data from the original disc and can be used to burn a copy to another disc.", "Windows, ", "['VSO Software BlindWrite']"], "b64": ["Base64 MIME-Encoded File", "Binary file encoded using base64 encoding; often used to convert text data into base64 data; enables more reliable transmission of e-mail attachments and other information; similar to a .MIME attachment.", "Windows, Mac, ", "['Smith Micro StuffIt Deluxe for Windows', 'Corel WinZip 21', 'ESTsoft ALZip', 'Ghisler Total Commander']['Smith Micro StuffIt Deluxe 16']"], "b5t": ["BlindWrite 5 Disc Track Information File", "Contains descriptor information for a disk created by BlindWrite; typically saved with a corresponding .B5I file; relatively small compared to the .B5I file.", "Windows, ", "['VSO Software BlindWrite', 'Smart Projects IsoBuster', 'EZB Systems UltraISO']"], "b5i": ["BlindWrite 5 Disk Image", "Disc image file originally created by BlindWrite but now supported by other disc imaging applications; often contains data copied from an audio or data CD; can be burned back to a disc or mounted with disc mounting software.", "Windows, ", "['VSO Software BlindWrite', 'H+H Software Virtual CD', 'Smart Projects IsoBuster', 'EZB Systems UltraISO']"], "b4s": ["Winamp Playlist File", "Music playlist file used by older versions of the Winamp media player; saved in an XML format and stores a list of multimedia files and associated metadata; used for saving song lists and favorite mixes.", "Windows, Mac, Linux, ", "['Nullsoft Winamp', 'VideoLAN VLC media player']['VideoLAN VLC media player', 'Macgo Mac Media Player']['VideoLAN VLC media player']"], "b3d": ["Blitz3D Entity Model File", "3D model, or \"entity,\" file used by Blitz3D, an application and simple programming language used to created 3D games; stores model information in \"chunks;\" may contain textures, brushes, vertices, triangles, meshes, bones, or animation data.", "Windows, Mac, Linux, ", "['Blitz Research Blitz3D', 'Ultimate Unwrap 3D', 'Irrlicht']['Irrlicht']['Irrlicht']"], "b2a": ["Btoa Encoded File", "ASCII text file that has been created from a binary file using the btoa (Binary to ASCII) algorithm; used for sending binary files over protocols that only support text-based data transfers.", "Windows, Mac, Linux, ", "['Smith Micro StuffIt Deluxe for Windows']['Smith Micro StuffIt Deluxe 16'][]"], "b1": ["B1 Compressed Archive", "Compressed archive created by B1 Free Archiver, a free file compression utility; based off of the .LZMA format and uses an openly published format; can be opened with B1 Free Archiver to extract the original set of files.", "Windows, Mac, Linux, Android, ", "['B1 Free Archiver']['B1 Free Archiver']['B1 Free Archiver']['B1 Free Archiver']"]}