{"c": ["C/C++ Source Code File", "A C file is a source code file for a C or C++ program.  It may include an entire program's source code, or may be one of many source files referenced within a programming project.  C files can be edited using a basic text editor, but will not show syntax highlighting like most software development programs do.", "Windows, Mac, Linux, Windows, ", "['File Viewer Plus', 'Microsoft Visual Studio 2017', 'Eclipse CDT', 'Code::Blocks', 'Embarcadero C++Builder', 'Borland C++Builder', 'ES-Computing EditPlus', 'BloodshedSoftware Dev-C++', 'ZinjaI', 'gVim']['Apple Xcode', 'Eclipse CDT', 'Code::Blocks', 'MacroMates TextMate', 'Freescale CodeWarrior Development Tools', 'ZinjaI']['Eclipse CDT', 'Code::Blocks', 'ZinjaI', 'GNU Emacs', 'Vim'][]"], "cal": ["3ds Max Pose Adjustment File", "File created by 3ds Max, a three-dimensional modeling and animation application; contains adjustment values for a biped's pose created while in the Adjust Talent Pose mode; used for adding pose information to the figure's structure, which is saved in a .FIG file.", "Windows, Windows, Mac, Windows, Mac, Windows, ", "['Autodesk 3ds Max 2017']['Broderbund The Print Shop', 'Broderbund PrintMaster v7 Platinum', 'Broderbund Calendar Creator']['Broderbund The Print Shop for Mac', 'Broderbund PrintMaster v7 Platinum']['Adobe Photoshop CC 2017', 'CorelDRAW Graphics Suite X8', 'Corel PaintShop Pro X9', 'ACD Systems Canvas X 2017', 'Newera Graphics Converter Pro', 'MaxView MaxReader']['Adobe Photoshop CC 2017']['Crytek CryENGINE SDK']"], "caj": ["Chinese Academic Journal File", "Document format developed by China National Knowledge Infrastructure (CNKI) and used for storing Chinese Academic Journal articles; contains text from a published article, which includes authors, citations, annotations, and other data related to the article.", "Windows, Mac, Web, iOS, Android, ", "['CNKI CAJViewer']['CNKI CAJViewer']['CNKI CAJViewer']['CNKI CAJViewer HD 1']['CNKI CAJViewer']"], "cam": ["Gerber CAM Job File", "Machine drilling job used by Gerber Computer-Aided Manufacturing (CAM) processing software; contains a compiled set of Gerber files saved by CAM350 software; may be used to view fabrication layers for printed circuit boards.", "Windows, Windows, Mac, Linux, ", "['CadSoft EAGLE']['XnViewMP']['XnViewMP']['XnViewMP']"], "calibre": ["Calibre Device Data File", "Data file generated by Calibre eBook management software; written by the Calibre software onto an attached eReader device (e.g., Kindle, NOOK) when it is connected to the computer; contains information that helps Calibre manage eBook information on the device.", "Windows, Mac, Linux, ", "['Calibre']['Calibre']['Calibre']"], "camp": ["WCS Color Appearance Model Profile File", "Windows Color System (WSC) file used by Windows programs to specify color viewing conditions; contains base parametric values for the CIECAM02 color properties of brightness, lightness, colorfulness, chroma, saturation, and hue.", "Windows, ", "['Microsoft Color Control Panel', 'Microsoft XML Notepad', 'text editor']"], "camm": ["espresso Mind Map Document", "File created by espresso Mind Map, a program used for visually outlining information; saves a mind map, which is a diagram that represents a branching out of ideas, usually originating from a central word or category.", "Windows, ", "['Corpatla espresso Mind Map']"], "calca": ["Calca Document", "Document created and used by Calca, a symbolic editor that calculates math problems in real time; contains plain text, which includes mathematical equations with variables, functions, and matrices. ", "Windows, Mac, iOS, ", "['Krueger Systems Calca']['Krueger Systems Calca']['Krueger Systems Calca']"], "caff": ["Core Audio File", "Audio file stored in the Core Audio Format (CAF), a digital audio format based on Apple's Core Audio technology; may include text annotations, channel layouts, and other information in addition to the audio data itself; more commonly uses the .CAF extension.", "Windows, Mac, Linux, ", "['File Viewer Plus', 'Apple QuickTime Player', 'GoldWave', 'Audacity']['Apple QuickTime Player', 'Apple GarageBand 10', 'Apple Logic Pro X', 'Apple Final Cut Express', 'Apple Final Cut Pro X', 'ShedWorx Smart Converter', 'Audacity']['Audacity']"], "camproj": ["Camtasia Studio Project", "Project file created by Camtasia, a screen recording and video editing program; saved using XML formatting and contains references to audio and video files as well as video edit, effect, and timeline settings; commonly used for saving software video tutorials and other demonstrations.", "Windows, ", "['TechSmith Camtasia Studio']"], "camrec": ["Camtasia Studio Screen Recording", "Recording of live events on a computer screen captured by Camtasia Studio; similar to a screenshot, but captures video instead of a still image; often used for creating program demos, computer training videos, and other types of presentations; may include both video and audio.", "Windows, ", "['TechSmith Camtasia Studio']"], "caf": ["Core Audio File", "Digital audio format based on Apple's Core Audio technology; stores audio data as well as text annotations, markers, channel layouts, and other information; similar to a .AIFF or .WAVE file, but does not have a 4GB size limit and can store any number of audio channels.", "Windows, Mac, Linux, Windows, Windows, Windows, Mac, Linux, ", "['File Viewer Plus', 'Apple QuickTime Player', 'GoldWave', 'Audacity']['Apple QuickTime Player', 'Apple GarageBand 10', 'Apple Logic Pro X', 'Apple Final Cut Express', 'Apple Final Cut Pro X', 'ShedWorx Smart Converter', 'Audacity']['Audacity']['Crytek CryENGINE SDK']['CalEd Class Action Gradebook']['Cal3dViewer', 'Short Fuze Limited Moviestorm']['Short Fuze Limited Moviestorm']['Cal3D']"], "c4p": ["CrossOver Software Installer File", "File used by CrossOver, a program used for running Windows programs on Mac and Linux; saves configuration information required for installing a Windows program on a Mac or Linux computer; can be double-clicked to install the associated program, if CrossOver is installed.", "Mac, Linux, ", "['CodeWeavers CrossOver']['CodeWeavers CrossOver']"], "cache": ["Cache File", "Stores recently used information in a disk cache for a specific program; used by Web browsers, image editing programs, and other applications to speed up the loading of recently viewed data.", "Windows, Mac, ", "[][]"], "czp": ["ClozePro Archive", "File used by Cloze Pro, a program used for preparing standardized tests and other documents for student assessment; stores a content package that can be imported into the software.", "Windows, Mac, ", "['Crick Software ClozePro']['Crick Software ClozePro']"], "cad": ["BobCAD-CAM File", "File created by BobCAD-CAM CAD design products; stores CAD data including the 2D and 3D part geometry and dimensions; used for designing parts and products for manufacturing.", "Windows, ", "['BobCAD-CAM']"], "cab": ["Windows Cabinet File", "A CAB file is a Windows Cabinet file saved in an archive format native to Microsoft Windows that supports .ZIP, Quantum, and LZX data compression algorithms.  CAB files contain compressed data and is used for Windows software installations such as system files, network components, and device drivers.", "Windows, Mac, Linux, ", "['File Viewer Plus', 'Microsoft Windows Installer', 'Corel WinZip 21', 'Smith Micro StuffIt Deluxe for Windows', 'Microsoft System Configuration Utility', 'WinRAR 5', '7-Zip', 'WinInizio ZipGenius', 'IZArc']['Corel WinZip Mac 5', 'Smith Micro StuffIt Deluxe 16', 'Incredible Bee Archiver', 'The Unarchiver']['cabextract']"], "czip": ["ZipGenius CryptoZip File", "Encrypted archive created by ZipGenius, an archive manager for Windows; saves one or more compressed files and incorporates four layers of protection (CZIP, BlowFish, TwoFish, and Rijndael); used for securely sharing data with others.", "Windows, ", "['WinInizio ZipGenius']"], "czi": ["Carl Zeiss Image Data File", "Microscope image data file created in the Carl Zeiss CZI format; can save image stacks, time lapse series, and tile images captured from a Carl Zeiss microscope; used for generating video sequences and performing medical research.", "Windows, Mac, Linux, ", "['Carl Zeiss ZEN', 'ImageJ']['ImageJ']['ImageJ']"], "czd": ["CAD Zone Drawing", "CAD document created by The Crash Zone or another CAD Zone software product; saves a 3D model of an accident scene, crime scene, or other emergency situation; used for making crash and other emergency diagrams that evaluate and influence road, site, and building construction.", "Windows, ", "['The Crash Zone']"], "cys": ["Cytoscape Session File", "File created by Cytoscape, an open source network analaysis and visualization application; saves an application session, which includes the state of the network visualization and its supporting data; used in social science, biology, and other research settings for creating and analyzing complex large-scale visualizations.", "Windows, Mac, Linux, Windows, Linux, ", "['Cytoscape']['Cytoscape']['Cytoscape'][][]"], "cyo": ["Clustify Output File", "Output file generated by Clustify, a document organization program, after identifying and arranging similar documents; specifies Cluster ID numbers for all documents that were input.", "Windows, Linux, ", "[][]"], "cyp": ["Home Designer Pro Project File", "Project file created by Home Designer Pro, a home designing application for do-it-yourself enthusiasts; supports both 2D and 3D plans as well as site planning; used for custom home construction as well as remodeling projects.", "Windows, ", "['Chief Architect Home Designer Pro', 'Ashampoo 3D CAD Professional 6']"], "cyi": ["Clustify Input File", "Text-based input file used by Clustify, a document organization program; specifies a list of documents to cluster (which identifies and arranges similar documents).", "Windows, Linux, ", "[][]"], "cyberduckprofile": ["Cyberduck Connection Profile", "Connection profile used by Cyberduck, an open source FTP, SFTP, and WebDAV application; saved in an XML format and contains information about a specific type of connection.", "Windows, Mac, ", "['Cyberduck']['Cyberduck']"], "cyberducklicense": ["Cyberduck Donation Key", "Cyberduck license file generated by Cyberduck, an open source FTP program; created when a user registers the software by making a donation to the Cyberduck development team.", "Windows, Mac, ", "['Cyberduck']['Cyberduck']"], "cxx": ["C++ Source Code File", "Source code file written in the C++ programming language; can contain a standalone program or components that can be included in other C++ source files; often edited with a text editor that includes syntax highlighting.", "Windows, Mac, Linux, ", "['File Viewer Plus', 'Microsoft Visual Studio 2017', 'Eclipse CDT']['Apple Xcode', 'Eclipse CDT']['Eclipse CDT']"], "cxt": ["CX-Programmer Project Text File", "Project file created by CX-Programmer, a PLC programming application included with OMRON's CX-One package; saves a developer project in a plain text format and includes the user programs and data parameters.", "Windows, Windows, Mac, ", "['OMRON CX-One']['Adobe Director']['Adobe Director']"], "cxr": ["FMAT Plate Results File", "Data file created by FMAT 8100 HTS System, a program used to analyze human cells; contains analysis data from scanned plates; includes the name or ID of the plate, plate row and column position, number of events in the well, and average intensity of the fluorescent events.", "Windows, ", "['Applied Biosystems FMAT 8100 HTS System']"], "cxp": ["CX-Programmer Project File", "Project file created by CX-Programmer, a program used for programming OMRON PLCs (programmable logic controllers); saves user programs and parameters; stored in a compressed format and is the compressed version of a .CXT file.", "Windows, Windows, ", "['OMRON CX-One']['Applied Biosystems FMAT 8100 HTS System']"], "cxi": ["FMAT RAW Image", "Image created by FMAT 8100 HTS System, an instrument used to study human cells; contains RAW image data of scanned specific wells or a whole plate of beads.", "Windows, ", "['Applied Biosystems FMAT 8100 HTS System']"], "cxd": ["SimplePCI Data Document", "File used by SimplePCI microscopy imaging software; contains data captured from a connected piece of microscope equipment; can save a single image or image sequences; used for image acquisition and analysis.", "Windows, ", "['Hamamatsu Photonics HCImage', 'Hamamatsu Photonics SimplePCI']"], "cxarchive": ["CrossOver Bottle Archive", "Archive file created by CrossOver, a program used to emulate Windows programs on Mac and Linux; contains multiple, consolidated files that build \"bottles\" used by CrossOver; should not be deleted.", "Mac, Linux, ", "['CodeWeavers CrossOver']['CodeWeavers CrossOver']"], "cxa": ["FMAT Listmode File", "File created by FMAT 8100 HTS System, a program used to analyze human cells; contains a list of data for scanned wells of beads; includes numeric identifications, location, intensity, and smoothness of fluorescent events.", "Windows, ", "['Applied Biosystems FMAT 8100 HTS System']"], "cxf": ["Picasa Collage File", "File created by Picasa, a free image editor and image sharing program developed by Google; created alongside the .JPG image when the user saves a collage; stores paths to the images that were used to create the collage, as well as the positions of the images in the collage.", "Windows, Mac, Windows, Linux, Windows, ", "['Google Picasa']['Google Picasa']['CAS SciFinder', 'CAS STN Express']['Cuttlefish']['CXeditor']"], "cx3": ["CMS Recorded Video File", "Video file recorded by Central Manager System (CMS), a suite of programs used to record video using DVR systems; saves the video in a proprietary CX3 format, but can be played with the DVR Player program included with the CMS software.", "Windows, ", "['IDView CMS']"], "cwy": ["ChordWizard Style", "Song style file used by Songtrix, a music learning and creating application; contains song settings for the volume, tempo, melody, rhythm, bass, drums, and riff levels; default styles include Blues, Country, Disco, Funk, Techno, and Swing; can be uploaded to the ChordWizard network and shared with other members.", "Windows, ", "['ChordWizard Songtrix']"], "cwz": ["Circuit Wizard File", "Circuit design created with Circuit Wizard, a printed circuit board (PCB) design and simulation program; contains a circuit layout, including components and connections, as well as voltage and electrical current information.", "Windows, ", "['New Wave Concepts Circuit Wizard']"], "cww": ["Crossword Weaver Puzzle File", "File created by Crossword Weaver, a program used for making crossword puzzle designs; saves the crossword grid, clues, and the final page layout that is printed for the design; can be published online to a website for others to play, or may be printed by newspaper and magazine editors, educators, and hobbyists.", "Windows, ", "['Variety Games Crossword Weaver']"], "cwk": ["ClarisWorks Document", "Document created by Apple's AppleWorks or ClarisWorks productivity suite; can be a word processing document, spreadsheet, or presentation; can still be opened by iWork applications (Pages, Numbers, Keynote), but the file must first be in the AppleWorks 6 format and importing results may vary.", "Windows, Mac, ", "['Apple AppleWorks']['Apple Pages', 'Apple Keynote 7', 'Apple Numbers 4', 'Apple AppleWorks']"], "cwt": ["Cakewalk SONAR Template", "Template created by Cakewalk SONAR, a digital audio workstation (DAW) application; contains pre- or user-defined settings; used for editing music and sound samples; includes settings for different audio effects such as input gain/pan, volume, tempo, and speaker outputs.", "Windows, Windows, Windows, Mac, iOS, ", "['Cakewalk SONAR X3']['ChordWizard Songtrix']['Apple AppleWorks']['Apple AppleWorks']['Apple AppleWorks']"], "cws": ["ChordWizard Song", "Song file created by Songtrix, an application used to learn about and create music; stores a song composition, which includes the song's style, notes, segments, credits, and structure; can be uploaded to the ChordWizard network and shared with other members.", "Windows, Mac, ", "['ChordWizard Songtrix']['Apple AppleWorks']"], "cwp": ["Cakewalk SONAR Project", "Audio project file created by Cakewalk SONAR, a digital audio workstation (DAW) application; saves an audio production and supports multiple tracks, audio effects, MIDI data, and other parameters; used for editing music and sound samples.", "Windows, ", "['Cakewalk SONAR X3']"], "cwb": ["Cakewalk Bundle", "Audio project archive created by Cakewalk SONAR, an audio production application; saves all project audio resources in a single archive; used for backing up projects and transferring them between computers.", "Windows, ", "['Cakewalk SONAR X3']"], "cw": ["CardWorks Template", "Business card template created by CardWorks, a program used for designing and printing business cards; saves the card layout and includes the individual's name, title, company, website, address, phone, email, and other related information.", "Windows, ", "['NCH CardWorks']"], "cvx": ["Canvas Drawing File", "Drawing file created by Canvas, a program used to create technical illustrations and other drawings; may contain both raster and vector graphics; also includes project drawing settings such as layers and image effects; can be saved as Canvas proprietary .CVI images, or exported to one of over 40 different raster and vector file formats.", "Windows, Mac, ", "['ACD Systems Canvas X 2017', 'ACD Canvas 9 Viewer', 'ACD Systems ACDSee 20']['ACD Canvas 9 Viewer']"], "cvw": ["CaseView Document", "Document created by CaseView, a program used for making business financial documents; saves the document layout and fields that can be filled by a connecting data source; can be created in Design mode or Form mode in the software.", "Windows, ", "['CaseWare CaseView']"], "cvi": ["Canvas Image File", "Image format used by Canvas, a technical illustration and graphics editing program; may contain both bitmap and vector graphics; sometimes used for saving proxy images, which reduces the screen redraw time for image intensive documents.", "Windows, Windows, ", "['ACD Systems Canvas X 2017'][]"], "cvs": ["Canvas 3 Drawing File", "Proprietary image format used by early versions of Canvas, a drawing program designed for creating technical illustrations; may contain both vector images and raster images.", "Windows, ", "['ACD Systems Canvas X 2017']"], "cvg": ["Calamus Vector Graphic File", "Vector image format used by Calamus, a European desktop publishing program designed for students and professionals; may contain shapes, paths, effects, and other image information.", "Windows, Mac, ", "[]['Lemkesoft GraphicConverter']"], "cvr": ["Microsoft Crash Report File", "File created by various Microsoft programs when they crash; contains crash report information used for analyzing the problem; can be sent to Microsoft with a crash report through the Windows crash reporter.", "Windows, ", "['Microsoft Word 2016', 'Microsoft Excel 2016', 'Microsoft PowerPoint 2016', 'Microsoft Outlook 2016']"], "cvn": ["CineVision Encoding Session", "Disc encoding session created with Sonic CineVision, a CD/DVD and Blu-ray disc encoding program; contains a list of media files to be burned to a disc, as well as their titles and start and end times.", "Windows, ", "[]"], "cvsrc": ["CVS Command File", "File created for TortoiseCVS, a freely shared Concurrent Versions System (CVS) client for Microsoft Windows; contains default options that are added to cvs_commands within CVS instead of using other shell scripts.", "Windows, ", "['TortoiseCVS']"], "cvd": ["ClamAV Virus Definitions File", "File used by ClamAV, an open source antivirus program; contains virus definitions for updating the list of recognized viruses in ClamAV; saved as a digitally signed tarball that contains one or more virus databases.", "Windows, Mac, Linux, Windows, Mac, ", "[][]['ClamAV']['Bitdefender Total Security 2017', 'Bitdefender Antivirus Plus 2017']['Bitdefender Antivirus for Mac']"], "cva": ["HP Systems Software Manager Information File", "File used by HP Systems Software Manager (SSM), a program used to update devices, platforms, and languages on PCs; contains the name and version of an update as well as a single command that executes on the client PC, which usually refers to the setup program for the update.", "Windows, Windows, ", "['HP Systems Software Manager']['ACD Systems Canvas X 2017']"], "cursorfx": ["CursorFX Theme File", "Theme file created by CursorXP, a mouse cursor editing program; contains mouse graphics, effects, and trails as well as mouse events and movement preferences; includes .PNG files for cursor images and contains author and version metadata; stored as a compressed file to reduce file size.", "Windows, ", "['Stardock CursorFX']"], "cv5": ["Canvas 5 Drawing File", "Image format used by Canvas 5, a technical illustration and drawing program; can contain both vector images and raster images; also compatible with newer versions of Canvas.", "Windows, ", "['ACD Systems Canvas X 2017']"], "curxptheme": ["CursorXP Theme File", "File created by CursorXP, a mouse theme editor program allowing users to customize the look and feel of mouse cursors; contains mouse cursor graphics, effects, and trails as well as mouse movement, event, and animation preferences; includes metadata such as author and version; contains cursor images as embedded .PNG files.", "Windows, ", "['Stardock CursorFX']"], "cui": ["Autodesk Custom Workspace File", "Saves workspace settings for AutoCAD architectural drawing and engineering software as well as for 3ds Max 3D modeling software; contains toolbar and menu configuration settings as well as the layout for windows and palettes; used for setting up the workspace for different modeling, rendering, and animation tasks.", "Windows, ", "['Autodesk AutoCAD 2017', 'Autodesk 3ds Max 2017']"], "cur": ["Windows Cursor", "A CUR file is a cursor image or animation used for the Windows mouse pointer.  It may be an arrow (for general use), a spinning hourglass (for waiting periods), or an I-bar (for text editing).  Custom desktop themes (.THEME files) may change the cursor image/animation, such as turning the hourglass into a watch.", "Windows, Mac, Linux, ", "['File Viewer Plus', 'Microsoft Windows', 'Axialis CursorWorkshop', 'Greenfish Icon Editor Pro', 'ACD Systems ACDSee 20', 'Corel PaintShop Pro X9', 'Inkscape']['Inkscape', 'Snap Converter']['Inkscape']"], "cul": ["Windows Cursor Library", "Library of Windows cursors created by cursor editing programs such as Axialis CursorWorkshop or CursorArts IconForge; contains a collection of .CUR files bundled together in a single archive; used for storing similar cursor images together for Windows themes.", "Windows, ", "['Axialis CursorWorkshop', 'CursorArts IconForge']"], "cuix": ["AutoCAD Custom User Interface File", "Custom workspace file created by the Custom User Interface (CUI) Editor component of AutoCAD; stores window and palette settings as well as toolbar and menu configurations; may also include custom images; used for loading full or partial custom workspace layouts during a drawing session.", "Windows, ", "['Autodesk AutoCAD 2017']"], "cue": ["Cue Sheet File", "A CUE file is a text file that defines the way tracks are organized on compact discs and super-audio CDs (SACDs).  It may contain the song name, performer, and length of each track on the disc.  CUE files are written in a standard format and therefore are recognized by most CD playback and editing programs.", "Windows, Mac, Linux, Windows, ", "['Nero 2017', 'Roxio Creator NXT Pro 5', 'Foobar2000', 'Smart Projects IsoBuster', 'EZB Systems UltraISO', 'Alcohol 120%', 'Lightning UK! ImgBurn', 'VideoLAN VLC media player', 'text editor']['Roxio Toast 15', 'NTI Dragon Burn 4', 'Burn', 'VideoLAN VLC media player', 'text editor']['VideoLAN VLC media player']['Engelmann Media CDRWIN', 'Smart Projects IsoBuster', 'EZB Systems UltraISO']"], "cube": ["Gaussian Cube File", "Gaussian cube format created by the cubegen and cubman programs included with the Gaussian distribution;  stores volumetric properties, which are the X-, Y-, and Z-coordinates that are mapped on to a 3D grid associated to a molecular system; may also contain the number of atoms and the number of voxels along the the axes.", "Windows, Mac, Linux, ", "['NWChem', 'Avogadro']['NWChem', 'Avogadro']['NWChem', 'Avogadro']"], "cub": ["Analysis Services Cube File", "Data file created by Analysis Services, a component of Microsoft SQL Server; stores a \"cube,\" which is a collection of structured data exported from a data source; includes the data schema as well as the data itself; often used for performing Online Analytical Processing (OLAP) analysis.", "Windows, Linux, Windows, Mac, Linux, ", "['Microsoft Excel 2016', 'Microsoft SQL Server 2016']['USGS ISIS']['NWChem', 'Avogadro']['NWChem', 'Avogadro']['NWChem', 'Avogadro']"], "cu": ["CUDA Source Code File", "Developer file written for CUDA, an NVIDIA architecture created for parallel processing on nVidia GPUs; contains source code written in the \"C for CUDA\" language, which is similar to the standard C language with a few CUDA-specific extensions.", "Windows, ", "['NVIDIA CUDA Toolkit', 'Microsoft Notepad', 'text editor']"], "ctxt": ["BlueJ Context File", "File created by BlueJ, a Java language development environment; automatically generated by BlueJ during compilation; contains extra information for a class such as the comments structure and documentation for methods in the code; only one CTXT file can accompany each class.", "Windows, Mac, Linux, ", "['BlueJ']['BlueJ']['BlueJ']"], "ctx": ["Valve ICE Encoded Script", "Game script encoded by the Information Concealment Engine (ICE) cipher; used by Valve games such as Team Fortress 2 (TF2) and Counter Strike; used for obfuscating game scripts so that users can't tamper with them easily.", "Windows, Windows, ", "['Ctx Converter']['Microsoft Visual Studio']"], "ctv3": ["Citavi 3 Project File", "Project file created by Citavi, a reference management program for Windows; may include various types of bibliographic and citation data about information sources; may also include written notes; used for saving research and source information.", "Windows, ", "['Swiss Academic Citavi']"], "cty": ["SimCity City File", "City data file used by early versions of SimCity; contains city layouts and objects (buildings, roads, trees, etc.) as well as settings, such as the starting amount of money for the city; used as a starting point for building a city.", "Windows, Mac, ", "[][]"], "ctv": ["Citavi Project", "Project file created by Citavi, a Windows reference management application; stores citation data about information sources and can also include written notes; used for storing and searching research source information.", "Windows, ", "['Swiss Academic Citavi']"], "ctt": ["Messenger Contact List", "Stores a list of contacts and groups used by the MSN/Live Messenger instant messaging program; saved as a text file and formatted in XML; can be exported from MSN Messenger and imported by another user.", "Windows, Mac, ", "['Microsoft Windows Live Messenger', 'text editor']['Microsoft Messenger']"], "cts": ["CrazyTalk Script File", "File used by CrazyTalk, a program used for 3D facial animation; stores an audio clip as well as facial motion data that controls the lip-sync and facial expressions for the audio; used for inserting pre-recorded voice and facial motion clips into the animation timeline.", "Windows, ", "['Reallusion CrazyTalk', 'Reallusion CrazyTalk Animator', 'Reallusion iClone']"], "ctl": ["StepMania SMZIP Package Description File", "File used by StepMania, a dance and rhythm game that includes support for dance pads; included inside a .SMZIP file and contains information describing the package contents; used for installing songs, themes, and add-ons in StepMania.", "Windows, Mac, Linux, Windows, ", "['StepMania']['StepMania']['StepMania']['Microsoft Visual Studio']"], "ctproject": ["CrazyTalk Animator Project File", "Project file created by CrazyTalk Animator, a program used for making 2D cartoon animations; saves actors, sounds, timelines, and animation settings for the cartoon; can be exported to .WMV and .AVI formats when complete.", "Windows, ", "['Reallusion CrazyTalk Animator']"], "ctg": ["Canon Digital Camera Catalog File", "A CTG file is a catalog index file created by Canon digital cameras.  It contains information about the number of images stored in each folder on a camera's memory card (typically up to 99).  CTG files are stored in the CANONMSC folder and they correspond to other folders saved on the memory card.", "Windows, Mac, ", "[][]"], "ctp": ["CakePHP Template", "Template file used by CakePHP, a development framework for PHP Web applications; contains the PHP \"view\" code within the Model-View-Controller (MVC) software architecture design pattern; stores a template for how information is displayed in the Web application.", "Windows, Mac, Linux, Windows, ", "['Cake Software CakePHP', 'Adobe Dreamweaver CC 2017']['Cake Software CakePHP', 'Adobe Dreamweaver CC 2017']['Cake Software CakePHP']['Reallusion CrazyTalk']"], "ctm": ["Star Wars Republic Commando Map File", "Map file used by Star Wars Republic Commando, a first-person shooter game that uses the Unreal Engine gaming technology; contains a game level, including terrain, buildings, obstacles, spawn points, and items; can be used to store custom maps.", "Windows, Windows, ", "[]['Reallusion CrazyTalk', 'Dell Webcam Central']"], "ctf": ["WhereIsIt Catalog File", "Contains a catalog of a media collection; may include CD-ROMs, DVDs, audio CDs, hard drives, removable drives, network drives, and other storage media recognized by Windows.", "Windows, Windows, Windows, ", "['WhereIsIt']['AVG Internet Security Unlimited']['ECMG FileMatica']"], "ctbodyfitting": ["CrazyTalk Animator Actor Fitting File", "File created by CrazyTalk Animator, a 2D animation and cartoon program; saves an actor whose head and body shape, control points, and mask information have been profiled by the software; created using the Actor Creator and Face Creator components.", "Windows, ", "['Reallusion CrazyTalk Animator']"], "ctb": ["AutoCAD Color-Based Plot Style File", "File used by AutoCAD, a CAD program used for 2D and 3D drawing; contains color-based plot styles, or mappings of colors to layers of objects; used to attach color and display settings to design objects.", "Windows, ", "['Autodesk AutoCAD 2017']"], "ct": ["Cheat Engine Cheat Table", "File created by Cheat Engine, an open source program used to create \"cheats,\" or modifications, to Windows-based games; contains game overrides and their address locations within the target program; allows users to edit game properties, such as numbers of lives, high scores, and units of health.", "Windows, Windows, Mac, ", "['Cheat Engine']['Adobe Photoshop CC 2017', 'Adobe Photoshop Elements 15', 'Adobe InDesign CC 2017', 'CorelDRAW Graphics Suite X8', 'Corel PaintShop Pro X9', 'XnViewMP', 'fCoder Group Image Converter Plus']['Adobe Photoshop CC 2017', 'Adobe Photoshop Elements 15', 'Adobe InDesign CC 2017', 'XnViewMP']"], "css": ["Cascading Style Sheet", "A CSS file is a cascading style sheet (CSS) file used to format the contents of a webpage.  It contains customized, global properties for how to display HTML elements.  CSS files can define the size, color, font, line spacing, indentation, borders, and location of HTML elements.", "Windows, Mac, iOS, ", "['File Viewer Plus', 'Adobe Dreamweaver CC 2017', 'Adobe ColdFusion Builder', 'Microsoft Visual Studio 2017', 'Blumentals WeBuilder', 'PSPad', 'Notepad++', 'text editor', 'Web browser']['Adobe Dreamweaver CC 2017', 'Adobe ColdFusion Builder', 'Apple TextEdit', 'text editor', 'Web browser']['Alexander Blach Textastic Code Editor']"], "csy": ["Canvas Symbol File", "Symbol file used by Canvas, a drawing program used to create technical illustrations; contains a vector graphic that can be inserted into a drawing; can store symbols for signs, buildings, electrical circuit parts, and other objects; may be resized and styled to fit the illustration.", "Windows, ", "['ACD Systems Canvas X 2017']"], "csx": ["Visual C# Script", "Developer file written in Visual C# Script, a C# API developed by Microsoft under the codename The Roslyn Project; used for developing components in C# that can run on-demand as scripts with the Roslyn framework.", "Windows, ", "['Microsoft Visual Studio 2017', 'text editor']"], "csv": ["Comma Separated Values File", "A CSV file is a comma separated values file commonly used by spreadsheet programs such as Microsoft Excel or OpenOffice Calc.  It contains plain text data sets separated by commas with each new line in the CSV file representing a new database row and each database row consisting of one or more fields separated by a comma.  CSV files are often opened by spreadsheet programs to be organized into cells or used for transferring data between databases.", "Windows, Mac, Linux, Web, iOS, Android, ", "['File Viewer Plus', 'Microsoft Excel 2016', 'Corel Quattro Pro X8', 'Apache OpenOffice', 'LibreOffice', 'Microsoft Notepad', 'Intuit Quicken', 'GenScriber', 'text editor']['Microsoft Excel 2016', 'Planamesa NeoOffice', 'Apache OpenOffice', 'LibreOffice', 'GenScriber', 'text editor']['Apache OpenOffice', 'LibreOffice', 'GenScriber']['FreshBooks', 'Intuit QuickBooks Canada', 'Sage One']['MobiSystems OfficeSuite Pro']['MobiSystems OfficeSuite Pro']"], "cst": ["Manga Studio Story File", "Page layout file created by Manga Studio, a program used for creating comic books; saves the storyline for the comic book and can include multiple chapters, multiple pages (.CPG files) per chapter, and layouts for each page; used for specifying the structure of the comic book.", "Windows, Mac, Windows, Mac, Windows, Mac, Windows, Linux, Windows, ", "['CELSYS Clip Studio Paint Pro']['CELSYS Clip Studio Paint Pro']['Adobe Director']['Adobe Director'][][][][]['ACD Systems Canvas X 2017']"], "csr": ["Certificate Signing Request File", "A CSR file is a file created as a signing request for a digital certificate.  It contains an encrypted block of text that identifies the applicant of the certificate and includes encrypted data for country, state, organization, domain, email address, and public key.  The file is used by a Certificate Authority to establish proof of identity for Web sites.", "Windows, Mac, Linux, ", "['Microsoft IIS', 'OpenSSL']['OpenSSL']['OpenSSL']"], "csproj": ["Visual Studio C# Project", "C# (C Sharp) programming project created with Microsoft Visual Studio; contains project settings and references to files used by the project; saved in the MSBuild format, which can be compiled into an executable program using the MSBuild platform.", "Windows, ", "['Microsoft Visual Studio 2017']"], "csn": ["Adobe Code Snippet Document", "Source code file used by Dreamweaver, a program used to develop websites and Web applications; stores a reusable block of code, which can include HTML, JavaScript, PHP, or other source code; used for inserting common code segments into Web pages under development.", "Windows, Mac, ", "['Adobe Dreamweaver CC 2017']['Adobe Dreamweaver CC 2017']"], "csplan": ["SPSS Sampling Plan File", "File created by SPSS, a statistics application; saves the parameters of a sampling plan created using the Sampling Wizard (Analyze → Complex Samples → Select a Sample...); draws the output sample data to a table when opened.", "Windows, Mac, Linux, ", "['IBM SPSS']['IBM SPSS']['IBM SPSS']"], "csp": ["Caché Server Page", "Webpage containing HTML as well as Caché Server Page (CSP) markup, a proprietary markup language used for accessing data from an InterSystems Caché object database; used for writing data-driven Web applications and must be run on a Caché Application Server.", "Windows, Windows, Mac, Linux, ", "['InterSystems Caché Application Server']['Web browser']['Web browser'][]"], "cso": ["Compiled Shader Object File", "File created by compiled .HLSL files written in High Level Shader Language (HLSL), which is shading language developed by Microsoft; contains a compiled shader object, which derives from a HLSL file; retains the same name as the HLSL file but appears as a CSO file after the compile in Microsoft Visual Studio.", "Windows, Mac, Linux, Windows, ", "['Microsoft Visual Studio 2017', 'Microsoft DirectX SDK', 'OpenGL SDK']['OpenGL SDK']['OpenGL SDK']['UMDGen', 'CisoPlus!', 'PSP ISO Compressor', 'YACC']"], "csi": ["ContentServ Include File", "Source code file that may be referenced by other files within a ContentServ project; contains code that may include functions, variables, and other objects that can be used by other project files.", "Windows, Linux, Windows, ", "[][][]"], "csm": ["Character Studio Marker File", "ASCII text file that contains position markers for a 3D character; used by Character Studio, a biped animation tool included with Autodesk's 3ds Max program; saves the position of the biped in the software's motion capture buffer.", "Windows, Windows, ", "['Autodesk 3ds Max 2017']['Valve Steam']"], "cskin": ["CD Art Display Skin File", "Skin file used by CD Art Display, a program that shows CD cover art for songs played in Windows Media Player, iTunes, Winamp, and other popular audio players; contains image graphics, fonts, and a skin.ini (.INI) file that defines the appearance of the player.", "Windows, ", "['CD Art Display']"], "cshtml": ["ASP.NET Razor Web Page", "C# (\"C sharp\") HTML webpage file used by Razor, an ASP.NET view engine used for generating Web pages for a user's Web browser; similar to a standard ASP.NET webpage (.ASP or .ASPX file), but uses a slightly different syntax; runs on a Web server, which generates the HTML for the client Web browser; can be programmed with syntax highlighting and Intellisense code suggestions using Microsoft Visual Studio.", "Windows, ", "['Microsoft Visual Studio 2017', 'text editor']"], "csf": ["GeoMedia Coordinate System File", "Coordinate system file used by GeoMedia, a GIS application used to analyze geographic information and produce maps; contains the coordinate system for an output data file that has no system in place; includes the base storage type, which is either Geographic, Projection, or Geocentric, of the coordinate system.", "Windows, Windows, Mac, Windows, Mac, Linux, Windows, ", "['Intergraph GeoMedia']['Adobe Photoshop CC 2017', 'Adobe InDesign CC 2017', 'Adobe Illustrator CC 2017']['Adobe Photoshop CC 2017', 'Adobe InDesign CC 2017', 'Adobe Illustrator CC 2017']['Cal3dViewer', 'Cal3d2ogre', 'Short Fuze Limited Moviestorm']['Short Fuze Limited Moviestorm']['Cal3D']['Informative Graphics Brava! Reader']"], "csd": ["Steam Game Data Backup File", "A CSD file is a backup file created by Steam, a gaming service that allows users to download and manage Valve games.  It contains backup game data, similar to a .SID file, and can be used to restore a game that has been deleted.", "Windows, Windows, Mac, Windows, ", "['Valve Steam']['CELSYS Clip Studio Paint Pro']['CELSYS Clip Studio Paint Pro'][]"], "csaplan": ["SPSS Analysis Plan File", "File created by SPSS statistical analysis software; stores the parameters of an analysis plan created using the Analysis Preparation Wizard (Analyze → Complex Samples → Prepare for Analysis...); used to generate SPSS syntax, which contains the SPSS commands required to run the analysis.", "Windows, Mac, Linux, ", "['IBM SPSS']['IBM SPSS']['IBM SPSS']"], "csh": ["Photoshop Custom Shapes File", "Collection of custom shapes used by Photoshop and Photoshop Elements; accessed by the Custom Shape Tool when the custom shape option is selected; can be loaded or saved by clicking the right arrow in the Shapes drop-down list and selecting \"Load Shapes...\" or \"Save Shapes...\"", "Windows, Mac, Windows, Mac, Windows, Mac, Linux, ", "['Adobe Photoshop CC 2017', 'Adobe Photoshop Elements 15']['Adobe Photoshop CC 2017', 'Adobe Photoshop Elements 15']['Steinberg Cubase']['Steinberg Cubase']['File Viewer Plus', 'Hamilton C shell', 'Microsoft Notepad', 'gVim', 'text editor']['Apple Terminal', 'MacVim', 'text editor']['FreeBSD C shell', 'Vim']"], "csa": ["PNA Code Calset File", "Data file saved by Agilent PNA Code software; stands for \"Cal/State/Archive\" because the Calset data is archived with the state; stores data collected from measurements performed with the software.", "Windows, ", "[]"], "cs": ["Visual C# Source Code File", "A CS file is a source code file written in C# (pronounced \"C Sharp\"), an object-oriented programming language created by Microsoft for use with the .NET Framework.  It is used for developing a range of applications, from simple desktop programs to applications for distributed environments.", "Windows, Mac, Linux, Windows, Mac, ", "['File Viewer Plus', 'Microsoft Visual Studio 2017', 'IC Code SharpDevelop', 'Adobe Dreamweaver CC 2017', 'ES-Computing EditPlus', 'Notepad++', 'MonoDevelop']['Adobe Dreamweaver CC 2017', 'MonoDevelop']['MonoDevelop']['Sanny Builder', 'Rockstar Games Grand Theft Auto: San Andreas']['CHROMAom ColorSchemer Studio']"], "crz": ["Compressed Poser Character Rigging File", "Compressed character information file created by Poser, a 3D figure and animation program; contains information about figure joints, such as where and how much they bend.", "Windows, Mac, ", "['Smith Micro Poser 11']['Smith Micro Poser 11']"], "cryptra": ["Cryptra Encrypted File", "Encrypted file created by Cryptra, a program used for securing data sent via email; contains a file that was encrypted using one of many available One Time Pad (OTP) keys provided on a CD (or .ISO image) with the software.", "Windows, ", "['BMB Software Cryptra']"], "crypt9": ["WhatsApp Encrypted Database File", "Encrypted database file created and used by WhatsApp Messenger, a messaging application for Android devices.  It contains an encrypted database of chat history messages.  CRYPT9 files are located on the SD card of Android devices.", "Web, Android, ", "['WhatCrypt']['WhatsApp Messenger', 'EliteAndroidApps Omni-Crypt']"], "crv": ["VCarve Pro Design File", "CAD file created by VCarve Pro, a program used for CNC routing, sign making, wood carving, and engraving; saves a vector design geometry and includes toolpaths for machining the design; can be exported to a CNC router or engraving machine to cut the final design.", "Windows, ", "['Vectric VCarve Pro']"], "crypt8": ["WhatsApp Encrypted Database File", "Encrypted database file created and used by WhatsApp Messenger, a smartphone messenger application; contains a database of chat history messages located on the SD card of Android devices.", "Windows, Android, ", "['WhatsApp Viewer']['WhatsApp Messenger', 'WhatsApp Xtract', 'deraills Crypt-DBConverter for Whatsapp']"], "crypt12": ["WhatsApp Encrypted Database File", "A CRYPT12 file is an encrypted database created by WhatsApp Messenger, an Android messenger application.  It contains a 256-bit AES encrypted database of messages sent and received through the app.", "Web, Android, ", "['WhatCrypt']['WhatsApp Messenger', 'EliteAndroidApps Omni-Crypt']"], "cry": ["CryENGINE Map File", "Map file used by games developed with CryENGINE, a first-person shooter game engine created by Crytek; stores a game level, including the terrain, buildings, mission objectives, spawn points, items, and other map objects; can be used for creating custom missions.", "Windows, ", "['Crytek CryENGINE', 'Crytek CryENGINE SDK']"], "crx": ["Chrome Extension", "A CRX file is an extension that adds extra features or themes to the Google Chrome web browser.  It is saved in a compressed format and may contain .JS, .JSON, and other files, such as images and executable programs.  CRX files are used for installing browser addons such as games, ad blockers, and news readers.", "Windows, Mac, Linux, ", "['Google Chrome', '7-Zip']['Google Chrome']['Google Chrome']"], "crwl": ["Windows Crawl File", "Log file generated after an indexing process run by Windows Search, Microsoft Exchange, or SharePoint Portal Server; contains data about the files that were \"crawled\" during the indexing process; typically saved along with a corresponding .GTHR file.", "Windows, ", "['text editor']"], "crypt": ["WhatsApp Encrypted Dastabase File", "File created by WhatsApp Messenger, a smartphone messenger application; contains backup messages from the WhatsApp application.", "iOS, Android, Windows Phone, ", "['WhatsApp Messenger']['WhatsApp Messenger', 'WhatsApp Xtract'][]"], "crtr": ["MultiAd Creator Pro Document", "Marketing document created by Creator Pro, a program used for designing business marketing materials; saves the page layout information, graphics, text, and other document data; used for printing flyers and other promotional materials.", "Windows, Mac, ", "['MultiAd Creator Pro']['MultiAd Creator Pro']"], "crp": ["Cities: Skylines Colossal Raw Asset Package", "Colossal Raw Asset Package file format used by Cities: Skylines, a city building simulation game; used to store a variety of data, including game progress, maps, assets, and color corrections.", "Windows, Mac, Linux, ", "['Paradox Interactive Cities: Skylines']['Paradox Interactive Cities: Skylines']['Paradox Interactive Cities: Skylines']"], "crtx": ["Office 2007 Chart Template File", "Chart template that can be applied to multiple documents and presentations in Microsoft Office 2007 or later; contains stored settings for colors, axes, grid lines, categories, legends, text, title, and other chart options; used to apply the same styles and formatting to multiple charts.", "Windows, Mac, ", "['Microsoft Word 2016', 'Microsoft Excel 2016', 'Microsoft PowerPoint 2016']['Microsoft Word 2016', 'Microsoft Excel 2016', 'Microsoft PowerPoint 2016']"], "crt": ["Security Certificate", "Certificate used by secure websites (beginning with \"https://\") to verify their authenticity; distributed by companies such as Verisign and Thawte.", "Windows, Mac, Linux, ", "['Microsoft Internet Explorer', 'Mozilla Firefox', 'Google Chrome', 'Web browser']['Apple Safari', 'Mozilla Firefox', 'Google Chrome', 'Web browser']['Mozilla Firefox', 'Web browser']"], "crds": ["Windows CardSpace Backup File", "Backup file created by Windows CardSpace, a digital identity management application included with Windows 7; contains a backup of one or more .CRD CardSpace cards; used when restoring cards in the event they are lost or corrupted; also used for transferring cards between computers.", "Windows, ", "['Microsoft Windows CardSpace']"], "crl": ["Certificate Revocation List File", "Data file typically used by Web servers and encryption software; contains a blacklist of revoked digital certificates; stores information about the certificates, such as the issuer and the revocation date; enables security administrators to block untrusted entities.", "Windows, Mac, Linux, ", "['Microsoft IIS', 'Citrix NetScaler', 'OpenSSL']['Globus Toolkit', 'OpenSSL']['Citrix NetScaler', 'Globus Toolkit', 'OpenSSL']"], "crf": ["Cal3D Binary Materials File", "Three-dimensional materials file created in the Cal3D binary materials format; stores references to the graphics that are overlaid on 3D meshes to provide the model's surface appearance; also stores  ambient, diffuse, specular, and shininess lighting properties.", "Windows, Mac, Linux, ", "['Cal3dViewer', 'Cal3d2ogre', 'Short Fuze Limited Moviestorm']['Short Fuze Limited Moviestorm']['Cal3D']"], "crev": ["Adobe Captivate Commentable SWF File", "File created by Adobe Captivate, a screen recording and eLearning product generation tool; contains a reviewable .SWF file that can be marked up and peer-reviewed using the Adobe Captivate Reviewer application, which is included with Adobe Captivate.", "Windows, Mac, ", "['Adobe Captivate']['Adobe Captivate']"], "crdownload": ["Chrome Partially Downloaded File", "A CRDOWNLOAD file is a partially downloaded file created by the Google Chrome web browser.  It stores the contents of a file as it is being received by the browser and uses the \".crdownload\" extension to mark the download as incomplete until it is finished, at which point the \".crdownload\" extension is removed.", "Windows, Mac, Linux, ", "['Google Chrome']['Google Chrome']['Google Chrome']"], "crc": ["Total Commander Checksum File", "File created by Total Commander, a program used to organize and manage files in Windows; contains a Cyclic Redundancy Check (CRC) code for a split archive; used to verify that files from a split archive have correctly been restored back to the original file.", "Windows, ", "['Ghisler Total Commander']"], "crash": ["Mac OS X Crash Log File", "Log file created by CrashReporter, a built-in Mac OS X program that records data from program crashes; stores information about the state of the computer at the time of a crash; includes timestamp, program, and memory dump information; used to report and debug problems with applications.", "Mac, ", "['Apple TextEdit']"], "crd": ["Guitar Tabs", "Includes song lyrics with matching guitar chords and tabs.", "Windows, Mac, Windows, ", "['text editor']['text editor']['Microsoft Windows CardSpace', 'AZZ Cardfile']"], "cram": ["Compressed Alignment File", "Compressed alignment file format developed by EBI, an outstation of the European Molecular Biology Laboratory; stores short DNA sequence read alignments generated from short read aligners such as BWA, BBMap, and BLAT.", "Windows, ", "['Samtools']"], "cr2": ["Canon Raw Image File", "A CR2 file is a raw camera image created by Canon digital cameras.  It stores uncompressed image data exactly how it was captured by the CCD.  CR2 files can be adjusted for white balance and exposure using several image-editing software programs, including the software bundled with Canon digital camera purchases.", "Windows, Mac, Linux, iOS, Android, Windows, Mac, ", "['File Viewer Plus', 'Adobe Photoshop CC 2017', 'Microsoft Windows Photos', 'Adobe Photoshop Elements 15', 'ACD Systems ACDSee 20', 'ACD Systems Canvas X 2017', 'IrfanView', 'Google Picasa', 'Microsoft Windows Live Photo Gallery', 'GIMP with UFRaw plug-in', 'FastStone Image Viewer']['Apple Photos', 'Adobe Photoshop CC 2017', 'Adobe Photoshop Elements 15', 'Snap Converter', 'Google Picasa', 'GIMP with UFRaw plug-in', 'MacPhun ColorStrokes']['GIMP with UFRaw plug-in', 'gphoto2', 'MATE', 'gThumb']['Adobe Photoshop Express']['File Viewer for Android', 'Adobe Photoshop Express']['Smith Micro Poser 11', 'DAZ 3D DAZ Studio 4', 'Autodesk 3ds Max with PMorphTools']['Smith Micro Poser 11', 'DAZ 3D DAZ Studio 4']"], "cpy": ["3ds Max Copy Track File", "Animation file created by 3ds Max, a 3D modeling and animation program; saves an animation track for selected objects from a biped (two-footed figure); includes the gestures and posture information; allows modelers to reuse biped poses and animations.", "Windows, Windows, ", "['Autodesk 3ds Max 2017'][]"], "cpx": ["Oracle ADF Binding Context File", "File used by Oracle Application Development Framework (ADF) applications; contains Web page tracking definitions as well as data bindings that map pages to data sources; created when a data control is dropped onto a Web page using the JDeveloper HTML Visual Editor.", "Windows, Mac, Linux, Windows, Windows, ", "[][][][]['CorelDRAW Graphics Suite X8']"], "cpvc": ["Adobe Captivate Video Composition", "A CPVC file is a video composition created and used by Captivate, a program used to develop interactive eLearning products.  It contains a video clip that can be copied, cut, or trimmed.  CPVC files may also include text captions, non-interactive objects, smart shapes, images, animations, and highlight boxes.", "Windows, Mac, ", "['Adobe Captivate']['Adobe Captivate']"], "cptx": ["Adobe Captivate Project File", "A CPTX file is a project file created by Adobe Captivate, a screen capture application used to create multimedia eLearning products.  It contains one or more slides that may include screen recordings, audio, or other interactive content.  CPTX files are used for authoring learning management system (LMS) products such as software demonstrations, simulations, and quizzes.", "Windows, Mac, ", "['Adobe Captivate']['Adobe Captivate']"], "cpn": ["Age of Mythology Campaign File", "Game campaign used by Age of Mythology, a real-time strategy game where players build kingdoms and control armies; contains one or more .SCN scenario files; also includes scenario descriptions, the campaign name and version, and the total number of scenarios included; can be used to store custom campaigns.", "Windows, ", "['Microsoft Age of Mythology', 'Microsoft Age of Empires', 'Microsoft Age of Empires 2', 'CPNBUILD']"], "cptm": ["Captivate Theme File", "A CPTM file is a theme created and used by Adobe Captivate, a program used to create eLearning content.  It stores a project theme, which consists of data that defines a project's layout, colors, fonts, and effects.", "Windows, Mac, ", "['Adobe Captivate']['Adobe Captivate']"], "cps": ["The Powder Toy Save File", "File created by The Powder Toy, a 2D physics game used for simulating particles, air pressure, gravity, and heat; stores the data for the simulation in a compressed format; can be distributed to others to share simulations.", "Windows, Mac, Linux, Windows, Mac, Windows, ", "['hardWIRED The Powder Toy']['hardWIRED The Powder Toy']['hardWIRED The Powder Toy']['Adobe Captivate']['Adobe Captivate'][]"], "cpr": ["Cubase Project", "Audio production project created by Cubase, a Digital Audio Workstation (DAW) application; stores project data such as audio and MIDI tracks, software instruments, audio effects, and mixer settings; also contains references to audio file assets.", "Windows, Mac, Windows, Windows Phone, Windows, Mac, Windows, ", "['Steinberg Cubase']['Steinberg Cubase']['CHome Visual Editor', 'Microsoft XML Notepad', 'Microsoft Notepad', 'text editor'][]['Adobe Captivate']['Adobe Captivate'][]"], "cpt": ["Corel Photo-Paint Image", "A CPT file is a bitmap image created by Corel PHOTO-PAINT, a photo editing program that is part of the CorelDRAW Graphics Suite.  It contains an image that supports layers, alpha channels, transparency, and other image effects.  CPT files are used by amateur and professional photographers and graphic designers for storing touched up photos.", "Windows, Mac, Windows, Mac, Linux, Mac, Windows, Mac, Windows, ", "['CorelDRAW Graphics Suite X8', 'Corel PaintShop Pro X9', 'Corel Presentations X8', 'XnViewMP']['XnViewMP'][][][]['Smith Micro StuffIt Deluxe 16', 'The Unarchiver'][]['Apple DVD Studio Pro']['Microsoft ActiveSync']"], "cpq": ["Compaq OEM Disc Configuration File", "File found on Compaq OEM system restore discs, which are called Compaq Restore Plus! CDs; uses the filename OSLANG.CPQ and contains configuration information for restoring the original Windows operating system on the computer.", "Windows, ", "['Microsoft Notepad', 'text editor']"], "cpp": ["C++ Source Code File", "A CPP file is a source code file written in C++, a popular programming language that adds features such as object-oriented programming to C.  It can be a standalone program or one of many files references in a development project.  CPP files must be compiled by a C++ compiler for the target platform before run.", "Windows, Mac, Linux, ", "['File Viewer Plus', 'Microsoft Visual Studio 2017', 'Eclipse CDT', 'Code::Blocks', 'Embarcadero Technologies C++ Builder', 'ES-Computing EditPlus', 'BloodshedSoftware Dev-C++']['Apple Xcode', 'Code::Blocks', 'Eclipse CDT', 'GNU Compiler Collection (GCC)', 'MacroMates TextMate', 'Freescale CodeWarrior Development Tools']['Eclipse CDT', 'Code::Blocks', 'GNU Compiler Collection (GCC)']"], "cpmz": ["Miradi/ConPro Project File", "Project file created with either Miradi or ConPro, the Conservation Projects Database; designed to enable data exchanges between Miradi and ConPro; contains data used for creating and monitoring conservation plans.", "Windows, Mac, Linux, ", "['Benetech Miradi']['Benetech Miradi']['Benetech Miradi']"], "cpl": ["Windows Control Panel Item", "A CPL file is a control panel item, such as Displays, Mouse, Sound, or Networking, used by the Windows operating system.  It is stored in the Windows\\System folder and loaded automatically when the Windows Control Panel is opened.", "Windows, ", "['Microsoft Windows']"], "cpi": ["AVCHD Video Clip Information File", "Clip information file created by various high definition (HD) digital video camcorders; contains metadata describing an AVCHD video stream, such as the frame rate, frames per second, and aspect ratio; used to describe an .MTS video stream.", "Windows, Mac, Windows, ", "['Adobe Premiere Pro CC 2017', 'Roxio Creator NXT Pro 5', 'CyberLink PowerDirector 15 Ultra', 'Pinnacle Studio 20', 'Corel VideoStudio Pro X10 Ultimate', 'MAGIX Vegas Pro 14']['Adobe Premiere Pro CC 2017', 'Roxio Popcorn']['Microsoft Windows']"], "cpk": ["CRI Middleware Package", "Game package file used by games created with the CRI Middleware packaging software; can store graphics, audio, and other game data; used as a container for game files.", "Windows, Windows, ", "[]['Microsoft DTM Log Viewer', 'Microsoft Winqual Submission Tool']"], "cph": ["Corel Print House File", "Printing project created with Corel Print House, a desktop publishing program; used for designing scrapbooks, greeting cards, banners, calendars, invitations, and printable documents.", "Windows, Mac, ", "[][]"], "cpio": ["Unix CPIO Archive", "File archive created in the Unix CPIO (Copy In, Copy Out) format, an uncompressed file container format used for grouping files together; similar to a .TAR archive and can be compressed into a .CPGZ file using Gzip compression.", "Windows, Mac, Linux, ", "['File Viewer Plus', 'PeaZip', 'Apache Commons Compress']['Apple Archive Utility', 'Incredible Bee Archiver', 'Apache Commons Compress', 'ditto', 'The Unarchiver']['GNU cpio', 'ditto', 'Apache Commons Compress']"], "cpgz": ["Compressed CPIO Archive", "Compressed archive that combines the Copy In, Copy Out (.CPIO) archive format and gzip (.GZ) compression; similar to a .TGZ file, which incorporates both an uncompressed .TAR container and gzip compression; most often used on Unix-based systems such as Linux and Mac OS X.", "Mac, Linux, ", "['Apple Archive Utility', 'The Unarchiver', 'ditto']['ditto']"], "cpg": ["ESRI Code Page File", "Character encoding file used by ESRI software products such as the ArcGIS Desktop suite; describes a set of characters for displaying text in shapefiles; helps localize maps for specific languages.", "Windows, Windows, Mac, Windows, Mac, Windows, ", "['ESRI ArcGIS for Desktop']['CELSYS Clip Studio Paint Pro']['CELSYS Clip Studio Paint Pro']['Blizzard StarCraft']['Blizzard StarCraft']['3Dize Cool Page']"], "cpf": ["Cognos Project File", "Project file created by Cognos Framework Manager, a data modeling tool included with IBM Cognos Business Intelligence (BI) software; contains data \"metamodels\" that that organize BI data from underlying databases; provides the means to store data models that can be used for BI analysis.", "Windows, Windows, ", "['IBM Cognos Business Intelligence']['Microsoft Makecab']"], "cpdx": ["Adobe Captivate Storyboard Project", "A CPDX file is a storyboard project file created by Adobe Captivate Draft, an iOS app used to create storyboards for eLearning content.  It contains one or more slides, which may include text, drawn objects, web objects, and embedded media (audio, videos, and images).  CPDX files are commonly used for planning quizzes, software demonstrations, and simulations.", "Windows, Mac, iOS, ", "['Adobe Captivate']['Adobe Captivate']['Adobe Captivate Draft']"], "cpe": ["Fax Cover Page File", "File created by Fax Cover Page Editor, a program used for creating fax cover pages; saves the page layout and content information for a cover page; often includes the company logo and the sender's contact information; can be used as a shared template for company faxes.", "Windows, ", "['Microsoft Fax Cover Page Editor']"], "cpc": ["CPC Compressed Image File", "Bitmap image compressed using the Cartesian Perceptual Compression (CPC) algorithm; designed for compressing 1-bit raster images, such as black-and-white photographs and line art; often used for compressing monochrome design layouts, legal documents, and other types of scanned text files.", "Windows, Mac, Linux, ", "['Microsoft Internet Explorer with Cartesian Products CPC View ax plugin', 'Mozilla Firefox with CPC Lite pi plugin']['Apple Safari with Cartesian Products CoPyCat plugin']['Mozilla Firefox with Cartesian Products CoPyCat plugin']"], "cpd": ["RoboHelp Cache Project Database", "Database file created by RoboHelp, a program used for authoring Windows help documentation; stored as part of a RoboHelp project (.XPJ) and contains cached information for the project; should not be opened or edited manually.", "Windows, Windows, Mac, ", "['Adobe RoboHelp']['Apple QuickTime Player with the PhotoDefiner component']['Apple QuickTime Player with the PhotoDefiner component']"], "cpb": ["Comicino Studio Project File", "File created by Comicino Studio, a rapid application development tool for Web, desktop, and mobile applications; saves a collection of user interface pages, which each may contain text, graphics, and interactive elements; can be compiled and deployed to iOs, Android, Windows, and Web platforms.", "Windows, ", "['Comicino Media Comicino Studio']"], "cpaa": ["Captivate Shared Action File", "A CPAA file is a shared action file created and used by Adobe Captivate, an application that allows users to create multimedia eLearning content.  It contains advanced actions that can be applied to different projects.", "Windows, Mac, ", "['Adobe Captivate']['Adobe Captivate']"], "cpa": ["CADSTAR PCB Archive File", "CAD file created by CADSTAR, an application used to create printed circuit board (PCB) designs; may contain a PCB design or a PCB component library; used for exporting, importing, and archiving designs.", "Windows, ", "['Zuken CADSTAR', 'Altium Designer']"], "cp9": ["ChoicePoint Encrypted File", "E-mail attachment encrypted using ChoicePoint NSA (National Safety Alliance) encryption; will open when double-clicked if the ChoicePoint decryption software is installed", "Windows, ", "[]"], "cp3": ["Grand Prix 3 Cockpit Shape File", "Custom race car cockpit shape created with the Grand Prix 3 Cockpit Editor; includes the steering wheel and internal controls; can be imported into Grand Prix 3 and used to customize the look and feel of a race car.", "Windows, ", "[]"], "cp": ["Xcode C++ Source File", "Source code file written in the C++ programming language; used by Apple Xcode development software and may be referenced by other source files within a programming project.", "Mac, Windows, Mac, ", "['Apple Xcode']['Adobe Captivate']['Adobe Captivate']"], "course": ["Super Mario ReMaker Course File", "A COURSE file is a course created by Super Mario ReMaker, a Super Mario game that allows you to design your own levels and play them.  It contains a course, which includes the course width (length of the course), course time (the time specified to complete a course), and the placement of objects in the course.", "Windows, ", "['Super Mario Remaker']"], "coverage": ["Visual Studio Code Coverage Report", "A COVERAGE file is a data file created by Visual Studio, a software development tool used for creating Windows programs and web applications.  It contains a coverage report, which includes the proportion of your code that was tested by a coded test.  COVERAGE files may be generated for managed (command line interface) and unmanaged (native) code.", "Windows, ", "['Microsoft Visual Studio 2017']"], "cox": ["Click & Create Extension", "Created by Clickteam; adds extra capabilities to Multimedia Fusion and The Games Factory (TGF).", "Windows, ", "['Clickteam Multimedia Fusion', 'Clickteam The Games Factory']"], "cov": ["Fax Cover Page File", "File created by Microsoft Fax Cover Page Editor, a fax program included with Windows Business, Ultimate, and Enterprise editions; saves the page layout structure, text, and graphics for a fax cover page; often contains company logos, the company name, and the sender's address; used for fax transmissions.", "Windows, ", "['Microsoft Fax Cover Page Editor']"], "cosessiondb": ["Capture One Session File", "A COSESSIONDB file is a session file created by Capture One, a program used for managing digital photos.  It stores a collection of photos that have been selected by the user and organized as an album.  COSESSIONDB files are used to organize your work as a project.", "Windows, Mac, ", "['Phase One Capture One']['Phase One Capture One']"], "cos": ["Capture One Settings File", "Image settings file created by Capture One, a program used for editing and organizing digital photos; saves image adjustments (exposure, color temperature, white balance, etc.) and other nondestructive edits for a photo.", "Windows, Mac, Windows, ", "['Phase One Capture One']['Phase One Capture One'][]"], "cor": ["Trimble Corrected SSF File", "File created by Trimble GIS programs, which are used to record and maintain GPS data; contains a corrected .SSF file that has undergone differential postprocessing, a technique that improves the accuracy of recorded positions from a GPS device.", "Windows, Windows, ", "[]['CorelDRAW Graphics Suite X8']"], "copy": ["Sony Ericsson Protected Content File", "Proprietary DRM (Digital Rights Management) copy-protected file format used by Sony Ericsson mobile phones", "Windows, ", "[]"], "contact": ["Windows Contact File", "Contact file created by Windows Contacts, a built-in contact management program included with Windows Vista and Windows 7; contains information about a person or organization, including name, picture, email address, phone number, home and work addresses, professional titles, and family members; located in the Windows \"Contacts\" folder for each Windows user.", "Windows, ", "['Microsoft Windows Contacts', 'Microsoft Windows Live Mail', 'Microsoft Windows Mail']"], "copreset": ["Capture One Preset File", "Settings file used by Capture One, a professional photo editing and management application; saves presets that can be applied to multiple photos; can be included in a style (.COSTYLE) with other presets.", "Windows, Mac, ", "['Phase One Capture One']['Phase One Capture One']"], "contour": ["Contour Screenplay File", "Movie script created by Contour, a program used to create screenplay outlines; stores written ideas according to the Contour story development philosophy; used for storing the step-by-step screenplay structure of a movie.", "Windows, Mac, ", "['Mariner Contour']['Mariner Contour']"], "consis": ["Sciral Consistency Document", "A CONSIS file is a document used by Sciral Consistency, a program for organizing tasks that need to be repeated.  It stores a calendar with user-added tasks such as exercising, watering houseplants, taking out the trash, vacuuming the carpet, and clearing voicemail.", "Windows, Mac, iOS, ", "['Sciral Consistency']['Sciral Consistency']['Sciral Consistency']"], "conform": ["Conformalizer Change List File", "File exported by Conformalizer, an audio post production program used for conforming produced audio to a video; saves data for conforming input Pro Tools sessions, FX lists, or ADR databases to a picture cut; incorporates a change Edit Decision List (.EDL) and associated metadata.", "Mac, ", "['The Cargo Cult Conformalizer']"], "configprofile": ["Apple Configuration Profile", "Configuration file created for the Mac operating system; located in System Preferences, an application included on the Mac platform; contains setup information, such as password policies, Wi-Fi settings, access permissions, and proxy connection information.", "Mac, ", "[]"], "config": ["Configuration File", "A CONFIG file is a configuration information file used by various applications.  It contains plain text parameters that define settings or preferences for building or running a program.  CONFIG files are often referenced by software development programs for configuring applications.", "Windows, Mac, ", "['File Viewer Plus', 'Microsoft Visual Studio 2017', 'Adobe Dreamweaver CC 2017', 'Microsoft Notepad', 'Microsoft WordPad']['Adobe Dreamweaver CC 2017', 'Apple TextEdit', 'MacroMates TextMate']"], "conf": ["Unix Configuration File", "Configuration or \"config\" file used on Unix and Linux based systems; stores settings for system processes and applications; similar to a .CFG file found on Windows and Macintosh systems.", "Mac, Linux, Windows, Mac, Linux, ", "['MacroMates TextMate']['GNU Emacs', 'Pico']['File Viewer Plus', 'Microsoft Notepad', 'Microsoft WordPad', 'gVim', 'Kingsoft Writer', 'text editor']['Apple TextEdit', 'MacroMates TextMate', 'Bare Bones TextWrangler', 'text editor']['GNU Emacs', 'gedit', 'text editor']"], "con": ["Battlefield 1942 Configuration File", "File used by Battlefield 1942, a World War II first-person shooter game; saved in plain text and contains configuration information for the game, including video and input control settings; often used for fine-tuning game \"mods.\"", "Windows, Windows, Linux, ", "['Electronic Arts Battlefield 1942']['Web browser'][]"], "compositiontemplate": ["Invantive Composition Template", "Template used by Composition, a module that can be added to Microsoft Word to combine Word documents with data from databases and other programs; contains information that defines the layout of the document and the placement of data from the Composition data model file (.COMPOSITIONMODEL).", "Windows, ", "['Invantive Composition']"], "compositefont": ["Windows Composite Font File", "XML file used by Windows applications to display different fonts; contains definitions of font families and includes each font family's name, weight, style, underlining, and strikethrough setting; can be used to build multilingual fonts or to provide a fallback mechanism for specific characters that are missing on the system.", "Windows, ", "['Microsoft Visual Studio 2017', 'Microsoft XML Notepad', 'text editor']"], "component": ["Mac OS X System Component", "Adds functionality and support for various system services, such as audio and video recording and playback, Dictionary services, and AppleScript. ", "Mac, ", "['Apple OS X']"], "compiled": ["Compiled Game Resource File", "Game resource file format used to define the placement of body parts and character movements in the Plants vs. Zombies (PvZ) game; commonly found in a PvZ game that has been hacked in order to modify the characters and their movements. ", "Windows, Mac, iOS, Android, Windows Phone, ", "['PopCap Games Plants vs. Zombies']['PopCap Games Plants vs. Zombies']['PopCap Games Plants vs. Zombies']['PopCap Games Plants vs. Zombies']['PopCap Games Plants vs. Zombies']"], "comp": ["Fusion Composition File", "Composition file created by Fusion, an advanced compositing software used for creating visual effects; stores a Fusion project, which includes render range, animated polygon style masks, frame types, and timeline settings.", "Windows, Mac, ", "['Blackmagic Design Fusion']['Blackmagic Design Fusion']"], "comicdoc": ["Comic Life Document", "Comic book or picture album created with Comic Life; used for creating comic books, storyboards, comic strips, photo layouts, and other visual documents; may be created from a template or from scratch; can include images, photos, and bendable comic lettering text.", "Windows, Mac, ", "['plasq Comic Life']['plasq Comic Life']"], "command": ["Terminal Command File", "Script file created for Terminal, the command line utility included with Mac OS X; contains plain text shell commands; used for executing commands automatically as if they were typed successively at the command line.", "Mac, ", "['Apple Terminal', 'Apple TextEdit', 'MacVim', 'text editor']"], "comiclife": ["Comic Life Document", "A COMICLIFE file is a document created by Comic Life, an application used to create comic books, scripts, picture albums, and other visual documents.  It stores one or more pages with custom layouts, which include text and images.  COMICLIFE files replaced .CL2DOC files as the default format for saving documents in Comic Life with the release of version 3.", "Windows, Mac, iOS, ", "['plasq Comic Life']['plasq Comic Life']['plasq Comic Life']"], "costyle": ["Capture One Style File", "Image styles file created by Capture One, a program used for editing and managing digital photos; stores image appearance settings that allow users to give an image a certain look or feel; can also store presets (.COPRESET files) containing metadata such as a personal signatures or copyright information.", "Windows, Mac, ", "['Phase One Capture One']['Phase One Capture One']"], "com": ["DOS Command File", "A COM file is an executable program capable of being run by MS-DOS and Windows.  It is saved in a binary format and is similar to an .EXE file, but differs in that it has a maximum size of roughly 64KB and it has no header or metadata.  COM files are commonly used for executing a set of instructions whereas EXE files are used for fully developed programs.", "Windows, Mac, ", "['Microsoft Windows']['Parallels Desktop for Mac with Windows installed']"], "colz": ["Adobe Collage File", "File created by Adobe Collage, an Adobe Touch App used for creating modern moodboards; may contain graphics and other content from .PDF, .PSD, and .AI files; can also include hand-drawn pen graphics and text; may be uploaded and shared on the Adobe Creative Cloud.", "Windows, Mac, ", "['Adobe Photoshop with Adobe Collage COLZ script']['Adobe Photoshop with Adobe Collage COLZ script']"], "colorpicker": ["Color Picker Plugin", "Plug-in for Apple's Color Picker, a color selection tool built in to Mac OS X; adds a color selection option to the Color Picker, such as crayons or an RGB color wheel.", "Mac, ", "[]"], "collab": ["Blackboard Collaborate Session File", "A COLLAB file is a session file used by Blackboard Collaborate Launcher, a utility that allows users to launch Blackboard Collaborate web conferencing sessions and recordings.  It contains a link to a conferencing session or recording that launches Blackboard Collaborate and brings the user to the session or recording.", "Windows, Mac, ", "['Blackboard Collaborate Launcher']['Blackboard Collaborate Launcher']"], "col": ["Capture One Session File", "A COL file is a session file created by Capture One, a program used for managing digital photos.  It stores an organized collection of photos selected by the user and supports folders and virtual albums.  COL files are often used for organizing pictures from trips or photo shoots together.", "Windows, Mac, Windows, ", "['Phase One Capture One']['Phase One Capture One']['Rockstar Games Grand Theft Auto 3', 'Collision File Editor']"], "cof": ["MPLAB COFF File", "Common Object File Format (COFF) executable file created by MPLAB IDE, an IDE used to program embedded applications for Microchip Technology's PIC and dsPIC microcontrollers; stores machine code and debugging information for the program.", "Windows, ", "['Microchip Technology MPLAB IDE']"], "cob": ["COBOL Source Code File", "Source code file written in COBOL, an older programming language used for developing business, finance, and administrative applications; still used by many enterprise business applications.", "Windows, Mac, Linux, ", "['IBM COBOL', 'GnuCOBOL', 'Alchemy Solutions NetCOBOL']['GnuCOBOL']['TinyCOBOL', 'GnuCOBOL']"], "codasite": ["Coda Site File", "Website project file created by Coda, a program used for creating and publishing webpages; stores the list of Web files for the project (i.e., .HTML, .CSS, .JS, and other supported types); also includes the publishing information for the remote server.", "Mac, ", "['Panic Coda 2']"], "cod": ["Compiled Source Code", "Compiled source code written in Fortran, dBASE, or Java 2 Platform, Micro Edition (J2ME); may also be created with Research In Motion's BlackBerry Java Development Environment (JDE).", "Windows, Windows, ", "['Microsoft Visual Studio 2017', 'dBase', 'BlackBerry JDE']['Rising Sun Solutions Atlantis Word Processor']"], "codaplugin": ["Coda Plug-in", "Plugin file used by Coda web development software; contains a plugin that adds new features to the software, such as support for additional languages, website backups, or source code validation.", "Mac, ", "['Panic Coda 2']"], "cnv": ["Canvas 6-8 Drawing File", "Canvas drawing format used by versions 6 through 8; can contain both vector graphics and raster graphics, but typically includes mainly vector images.", "Windows, Mac, ", "['ACD Systems Canvas X 2017', 'ACD Canvas 9 Viewer', 'ACD Systems ACDSee 20']['ACD Canvas 9 Viewer']"], "cnt": ["Help Contents File", "Help file used by Windows and Windows applications; stores topics for a Help document (.HLP file) in a plain text format; commonly installed with an application that uses Microsoft Help as the help documentation format.", "Windows, ", "['Microsoft HTML Help Workshop']"], "cns": ["M.U.G.E.N. Character States File", "Game properties file used by M.U.G.E.N. (or just Mugen), a free 2D fighting game engine; stores character states, which are the positions that the fighters assume after an event has occurred, such as jumping or receiving a punch or kick.", "Windows, ", "['Elecbyte M.U.G.E.N.']"], "cng": ["CryptoNG Encrypted Archive", "File created by CryptoNG, a program used for creating encrypted archives; incorporates an AES-256 encryption algorithm and requires a password in order to decrypt the archive back to the original set of files.", "Windows, ", "['CryptoNG']"], "cnm": ["NoteMap Outline File", "File created by LexisNexis NoteMap Outline, a program used for making outlines; stores a text document using an outline structure; includes indented topics, subpoints, and other notes; often used in legal environments for case analysis and assessment.", "Windows, ", "['LexisNexis NoteMap']"], "cnf": ["MySQL Configuration File", "Configuration file used by MySQL, an open source relational database program; contains settings such as the default character encoding, timeouts, and cache and buffer settings; often modified to fine-tune performance depending on the use of the database.", "Windows, Mac, Linux, Windows, Mac, ", "['MySQL']['MySQL']['MySQL'][][]"], "cndx": ["Avery DesignPro for Mac Label File", "Document created by Avery DesignPro for Mac, a program used for making labels, business cards, greeting cards, and other page layout designs; can include text, clip art, various gradients and shapes, as well as other design elements.", "Mac, ", "['Avery DesignPro']"], "cnd": ["Melco Condensed Embroidery File", "File used by Melco embroidery machines; contains a stitch design and supports vector graphics that allow the design to be resized without losing quality; not supported by many embroidery software programs.", "Windows, ", "['Dakota AlphaSizer', 'Coats EDV', 'Melco Sizer']"], "cnc": ["CNC Machine Tool Path", "A CNC file is a path file created by QuickCAM Pro, a program used to create cutter paths for machining 3D parts on a milling machine.  It contains path instructions for cutting a 3D part using a CNC milling machine.  CNC files can can be created from 3D models or 2D images.", "Windows, Windows, ", "['Denford QuickCAM Pro']['Dolphin Cad Cam PartMaster']"], "cna": ["Catena Project File", "Project file created with Catena, a business performance optimization program used for improving quality, service, and profitability; saved in a project folder along with a Toolkit folder that contains other project data.", "Windows, ", "[]"], "cmx": ["Corel Metafile Exchange Image File", "Image file format used by Corel programs, such as CorelDRAW, Corel Presentations, and Paint Shop Pro; also used for storing vector-based image files included with Corel Mega Gallery Clip Art; includes image data as well as metadata that describes the image.", "Windows, Mac, Linux, ", "['CorelDRAW Graphics Suite X8', 'Corel PaintShop Pro X9', 'Corel Presentations X8', 'ACD Systems Canvas X 2017', 'Adobe Illustrator CC 2017', 'Inkscape']['Inkscape']['Inkscape', 'sK1']"], "cmz": ["Compressed Poser Camera Set File", "Compressed camera set file used by Poser, a 3D figure modeling and animation program; includes positions of cameras used by Poser; determines the viewing perspectives of a Poser model or scene.", "Windows, Mac, ", "['Smith Micro Poser 11']['Smith Micro Poser 11']"], "cms": ["Content Management System", "Web page published via a content management system (CMS), an automated system used for publishing documents to the Web; often based on the same template as other pages and is generated dynamically on the Web server.", "Windows, Mac, Windows, ", "['Web browser']['Web browser']['Microsoft Connection Manager Administration Kit']"], "cmrec": ["Camtasia Recording", "Screen recording file created by Camtasia,  a screen recording and video editing program; contains audio and video captured as the user interacts with the computer during a screen recording session; used for storing tutorial and demonstration content; saved as part of a .CMPROJ screen recording project.", "Mac, ", "['TechSmith Camtasia for Mac']"], "cmr": ["Coach Results File", "Results file created and used by Coach, a Dutch computer modeling program that allows users to make dynamic models; contains all elements of a .CMA activity, such as pictures and texts, along with any user changes such as notes, measurement data, models, control programs, and calibrations.", "Windows, Windows, ", "['CMA Coach']['Naviter SeeYou']"], "cmproj": ["Camtasia Project File", "Project file created by Camtasia, a screen recording and video editing application; contains all media files, video edits, timeline settings, and project settings; often used for constructing software video tutorials and other demonstrations.", "Mac, ", "['TechSmith Camtasia for Mac']"], "cmp": ["Windows Connection Manager Profile", "Settings file created using Connection Manager, a suite of software components that enables system administrators to setup Windows remote connection profiles; saves information such as the username, password, and the phone number to dial.", "Windows, Windows, Windows, Windows, ", "['Microsoft Connection Manager Administration Kit']['HotDocs']['Siemens Solid Edge']['General CADD Pro']"], "cmod": ["Celestia Model", "Three-dimensional model file used by Celestia, a real-time universe visualization program; uses OpenGL technology for rendering and may be stored in either a binary or ASCII text format; used for displaying planets, stars, and other elements in space.", "Windows, Mac, Linux, ", "['Celestia']['Celestia']['Celestia']"], "cmmtpl": ["Camtasia MenuMaker Template", "Video production template used by Camtasia MenuMaker, a program included with the Camtasia Studio screen recording software; contains the default settings for creating a .CMMP MenuMaker project; can be used for creating multiple video menus with the same look and feel.", "Windows, ", "['TechSmith Camtasia Studio']"], "cml": ["Chemical Markup Language File", "XML file saved in the Chemical Markup Language (CML) format, a standard used to specify chemical information; contains descriptions of molecule structures or other chemical informatics data; used for exchanging and archiving chemical data.", "Windows, Mac, Linux, Windows, Windows, ", "['Avogadro', 'Bioclipse', 'Open Babel']['Avogadro', 'Bioclipse', 'Open Babel', 'iBabel']['Avogadro', 'Bioclipse', 'Open Babel']['TheGreenBow CryptoMailer']['Viva Media Crazy Machines']"], "cmmtheme": ["CleanMyMac Theme File", "User interface theme used by CleanMyMac, a program that improves Mac OS X performance by removing unwanted files; saves a visual theme that alters the appearance of the buttons, graphics, and other visual elements.", "Mac, ", "['MacPaw CleanMyMac']"], "cmmp": ["Camtasia MenuMaker Project", "Video project created by Camtasia MenuMaker, a program included with the Camtasia Studio screen recording application; stores graphics, menu text, and referenced video files; used for creating the user navigation menus for videos.", "Windows, ", "['TechSmith Camtasia Studio']"], "cmm": ["Corel Multimedia Manager Album", "Photo album used by Corel Multimedia Manager (included with CorelDRAW) for organizing and managing image files; can be opened with CorelDRAW 7 or later.", "Windows, ", "['CorelDRAW Graphics Suite X8']"]}