{"d": ["D Source Code File", "Source code written in the D programming language; similar to C++, but also influenced by C#, Java, and Eiffel; can be opened and edited in a text editor, but requires a D compiler to be compiled into an executable program.", "Windows, Mac, Linux, ", "['Code::Blocks', 'text editor']['Code::Blocks', 'MacroMates TextMate', 'text editor']['Code::Blocks', 'text editor']"], "dadiagrams": ["RemObjects Data Abstract Data Diagrams File", "Developer file created using the RemObjects SDK, a development application suite used for building middle-tier applications; contains a diagram of a database schemas that define how data is represented in the database.", "Windows, ", "['RemObjects SDK', 'RemObjects Data Abstract']"], "dad": ["RemObjects Data Abstract Driver File", "Driver file used by RemObjects middle-tier applications; contains a driver, which communicates with a database server to supply data for the middle-tier application; can be swapped out dynamically during runtime to switch data providers.", "Windows, ", "['RemObjects SDK', 'RemObjects Data Abstract']"], "dae": ["Digital Asset Exchange File", "3D interchange file format used for exchanging digital assets between multiple graphics programs; based on the COLLADA (COLLAborative Design Activity) XML schema, which is now owned and developed by Autodesk.", "Windows, Mac, Linux, ", "['Autodesk AutoCAD 2017', 'Autodesk 3ds Max with ColladaMax plugin', 'Autodesk Maya with ColladaMaya plugin', 'Bentley Systems MicroStation', 'DAZ 3D DAZ Studio 4', 'Trimble SketchUp', 'Adobe Photoshop CC 2017', 'Blender with Collada Plug-in for Blender']['Adobe Photoshop CC 2017', 'Apple Preview', 'Autodesk Maya with ColladaMaya plugin', 'DAZ 3D DAZ Studio 4', 'Trimble SketchUp', 'Cheetah3D', 'GLC_Player', 'Blender with Collada Plug-in for Blender']['Autodesk Maya with ColladaMaya plugin', 'GLC_Player', 'Blender with Collada Plug-in for Blender']"], "daf": ["Digital Anchor File", "Secure database file for the Digital Anchor database engine, a compact, robust, and portable database system; can store data in text and binary formats.", "Windows, ", "[]"], "dar": ["DAR Disk Archive", "A DAR file is an archive of a disk or group of files compressed with DAR (Disk ARchive) compression.  It is used for creating split-archives and incremental backups.  DAR files are designed as a replacement for the .TAR archive format.", "Linux, Windows, ", "[]['Sony DVD Architect']"], "dao": ["Disk at Once CD/DVD Image", "Duplicate disc created with CD/DVD Duplicator software; used by CD and DVD duplicator systems that can duplicate several discs at a time", "Windows, ", "['Smart Projects IsoBuster', 'EZB Systems UltraISO']"], "dal": ["DVD-lab Project File", "DVD authoring project created with DVD-lab  or DVD-lab PRO; contains project settings and references to media files that are included in the project; can be burned to a DVD disc when completed.", "Windows, Windows, ", "[][]"], "dap": ["Access Data Access Page", "Web page that is connected to an Access database; can also be used to distribute reports via the Web or e-mail; may serve as a data entry form or may generate interactive reports.", "Windows, Windows, Windows, ", "['Microsoft Access 2016'][]['Cengage Learning Diet Analysis Plus']"], "dam": ["DeltaMaster Analysis Model", "Model file created with DeltaMaster, a front-end for OLAP databases used primarily for analyzing business data; stores all settings that are not to be redefined for the analysis of the same data.", "Windows, Windows, Mac, Linux, ", "['Bissantz DeltaMaster']['DAME']['DAME']['DAME']"], "dacpac": ["SQL Server Data Tier Application Package", "Data package created by a Microsoft SQL Server data tier application; contains both the schema of data as well as the data records, or objects, themselves; used for providing data between SQL Server databases and vendor applications.", "Windows, ", "['Microsoft SQL Server 2016']"], "daconnections": ["RemObjects Data Abstract Connections File", "Database connection file used by Data Abstract, a database development application included with the RemObjects SDK; saves connection strings, pooling settings, and timeout values for one or more databases; used by the middle-tier RemObjects application to connect to a backend database.", "Windows, ", "['RemObjects SDK', 'RemObjects Data Abstract']"], "daconfig": ["RemObjects Data Abstract Configuration File", "Developer file used by the RemObjects SDK, a collection of programs used to build RemObjects middle-tier applications; used by Data Abstract server applications and contains the configuration for how to access data from a providing database, such as an RDBMS (relational database management system).", "Windows, ", "['RemObjects SDK', 'RemObjects Data Abstract']"], "dabriefcase": ["RemObjects Data Abstract File Briefcase", "Developer file used by Data Abstract, a data persistence program included with the RemObjects SDK; used as an application cache and stores application data between restarts; enables applications to run more quickly since data doesn't have to be reloaded.", "Windows, ", "['RemObjects SDK', 'RemObjects Data Abstract']"], "daa": ["PowerISO Direct-Access-Archive", "Proprietary disk image file format used by PowerISO, a disk imaging application; can be compressed, encrypted, password protected, and split into multiple volumes; used for mounting virtual file systems as disk drives, as well as protecting sensitive data.", "Windows, Mac, Linux, ", "['PowerISO', 'EZB Systems UltraISO', 'WinArchiver', 'DAA2ISO']['PowerISO', 'Twilight Edge DAA Converter'][]"], "da2": ["Ad-Aware License File", "License file used by Ad-Aware, a spyware detection program; contains software registration information; used for authenticating and activating a user license for a specific version of the software.", "Windows, Windows, Windows, ", "['Lavasoft Ad-Aware']['HammerTap DeepAnalysis']['AGiliTy']"], "dzt": ["DirectorZone Title File", "DVD authoring file used by PowerDirector, a program used to create DVDs; contains title screen graphics, animations, and text; used for creating DVD introductions; also used for sharing titles online through CyberLink's DirectorZone website.", "Windows, ", "['CyberLink PowerDirector 15 Ultra']"], "dzp": ["DirectorZone Particle Effect File", "A DZP file is a particle effect file used by PowerDirector, a DVD authoring program.  It is used for authoring dynamic content into DVD menus and menu navigation.  DZP files may contain static graphical objects, motion objects, or particles, which are video effect animations. ", "Windows, ", "['CyberLink PowerDirector 15 Ultra']"], "dzm": ["DirectorZone Menu Template", "A DZM file is a DVD menu template used by PowerDirector and PowerProducer video editing applications.  It is designed for authoring DVDs.  DZM files contain multimedia data for creating a DVD menu, which includes navigation settings, background graphics, videos, formatted text and buttons, and audio.", "Windows, ", "['CyberLink PowerDirector 15 Ultra', 'CyberLink PowerProducer 6']"], "dzip": ["The Witcher 2 Game Archive", "File used by The Witcher 2: Assassins of Kings, a third person role-playing game; used as a container format for game content and may store various types of data, including models, textures, sounds, and other game data.", "Windows, ", "['CD Projekt The Witcher 2: Assassins of Kings']"], "dz": ["Land of the Dead Level File", "Game file used by Land of the Dead: Road to Fiddler's Green, a zombie first-person shooter game; saves the structure of a level and includes terrain, buildings, items, and other map features; stored in the \\Land of the Dead\\Levels\\ directory.", "Windows, Windows, Mac, Linux, ", "['Unreal Tournament Package Tool']['Dzip']['Dzip']['Dzip']"], "dxx": ["AutoCAD Drawing Interchange Attribute File", "Data file created by AutoCAD, an application used for creating 3D design drawings; may contain drawing block reference, attribute, and end-of-sequence objects; can only store a subset of information that can be saved in a .DXF file.", "Windows, ", "['Autodesk AutoCAD 2017']"], "dxr": ["Protected Macromedia Director Movie", "Movie or animation created with Macromedia Director; similar to a .DIR file, but is saved in a non-editable, or locked format; may be used for distributing Director files to users who do not need to edit the contents of the Director movie.", "Windows, Mac, ", "['Adobe Director', 'Adobe Shockwave Player', 'Echo One iSwiff', 'dirOpener']['Adobe Director', 'Adobe Shockwave Player', 'Echo One iSwiff']"], "dxp": ["CDBurnerXP Data Compilation File", "Data disc compilation file created by CDBurnerXP, a program used to burn data and music discs; contains a list of files and directories to burn, as well as the file sizes and the target directory structure; saved in an XML format.", "Windows, Windows, Windows, ", "['Canneverbe CDBurnerXP']['Dexpot']['Duxbury Braille Translator', 'Duxbury MegaDots']"], "dxls": ["DashXL Skin Set File", "Skin file used by DashCommand, program used for monitoring on-board diagnostics II (OBD-II) automotive data; contains files that specify the appearance of the dashboard, which shows different diagnostics tools; allows the dashboard to be customized.", "Windows, ", "['Palmer Performance Engineering DashCommand', 'Palmer Performance Engineering DashXL Skin Editor']"], "dxl": ["Domino XML Language File", "XML database file created for Lotus Domino, an enterprise level business collaboration software; may store data from a Lotus Domino database as well as schemas, design elements, views, forms, and documents; provides an export and interchange format for the database.", "Windows, Mac, Linux, Windows, ", "['IBM Domino', 'IBM Lotus Domino Designer', 'Microsoft XML Notepad', 'Microsoft Notepad', 'gVim', 'text editor']['IBM Lotus Domino Designer']['IBM Domino', 'IBM Lotus Domino Designer', 'Vim', 'text editor']['IBM Rational DOORS', 'Microsoft Notepad', 'text editor']"], "dxf": ["Drawing Exchange Format File", "A DXF file is a data file saved in a format developed by Autodesk and used for CAD (computer-aided design) vector image files, such as AutoCAD documents.  DXF files are similar to .DWG files, but are more compatible with other programs since they are ASCII (text) based.", "Windows, Mac, Linux, Android, ", "['Autodesk AutoCAD 2017', 'Autodesk DWG TrueView', 'Autodesk Design Review', 'IMSI TurboCAD Pro 2017', 'CorelCAD 2017', 'ACD Systems Canvas X 2017', 'Adobe Illustrator CC 2017', 'Dassault Systemes SolidWorks eDrawings Viewer', 'CADSoftTools ABViewer']['Autodesk AutoCAD 2017', 'IMSI TurboCAD Deluxe v10', 'CorelCAD 2017', 'Dassault Systemes SolidWorks eDrawings Viewer', 'Adobe Illustrator CC 2017', 'Cheetah3D']['CADEMIA', 'LibreCAD']['AutoDWG DWGSee']"], "dxe": ["AutoCAD Data Extraction Template", "Template file used by AutoCAD, a 3D CAD application used for architectural drawing; contains properties that to be extracted from drawn objects; allows users to extract drawing data with the same properties from multiple drawings.", "Windows, ", "['Autodesk AutoCAD 2017']"], "dxb": ["Drawing Exchange Binary", "Vector image format used by Autodesk AutoCAD; stores 3D CAD drawings created by AutoCAD, such as building and landscape designs.", "Windows, Windows, ", "['Autodesk AutoCAD 2017']['Duxbury Braille Translator', 'Duxbury MegaDots', 'CASC Braille 2000']"], "dwt": ["Dreamweaver Web Page Template", "A DWT file is a template used to create multiple webpages in Dreamweaver, a popular web development program.  It contains a webpage with editable regions defined by the user and non-editable regions that affect all pages designed from the template.", "Windows, Mac, Windows, Mac, ", "['Adobe Dreamweaver CC 2017']['Adobe Dreamweaver CC 2017', 'MacroMates TextMate']['Autodesk AutoCAD 2017', 'CorelCAD 2017']['CorelCAD 2017']"], "dws": ["AutoCAD Drawing Standards File", "Drawing verification file used by AutoCAD, a 3D design and engineering CAD application; contains properties that must be conformed to in another drawing; used for defining drawing standards and for detecting violations during the checking process; can be used to specify standards for layer properties, dimension styles, linetypes, and text styles.", "Windows, Windows, Mac, Linux, Windows, Mac, ", "['Autodesk AutoCAD 2017']['Dyalog']['Dyalog']['Dyalog']['Adobe Dreamweaver CC 2017']['Adobe Dreamweaver CC 2017']"], "dwn": ["Firmware Update File", "Software update file that is used to update the firmware of a hardware device, such as a router, modem, or graphics card; typically accessed by the hardware's associated setup program.", "Windows, ", "[]"], "dwl": ["TurboCAD Drawing Lock File", "Lock file created by TurboCAD, a program used to draft 2D and 3D designs; stores lock information when a drawing (.TCW file) is opened in the program; used for preventing simultaneous access to a drawing, which may cause the file to become corrupted.", "Windows, ", "['IMSI TurboCAD Pro 2017']"], "dwi": ["Dance With Intensity Song File", "Song data file for Dance With Intensity (DWI), a PC version of Dance Dance Revolution (DDR); includes song data, background animations, and arrows that move with the rhythm of the song; supported by StepMania and other PC dance programs.", "Windows, Mac, Linux, ", "['StepMania']['StepMania']['StepMania']"], "dwlibrary": ["Paperless Document Library", "Digital document library created by Paperless, an application used to scan and organize electronic copies of documents; contains a collection of documents that have been scanned from paper copies; also stores metadata that has been captured with Mariner's optical character recognition (OCR) technology.", "Mac, ", "['Mariner Paperless']"], "dwfx": ["Design Web Format XPS File", "A DWFX file is a 2D or 3D drawing created with Autodesk CAD software.  It is saved in the DWFx format, which is similar to a .DWF file, but is formatted using Microsoft's XML Paper Specification (XPS).  DWFX files may contain 3D design data, object properties, and metadata.", "Windows, ", "['Autodesk AutoCAD 2017', 'Autodesk Design Review', 'Microsoft XPS Viewer']"], "dwg": ["AutoCAD Drawing Database File", "A DWG file is a database of 2D or 3D drawings created with AutoCAD, a professional CAD program.  It contains vector image data and metadata that describes the contents of the file.  DWG files are related to .DXF files, which are ASCII versions of DWG files.", "Windows, Mac, Linux, Web, iOS, Android, Windows Phone, ", "['Autodesk AutoCAD 2017', 'Autodesk Design Review', 'Autodesk DWG TrueView', 'AutoDWG DWGSee', 'CADSoftTools ABViewer', 'IMSI TurboCAD Pro 2017', 'TurboCAD LTE Pro 9', 'ACD Systems Canvas X 2017', 'CorelCAD 2017', 'GRAPHISOFT ArchiCAD', 'Dassault Systemes SolidWorks eDrawings Viewer', 'AnyDWG Any DWG to PDF Converter', 'Adobe Illustrator CC 2017', 'Serif DrawPlus', 'Bricsys Bricscad', 'Dassault Systemes DraftSight', 'Wout Ware DWG DXF Sharp Viewer']['Autodesk AutoCAD 2016', 'IMSI TurboCAD Deluxe v10', 'CorelCAD 2017', 'progeCAD iCADMac', 'GRAPHISOFT ArchiCAD', 'Microspot DWG Viewer', 'Dassault Systemes SolidWorks eDrawings Viewer', 'Adobe Illustrator CC 2017', 'Dassault Systemes DraftSight', 'Autodesk Fusion 360']['Bricsys Bricscad', 'Dassault Systemes DraftSight']['Autodesk Fusion 360', 'AutoDesk A360 Viewer']['Autodesk Fusion 360', 'AutoDesk AutoCAD 360']['AutoDWG DWGSee', 'Autodesk Fusion 360', 'AutoDesk AutoCAD 360']['Autodesk Fusion 360']"], "dwf": ["Design Web Format File", "2D/3D drawing format developed by Autodesk as a device independent and resolution independent drawing format for distributing designs; saved in a compressed format, which reduces file size; may contain design data, graphics, and text.", "Windows, Mac, Web, iOS, Android, ", "['Autodesk Design Review', 'IMSI TurboCAD Pro 2017', 'TurboCAD LTE Pro 9', 'CorelCAD 2017', 'AutoDWG DWGSee', 'ACD Systems Canvas X 2017', 'Safe Software FME Desktop', 'CAD Systems Unlimited Slick! ViewPlus']['IMSI TurboCAD Deluxe v10', 'CorelCAD 2017']['ShareCAD.org', 'AutoDesk A360 Viewer']['AutoDesk AutoCAD 360']['AutoDesk AutoCAD 360']"], "dwdoc": ["DrawWell Document", "Design or illustration created by DrawWell or WorkWell drawing and document creation tools; can be used for saving presentations, reports, and many other types of document designs; supports vector objects and multiple editing layers.", "Mac, ", "['DrawWell Technologies DrawWell', 'DrawWell Technologies WorksWell']"], "dwd": ["DavkaWriter File", "File created by DavkaWriter, an English and Hebrew word processor; supports a Hebrew keyboard, spell checker, Jewish calendar, and other features; contains formatted text, images, objects, fonts, etc.", "Windows, Windows, ", "['Davka Corporation DavkaWriter', 'Davka Corporation DavkaViewer'][]"], "dwc": ["Emulex DWC Firmware Update File", "Firmware update file for an Emulex networking device, such as a router, bridge, or switch; used to update or \"flash\" the firmware on the device; affects the kernel and components, but does not touch the POST code.", "Windows, ", "[]"], "dvx": ["DivX Video File", "Movie or video clip encoded using DivX, a high-quality video compression codec; can be played using DivX software or other video players that support the DivX codec.", "Windows, Mac, ", "['DivX 7 for Windows', 'Xilisoft Video Converter Ultimate', 'CyberLink PowerDVD 16', 'Apple QuickTime Player with DivX codec', 'Roxio Creator NXT Pro 5']['DivX 7 for Mac', 'Apple QuickTime Player with DivX codec', 'Roxio Toast 15']"], "dvtcolortheme": ["Xcode Color Theme File", "Color theme file used by Apple Xcode, an iOS and Mac OS X application development program; structured similar to a .PLIST file, formatted in XML; contains data that describes the color theme of the code editor; includes text color, text font, and text background color.", "Mac, ", "['Apple Xcode']"], "dvr": ["Microsoft Recorded TV Show", "Video file created by Windows Media Center, a Windows program that can record and playback television shows; contains the TV program information, the time recorded, and the video itself; saves video encoded in the MPEG-2 format; used for watching recorded TV shows.", "Windows, ", "['Microsoft Windows Media Center', 'Microsoft Windows Media Player']"], "dvr-ms": ["Microsoft Digital Video Recording", "Video format used for storing recorded television content; introduced in Microsoft Windows XP Media Center Edition; permits DVR functions such as time-shifting, pausing live TV, and simultaneous recording and playback; video is encoded as MPEG-2 and audio is encoded as MPEG-1 Layer II.", "Windows, ", "['Microsoft Windows Media Center', 'Microsoft Windows Media Player', 'Roxio Creator NXT Pro 5', 'Corel VideoStudio Pro X10 Ultimate', 'CyberLink PowerDVD 16', 'CyberLink PowerDirector 15 Ultra', 'CyberLink PowerProducer 6', 'Online Media Technologies AVS Video Converter']"], "dvl": ["Virtual Library File", "Image information format used by Dalim Software's electronic publishing programs; contains one or more pages with keywords, URLs, document structure information and other metadata.", "Windows, Mac, ", "[][]"], "dvo": ["Cook'n Cookbook File", "File created by Cook'n, a program that allows users to organize cookbook recipes; contains a cookbook, including recipes, meal menus, ingredients, pictures, and search information; used to store, search, and share recipes.", "Windows, ", "[\"DVO Enterprises Cook'n\"]"], "dvi": ["Device Independent Format File", "Output file from a TeX-based program, such as LaTeX; contains typesetting information to be sent to a printer; requires a DVI driver, but is \"device-independent,\" meaning it can be printed on almost any kind of typographic output device; similar to a PostScript (.PS) file.", "Windows, Mac, Linux, ", "['LaTeX Editor', 'MiKTeX', 'BaKoMa TeX', 'DVII']['Skim', 'LyX/Mac', 'DVII']['Evince', 'Xdvik', 'DVII', 'KDE Okular']"], "dvf": ["Sony Digital Voice File", "Compressed audio file format used by Sony's IC digital audio recorders, such as the ICD-BP100 and ICD-BP150; saved in a proprietary audio format that is only recognized by Sony software.", "Windows, ", "['Sony Digital Voice Player', 'Microsoft Windows Media Player with Sony Player plugin']"], "dvds": ["DVDStyler Project File", "XML project file created by DVDStyler, a DVD authoring tool; contains all information required to burn a DVD, including the DVD menus, background graphics, and aspect ratio; also stores references to the video files that will be burned to the disc.", "Windows, Mac, Linux, ", "['DVDStyler']['DVDStyler']['DVDStyler']"], "dvdproj": ["iDVD Project File", "DVD project created with Apple iDVD, a DVD authoring program; includes a template for the DVD interface, movie chapters, and references to additional video clips or slideshows; can be burned to a DVD disc that can be played in a DVD player.", "Mac, ", "[]"], "dvdmedia": ["RipIt DVD Package", "Ripped DVD package created by RipIt, a program used to make digital backups of DVDs; contains audio and video files ripped from a DVD; used for backing up DVDs and playing them with Apple DVD Player.", "Mac, ", "['The Little App Factory RipIt', 'Apple DVD Player', 'iSkysoft DVD Ripper 4', 'VideoLAN VLC media player']"], "dvd": ["DOS Device Driver", "Driver for devices used with MS-DOS; enables communication between the operating system and the hardware device; may be preinstalled with Windows or may need to be installed from a disc that comes with the hardware.", "Windows, Windows, ", "['Microsoft MS-DOS']['Lightning UK! ImgBurn']"], "dvc": ["Dragon Voice Command File", "File used by Dragon NaturallySpeaking, a speech recognition program developed by Nuance Communications; saves a collection of voice commands that can be spoken by the user, as well as the scripts that run when they are issued.", "Windows, Windows, ", "['Nuance Dragon NaturallySpeaking Home 13']['SuperMap Desktop GIS']"], "dvb": ["AutoCAD VBA Project File", "A DVB file is a VBA project created by AutoCAD VBA, a module used to write applications for automating tasks in AutoCAD.  It contains a Microsoft Visual Basic for Applications (VBA) program, which is known as a macro that includes components and code for automating a task.", "Windows, ", "['AutoCAD VBA module']"], "dv4": ["Bosch Security Systems CCTV Video File", "Recorded video file created by Bosch Security Systems closed-circuit television (CCTV) systems; stores video in a proprietary format; used for archiving and reviewing surveillance videos.", "Windows, ", "[]"], "dv2": ["Divinity 2 Data File", "Game file used by Divinity II: Ego Draconis, a fantasy role-playing game; may contain text, speech, and lip sync settings for in-game dialog; may also store other game data such as textures; sometimes modified by players to localize the game into a different language.", "Windows, ", "['Larian Studios Divinity 2: Ego Draconis', 'dv2_u', 'dv2_pak']"], "dv-avi": ["Microsoft DV-AVI Video File", "Video file format created by Microsoft to handle digital video in .AVI files; stores DV video from a digital camcorder in an AVI file container; may be one of two types:\r\n\r\nType-1: AVI file containing one DV data stream; stores combined, or \"muxed,\" audio and DV video in a single interleaved stream.\r\nType-2: AVI files containing DV video and DV audio streams; separates the interleaved data into separate streams.\r\n\r\nDV-AVI files can be played back with several different video player programs.", "Windows, ", "['Microsoft Windows Movie Maker', 'DVMP Pro']"], "dv": ["Digital Video File", "Recorded video file created by a digital video (DV) camera; saved to the camera's DV tape and uses a standard raw format for the DV video; supported by several video editing programs.", "Windows, Mac, Linux, ", "['File Viewer Plus', 'Apple QuickTime Player', 'Adobe Flash Professional CC', 'Roxio Creator NXT Pro 5', 'CyberLink PowerDirector 15 Ultra', 'CyberLink PowerDVD 16', 'Microsoft Windows Movie Maker', 'VideoLAN VLC media player', 'MPlayer']['Apple QuickTime Player', 'Apple iMovie 10', 'Adobe Flash Professional CC', 'Eltima Elmedia Player', 'Roxio Toast 15', 'Roxio Popcorn', 'VideoLAN VLC media player', 'MPlayer']['VideoLAN VLC media player', 'MPlayer']"], "dupeguru": ["dupeGuru Duplicate File List", "Duplicate file list created by dupeGuru, a tool used to find duplicate files on the user's computer; contains a list of duplicate files from a folder that have been detected by the application.", "Windows, Mac, Linux, ", "['dupeGuru']['dupeGuru']['dupeGuru']"], "dun": ["Dungeon Defenders Saved Game File", "Game file created by Dungeon Defenders, a tower defense multiplayer online game; saves information about a player's hero, including experience, items, and other game achievements; saved locally on the iOS or Android device, or on the local desktop computer.", "Windows, Mac, iOS, Android, Windows, ", "['Trendy Entertainment Dungeon Defenders']['Trendy Entertainment Dungeon Defenders']['Trendy Entertainment Dungeon Defenders']['Trendy Entertainment Dungeon Defenders']['Microsoft Dial-Up Networking']"], "duf": ["DAZ User File", "3D modeling file created by DAZ Studio modeling software; contains character, shaping, pose, and shader materials; similar to the .DSF file but its assets cannot be referenced by any other file; used for sharing between users.", "Windows, Mac, ", "['DAZ 3D DAZ Studio 4']['DAZ 3D DAZ Studio 4']"], "duck": ["Cyberduck Bookmark", "Bookmark created by Cyberduck, an open source FTP, SFTP, and WebDAV client; contains connection settings for a specific server; opens the connection to the corresponding server when double-clicked.", "Windows, Mac, ", "['Cyberduck']['Cyberduck']"], "duc": ["Action Replay Max DS Save File", "Saved game created by the Action Replay Max DS, a hardware device used to apply cheat codes to Nintendo DS and DS Lite handheld console games; saved in Action Replay Max DS's proprietary format, but can be converted to a traditional .SAV file and loaded with a Nintendo DS emulator.", "Windows, Web, ", "['max2sc', 'ARDStoSAV']['Shunyweb']"], "dtx": ["Documented LaTeX File", "LaTeX package file created in the DOCTex format; includes both source and documentation in the same file, meaning that both the user manual (the documentation) and the LaTeX component to be installed (e.g., a new style or class) are present in the file; used for distributing LaTeX packages.", "Windows, Mac, Linux, ", "['MiKTeX', 'TeXworks', 'Texmaker', 'text editor']['LyX/Mac', 'TeXworks', 'Texmaker', 'text editor']['Texmaker', 'text editor']"], "dtw": ["Desktop Wallpaper", "Desktop background that can be used as a wallpaper for the desktop screen; similar to a static desktop background, but may contain images from photo albums like a slideshow.", "Windows, Mac, ", "[][]"], "dtsx": ["DTS Settings File", "Data Transformation Services (DTS) file used by SQL Server, an RDBMS (relational database management system) application; specifies settings for migrating data between databases; allows the integration of external data sources.", "Windows, ", "['Microsoft SQL Server 2016']"], "dtshd": ["DTS-HD Master Audio File", "Audio file used to author Blu-ray and HD DVD discs; contains audio data stored in either a lossless or lossy format; used in conjunction with video data to author a Blu-ray disc surround sound for movies.", "Windows, Mac, ", "[][]"], "dtsconfig": ["SSIS Package Configuration File", "A DTSCONFIG file is an XML configuration file used to apply property values to SQL Server Integration Services (SSIS) packages.  The file contains one or more package configurations that consist of metadata such as the server name, database names, and other connection properties to configure SSIS packages.", "Windows, ", "['Microsoft SQL Server 2016']"], "dts": ["DTS Encoded Audio File", "Multi-channel audio file encoded in the Digital Theater Systems (DTS) format; saves five tracks of audio data used for surround sound; channels include center, left-front, right-front, left-rear, and right-rear.", "Windows, Mac, Linux, ", "['File Viewer Plus', 'Apple iTunes', 'CyberLink PowerDVD 16', 'VideoLAN VLC media player', 'Media Player Classic']['Apple iTunes', 'VideoLAN VLC media player', 'Macgo Mac Media Player']['VideoLAN VLC media player']"], "dtr": ["DATroniC Data Recording", "Contains automobile data recorded by a DATroniC data logging device; used for the calibration and measurement of automotive electronic control units (ECUs); can be analyzed using PC data analysis software.", "Windows, ", "[]"], "dtp": ["Publish-iT Document", "Page layout file created with Publish-iT desktop publishing (DTP) software; may include text, images, special page formatting, and multiple pages; often used for creating newsletters, brochures, or other types of printable documents.", "Windows, ", "[]"], "dtm": ["DigiTrakker Module", "Audio tracking module format used by DigiTrakker, a Windows-based tracking program", "Windows, Mac, Windows, Mac, Linux, ", "[]['CocoModX']['Dolphin', 'DTM Editor']['Dolphin']['Dolphin']"], "dt2": ["Windows Live Messenger Emoticon Image File", "Image file used by Windows Live Messenger, a program used for online chatting; contains an emoticon image in .GIF or .PNG format; used for inserting emoticons into online chat windows; may be renamed with a \".gif\" or \".png\" extension and opened in an image viewer.", "Windows, Windows, Linux, ", "['Microsoft Windows Live Messenger']['Safe Software FME Desktop', 'ESRI ArcGIS for Desktop', 'Pitney Bowes MapInfo', 'Blue Marble Geographics Global Mapper', 'TatukGIS Viewer'][]"], "dtapart": ["DownThemAll! Partially Downloaded File", "File used by DownThemAll!, a download manager add-on for the Firefox Web browser; stores the incomplete contents of a file as it is being downloaded; renamed to have the actual download filename extension after the download is fully complete.", "Windows, Mac, Linux, ", "['Mozilla Firefox with DownThemAll! plug-in']['Mozilla Firefox with DownThemAll! plug-in']['Mozilla Firefox with DownThemAll! plug-in']"], "dt1": ["DTED Level 1 File", "Digital Terrain Elevation Data (DTED) Level 1 file used by military GIS programs to display terrain elevation data; contains a grid of elevation points that are uniformly spaced; used as a standard data set for military programs that require terrain elevation, slope, and surface contour information.", "Windows, Linux, ", "['Safe Software FME Desktop', 'ESRI ArcGIS for Desktop', 'Pitney Bowes MapInfo', 'Blue Marble Geographics Global Mapper', 'TatukGIS Viewer'][]"], "dtd": ["Document Type Definition File", "A DTD file is a text file that specifies elements and attributes used in an XML, SGML, HTML, or XHTML document.  It can also define the ordering and nesting for elements and their attributes.  DTD files are commonly referenced within webpages using a URL.", "Windows, Mac, Linux, Windows, ", "['Altova XMLSpy', 'Progress Stylus Studio', 'SyncRO Soft oXygen XML Editor', 'Liquid Technologies Liquid XML Studio', 'JAPISoft EditiX', 'Microsoft Visual Studio 2017', 'Microsoft Notepad', 'text editor']['Altova XMLSpy', 'MacroMates TextMate', 'SyncRO Soft oXygen XML Editor', 'Apple TextEdit', 'text editor']['Altova XMLSpy', 'SyncRO Soft oXygen XML Editor'][]"], "dt": ["Drum Station Machine State File", "File created by Drum Station, a program used for making drum beats; saves the state of the drum machine and includes settings such as the list of different drums and the volume, pan, and effect of each drum; used for saving specific drum set sounds and grooves.", "Windows, ", "['d-lusion Drum Station']"], "dt0": ["DTED Level 0 File", "Digital Terrain Elevation Data (DTED) Level 0 file used by GIS programs to study terrain elevation data; contains a matrix of elevation points that are uniformly spaced; used by scientific, technical, and other communities to study the slope, elevation, and surface roughness of global terrains.", "Windows, Linux, ", "['Safe Software FME Desktop', 'ESRI ArcGIS for Desktop', 'Pitney Bowes MapInfo', 'Blue Marble Geographics Global Mapper', 'TatukGIS Viewer'][]"], "dsz": ["Orchida (OES) Embroidery File", "Embroidery format supported by the Orchida Embroidery System (OES); may contain embroidery designs and sewing instructions; can be generated from image files and TrueType fonts.", "Windows, ", "[]"], "dsym": ["Xcode Debug Symbols File", "Debugging information file generated by Apple's Xcode development software; produced during the debugging process if the Debug Information Format is set to \"DWARF with dSYM;\" saved in a package format that can be opened by right-clicking the file and selecting \"Show Package Contents.\"", "Mac, ", "['Apple Xcode']"], "dsy": ["Directory Synchronizer Project File", "Project file created with AJC Directory Synchronizer, a folder synchronization program; contains information about two folders that can be synchronized automatically by the program; often used for keeping the same data on a desktop and laptop or for backup purposes.", "Windows, Windows, ", "[][]"], "dsx": ["DAZ Studio XML File", "Data file used by DAZ Studio, an application used for 3D character modeling; uses XML formatting and can save several different types of data for the application, including user workspace layouts and other user interface settings.", "Windows, Mac, Windows, ", "['DAZ 3D DAZ Studio 4']['DAZ 3D DAZ Studio 4']['Numerical Computing Diet Studio']"], "dsw": ["Visual C++ 6 Workspace File", "Contains user workspace settings for Microsoft Visual C++ 6 development software; saves the current state of the interface by recording the size and position of open windows and palettes; can be loaded at a later time to resort back to the saved interface.", "Windows, ", "['Microsoft Visual Studio 2017']"], "dstudio": ["DownloadStudio Incomplete Download", "Incomplete file partially downloaded with DownloadStudio, a download manager for Windows; may be used to resume a download if the file transfer stopped; after the download is complete, the \".dstudio\" extension is removed, leaving only the original file extension.", "Windows, ", "[]"], "dst": ["AutoCAD Sheet Set File", "Drawing sheets file created by AutoCAD, a CAD design and documentation application; contains an organized collection of sheets, which are select drawing layouts that have been extracted from multiple drawing files; commonly used as the deliverable format for drafted or completed designs.", "Windows, Windows, Windows, Mac, Linux, ", "['Autodesk AutoCAD 2017']['Embroidermodder', 'BALARAD Embird Studio', \"Designer's Gallery StudioPlus\", 'Buzz Tools', 'S & S Computing SewWhat!', 'Orchida Embroidery System']['DeSmuME']['DeSmuME']['DeSmuME']"], "dsv": ["DeSmuME Save File", "Saved game created with DeSmuME, a Nintendo DS emulator; saves game progress at a specific point within the game so it can be resumed at a later time; saved by the emulator, meaning the save file can be created at any time, not just at the save points within each game.", "Windows, Mac, Linux, Windows, Mac, ", "['DeSmuME']['DeSmuME']['DeSmuME']['DAZ 3D DAZ Studio 4']['DAZ 3D DAZ Studio 4']"], "dss": ["Digital Speech Standard File", "Audio file saved by a digital voice recorder or speech recognition program; stores voice audio data in a highly-compressed format; can be written in insert or overwrite mode; commonly used for professional transcript environments, such as law firms.", "Windows, Mac, Windows, Web, ", "['Olympus DSS Player', 'Olympus DSS Player Lite', 'IBM ViaVoice']['IBM ViaVoice', 'Olympus DSS Player Lite Software for Mac'][]['Synology DiskStation Manager']"], "dsp": ["Dynamic Studio Professional Module", "Older type of tracker module used by the Dynamic Studio digital audio tracking program.", "Windows, Mac, Windows, ", "['MODPlug Player']['CocoModX']['Microsoft Visual Studio 2017']"], "dso": ["DAZ Studio Object File", "3D object file created by DAZ Studio, a program used for character modeling; stores the geometry for objects in a 3D scene; referenced by the .DAZ scene file, which is used to save and load the 3D scene; may also be saved with .DSD and .DSV files, which are also referenced in the DAZ scene file.", "Windows, Mac, ", "['DAZ 3D DAZ Studio 4']['DAZ 3D DAZ Studio 4']"], "dsm": ["Digital Sound Module", "Tracker module format used by digital audio tracking programs; includes multiple tracks with notes that compose a musical score; notes are linked to sound samples, which are also included in the file.", "Windows, Mac, Linux, ", "['MODPlug Player', 'Nullsoft Winamp']['CocoModX']['XMMS']"], "dskin": ["DockX Skin", "Skin that can be applied to the Mac OS X Dock using DockX; saved in a package format that includes multiple .PNG images and a .PLIST file; used to change the appearance of the Dock.", "Mac, ", "['Mr. Gecko DockX']"], "dsl": ["Lingvo Dictionary File", "Dictionary file used by Lingvo Dictionary software, which is used to translate words into different languages and look up definitions; contains dictionary entries, which are made up of the headword of the card (defined word) and the body of the card (definition).", "Windows, Mac, iOS, Android, Windows Phone, ", "['ABBYY Lingvo Dictionary', 'GoldenDict']['ABBYY Lingvo Dictionary']['ABBYY Lingvo Dictionary']['ABBYY Lingvo Dictionaries'][]"], "dsi": ["DAZ Studio Layered Image Set", "File created by DAZ Studio, a program used for 3D character modeling; stores multiple image layers as a material file that can be applied to 3D objects; allows the source images (e.g., .PNG or .JPG) to be combined while allowing each image to remain unmodified from its original state.", "Windows, Mac, Windows, ", "['DAZ 3D DAZ Studio 4']['DAZ 3D DAZ Studio 4']['RandomControl fryrender']"], "dsgm": ["DS Game Maker Project", "Project file created using DS Game Maker (DSGM), a program used to develop games for the Nintendo DS hand-held game console; stores \"Rooms\" (environments in which the game is played), Scripts, Sounds, Objects and Sprites (game images).", "Windows, ", "['Invisionsoft DS Game Maker']"], "dsn": ["OrCAD Design File", "PCB (printed circuit board) design file created by OrCAD, a program used for designing PCBs; saves the circuit schematic and is often one of several files included in a OrCAD project (.OPJ file); references \"symbols,\" which are the electronic components used to make up the design (stored in .OLB files).", "Windows, Windows, Mac, ", "['Cadence OrCAD PCB Designer']['Microsoft ODBC Data Source Administrator']['Apple ODBC Administrator']"], "dsk": ["Disk Image", "Generic disk image format created by disk imaging programs; may be from an older program that images 3.5\" diskettes, or from a newer program that creates larger disk images; often compressed to save disk space; can be mounted to appear as a disk on the desktop for Mac or within My Computer for Windows.", "Windows, Mac, Windows, Windows, ", "['Gilles Vollant WinImage', 'SoftAmbulance Partition Doctor', 'PowerISO', 'R-Tools Technology R-Studio']['Apple Disk Utility']['Embarcadero Delphi']['DSKE Simple IDs']"], "dsg": ["Doom Saved Game", "Save file created and used by Chocolate Doom, a fan-made version of the Windows 95 Doom; contains saved game progress, which includes the game version, game skill, episode of the game, current level, time since the level began, amount of possessed armor, armor type, attained powers and weapons, whether the player is alive, dead, or respawning, and other game information. ", "Windows, Mac, Windows, Windows, ", "['Chocolate Doom']['Chocolate Doom']['New Wave Concepts Control Studio'][]"], "dse": ["DAZ Studio Encrypted Script", "Script used by DAZ Studio, a 3D character modeling application; contains instructions that apply certain morphs, textures, materials, or other features to a model; saved in an encrypted format, which enables script developers to protect intellectual property for scripts that are made available for purchase.", "Windows, Mac, ", "['DAZ 3D DAZ Studio 4']['DAZ 3D DAZ Studio 4']"], "dsf": ["Delusion Digital Sound File", "Digital audio sample used to create sounds for .DMF tracker modules.", "Windows, Windows, Mac, Windows, Windows, ", "['DeliPlayer', 'OpenMPT', 'MODPlug Player']['DAZ 3D DAZ Studio 4', 'Dimension3D DSF Toolbox']['DAZ 3D DAZ Studio 4', 'Dimension3D DSF Toolbox']['Write Brothers Dramatica Pro']['Corel DESIGNER Technical Suite X7', 'CorelDRAW Graphics Suite X8']"], "dsd": ["AutoCAD Drawing Set Description File", "Properties file used by AutoCAD, a CAD productivity application; contains settings for publishing a drawing to a .DWF file or to another plotter format; used for saving reusable publishing settings for different types of output.", "Windows, Windows, Windows, Mac, ", "['Autodesk AutoCAD 2017']['Numerical Computing Diet Studio']['DAZ 3D DAZ Studio 4']['DAZ 3D DAZ Studio 4']"], "dsa": ["DAZ Studio 3+ Script", "Script format introduced with DAZ Studio version 3, a 3D modeling application; saved in a plain text (ASCII) format and contains instructions that automate modeling tasks, such as applying materials or character morphs; can act like a macro for running common tasks, or may include custom code that extends the functionality of the software.", "Windows, Mac, ", "['DAZ 3D DAZ Studio 4']['DAZ 3D DAZ Studio 4']"], "dsc": ["Kingsoft Design Science Equation File", "Settings file used by WPS Office (previously known as Kingsoft Office), an office suite which includes the Writer, Spreadsheets, and Presentation applications; stores the settings for the Design Science Equation Editor, which includes the window size, interface style, and zoom magnification.", "Windows, Windows, Mac, Windows, Mac, Linux, Windows, Mac, Linux, ", "['Kingsoft WPS Office']['Nikon ViewNX']['Nikon ViewNX']['Microsoft Notepad', 'text editor']['Apple TextEdit', 'text editor']['Debian package management system']['Celestia']['Celestia']['Celestia']"], "dsb": ["Dell DataSafe Backup File", "Backup file created by Dell DataSafe Local Backup, a backup and recovery application included with Inspiron, Studio, and XPS Dell computer purchases; may store system files (applications, drivers, etc.) and user files (photos, documents, etc.); may be one of several files that comprise the total backup.", "Windows, Windows, Windows, Mac, Windows, ", "['Dell DataSafe Local Backup']['Wondershare DVD Slideshow Builder Deluxe']['DAZ 3D DAZ Studio 4']['DAZ 3D DAZ Studio 4'][]"], "ds_store": ["Mac OS X Folder Settings File", "Stores viewing preferences for a folder in Mac OS X; includes information about the folder's window location, window size, what view option has been selected (icon, list, or column), and the layout of icons in the window.", "Mac, ", "[]"], "ds2": ["Olympus DSS Pro Audio File", "Audio file created in the Digital Speech Standard Pro (DS2) format, a highly compressed audio format developed by Olympus for digital voice recordings; typically contains a recording of human speech that is saved to a recording device's memory card; used for saving personal and professional notes, often by laywers, researchers, and physicians; useful for sending as email attachments because of the highly compressed file size.", "Windows, ", "['Olympus DSS Player', 'Voelker Software DSS File Converter', 'Bytescribe WavPlayer']"], "drwdot": ["SolidWorks Drawing Template", "Drawing template created with SolidWorks 2D and 3D CAD design software; typically used for creating multiple drawings related to the same design.", "Windows, ", "['Dassault Systemes SolidWorks']"], "ds": ["DAZ Studio 1/2 Script", "Plain text script used by DAZ Studio, a 3D modeling application; contains instructions that automate program functionality; may act like a macro for running common tasks or may include custom code that extends the functionality of the software; often used for applying character morphs or model presets, and for working with import and export file formats.", "Windows, Mac, Windows, Linux, Windows, Mac, Windows, ", "['DAZ 3D DAZ Studio 4']['DAZ 3D DAZ Studio 4']['LMMS']['LMMS'][][]['Furcadia']"], "drw": ["DESIGNER Drawing", "Drawing format used by Micrografx Designer, a drawing program for making  technical drawings; used in engineering, construction, and other related fields.", "Windows, Windows, Mac, Linux, ", "['Corel DESIGNER Technical Suite X7', 'Corel Presentations X8']['CorelDRAW Graphics Suite X8', 'Corel PaintShop Pro X9', 'ACD Systems Canvas X 2017', 'Microsoft Picture It!', 'Inkscape']['Apple AppleWorks', 'Inkscape']['Inkscape']"], "drscan": ["Data Rescue Scans File", "File created by Data Rescue, a program used for recovering files from crashed or infected hard drives; saves the result of one or more drive scans, which detect the existing directory structure and locate files; can be imported back into Data Rescue but only if the Mac OS X system specifications match those when then scan was performed.", "Mac, ", "['ProSoft Engineering Data Rescue 3']"], "drv": ["Device Driver", "A DRV file is a driver file used by Windows operating systems to connect and communicate with hardware devices (both external and internal).  It contains commands and parameters for how a device and the operating system communicate together.  DRV files are also used to install a device driver on a computer.", "Windows, ", "['Microsoft Windows']"], "drpm": ["Delta RPM File", "File used by Linux operating systems for installing software; similar to an .RPM file, but is significantly smaller in file size because it only includes the files required since a prior RPM package was installed.", "Linux, ", "['The Fedora Project Presto', 'YaST']"], "drmx": ["Drumlin Fully Secure PDF File", "PDF file saved in a secure proprietary format; created by Drumlin PDF Publisher and can be read by Javelin PDF Reader; assigned a unique authorization code in order to protect its digital assets.", "Windows, Mac, ", "['Drumlin Security Javelin PDF Reader', 'Drumlin Security Drumlin PDF Reader and Publisher']['Drumlin Security Javelin PDF Reader']"], "drm": ["Cubase Drum Map File", "Contains drum map settings for a specific MIDI keyboard; maps different drum sounds to different keys on the keyboard; used for playing a software drum instrument within Cubase from Yamaha, Roland, Korg, and other keyboards.", "Windows, Mac, Windows, ", "['Steinberg Cubase']['Steinberg Cubase'][\"Gibbed's Deus Ex HR tools\", 'Eidos Interactive Deus Ex: Human Revolution']"], "drl": ["Gerber Drill Rack File", "Contains drill data for manufacturing a printed circuit board (PCB) based on the Gerber specifications standard; includes data about the drilling tools and drill sizes used in creating the board.", "Windows, Mac, Linux, ", "['Altium Designer', 'PentaLogix ViewMate']['vhf interservice Cenon']['vhf interservice Cenon']"], "drg": ["AllyCAD Drawing File", "Three-dimensional drawing created by AllyCAD, a program used to create engineering and architectural designs; contains a 3D model, commonly of an assembly part or a structure; used to store designs in the planning process before manufacturing or construction.", "Windows, Windows, Mac, iOS, Android, ", "['Knowledge Base AllyCAD']['I-Doser']['I-Doser']['I-Doser']['I-Doser']"], "drf": ["VIZ Render File", "Discreet Render Format (DRF) file created by VIZ Render, a program included with older versions of Autodesk Architecture; saves a rendered image of buildings or other modeled structures; can be opened in 3ds Max, but can only be created by VIZ Render.", "Windows, Mac, Windows, Windows, ", "['Autodesk 3ds Max 2017']['Autodesk 3ds Max 2017']['Dynojet WinPEP']['Embarcadero Delphi']"], "drc": ["DRM Rights Object", "Contains copy-protection information stored in an OMA (Open Mobile Alliance) rights object, formatted in WBXML (WAP Binary XML); includes the key used to encrypt the content of a .DCF file; enables Digital Rights Management (DRM) encrypted files to be opened and played back.", "Windows, Mac, ", "['text editor']['Sony Ericsson DRM Packager', 'text editor']"], "dream": ["Dream Animated Wallpaper File", "File created by DreamMaker, a program used for creating animated desktop wallpapers in Windows; contains video playback contents as well as settings for triggered visual effects; enhances the user desktop experience.", "Windows, ", "['Stardock DreamMaker', 'Stardock DeskScapes']"], "dres": ["Delphi Compiled Resource File", "Developer file created by Delphi, a Windows software development application; contains the compiled version of a .RES file that is suitable for use at linking time, when the executable is built.", "Windows, ", "['Embarcadero Delphi']"], "drawit": ["DrawIt Drawing", "Drawing created by DrawIt, a vector drawing program for Mac OS X; saves drawn shapes, colors, and filters using layers; support non-destructive filters, which means that the drawn elements are preserved in their original form even after filters are applied.", "Mac, ", "['Bohemian Coding Sketch']"], "drawing": ["Artboard Drawing", "Drawing created by Artboard, a vector illustration program for Mac; saves the drawing in either a binary or plain XML plist (.PLIST) format, depending on the user's save option; usually is contained within an .ARTB package.", "Mac, ", "['Mapdiva Artboard']"], "dra": ["Nuance Dragon Voice Recording File", "Audio file saved by Dragon, a program used to generate text documents from voice recordings; stores the audio as it was dictated by the user; saved so that the software's generated text can be corrected later if it does not match the dictation.", "Windows, Mac, Windows, Windows, ", "['Nuance Dragon NaturallySpeaking Home 13']['Nuance Dragon Professional Individual for Mac 6']['Dolphin Cad Cam PartMaster']['Cadence OrCAD PCB Designer', 'Cadence Allegro Free Physical Viewer']"], "dr5": ["Dramatica Story Expert Project", "A DR5 file is a document created by Dramatica Story Expert, a macOS (OS X) application used by writers to formulate stories.  It contains a story project, which includes the title, author, story plot, characters, and character relationships.", "Mac, ", "['Write Brothers Dramatica Story Expert']"], "dpx": ["Digital Picture Exchange File", "Kodak raster image format used for transferring film images to a digital medium with no loss of quality; also referred to as a \"Digital Moving Picture Exchange Bitmap;\" often exported as a frame sequence which contains a series of still images.", "Windows, Mac, Linux, Windows, Windows, ", "['File Viewer Plus', 'Adobe SpeedGrade CC 2017', 'Adobe Photoshop CC 2017', 'XnViewMP']['Adobe SpeedGrade CC 2017', 'Adobe Photoshop CC 2017', 'Apple Final Cut Pro X', 'Autodesk Smoke 2017', 'Lemkesoft GraphicConverter', 'XnViewMP']['XnViewMP'][]['Serif DrawPlus']"], "dr": ["DRM Rights Object", "Contains the OMA (Open Mobile Alliance) rights object in XML format, and the key used to encrypt the content of a .DCF file; enables DRM (Digital Rights Management) encrypted files to be opened and played back", "Windows, Mac, ", "['text editor']['Sony Ericsson DRM Packager', 'text editor']"], "dqy": ["Excel Query File", "Database query used by Microsoft Excel; uses ODBC formatting for compatibility with other databases.", "Windows, Mac, ", "['Microsoft Excel 2016']['Microsoft Excel 2016']"], "dpv": ["Siemens NX Drafting Standard File", "File used by Siemens NX, a CAD product lifecycle management (PLM) solution; contains settings for measurement units, colors, and object properties; used for creating CAD design drafts according to standards.", "Windows, ", "['Siemens PLM Software NX']"], "dpt": ["Kingsoft Presentation Template", "A DPT file is a slide show template created by Kingsoft Presentation, a free program included with the Kingsoft WPS Office suite.  It saves the default layout and styles for a presentation and is used for creating presentations (.DPS files) with the same formatting.", "Windows, Android, ", "['Kingsoft WPS Office', 'Kingsoft Presentation']['Kingsoft WPS Office for Android']"], "dps": ["DivX Player 2 Skin File", "File used by DivX Player version 2, a video player program; contains skin image files in a compressed .ZIP file format; includes an .XML file named skin.divl that describes the skin images for buttons, logo, main view, compact view, font, resize policy, playback area; used to customize the look and feel of the DivX Player.", "Windows, Windows, Android, ", "['DivX 7 for Windows']['Kingsoft WPS Office', 'Kingsoft Presentation']['Kingsoft WPS Office for Android']"], "dproj": ["Delphi Project", "Project file created by Delphi 2007 and later software development IDEs; used as the save and load format for the development project and contains source code file references, compiler and linker settings, directories for the project, and other project settings; built into the final .EXE, .DLL, or .OCX file.", "Windows, ", "['Embarcadero Delphi']"], "dpr": ["Delphi Project", "Project file created by Delphi, a software IDE often used for building Windows applications; used as the main source code file that is the entry point for the application; may contain references to other source code files in the project.", "Windows, Windows, ", "['File Viewer Plus', 'Embarcadero Delphi'][]"], "dpp": ["DrawPlus Drawing File", "Vector image saved in the native DrawPlus drawing format; supports CMYK color, 3D shapes, filter effects, text in a shape, and image feathering; DPP documents created with DrawPlus 7 or later may also include multiple pages.", "Windows, ", "['Serif DrawPlus']"], "dpn": ["Depiction Data File", "Data file used by Depiction, a mapping program used to explore and map dynamic \"what if?\" scenarios; contains the static information for a particular depiction, including maps, elevation, images, etc.", "Windows, ", "[]"], "drmz": ["Drumlin Fully Secure Mobile PDF File", "PDF file saved in a secure proprietary format that can be read on computers and mobile devices; created by Drumlin PDF Publisher and used by Javelin PDF Reader; assigned a unique authorization codes in order to protect its digital assets.", "Windows, Mac, iOS, Android, ", "['Drumlin Security Javelin PDF Reader', 'Drumlin Security Drumlin PDF Reader and Publisher']['Drumlin Security Javelin PDF Reader']['Drumlin Security Javelin PDF Reader']['Drumlin Security Javelin PDF Reader']"], "dpl": ["Delphi Package Library", "Dynamic-link library (DLL) used for building Delphi applications; contains components that can be shared across multiple projects.", "Windows, ", "['Embarcadero Delphi']"], "dpm": ["Pro Tools Plugin File", "Audio plugin for Pro Tools audio production software; adds effects and filters that can be applied to audio tracks within a Pro Tools session.", "Windows, Mac, ", "['Avid Pro Tools']['Avid Pro Tools']"], "dpkw": ["Delphi Package", "File used by Delphi, an IDE used for developing Windows applications; saves a package, which can be used for extending Delphi applications (runtime packages) or the Delphi IDE itself (designtime packages); similar to a plugin or library that can be reused across development projects.", "Windows, ", "['Embarcadero Delphi']"], "dpk": ["Delphi Package", "File used by Delphi Windows development software; may store a package for extending Delphi applications (runtime packages) or the Delphi IDE itself (designtime packages); often contains a reusable development component such as a user interface component.", "Windows, ", "['File Viewer Plus', 'Embarcadero Delphi']"], "dpf": ["Dargon Package", "Game modification package used by Dargon, an application used for applying custom alterations to the MOBA game League of Legends (LOL); contains data for a game modification and can be applied to LOL using the Dargon software.", "Windows, ", "['Dargon']"], "dpb": ["DataPilot Backup File", "File created by DataPilot, a program used for transferring cell phone data to the computer; may store contacts, text messages, pictures, videos, and other mobile phone data; used for syncing a phone with the computer; can be password protected.", "Windows, Mac, Windows, Windows, ", "['Susteen DataPilot for Windows']['Susteen DataPilot for Mac']['Invelos DVD Profiler'][]"], "dpg": ["Nintendo DS Movie File", "Video container format used for playing movie files on the Nintendo DS portable gaming device; may be converted from other video formats to DPG using MoonShell or another converter program.", "Windows, Mac, Linux, ", "['Moonshell', 'BatchDPG', '4Media DPG Converter', 'Aiseesoft DPG Converter', 'dpg4x']['dpg4x', 'Aiseesoft DPG Converter for Mac']['dpg4x']"], "dpd": ["Ovation Pro File", "Document created by Ovation Pro, a desktop publishing program for Windows created by David Pilling; includes features such as auto paragraph numbering and bulleting, referenced and proxy pictures, and .EPS file support.", "Windows, ", "[]"], "dpa": ["DrawPlus Animation File", "Two-dimensional animation file created by DrawPlus, a graphics editing program; stores either a stopframe animation (a flip book-like animation), or a keyframe animation (a set of anchor frames used by the computer to generate a smooth animation); also supports visual effects and audio data.", "Windows, ", "['Serif DrawPlus']"], "dp1": ["DataPower Database File", "Database format used by DataPower, a user-friendly multimedia database program; can be created using the form designer within DataPower.", "Windows, ", "[]"], "downloading": ["Pando Incomplete Download File", "Partially downloaded file created by Pando, an Internet file sharing program that operates as a Microsoft Oulook plug-in as well as a desktop application; saves the progress of the file as it's being downloaded, but the file is not usable until the download is complete.", "Windows, Mac, ", "['Pando']['Pando']"], "dotx": ["Word Open XML Document Template", "A DOTX file is a template created by Microsoft Word, a word processing program.  It contains default layouts and settings for a document, including styles, AutoText, toolbars, and macros.  DOTX files are used as a baseline to create multiple .DOCX documents with the same formatting.", "Windows, Mac, Linux, ", "['File Viewer Plus', 'Microsoft Word 2016', 'Apache OpenOffice', 'LibreOffice']['Microsoft Word 2016', 'Planamesa NeoOffice', 'Apache OpenOffice', 'LibreOffice', 'Apple Preview']['Apache OpenOffice', 'LibreOffice']"], "downloadhost": ["MSN Download Settings File", "Stores file download settings for MSN software; included with the MSN installation and required for downloading files and checking e-mail; typically named \"MSN#.downloadhost.\"", "Windows, ", "[]"], "download": ["Partially Downloaded File", "A DOWNLOAD file is a file that is currently being downloaded from the Internet or was stopped before the download finished.  It may be double-clicked to resume the download using the same web browser that started the download.", "Windows, Mac, ", "['Mozilla Firefox', 'Google Chrome']['Apple Safari', 'Mozilla Firefox']"], "dotm": ["Word Open XML Macro-Enabled Document Template", "A DOTM file is a document template created by Microsoft Word, a word processing program.  It contains the default layout, settings, and macros for a document.  DOTM files are used to create a new .DOCM document with embedded macros.", "Windows, Mac, Linux, ", "['File Viewer Plus', 'Microsoft Word 2016', 'Apache OpenOffice']['Microsoft Word 2016', 'Planamesa NeoOffice', 'Apache OpenOffice']['Apache OpenOffice']"], "dot": ["Word Document Template", "A DOT file is a template created by Microsoft Word, a word processing application and may be opened by various word processors.  It contains pre-formatted document settings, such as headers, footers, margins, font sizes, and other common page styles.  DOT files are used to create multiple documents that have similar formatting, such as company letterheads, business memos, or envelopes.", "Windows, Mac, Linux, Windows, Mac, Linux, ", "['File Viewer Plus', 'Microsoft Word 2016', 'Microsoft Word Viewer', 'Apache OpenOffice']['Microsoft Word 2016', 'Planamesa NeoOffice', 'Apache OpenOffice']['Apache OpenOffice']['AT&T Graphviz']['AT&T Graphviz']['AT&T Graphviz']"], "dolphinview": ["Dolphin Folder View Settings File", "Stores viewing preferences for a folder in Dolphin, a file manager for KDE (K Desktop Environment); contains window settings, such as icon positions and view mode; typically hidden by default.", "Linux, ", "['Dolphin for KDE']"], "dol": ["GameCube Executable File", "Game or application that can run on the Nintendo GameCube or Nintendo Wii game systems; may also be run by PC emulation software for the Gamecube and Wii; used for commercial games and homebrew games created by users.", "Windows, Mac, Linux, ", "['Dolphin', 'Dolwin']['Dolphin']['Dolphin']"], "dok": ["DesktopOK Icons Layout File", "Layout file created and used by DesktopOK, a free program that allows users to save and restore the position of icons on their desktop; stores the layout of desktop icons and may also include the date, time, and resolution of the layout.", "Windows, ", "['SoftwareOK DesktopOK']"], "docx": ["Microsoft Word Open XML Document", "A DOCX file is a document created by Microsoft Word or another word processing program, such as OpenOffice Writer or Apple Pages.  It contains formatted text but may also include images, drawn objects, and other document elements.  DOCX files are widely used in home, academic, and business environments for drafting letters, resumes, invitations, newsletters, and other documents.", "Windows, Mac, Linux, Web, iOS, Android, ", "['File Viewer Plus', 'Microsoft Word 2016', 'Microsoft Word Viewer', 'Corel WordPerfect X8', 'Apache OpenOffice', 'Hancom Thinkfree Office NEO Word', 'SoftMaker Office', 'Kingsoft Writer', 'LibreOffice']['Microsoft Word 2016', 'Apple Pages', 'Planamesa NeoOffice', 'Apache OpenOffice', 'Hancom Thinkfree Office NEO Word', 'LibreOffice', 'Apple Preview']['Apache OpenOffice', 'Hancom Thinkfree Office NEO Word', 'LibreOffice']['Google Drive', 'Microsoft OneDrive']['Microsoft Word', 'Apple Pages', 'Infraware Polaris Office', 'MobiSystems OfficeSuite Pro', 'Google Drive', 'Microsoft OneDrive']['Microsoft Word', 'SoftMaker Office: TextMaker Mobile', 'Kingsoft WPS Office for Android', 'Infraware Polaris Office', 'Google Drive', 'MobiSystems OfficeSuite Pro', 'Microsoft OneDrive']"], "docset": ["Doxygen Document Set File", "Developer file created by Doxygen, a source code documentation system; contains an archive of documentation about a body of source code, which can encompass many different individual source code files and code constructs; used as the storage format for publishing documentation to developers that use the source code.", "Mac, ", "['Apple Xcode', 'Kapeli Dash']"], "docm": ["Word Open XML Macro-Enabled Document", "A DOCM file is a document created by Microsoft Word, a popular word processor included with Microsoft Office.  It contains embedded macros that can be executed within the document.  DOCM files are used to automate Word Open XML document (.DOCX) tasks by adding advanced macro functionality.", "Windows, Mac, Linux, iOS, Android, ", "['File Viewer Plus', 'Microsoft Word 2016', 'Microsoft Word Viewer', 'Apache OpenOffice']['Microsoft Word 2016', 'Planamesa NeoOffice', 'Apache OpenOffice']['Apache OpenOffice']['MobiSystems OfficeSuite Pro']['MobiSystems OfficeSuite Pro']"], "doc": ["Microsoft Word Document", "A DOC file is a word processing document created by Microsoft Word, or another word processing program, such as OpenOffice Writer or Apple Pages.  It may contain formatted text, images, tables, graphs, charts, page formatting, and print settings.", "Windows, Mac, Linux, Web, iOS, Android, Windows, Mac, ", "['File Viewer Plus', 'Microsoft Word 2016', 'Microsoft Word Viewer', 'Corel WordPerfect X8', 'Apache OpenOffice', 'Kingsoft Writer', 'SoftMaker Office', 'LibreOffice', 'Microsoft Wordpad']['Microsoft Word 2016', 'Apple Pages', 'Apache OpenOffice', 'Planamesa NeoOffice', 'LibreOffice']['Apache OpenOffice', 'LibreOffice']['Google Drive']['Microsoft Word', 'Apple Pages', 'Infraware Polaris Office', 'Google Drive', 'MobiSystems OfficeSuite Pro']['Microsoft Word', 'SoftMaker Office: TextMaker Mobile', 'Kingsoft WPS Office for Android', 'Infraware Polaris Office', 'Google Drive', 'MobiSystems OfficeSuite Pro']['Microsoft WordPad']['Microsoft Word 2016']"], "dockzip": ["ObjectDock File", "Custom dock created with ObjectDock, a program that creates a dock for the Windows desktop (similar to Mac OS X); includes icons and background images used by the dock; saved in a compressed archive format.", "Windows, ", "[]"], "dob": ["Visual Basic UserDocument", "ActiveX program file saved during the development of an ActiveX project; plain text file that contains the project source code, definitions of the project?s controls, and other project data.", "Windows, ", "['Microsoft Visual Studio']"], "do": ["Java Servlet", "A DO file is a web-based Java program run by a web server that supports Java, such as Tomcat or IBM WebSphere.  It is typically mapped to the Struts controller, which processes the file.  DO files are used for generating dynamic web pages.", "Windows, Mac, Linux, ", "['Apache Tomcat', 'Web browser']['Apache Tomcat', 'Web browser']['Apache Tomcat', 'Web browser']"], "dnf": ["Duke Nukem Forever Map File", "Game map file used by Duke Nukem Forever, a sequel to the Duke Nukem 3D first-person shooter game released in 1996; saves a game level, including terrain, buildings, weapons, spawn points, and other objects; used for single mission play and multiplayer gaming.", "Windows, ", "['3D Realms Duke Nukem Forever']"], "dns": ["Duke Nukem Forever Save File", "Game file created by Duke Nukem Forever, a first-person shooter game that is the sequel to Duke Nukem 3D; stores a checkpoint within a game level; used for saving and loading game progress.", "Windows, ", "['3D Realms Duke Nukem Forever']"], "dnl": ["DNAML eBook File", "eBook file created and used by DNAML desktop publishing software; contains raw text, image, and navigation data stored in a compact format for efficiency; protected using digital rights management (DRM); used by publishers and authors to distribute secure eBooks.", "Windows, Mac, ", "['DNAML DNL Reader', 'DNAML DeskTop Author']['DNAML DNL Reader', 'DNAML DeskTop Author']"], "dng": ["Digital Negative Image File", "Universal RAW image format for saving digital photos in an uncompressed format; developed by Adobe Systems as a RAW image archival format and is supported by many image viewing and photo editing programs.", "Windows, Mac, iOS, Android, Windows, ", "['File Viewer Plus', 'Adobe Photoshop CC 2017', 'Adobe Photoshop Elements 15', 'Adobe Photoshop Lightroom 6', 'Microsoft Windows Photos', 'Serif PhotoPlus', 'ACD Systems Canvas X 2017', 'ACD Systems ACDSee 20', 'Google Picasa', 'CyberLink PhotoDirector 8 Ultra']['Apple Preview', 'Apple Photos', 'Google Picasa', 'Adobe Photoshop CC 2017', 'Adobe Photoshop Elements 15', 'Adobe Photoshop Lightroom 6', 'MacPhun ColorStrokes', 'CyberLink PhotoDirector 8 Ultra']['Adobe Photoshop Express']['File Viewer for Android', 'Adobe Photoshop Express']['Soft-Key Solutions DongleBackup2012']"], "dmx": ["Source Filmmaker Project File", "Project file created by Source Filmmaker (SFM), a program used for making 3D movies and still images for use with Valve's Source game engine; saves a 3D recording created by the user and can be comprised of game map objects, models, animations, sounds, effects, and other 3D model data; often contains a recording of actual gameplay.", "Windows, ", "['Valve Source Filmmaker']"], "dmt": ["DeLorme Transfer File", "Packaged project file created by DeLorme software mapping products such as Topo North America; saves a mapping project (.TPX file) but bundles it into a single file that can be used for sharing via email or online.", "Windows, ", "['DeLorme Topo North America']"], "dna": ["SnapGene DNA File", "Data file created by SnapGene, a molecular biology program used for analyzing DNA data; stores a DNA sequence and associated XML and binary metadata; also includes the author, a description, comments, and other written information.", "Windows, Mac, Windows, Windows, ", "['GSL Biotech SnapGene', 'GSL Biotech SnapGene Viewer', 'Genome Compiler']['GSL Biotech SnapGene', 'GSL Biotech SnapGene Viewer', 'Genome Compiler'][]['GenePool', 'Rocket Science Games Darwin Pond']"], "dox": ["Visual Basic Binary UserDocument", "ActiveX program file saved during the development of an ActiveX project in binary format; similar to a .DOB file, but contains graphics and other data that cannot be saved in a text format.", "Windows, Windows, Mac, Linux, Windows, ", "['Microsoft Visual Studio'][][][]['Corel WordPerfect X8']"], "dmsp": ["PhotoSuite Project File", "Project file created by Roxio PhotoSuite, a program used to create cards and posters from digital photos; contains project data and properties, including digital photos, text, overlays, and effects; used to save and load photo projects.", "Windows, ", "['Roxio Creator NXT Pro 5']"], "dmx-info": ["DriverMax Driver Information File", "File used by DriverMax, a program used for updating and backing up Windows drivers; stores information about the driver to be downloaded and installed; often downloaded directly from the DriverMax website.", "Windows, ", "['Innovative Solutions DriverMax']"], "dmsm": ["VideoWave Movie Project File", "Movie project created with VideoWave, a video editing program bundled with Roxio Creator; contains movie project data and settings, including effects, transitions, references to video and audio files, and other video editing information.", "Windows, ", "['Roxio Creator NXT Pro 5']"], "dmsa": ["Music Disc Creator Project File", "Project file created by Music Disc Creator, a program used to create music compilations; stores project information, such as references to audio files, sound edits, transitions, and track information.", "Windows, ", "['Roxio Creator NXT Pro 5']"], "dmsm3d": ["VideoWave 3D Movie Project File", "Media production file created by VideoWave, a movie editor included with the Roxio Creator software; stores a movie production, which can include movie clips, transitions, effects, audio, and slide show photos; used for saving and loading video editing progress.", "Windows, ", "['Roxio Creator NXT Pro 5']"], "dmse": ["Sound Editor Project File", "Project file created by Sound Editor, an audio editing program included in the Roxio Creator multimedia suite; contains project information, including references to audio files, audio edits, and transitions; used to save and load audio projects.", "Windows, ", "['Roxio Creator NXT Pro 5']"], "dmsd3d": ["Roxio MyDVD 3D Project", "DVD project created by Roxio MyDVD, a program included with Roxio Creator and used for creating home DVDs; stores a 3D video project (2D projects use .DMSD files) and can be created for DVD, VCD/SVCD, Blu-ray, or AVCHD media formats.", "Windows, ", "['Roxio Creator NXT Pro 5']"], "dmsd": ["Roxio MyDVD Project", "DVD project created by Roxio MyDVD, a program bundled with Roxio Creator used for creating home DVDs; saves a 2D movie project (3D projects use the .DMSD3D extension) and may created for DVD, VCD/SVCD, Blu-ray, or AVCHD media types.", "Windows, ", "['Roxio Creator NXT Pro 5']"], "dms": ["Disk Masher Image", "Compressed Amiga disk image created using The Disk Masher (DMS); originally used by actual Amiga computers to archive floppy disks; now often used to create disk images that can be opened by Amiga emulators, such as Amiga Forever.", "Windows, Mac, Windows, Mac, Linux, ", "['Cloanto Amiga Forever', 'WinFellow', 'WinUAE']['The Unarchiver', 'Cloanto Amiga Forever', 'MaxUAE']['BYOND']['BYOND']['BYOND']"], "dmr": ["BrainVoyager Diffusion Weighted Project File", "File created by BrainVoyager, a program used for analyzing MRI data of the brain; describes the brain imaging data but does not contain the data itself--the data is stored in one or more corresponding files (e.g., \".dwi\" files or DICOM .DCM files); often used for concatenating multiple images into a sequenced image project.", "Windows, Mac, Linux, ", "['BrainVoyager']['BrainVoyager']['BrainVoyager']"], "dmpr": ["Direct Mail Project File", "File created by Direct Mail, an email marketing program used for sending advertisement emails; contains messages, contacts, mailing lists, and history data created in the software; can also store tracking data for analyzing the success of an email campaign.", "Mac, ", "['e3 Software Direct Mail']"], "dmp": ["Windows Memory Dump", "A DMP file is a file that contains data \"dumped\" from a program's memory space.  It is often created when a program has an error or crashes and may also be saved by the program \"Savedump.exe\" on the first reboot after a crash.  DMP files are usually named \"Memory.dmp.\"", "Windows, ", "['Windows Debug Tools', 'Windows Kernel Debug', 'Microsoft Visual Studio 2017']"], "dmo": ["Duke Nukem 3D Demo File", "File created by Duke Nukem 3D, a first-person shooter game developed with the Build game engine; contains a game recording of player actions and world events; enables players to replay multiplayer sessions.", "Windows, Windows, Windows, Windows, Mac, Linux, ", "['Apogee Duke Nukem 3D'][][]['Cube 2: Sauerbraten']['Cube 2: Sauerbraten']['Cube 2: Sauerbraten']"], "dne": ["Netica Text File", "Text-based file format used by Netica, a Bayesian network development software program that manages uncertainty in business, engineering, medicine, or ecology", "Windows, ", "['Norsys Netica']"], "dmmx": ["iMindQ XML Map Bundle", "Mind map file created by iMindQ, a brainstorming and mind mapping program; stores a iMindQ diagram in an XML format compressed with .ZIP compression; often used for bundling iMindQ mind maps (.DMM files) and sending them over email.", "Windows, Mac, iOS, ", "['Seavus iMindQ']['Seavus iMindQ']['Seavus iMindQ']"], "dmm": ["iMindQ Mind Map File", "File created by iMindQ, a mind mapping application that is compatible with MindManager software file types; used as the default save format for iMindQ and contains a diagram with shapes, information flows, and annotations; used for capturing ideas and information in a structured manner.", "Windows, Mac, iOS, ", "['Seavus iMindQ']['Seavus iMindQ']['Seavus iMindQ']"], "dml": ["DynaScript File", "Web script written in DynaScript, a specialized Dynamic HTML scripting language; contains code that can be used to dynamically generate HTML; may be executed on any Web server that has DynaScript installed.", "Windows, Mac, Linux, ", "['Web browser']['Web browser']['Web browser']"], "dmi": ["BYOND Dream Maker Icon File", "Bitmap image used by BYOND, a game engine used for creating and playing 2D online multiplayer games; saves one or more icon graphic states as well as animation information; used for game graphics such as characters or objects that are visible on a map; similar to a sprite sheet.", "Windows, Mac, Linux, ", "['BYOND']['BYOND']['BYOND']"], "dmgpart": ["Mac OS X Disk Image Part", "Partial disk image file used by the Mac OS X operating system; contains a portion of a .DMG file that has been split into multiple partial archives; often used for distributing software over the Internet in smaller download sizes instead of one large download; also used for making file sizes that fit onto CDs or DVDs.", "Mac, ", "['Apple Disk Utility']"], "dmf": ["Geosystem Digitals Map File", "Map file used by Digitals, a mapping software used for creating topographical maps; contains the terrain topology as well as drawn shapes and specific locations of interest; used for publishing maps for land management and urban cadastral surveys.", "Windows, Windows, ", "['Geosystem Digitals']['DeliPlayer', 'OpenMPT', 'MODPlug Player', 'FMJ-Software Awave Studio']"], "dmd": ["SQL Developer Data Modeler File", "File created by Oracle SQL Developer Data Modeler, a program used for designing structured data models such as relational database schemas; stores the data structure and relationships and can be displayed visually in software.", "Windows, Mac, Linux, ", "['Oracle SQL Developer Data Modeler']['Oracle SQL Developer Data Modeler']['Oracle SQL Developer Data Modeler']"], "dmss": ["VideoWave SlideShow Project File", "Project file created by VideoWave, a program used to create movies and slideshows; contains images, background audio, effects, transition information, and other slideshow properties; used to save and load slideshow projects.", "Windows, ", "['Roxio Creator NXT Pro 5']"], "dmc": ["Datamartist Data Canvas File", "Document file created Datamartist, a data profiling tool used to analyze, combine, and manage data from multiple sources; can contain internal data sets as well as data transformation specifications in the form of transform blocks and connections between them.", "Windows, Windows, Windows, Mac, Windows, Linux, ", "['nModal Solutions Datamartist']['FamiTracker']['DAZ 3D Mimic']['DAZ 3D Mimic'][][]"], "dm_84": ["Wolfenstein 2.06 Demo Movie File", "Demo movie recorded in Wolfenstein - Enemy Territory, a 3D action game (also known as \"W:ET\"); records gameplay and saves it as a movie that can be played in W:ET; stored in the \"\\etmain\\demos\" folder and can be loaded using the \"Replays\" feature in Wolfenstein.", "Windows, Mac, Linux, ", "[][][]"], "dm_83": ["Wolfenstein 1.02 Demo Movie File", "Recording of a game played in Return to Castle Wolfenstein: Enemy Territory (v. 1.02), a first-person 3D action game; records the gameplay of a mission and can be played back later using the program's \"Replays\" option.", "Windows, Mac, Linux, ", "[][][]"], "dm_82": ["Wolfenstein 1.00 Demo Movie File", "Recording of a game played in Return to Castle Wolfenstein: Enemy Territory (v. 1.00), a 3D shooter; saves a complete recording of the gameplay that can be played back using the \"Replays\" option in Wolfenstein.", "Windows, Mac, Linux, ", "[][][]"], "dm_68": ["Quake 3 Demo File", "Game demo created by the 1.32 point release of Quake 3 Arena, a first-person shooter game; contains a recording of gameplay captured by the player; can be played back in the 1.32 version of the game.", "Windows, ", "['id Software Quake 3']"], "dm3": ["DigitalMicrograph Image", "Raster image created by DigitalMicrograph, a application used for viewing and analyzing captured microscope images; stores the image and includes metadata such as the microscope's CCD camera properties, the exposure length, and a timestamp; uses a proprietary format.", "Windows, Mac, Linux, Windows, ", "['Gatan DigitalMicrograph', 'ImageJ']['ImageJ']['ImageJ']['id Software Quake 3']"], "dmb": ["BYOND Game Executable", "Game file used by BYOND, a program used for running games created with the BYOND development tools; saves a game executable that can be run on the player's computer; used for storing 2D multiplayer online games.", "Windows, Mac, Linux, Windows, ", "['BYOND']['BYOND']['BYOND']['Microsoft Windows Media Player with Epigon DMB player plugin', 'GRETECH GOM Player']"], "dltemp": ["UC Browser Temporary Download File", "A DLTEMP file is a temporary download created by UC Browser, a mobile web browser for Android, iOS, and Windows Phone.  It contains information about an incomplete download of a file.  DLTEMP files can be clicked in order to resume a paused download of a file.", "iOS, Android, Windows Phone, ", "['UCWeb UC Browser']['UCWeb UC Browser']['UCWeb UC Browser']"], "dm2": ["Toad Data Modeler 2 File", "Data model created with Toad Data Modeler 2; used for designing databases and developing entity relationship diagrams from existing database files; allows database structures to be represented visually.", "Windows, Windows, Mac, ", "[]['id Software Quake 2']['id Software Quake 2']"], "dm": ["DRM Delivery Message", "File (often audio) that has been encoded with DRM (Digital Rights Management) copy-protection; used by some cell phones for ringtones and other media clips, but can also be used for digitally signed mobile applications; can only be opened using an authorized cell phone.", "Windows, ", "['Sony Ericsson DRM Packager', 'SISContents']"], "dlx": ["DIALux Document", "Lighting design project file created by DIALux, a free, professional light planning application; stores an indoor or outdoor lighting plan; may include luminaires (electric light units), floor plans, street layouts, and other environmental lighting factors.", "Windows, Windows, Windows, Mac, ", "['DIAL DIALux']['Microsoft Visual Studio 2017']['Adobe Premiere Pro CC 2017']['Adobe Premiere Pro CC 2017']"], "dlv": ["CATIA 4 Export File", "File created by CATIA version 4, a CAD program used to create virtual designs; contains a 3D model and its properties; used for saving and loading information during the design process; can be imported by various other CAD programs.", "Windows, Mac, ", "['Dassault Systemes CATIA', 'Adobe Acrobat DC']['Adobe Acrobat DC']"], "dlu": ["3ds Max Utility Plug-in File", "Plug-in used by 3ds Max, a program used for creating and animating 3D models; contains a utility for the software, such as a file format importer or exporter; may be a Standard MAX plug-in included with the software, or an Additional MAX plug-in added to the software; used for extending 3ds Max with new capabilities.", "Windows, ", "['Autodesk 3ds Max 2017']"], "dls": ["Downloadable Sounds File", "Roland GS MIDI sound set; based in the Interactive Music Architecture; contains sounds that can be played back using a MIDI input device", "Windows, Mac, ", "['FMJ-Software Awave Studio'][]"], "dlt": ["DELTA Binary Dataset File", "Dataset created by the DELTA System, an integrated set of programs used for recording taxonomic descriptions in the DELTA format (Description Language for Taxonomy); contains taxonomic data such as leaf length and flower color that's organized through DELTA. ", "Windows, ", "['IB-CAS DELTA']"], "dlr": ["finalRender Plugin", "Plugin created by finalRender for Autodesk 3ds Max, a 3D modeling program for games, films and other motion graphics entertainment; contains features like shadow and atmosphere effects referenced by Autodesk 3ds Max.", "Windows, ", "['cebas Visual Technology finalRender', 'Autodesk 3ds Max 2017']"], "dlo": ["3ds Max Plug-in", "Plugin file used by Autodesk 3ds Max, a 3D modeling and animation program; adds new features to the software, such as importers or exporters for a third-party 3D file formats; enables users to customize software capabilities.", "Windows, ", "['Autodesk 3ds Max 2017']"], "dlm": ["Akamai Download Manager File", "Incomplete file downloaded from the Internet using Akamai Download Manager; saved temporarily while the file is downloading; once the download finishes, the \".dlm\" extension is replaced with file's original extension.", "Windows, Mac, ", "[][]"], "dll": ["Dynamic Link Library", "A DLL file is a compiled library that contains a set of procedures and/or drivers that are referenced and executed by a Windows program.  It allows multiple programs to access shared functions through common libraries.  DLL files are \"dynamically linked\" into a program at runtime, meaning they are only loaded as needed.", "Windows, Windows, Mac, Linux, ", "['DLL-Files.com Client', 'Microsoft Windows', 'Microsoft Visual Studio 2017', 'Microsoft Visual FoxPro', 'Resource Hacker']['Web browser']['Web browser']['Web browser']"], "dmg": ["Mac OS X Disk Image", "A DMG file is a mountable disk image created in Mac OS X.  It contains raw block data typically compressed and sometimes encrypted.  DMG files are commonly used for OS X software installers that are downloaded from the Internet and mounts a virtual disk on the desktop when opened.", "Windows, Mac, Linux, ", "['File Viewer Plus', '7-Zip', 'PeaZip', 'Catacombae HFSExplorer', 'Reincubate DMG Extractor', 'DMG2IMG', 'DMG2ISO']['Apple Disk Utility', 'Roxio Toast 15', 'Incredible Bee Archiver', 'Catacombae HFSExplorer']['Catacombae HFSExplorer']"], "dlis": ["DLIS Well Log Data File", "A DLIS file is a log file created by sensors that monitor petroleum wells, which are holes drilled in the ground for the purpose of exchanging petroleum between a subsurface reservoir and the surface.  It contains a database of well measurements such as resistivity, porosity, sonic, and magnetic resonance measurements.  DLIS files are saved in the Digital Log Interchange Standard used for interchanging well log data.  ", "Windows, ", "['PPDM Data Model', 'Oilware EzTools']"], "dlg": ["Dialogue File", "Dialogue file used by games such as Crysis, a first person shooter game developed by Crytek; contains a character dialogue that is referenced during gameplay; can be edited by the user with a text editor.", "Windows, Windows, ", "['Crytek Crysis']['Safe Software FME Desktop', 'ESRI ArcGIS for Desktop', 'TatukGIS Viewer']"], "dld": ["EdLog Compiled Program", "Custom data logging program created with EdLog, a program included in the LoggerNet software package; used for recording data from Campbell Scientific CR10X logging devices.", "Windows, ", "[]"], "dlc": ["Download Link Container File", "Encrypted container format used for storing downloadable content; uses client-server encryption in which links are processed locally and keys are distributed and recrypted by a Web service; can be processed by JDownloader, a Java-based download management program.", "Windows, Mac, Linux, iOS, Android, Windows, ", "['JDownloader', 'pyLoad', 'FreeRapid Downloader']['JDownloader']['JDownloader', 'pyLoad']['pyLoad']['pyLoad']['DIAL DIALux']"], "dl_": ["Compressed DLL File", "Compressed .DLL file created by Makecab, a Windows utility used for compressing files and creating .CAB files; often used for storing DLL files on Windows installation CDs so that they take up less space on the disc.", "Windows, ", "['Microsoft Makecab', 'Microsoft Expand']"], "dl": ["Zoo Tycoon 2 Data File", "File used by Zoo Tycoon, a video game that allows players to manage zoos; contains data used for exhibits, animals, and other game objects; used with a .Z2F file to add new game content.", "Windows, Windows, Linux, ", "[]['oZone GUI']['oZone GUI']"], "dix": ["DIVA-GIS Export File", "Export file created with the DIVA-GIS geographic data analysis program; contains a DIVA-GIS project (.DIV) file and all the layers referenced by the project; saved in a compressed format that can be transferred via email.", "Windows, ", "['DIVA-GIS']"], "djr": ["Ringtone Media Studio DJ Ringtone Project", "Project file created by Ringtone Media Studio, a program used for making mobile phone ringtones; saves a DJ Ringtone project, which includes guitar, keyboard, drum, and other instrument tracks; used for constructing .MIDI ringtones.", "Windows, ", "[]"], "djvu": ["DjVu Image", "A DJVU file is a compressed image format developed by AT&T and marketed by LizardTech.  It is designed to allow content developers to scan high-resolution color pages of books, magazines, comics, catalogs, etc. and publish them on the Web.", "Windows, Mac, Linux, iOS, ", "['WinDjView', 'DjVuLibre DjView', 'ACD Systems Canvas X 2017', 'ACD Systems ACDSee 20', 'Lizardtech DjVu Solo', 'Web browser']['MacDjView', 'DjVuLibre DjView', 'SST DjVuReader', 'Web browser']['DjVuLibre DjView', 'KDE Okular']['DjVu Reader']"], "diz": ["Description in Zip File", "Plain text file that describes the program or files within a .ZIP archive; typically named \"FILE_ID.DIZ,\" where FILE_ID stands for \"file identification\" and DIZ stands for \"Description in Zip File.\"", "Windows, Mac, ", "['File Viewer Plus', 'Microsoft Notepad', 'Notepad++', 'NFOPad', 'CubicDesign Compact NFO Viewer', 'text editor']['Apple TextEdit', 'Bare Bones TextWrangler', 'text editor']"], "dm1": ["ER/Studio Data Model File", "File created by ER/Studio, a program used for building large-scale databases; saves a data model that describes the structure and relationships of the data to be stored; used for viewing the data model visually, as well as for assisting in the process of generating the final data model.", "Windows, ", "['Embarcadero Technologies ER/Studio']"], "divx": ["DivX-Encoded Movie File", "High-quality, high-compression video codec used for digital video distribution; compresses video to a fraction of the original size with minimal loss in quality; supports video resolutions up to 1080 HD.", "Windows, Mac, Linux, iOS, ", "['File Viewer Plus', 'DivX 7 for Windows', 'Microsoft Windows Video', 'RealNetworks RealPlayer Cloud', 'Roxio Creator NXT Pro 5', 'CyberLink PowerDVD 16', 'CyberLink PowerDirector 15 Ultra', 'Audials One 2017', 'Xilisoft Video Converter Ultimate', 'Apple QuickTime Player with DivX codec', 'Aviosoft DVD X Player', 'VideoLAN VLC media player']['DivX 7 for Mac', 'RealNetworks RealPlayer Cloud', 'Eltima Elmedia Player', 'Apple QuickTime Player with DivX codec', 'VideoLAN VLC media player', 'Roxio Toast 15']['RealNetworks RealPlayer Cloud', 'VideoLAN VLC media player']['VideoLAN VLC for iOS 2']"], "diva": ["Project DIVA Song File", "Game file used by Project DIVA, a Japanese rhythm game created by SEGA; saves song information; includes a reference to the song .MP3 file and the timings for which events have to be triggered to score points in the game.", "Windows, ", "['SEGA Project DIVA']"], "ditamap": ["DITA Topic Map File", "Collection of DITA (Darwin Information Typing Architecture) topics created in the XML DITAMAP format; stores references to the topics specified in .DITA files using <topicref> tags; enables authors to build a hierarchical structure of related topics.", "Windows, Mac, Linux, ", "['SyncRO Soft oXygen XML Editor', 'Eclipse with XMLBuddy plug-in', 'JustSystems XMetaL']['Eclipse with XMLBuddy plug-in']['Eclipse with XMLBuddy plug-in']"], "div": ["DIVA-GIS Project File", "Project file created with DIVA-GIS, a mapping and geographic data analysis program; includes a map image and a collection of layers used to display objects and properties on the map; also stores parameters that describes the map’s scale and center.", "Windows, ", "['DIVA-GIS']"], "ditaval": ["DITA Conditions File", "File used for filtering the data in XML .DITA technical documents; stores conditional rules for including or excluding certain types of topics in the DITA document; allows DITA readers to filter DITA topics.", "Windows, ", "['Adobe FrameMaker', 'SyncRO Soft oXygen XML Editor', 'Microsoft Notepad', 'text editor']"], "dita": ["DITA Document", "XML file created in the Darwin Information Typing Architecture (DITA) format, which is used for authoring and publishing technical documents; contains topics of information in the form of Tasks (how-to data), Concepts (definitions), and References (facts and citations).", "Windows, Mac, Linux, ", "['Adobe FrameMaker', 'SyncRO Soft oXygen XML Editor', 'Eclipse with XMLBuddy plug-in', 'JustSystems XMetaL']['Eclipse with XMLBuddy plug-in']['Eclipse with XMLBuddy plug-in']"], "dit": ["Active Directory Information Tree File", "Directory information tree (DIT) file used by Active Directory, a directory service for computers and networks; saves a hierarchy of network objects and access permissions; named ntds.dit by default.", "Windows, ", "['Microsoft Active Directory']"], "dist": ["Mac OS X Distribution Script", "Script that customizes the installation of a Mac OS X software program; derived from the NeXTSTEP operating system; created with PackageMaker but used by the Mac OS X Installer program.", "Mac, ", "['MacroMates TextMate']"], "diskdefines": ["Linux LiveCD Information File", "Readme file often found on Linux LiveCD installer discs, such as an Ubuntu Linux installation CD; typically named \"README.diskdefines\" and may be referenced during installation.", "Linux, ", "[]"], "disk": ["Linux Virtual Hard Disk", "Disk image file that serves as a virtual hard disk for Linux operating systems, such as Ubuntu, Kubuntu, Xubuntu, Edubuntu, and UbuntuStudio; can be mounted and viewed by the operating system as an actual hard disk; can be used to run multiple variations of Linux without needing to repartition the hard drive.", "Linux, ", "[]"], "dkt": ["DiGiTIAL THUNDER Drum Kit File", "File used by d-lusion Drum Station, a program used for generating drum kit beats and sounds; saves drum sounds for a certain drum kit type (written \"DRUM KiT\"), such as rock or jazz; allows the specific configuration to be saved and shared.", "Windows, ", "['d-lusion Drum Station']"], "discomap": ["DISCO Discovery Output File", "Output file generated by the Microsoft Web Services Discovery Tool (Disco.exe); contains information about ASP.NET Web Services discovered at a specified URL, such as a the location of a .DISCO or .WSDL file; typically named \"results.discomap.\"", "Windows, ", "['Microsoft Visual Studio 2017']"], "disc": ["Toast Document", "Project file created by Roxio Toast, a multimedia disc authoring and burning application; stores the saved settings for a data, audio, video, or conversion disc project; may include references to files as well as burning settings.", "Mac, ", "['Roxio Toast 15']"], "disabled": ["Spybot - Search & Destroy Disabled File", "Disabled application or link created by Spybot - Search & Destroy, a program used for removing spyware from Windows computers; adds the \".disabled\" file extension to a malicious program so that it cannot be run natively in Windows (e.g., program.exe becomes program.exe.disabled).", "Windows, ", "['Safer Networking Spybot - Search & Destroy']"], "directory": ["KDE Folder View Properties File", "Contains the folder viewing settings for a directory in KDE (the K Desktop Environment); includes settings such as icon positions and view mode (icon, list, etc.); automatically created when the view settings of a folder are modified; hidden by default.", "Linux, ", "[]"], "disco": ["DISCO Discovery Document", "Information file published by DISCO, a Microsoft application for publishing and discovering Web Services; formatted in XML and contains links to other discovery documents, XSD schemas, and service descriptions.", "Windows, ", "['Microsoft Visual Studio 2017']"], "dis": ["Oracle Discoverer Workbook", "File created by Oracle Discoverer, a spreadsheet program; stores a workbook, which may be comprised of multiple populated spreadsheets, called worksheets; used for business intelligence reporting and analysis.", "Windows, Linux, Windows, ", "['Oracle Discoverer']['Oracle Discoverer']['NETdecompiler.com DisSharp']"], "dir": ["Adobe Director Movie", "Movie or animation project created with Macromedia Director, which was acquired by Adobe in 2005; includes project resources, links to externally referenced files, scripting code, and the timeline, which determines how the movie is played back.", "Windows, Mac, ", "['Adobe Director']['Adobe Director']"], "dim": ["Active@ Raw Disk Image Backup File", "Raw disk image backup created by Active@ Disk Image, a Windows backup and recovery program; stores a raw disk image, which includes configuration data that describes the disk or partition geometry.", "Windows, Windows, Mac, Linux, ", "['Active@ Data Recovery Active@ Disk Image'][][][]"], "dict": ["Dictionary File", "File created for the Microsoft Virtual PC 2007, a virtual machine that enables multiple versions of Windows to operate within the computer their installed on; contains dictionary data such as word definitions and pronunciations referenced by the dictionary tool on the Virtual PC 2007; also contains different languages like French and German.", "Windows, ", "['Microsoft Virtual PC 2007']"], "dig": ["Digilink Audio File", "Audio file saved in the Digilink format.", "Windows, Windows, Mac, ", "['MAGIX Sound Forge Pro 11', 'FMJ-Software Awave Audio']['FMJ-Software Awave Audio'][]"], "diff": ["Patch File", "Patch file created by Mercurial, a control management tool for developers; contains a record of the differences between two versions of the same text or source file; enables updating of older text files to newer version text files; accessed by developers that are making changes to different versions of the same file; also known as .PATCH files.", "Windows, Mac, Linux, ", "['Mercurial']['Mercurial']['Mercurial']"], "dii": ["Summation Batch Load File", "ASCII text file formatted using a non-delimited, multiple line format; used by a Summation Core Database to establish the link between the database summaries and the associated image file.", "Windows, ", "[]"], "dicom": ["DICOM Image File", "Image created in the Digital Imaging and Communications in Medicine (DICOM) format, which was developed by the NEMA (National Electrical Manufacturers Association) for exchanging and viewing medical images, such as CT scans, MRIs, and ultrasound images.", "Windows, Mac, Linux, Web, ", "['File Viewer Plus', 'MeVisLab', 'DicomWorks', 'ImageMagick', 'GIMP']['OsiriX Imaging Software', 'GIMP']['ImageMagick', 'GIMP']['Jack Imaging']"], "dif": ["Data Interchange Format", "A DIF file is a spreadsheet supported by spreadsheet software such as Microsoft Excel and Access and Apache OpenOffice Calc.  It contains spreadsheet data exported from a program.  DIF files are stored in ASCII text, which means they can be viewed and edited with a text editor.", "Windows, Mac, Linux, Windows, Mac, Windows, Windows, Mac, ", "['Microsoft Excel 2016', 'Microsoft Access 2016', 'Corel WordPerfect X8', 'SAS Institute SAS', 'IBM Collaboration Solutions', 'Apache OpenOffice', 'Gnumeric', 'Microsoft Notepad', 'text editor']['Microsoft Excel 2016', 'Planamesa NeoOffice', 'SAS Institute SAS', 'Apache OpenOffice']['Apache OpenOffice', 'Gnumeric']['MAME', 'ExtraMAME']['MacMAME', 'MAME OS X']['Torque Game Engine', 'Torque Constructor']['Apple QuickTime Player', 'Pinnacle Studio 20'][]"], "dib": ["Device Independent Bitmap File", "Generic Windows or OS/2 bitmap graphic; similar to a .BMP file, but has different header information; supports 1, 4, 8, and 24 bits per pixel if the image is uncompressed and 4 and 8 bits per pixel if the image uses RLE compression; a 24-bit DIB image contains 8 bits, or 1 byte for each RGB color.", "Windows, Mac, Linux, ", "['File Viewer Plus', 'Microsoft Windows Photos', 'Microsoft Windows Photo Viewer', 'Adobe Photoshop CC 2017', 'Adobe Photoshop Elements 15', 'Adobe Illustrator CC 2017', 'Adobe InDesign CC 2017', 'Corel PaintShop Pro X9', 'Newera Graphics Converter Pro', 'GIMP']['Adobe Photoshop CC 2017', 'Adobe Photoshop Elements 15', 'Adobe Illustrator CC 2017', 'Adobe InDesign CC 2017', 'GIMP']['GIMP']"], "diagsession": ["Diagnostics Session File", "A DIAGSESSION file is a diagnostics session created by Internet Explorer, a web browser for Windows, or Visual Studio, a software development tool.  It contains diagnostics data from a debug session, which allows developers to troubleshoot problems with an application, such as memory and performance issues.", "Windows, ", "['Microsoft Visual Studio 2017', 'Microsoft Internet Explorer']"], "dic": ["DICOM Image", "A DIC file is an image created in the Digital Imaging and Communications in Medicine (DICOM) format.  It contains an image such as an MRI, ultrasound, or CT scan.  DIC files can also store patient identification data to link the image to a specific individual.", "Windows, Mac, Linux, Windows, Mac, Linux, ", "['RadiAnt Dicom Viewer', 'ezDICOM', 'MicroDicom viewer']['OsiriX Imaging Software', 'MeVisLab', 'XnViewMP', 'GIMP']['MeVisLab', 'ImageMagick', 'XnViewMP', 'GIMP']['Microsoft Word 2016', 'ACD Systems Canvas X 2017', 'Apache OpenOffice', 'IBM Lotus Notes', 'JGsoft EditPad Pro', 'Microsoft Windows', 'LibreOffice', 'Kingsoft Writer']['Microsoft Word 2016', 'Apache OpenOffice', 'LibreOffice']['Apache OpenOffice', 'LibreOffice']"], "diagpkg": ["Troubleshooting Pack File", "File used by the Microsoft Support Diagnostic Tool (msdt.exe), a program used to help users troubleshoot computer problems; contains information required to locate and potentially fix a hardware or software issue; can be run by double-clicking the file in Windows.", "Windows, ", "['Microsoft Support Diagnostic Tool']"], "diagcfg": ["Troubleshooting Pack Configuration File", "Settings file used by the Microsoft Support Diagnostic Tool, a Windows Troubleshooting Platform (WTP) wizard application used to diagnose computer problems; contains configuration information for the troubleshooting pack.", "Windows, ", "['Microsoft Support Diagnostic Tool']"], "diagcab": ["Troubleshooting Pack Cabinet File", "A DIAGCAB file is a file used by the Microsoft Support Diagnostic Tool (also referred to as the WTP Wizard), a Windows Troubleshooting Platform (WTP) program used to locate and fix hardware and software problems in Windows.  It contains a .CAB file and is used specifically for diagnosing and repairing computer problems.", "Windows, ", "['Microsoft Support Diagnostic Tool', 'Microsoft Makecab', 'Microsoft Sign Tool']"], "dia": ["Do It Again Task File", "File created by Do It Again, a Windows utility that records tasks and runs them; contains a macro, which stores actions such as mouse and keyboard events recorded by the user; used for saving an automated task, which can be invoked by the user.", "Windows, Windows, Mac, Linux, ", "['Spacetornado.com Do It Again']['Dia']['Dia']['Dia']"], "dhtml": ["Dynamic HTML file", "Text file that contains DHTML (Dynamic HTML) code; used for developing interactive Web pages that can change without being reloaded or opening another link; can be used to create drop-down menus, floating layers, rollover buttons, and other dynamic content.", "Windows, Mac, ", "['Web browser', 'text editor']['Web browser', 'text editor']"], "dhs": ["HyperSnap Drawing", "Image created by HyperSnap screen capture and annotation software; stores a screen capture image as well as drawn shapes, such as callouts and arrows; allows the image and shapes to be saved and re-edited before rasterizing the final image.", "Windows, ", "['Hyperionics HyperSnap']"], "dgt": ["DST Thumbnail File", "File created by some embroidery design programs; saves a thumbnail image for a corresponding .DST embroidery design file; enables the DST design to be previewed without having compatible DST software.", "Windows, Mac, Linux, ", "['Microsoft Paint', 'image viewer']['Apple Preview', 'image viewer']['GIMP', 'image viewer']"], "dgsl": ["Visual Shader Graph File", "File created by the Shader Designer component of the Visual Studio IDE; contains a directed graph that defines 3D surfaces and operations to be performed on the surfaces (e.g., shading, lighting, etc.); often used by programmers that want to develop shaders visually without manually writing source code.", "Windows, ", "['Microsoft Visual Studio 2017']"], "dgs": ["Dagesh Pro Document", "Word processing document created with Dagesh Pro, a Hebrew-English word processor; supports over 200 Hebrew True-Type fonts and spellcheck for 7 languages; may include formatted text, wrap around graphics, background graphics, tables, and many other objects.", "Windows, Windows, ", "[]['DevSoft 3D Screen Creator']"], "dgn": ["MicroStation Design File", "2D/3D drawing format used by MicroStation construction design software; based on either the Intergraph Standard File Format (ISFF) or the newer V8 DGN standard; can be converted to the more universal .DWG format by AutoCAD LDT.", "Windows, Mac, ", "['Bentley Systems Bentley View', 'Bentley Systems MicroStation', 'Autodesk AutoCAD 2017', 'AutoDWG DGN to DWG Converter', 'IMSI TurboCAD Pro 2017', 'Oracle AutoVue', 'ESRI ArcGIS for Desktop', 'Corel PaintShop Pro X9']['IMSI TurboCAD Deluxe v10']"], "dgml": ["Visual Studio Directed Graph Document", "Developer file created by Visual Studio, a software development application; saves a directed graph, also called a dependency graph, which shows a visual layout of how source code components depend on one another.", "Windows, ", "['Microsoft Visual Studio 2017']"], "dgk": ["Delcam 3D Model File", "Three-dimensional model created by Delcam CAD programs, including PowerSHAPE, PowerMILL, CopyCAD, PowerInspect, and ArtCAM; contains the model geometry, which is comprised of wireframes, surfaces, and solids; used to save and load 3D designs.", "Windows, ", "['Delcam ArtCAM']"], "dhcd": ["DHCD Computing Application Data File", "File used by DHCD Computing File Sniffer, a program used to validate genuine copies of DHCD Computing software; contains data for a DHCD Computing software package, including application and user settings; used both for storing program data and for testing whether the software is authentic.", "Windows, ", "['DHCD Computing File Sniffer']"], "dgc": ["DGCA File Archive", "Archive created by DGCA (DigitalGCodecArchiver), a file compression utility created by Japanese developer Shin-ichi Tsuruta; saves one or more files in a compressed format and can compress at better ratios than the .ZIP format.", "Windows, Windows, Mac, ", "['DGCA']['Intuit TurboTax Deluxe']['Intuit TurboTax Deluxe']"], "dgb": ["FlashCAD Drawing Database", "Database of drawings created with FlashCAD, a 2D and 3D CAD program; saved in a proprietary format that stores design data created with FlashCAD and other Digitarch software; can be viewed on Windows using the free DGB Vista3D program.", "Windows, ", "[]"], "dfx": ["Drafix CAD File", "3D CAD document created with Drafix QuickCAD or Drafix Professional CAD; contains 3D objects and symbols used for creating home layouts and other designs.", "Windows, ", "['Autodesk AutoCAD 2017']"], "dfu": ["iOS DFU File", "Firmware file used by iPhone and iPod devices; stores low-level system data that is used to run the device; contained within an .IPSW update file and is among other files in the IPSW archive; may stand for \"Device Firmware Update\" file.", "iOS, Windows, Mac, ", "['Apple iOS']['MiKTeX', 'text editor']['TeXworks', 'text editor']"], "dft": ["eJuice Me Up Default Settings File", "Default settings file created and used by eJuice Me Up, a program used to mix juices for use in e-cigarettes; stores a user's preferred settings for creating a recipe; includes flavors, target Nicotine strength, and the desired amount to make.", "Windows, Windows, ", "['Breaktru eJuice Me Up'][]"], "dfs": ["BrainSuite Surface File", "File created by BrainSuite, a program used for visualizing MRIs of the brain; stores surface data using triangles and vertices; uses a proprietary format, but can be parsed using the C++ BrainSuite Surface File Reader/Writer, which is provided for free on the BrainSuite website.", "Windows, ", "['BrainSuite']"], "dfproj": ["DVD Flick Project", "DVD video project created with DVD Flick, a DVD authoring tool; may include a navigation menu, multiple video files, custom audio tracks, and subtitles; can be burned to a DVD, which can be played in a standard DVD video player.", "Windows, ", "[]"], "dfp": ["Fusion Plugin File", "Plugin for Blackmagic Design's Fusion, a digital 3D graphics compositing application; adds extra features and functionality to the program; examples include additional image effects, animation effects, compositing functions, and file export capabilities.", "Windows, Mac, ", "['Blackmagic Design Fusion']['Blackmagic Design Fusion']"], "dfont": ["Mac OS X Data Fork Font", "Standard font format used by Mac OS X; font contents are stored in the data fork part of the file instead of the resource fork (which was used by fonts in Mac OS Classic).", "Windows, Mac, ", "['File Viewer Plus', 'DfontSplitter']['Apple Font Book', 'DfontSplitter']"], "dfm": ["Midas ViewPoint Display Form", "Form created by Midas ViewPoint, an object orientated audio-visual information display channel editor and player; used for controlling how information is displayed on screens; contains ViewPoint display objects and related display forms.", "Windows, Windows, ", "[]['File Viewer Plus', 'Embarcadero Delphi']"], "dfk": ["Dark Flow Project File", "Game development project created with Dark Flow, an application used for developing multi-platform video games; contains source code, project settings, and references to resources used by the project, which can include sprites, sounds, backgrounds, paths, and other objects.", "Windows, ", "[]"], "dfg": ["Data Flask Grid File", "Spreadsheet file created by Data Flask, a spreadsheet program designed for data authoring and migration; can include raw cell data as well as connection information for external data sources; also stores column types, primary key identifiers, and other data schema information.", "Windows, ", "['Interscape Data Flask']"], "dff": ["RenderWare Model File", "A DFF file is a three-dimensional model saved in the RenderWare binary stream format.  It is used by various CAD programs and 3D games, such as Grand Theft Auto 3 (GTA3).  DFF files are organized into multiple sections that describe the geometry and materials that compose the model.  Some of the sections in the DFF file are texture, reflection material, model skins, behavior of breakable objects, and specular lighting material. ", "Windows, Windows, ", "['Zanoza ZModeler']['Foobar2000 with foo_input_sacd plug-in', 'HFX Austria DFF to DSF Converter']"], "df2": ["Defractor 2 Instrument", "Software instrument format used by the second version of Defractor, a software synthesizer program; created using waveform oscillators, envelope generators, filters, and other effects.", "Windows, ", "['Neurotix Defractor']"], "df1": ["Omnis Native Datafile", "Proprietary data format used by Omnis development software, which is used to create multi-tier and Web applications; stores data in a database format and can be referenced by Omnis programs.", "Windows, Mac, Linux, ", "[][][]"], "dfc": ["Defractor Instrument", "Software instrument format used by Defractor, a software synthesizer program; created using waveform oscillators, envelope generators, and filters.", "Windows, Windows, Mac, Linux, ", "['Neurotix Defractor']['DeSmuME']['DeSmuME']['DeSmuME']"], "dex": ["Dalvik Executable File", "A DEX file is an executable file saved in a format that contains compiled code written for Android, Google's Linux-based mobile phone platform.  It is technically referred to as a \"Dalvik Executable,\" and can be interpreted by the Dalvik virtual machine.", "Windows, Mac, Linux, Windows, Windows, Mac, Windows, ", "['Google Android SDK']['Google Android SDK']['Google Android SDK']['NCH Disketch']['Microsoft Excel 2016']['Microsoft Excel 2016']['DEXIS DEXview']"], "dewf": ["SoundEdit Recorded Instrument", "Audio file format used to record audio samples for playing back instrument sounds in the Macintosh Sound Cap and SoundEdit programs.", "Mac, ", "[]"], "deviceinfo": ["Device Record", "Record file created by iPhone Configuration Utility, an Apple application used for managing device configuration profiles; contains information about iOS devices created by the iPhone Configuration Utility; Certificate data and a list of applications installed on the device are some examples of the data it holds.", "Windows, Mac, ", "['Apple iPhone Configuration Utility']['Apple iPhone Configuration Utility']"], "deviceids": ["Device Identification FIle", "Identification file created for registering devices in the Member Center, an Apple developer community; contains the name and ID of the specific device.", "Windows, Mac, ", "['Apple iPhone Configuration Utility']['Apple iPhone Configuration Utility']"], "develve": ["Develve Data File", "Data file created by Develve, a software application used for statistical analysis; stores data that can be viewed, analyzed, interpolated, and summarized in the software; can also be used for storing sample size data and DOE matrices.", "Windows, ", "['Develve']"], "det": ["Sage ACT! 5 Email Message", "Proprietary email message format used by ACT!, a contact management program; contains a single email message without any attachments.", "Windows, ", "['Swiftpage Act!']"], "developerprofile": ["Xcode Developer Profile", "File created by Xcode, a program used for developing iOS and Mac OS X applications; stores the developer's profile and is password protected and signed with a private key; used for migrating a profile from one computer to another.", "Mac, ", "['Apple Xcode']"], "dev": ["Dev-C++ Project File", "Programming project created with Dev-C++, an open-source Integrated Development Environment (IDE) for C/C++ software programming; DEV-C++ is distributed under the GNU General Public License.", "Windows, Windows, Mac, ", "['BloodshedSoftware Dev-C++', 'Orwell Dev-C++']['Microsoft Windows']['Parallels Desktop for Mac with Windows installed']"], "desktop": ["Desktop Entry File", "Data file that provides information about an item in a program's menu; specifies details such as the name, icon file, command to run, etc; used in Unix-based operating systems such as CentOS, Ubuntu, and Red Hat Enterprise Linux.", "Linux, ", "[]"], "deskthemepack": ["Windows 8 Desktop Theme Pack File", "A DESKTHEMEPACK file is a desktop theme file introduced with the Windows 8 operating system.  It is saved in the .CAB format and contains background images (.JPG files) as well as a .THEME file, which contains colors, sounds, and other settings used to customize the Windows desktop.  DESKTHEMEPACK files can be downloaded and shared with other Windows users.", "Windows, ", "['Microsoft Windows Personalization Control Panel']"], "desc": ["Battlefield 2 Map Description File", "Game file used by Battlefield 2, a first-person shooter set in a modern warfare environment; describes a map using XML formatting and includes a reference to the map files and the game mode; referenced by the game when loading maps.", "Windows, ", "['Electronic Arts Battlefield 2']"], "desklink": ["Desktop Shortcut", "File that enables Windows users to create shortcuts on the desktop when right-clicking a file or folder and selecting the SendTo → Desktop (create shortcut) option; does not contain any data, but exists as an empty file that notifies Windows to display the menu option.", "Windows, ", "['Microsoft Windows']"], "design": ["Microsoft Expression Design Drawing", "Drawing created with Microsoft Expression Design, a drawing and design program for Windows; may contain both vector and raster graphics; can also include multiple layers and various image effects.", "Windows, ", "['Microsoft Expression Studio']"], "des": ["Pro/DESKTOP CAD File", "2D or 3D drawing created with Pro/DESKTOP, a CAD program used primarily in the education market; shapes created with the program can be viewed as wireframes, transparent, shaded, or enhanced images.", "Windows, Windows, Windows, Mac, ", "[]['Corel DESIGNER Technical Suite X7', 'CorelDRAW Graphics Suite X8']['Intuit QuickBooks Pro 2016']['Intuit QuickBooks for Mac 2016']"], "der": ["DER Certificate File", "Digital certificate file created in the Distinguished Encoding Rules (DER) format; contains a binary representation of the certificate; commonly used for storing X.509 certificates in public cryptography.", "Windows, Mac, Linux, ", "['Microsoft Internet Explorer', 'Mozilla Firefox']['Apple Safari', 'Mozilla Firefox', 'Apple Keychain Access']['Mozilla Firefox']"], "deproj": ["Disketch Project File", "Disc label project created by Disketch, a program used for CD and DVD labels; saves the disc layout information and includes text and references to imported images; allows work to be saved and continued later.", "Windows, ", "['NCH Disketch']"], "dep": ["Windows Dependency File", "File used by various Windows programs or Windows application components; contains run-time requirements for a program, such as needed components or the names of target installation files and directories for an installer; often used for declaring dependencies for productivity tools being integrated with Microsoft Office.", "Windows, ", "['Microsoft Office 2000 Developer']"], "dem": ["Video Game Demo File", "A DEM file is a game replay file created by various first-person shooter games and most popularly by Counter-Strike (supported by Valve's Source game engine).  DEM files are used to record a player's perspective in a single or multiplayer game, which can then be shared with others.", "Windows, Mac, Windows, ", "['Valve Counter-Strike', 'Epic Games Unreal Tournament', 'id Software Quake', 'id Software Hexen 2', 'VirtualDub']['Valve Counter-Strike', 'Epic Games Unreal Tournament', 'id Software Quake']['ESRI ArcGIS for Desktop', 'Golden Software Voxler', 'TatukGIS Viewer', 'MicroMouse AccuTrans 3D']"], "dek": ["Yugioh Virtual Desktop Deck File", "File used by Yugioh Virtual Desktop (YVD), a game used for playing Yu-Gi-Oh! card games online; saved in plain text and contains a list of cards in the deck separated by line breaks; used for saving decks for different styles of gameplay.", "Windows, Windows, Windows, Mac, Linux, Windows, Windows, ", "['XeroCreative Yugioh Virtual Desktop']['Wizards of the Coast Magic: The Gathering Online', 'PalmROOT MTG Studio']['LackeyCCG']['LackeyCCG']['LackeyCCG']['Side-Eight Memorize-It'][]"], "deft": ["Juice Grinder Defaults File", "Grinder defaults file created by Juice Grinder, a program used to create and save juice grinder recipes; contains recipe information, such as nicotine base percentages, target amount to make, flavor types; used to calculate information that is contained in .GRIND files .", "Windows, ", "['Juice Grinder']"], "def": ["Module-Definition File", "Lists the exports and attributes of a program to be linked by an application linker; used in software development when creating a DLL.", "Windows, Windows, Windows, Windows, ", "['Microsoft Visual Studio 2017'][]['Elecbyte M.U.G.E.N.']['IObit Malware Fighter']"], "ded": ["Dr. Engrave Document", "Document created by Dr. Engrave, a program used to design engravings for nametags, nameplates, and awards; contains text and graphics as well as the target layout dimensions; supports raster and vector graphics as well as Windows True Type fonts; can be engraved using a compatible Roland engraving device.", "Windows, ", "[]"], "decrypt": ["Decrypted Microsoft ESD File", "File used by Microsoft's Electronic Software Download (ESD) technology, a software product that helps users install and upgrade purchased software online through the Microsoft store; used as a temporary file during the software installation process.", "Windows, ", "['Microsoft Windows 8']"], "dec": ["Declaration File", "Text-based declaration file used by by ADL (Application Development Language) programs; contains global variables and constants that may be referenced by other files within a programming project.", "Windows, Mac, ", "['text editor']['text editor']"], "deb": ["Debian Software Package", "A DEB file is a standard Unix archive that contains two bzipped or gzipped archives, one for the installer control information and another for the actual data.  DEB files are typically used for software installation packages.", "Windows, Linux, iOS, ", "['File Viewer Plus', '7-Zip', 'IZArc']['Debian package management system', 'Synaptic Package Manager', 'Adept']['Cydia']"], "de": ["DrawExpress Diagram File", "A DE file is a diagram file created by DrawExpress, an app used to draw flowcharts and diagrams.  It contains a diagram, which includes text, shapes, arrows, lines, and colors.  DE files are used to store various types of diagrams, such as flowcharts, decision trees, sequence diagrams, mind maps, data flow diagrams, and organization charts.", "iOS, Android, ", "['DrawExpress']['DrawExpress']"], "ddt": ["Football Manager Keep Player Data File", "Data file used by Football Manager, a game where players manage finances, rosters, and other aspects of football teams; contains plain text instructions that describe imports for football players and teams.", "Windows, Mac, Windows, Windows, Windows, ", "[][][]['Diagram Designer']['Microsoft Age of Mythology', 'AOM Edit']"], "ddl": ["Data Definition Language File", "Database file created in the Data Definition Language (DDL), a language used for describing database schemas; saved in a plain text format and contains commands such as CREATE, USE, ALTER, and DROP; often used for configuring data sources used by data-driven applications.", "Windows, Mac, Linux, ", "['Jetbrains IntelliJ IDEA', 'EclipseLink', 'text editor']['Jetbrains IntelliJ IDEA', 'EclipseLink', 'text editor']['Jetbrains IntelliJ IDEA', 'EclipseLink', 'text editor']"], "dds": ["DirectDraw Surface", "A DDS file is an image file saved in a raster image format used by Microsoft DirectX to store textures and environments.  It can store compressed and uncompressed pixel formats and is sometimes used for storing Windows desktop backgrounds or wallpapers.  DDS files are also used for texturing video game unit models.", "Windows, Mac, Linux, Android, ", "['File Viewer Plus', 'Windows Texture Viewer', 'XnViewMP', 'IrfanView with IrfanView Formats plugin', 'Adobe Photoshop with NVIDIA DDS plugin', 'GIMP with DDS plugin']['XnViewMP']['XnViewMP']['File Viewer for Android']"], "ddrw": ["ClarisDraw Drawing", "Drawing created by ClarisDraw, an older vector graphics editing program for the Macintosh; may contain vector-based shapes, text, and image effects; used for logos, banners, or other graphics that need to be resized without losing image quality.", "Mac, ", "['Dekorra Optics EazyDraw']"], "ddp": ["Delphi Diagram Portfolio File", "Developer file created by Delphi, an IDE often used for creating Windows programs; saves a pictorial representation of dependencies between software components being developed; created by the Diagram Editor that is included with Delphi versions 6 and 7.", "Windows, ", "['Embarcadero Delphi']"], "ddoc": ["DigiDoc Signature File", "A DDOC file is a digital document (DigiDoc) created with qDigiDoc, an open source software used to authenticate Estonian and Finnish government issued ID cards and signed documents.  It contains files that have been signed by a government employee, along with the signatures related to each file, which includes the certificate, validity confirmation, and the validity confirmation service certificate.", "Windows, Mac, Linux, ", "['qDigiDoc']['qDigiDoc']['qDigiDoc']"], "ddf": ["Diamond Directive File", "Diamond Directive File (DDF) used to specify properties for compressing a .CAB file; stored in a plain text format; should not be modified unless necessary.", "Windows, ", "['Microsoft Makecab', 'Microsoft Notepad', 'Microsoft WordPad', 'text editor']"], "ddd": ["Alpha Five Data Dictionary File", "Dictionary file created by Alpha Five, an IDE that enables users to develop Web, desktop, and mobile applications; contains a list of all the elements added to the .DBF file; elements include browses, reports, saved operations, letters, and form designs; functions similarly to the DBF file format as it's a table linked to a .DDM memo file like the DBF file is linked to the .FPT memo file.", "Windows, Windows, ", "['Alpha Software Alpha Anywhere']['Dream Design Entertainment GLBasic SDK']"], "ddcx": ["DivX Descriptor 2 File", "Fichier descriptor file created by DivX Descriptor 2; formatted in XML and contains descriptions of DivX-formatted DVD movies; may include information such as the movie's plot summary, duration, director, actors, movie poster, etc.", "Windows, ", "[]"], "dcu": ["Delphi Compiled Unit", "Compiled unit (.PAS) file; typically has the same name as the source code file, i.e. \"source.dcu\" is the compiled version of \"source.pas.\"", "Windows, ", "['Embarcadero Delphi']"], "ddc": ["DivX Descriptor File", "Fichier descriptor file that contains descriptions of DivX-formatted DVD movies; includes information such as the movie's plot summary, duration, director, actors, movie poster, etc.", "Windows, ", "[]"], "ddb": ["Digidesign Database", "Application support file created by Pro Tools, a digital audio workstation (DAW) application; contains application support information for an audio project and uses the filename volume.ddb.", "Windows, Mac, Windows, Windows, Mac, ", "['Avid Pro Tools']['Avid Pro Tools']['Westwood Studios Command & Conquer: Renegade'][][]"], "dd": ["DiskDoubler Archive", "Compressed file archive created by Macintosh DiskDoubler for Mac OS Classic; uses the LZ78 compression algorithm; compresses files in place on the hard drive, which are expanded on-the-fly when opened; compressed automatically in the background using AutoDoubler.", "Mac, ", "['The Unarchiver']"], "dcx": ["FAXserve Fax Document", "Fax format used by ACCPAC FAXserve, a program that can send, receive, and broadcast faxes from a computer; saves images and text in a digital format that is viewable by multiple fax programs.", "Windows, Windows, Mac, Windows, ", "[]['Corel PaintShop Pro X9', 'Adobe Photoshop CC 2017', 'ACD Systems ACDSee 20', 'Nuance PaperPort 14', 'Nuance OmniPage Ultimate', 'XnViewMP', 'IrfanView', 'CoolUtils Total Image Converter']['Adobe Photoshop CC 2017', 'XnViewMP']['Microsoft Visual FoxPro']"], "dcuil": ["Delphi .NET Compiled Unit File", "Developer file created by Delphi, an application used for building Windows programs; similar to a .DCU file (Delphi's native Win32 compiled unit format) but is compiled for Microsoft's .NET Framework; compiled from a .PAS file.", "Windows, ", "['Embarcadero Delphi']"], "dctmp": ["DC++ Partially Downloaded File", "Incomplete file downloaded over the Internet with DC++, an open source Direct Connect compatible alternative client used for file sharing; if a DCTMP file download is stopped, it can be resumed by DC++ as long as the file is available on an active server.", "Windows, ", "['DC++']"], "dct": ["Dictionary File", "Data file used by various dictionary, translation, or word processing applications; typically contains a list of words and may also include definition or translation information; often used for spell-checking and may be available in different languages.", "Windows, Mac, Windows, Mac, Windows, Windows, Windows, Mac, Linux, ", "['QuarkXPress', 'VerbAce-Pro']['QuarkXPress']['NCH Express Scribe', 'NCH Express Dictate', 'NCH Switch']['NCH Express Scribe', 'NCH Express Dictate', 'NCH Switch']['Microsoft Visual FoxPro']['Autodesk AutoCAD 2017']['DeSmuME']['DeSmuME']['DeSmuME']"], "dcst": ["Adobe InDesign Document Presets File", "Settings file used by Adobe InDesign, an application used for publishing documents to digital and print media; contains presets for a new document, such as margin widths and other page layout information; used for authoring documents that have the same template.", "Windows, Mac, ", "['Adobe InDesign CC 2017']['Adobe InDesign CC 2017']"], "dcs": ["Desktop Color Separation File", "Color-separated .EPS file; often saved as a collection of files, one for each color; the individual files are used as \"plates\" for printing individual colors of an image; allows colors to be separated properly before being sent to the printer.", "Windows, Mac, ", "['QuarkXpress', 'Adobe Photoshop CC 2017', 'Adobe Illustrator CC 2017', 'Adobe InDesign CC 2017']['QuarkXpress', 'Adobe Photoshop CC 2017', 'Adobe Illustrator CC 2017', 'Adobe InDesign CC 2017']"], "dcr": ["Shockwave Media File", "A DCR file is an interactive media file saved in the Shockwave format for distribution on the web.  It is often used for creating web games and other highly interactive content.", "Windows, Mac, Windows, Windows, Mac, iOS, Android, Windows, Mac, Windows, Mac, iOS, Android, ", "['Adobe Director', 'Adobe Shockwave Player', 'Echo One iSwiff', 'dirOpener']['Adobe Director', 'Adobe Shockwave Player', 'Echo One iSwiff']['Embarcadero Delphi']['File Viewer Plus', 'Adobe Photoshop CC 2017', 'Microsoft Windows Photos', 'Microsoft Windows Live Photo Gallery', 'Adobe Photoshop Elements 15', 'Kodak Professional DCS Custom Looks Software', 'CorelDRAW Graphics Suite X8', 'ACD Systems ACDSee 20', 'ACD Systems Canvas X 2017', 'Google Picasa']['Adobe Photoshop CC 2017', 'Adobe Photoshop Elements 15', 'Kodak Professional DCS Custom Looks Software', 'Google Picasa']['Adobe Photoshop Express']['File Viewer for Android', 'Adobe Photoshop Express']['BIS Digital DCR Player', 'BIS Digital Digital Court Recorder']['BIS Digital DCR Player', 'BIS Digital Digital Court Recorder']['High Criteria Liberty Court Recorder', 'High Criteria Liberty Player']['High Criteria Liberty Player']['High Criteria Liberty Player']['High Criteria Liberty Player']"], "dcproj": ["Dashcode Project", "Development project created by Dashcode, a developer IDE used for creating dashboard widgets and iOS Safari Web apps; includes the designed layout, graphics, and scripted logic for interactive elements; written using HTML, JavaScript, and CSS.", "Mac, ", "['Apple Dashcode']"], "dcpr": ["Adobe DNG Camera Profile Recipe File", "Document created by DNG Profile Editor, a free Adobe application used to create .DCP digital camera profiles; stores color tables, tone curve, and color matrices used to render RAW images; used for saving, loading, and editing the properties of a camera profile.", "Windows, Mac, ", "['Adobe DNG Profile Editor']['Adobe DNG Profile Editor']"], "dcpf": ["Disc Copier Project File", "Project file created by older versions of Roxio disc software; contains settings for copying a disc; includes the input video content, the output disc format, and other settings; used for converting and burning discs.", "Windows, ", "['Roxio Creator NXT Pro 5']"], "dcover": ["Disc Cover File", "CD or DVD graphic created by Disc Cover, a program used to create and print disc labels; contains text, graphics, and layout properties for a disc; can be printed to a disc or exported as a .JPEG, .PDF, or .TIFF file.", "Mac, ", "['Roxio Popcorn', 'BeLight Disc Cover']"], "dco": ["Safetica Free Encrypted Virtual Disk Archive", "File created by Safetica Free, a program used for securely encrypting personal and business data; stores a virtual disk in an encrypted format and can be securely stored on external devices such as USB keys; similar to a .DCF file, which is used for encrypted file archives.", "Windows, ", "['Safetica Free']"], "dcl": ["AutoCAD Dialog Definition File", "Custom dialog definition file used by AutoCAD, a CAD design and documentation software application; contains dialog box settings, such as the title, buttons, text, list boxes, and other components; typically referenced by an application component, which displays the dialog box in order to receive user input.", "Windows, Windows, ", "['Autodesk AutoCAD 2017'][]"], "dcmf": ["DiskCatalogMaker Catalog", "Catalog file created by DiskCatalogMaker, a disc file cataloging application for Mac OS X; contains a database of files that are stored on multiple discs; used for storing searchable information about one or more discs.", "Mac, ", "['Fujiwara DiskCatalogMaker']"], "dcmd": ["DiskCatalogMaker Thumbnail-Enabled Catalog", "Thumbnail-enabled catalog file format used by DiskCatalogMaker, a file cataloging program for Mac OS X; contains a database of files that are stored on multiple discs; created with DiskCatalogMaker 5.5 or later.", "Mac, ", "['Fujiwara DiskCatalogMaker']"], "dcf": ["DRM Content Format File", "Media file encoded with DRM (Digital Rights Management) copy-protection; used by some cell phones for saving protected ringtones, pictures, videos, and other media clips; similar to a .DM file, but the rights object, which allows the encrypted data to be played back, is contained in a separate file.", "Windows, Mac, Windows, Windows, Windows, ", "['Sony Ericsson DRM Packager', 'Sony Memory Card File Rescue']['Sony Ericsson DRM Packager']['Safetica Free'][][]"], "dck": ["Resolume Deck File", "File created by Resolume, a program used to create live audio-visual performances; contains a \"deck,\" which is made up of channels, each of which use visual sources, such as video clips, flash animations, live video feeds, and raster images; used to store a pre-configured collection of visual materials and their properties.", "Windows, Mac, ", "[][]"], "dce": ["DriveCam Video File", "Video format used by DriveCam, a small video recorder that monitors driving activity and records audio and video inside and outside a vehicle.", "Windows, ", "['DriveCam Event Player']"], "dc3": ["DesignCAD 3D ASCII Drawing", "Three-dimensional drawing created by DesignCAD 3D MAX, a CAD design and drafting program; encodes the 3D drawing in ASCII text and includes all drawn elements; used as a plain text alternative to the .DCD file format.", "Windows, ", "['IMSI DesignCAD 3D Max 2016']"], "dcd": ["DesignCAD Drawing", "2D or 3D drawing created with DesignCAD, a basic CAD program developed by IMSI/Design; used for creating architectural and mechanical drawings; may be designed from scratch or built from preloaded designs included with the software.", "Windows, Mac, Windows, ", "['IMSI TurboCAD Pro 2017', 'IMSI DesignCAD 2016']['IMSI TurboCAD Deluxe v10'][]"], "dc2": ["DesignCAD 2D ASCII Drawing", "2D drawing created by DesignCAD, a CAD design and drafting application; encodes the drawing in ASCII text and includes all drawn elements; used as a plain text alternative to the .DCD drawing format.", "Windows, Windows, Mac, Windows, ", "['IMSI DesignCAD 2016', 'IMSI DesignCAD 3D Max 2016']['Serif PhotoPlus', 'FileStream Image Broadway', 'Adobe Photoshop with LaserSoft Imaging SilverFast DC plug-in']['Adobe Photoshop with LaserSoft Imaging SilverFast DC plug-in']['DevCad Cam Pro']"], "dc1": ["DevCad Document", "CAD file created by DevCad, a Windows CAD application; saves a 2D drawing for a construction or engineering design; used as the native format for saving CAD documents.", "Windows, Windows, ", "['DevCad'][]"], "dbt": ["Database Text File", "Text file used for memo fields of dBASE and other xBase database programs.", "Windows, ", "['dBase', 'Microsoft Visual FoxPro', 'Swiftpage Act!', 'text editor']"], "dcp": ["Adobe DNG Camera Profile", "Digital negative (DNG) camera profile used by Adobe image-editing products, such as Adobe Photoshop and Photoshop Lightroom; contains the initial color rendering settings when importing a RAW digital photo; describes the interpretation of color information for digital raw image data.", "Windows, Mac, Windows, ", "['Adobe Photoshop CC 2017', 'Adobe Photoshop Lightroom 6', 'Adobe DNG Profile Editor']['Adobe Photoshop CC 2017', 'Adobe Photoshop Lightroom 6', 'Adobe DNG Profile Editor']['Embarcadero Delphi']"], "dc": ["DesignCAD Design File", "3D design created with IMSI DesignCAD, a basic CAD software program; used for creating three-dimensional models, including wireframe and solid objects; may also be animated within the DesignCAD program.", "Windows, Mac, ", "['IMSI TurboCAD Pro 2017', 'IMSI DesignCAD 2016']['IMSI TurboCAD Deluxe v10']"], "dbx": ["Outlook Express E-mail Folder", "Folder created by Outlook Express, a Microsoft email program; contains email messages for a specific mailbox; typically saved within the \"Documents and Settings\" user directory; may be copied to another folder in order to backup e-mail messages.", "Windows, Windows, Windows, ", "['Microsoft Outlook Express', 'Microsoft Windows Mail', 'Microsoft Windows Live Mail', 'Remo Recover Outlook Express', 'OE-Mail Recovery', 'DBXtract', 'Stellar DBX to PST Converter']['Autodesk AutoCAD 2017']['Microsoft Visual FoxPro']"], "dbv": ["Database Variable Field", "Defines database fields of variable length; can be used to designate the size of text and binary (BLOB data type) fields; referenced by an xBase-compatible database (.DBF) file with the same name.", "Windows, ", "['dBase', 'multisoft FlagShip']"], "dcm": ["DiskCatalogMaker Catalog File", "A DCM file is a file saved in the catalog format used by DiskCatalogMaker, a file cataloging and organization program for the Mac.  It contains a database of files stored on multiple discs that can be searched by filename and other attributes.", "Mac, Windows, Mac, Linux, Windows, ", "['Fujiwara DiskCatalogMaker']['File Viewer Plus', 'ACD Systems Canvas X 2017', 'ezDICOM', 'MicroDicom viewer', 'MeVisLab', 'IrfanView', 'XnViewMP', 'GIMP']['OsiriX Imaging Software', 'MeVisLab', 'XnViewMP', 'GIMP']['MeVisLab', 'ImageMagick', 'XnViewMP', 'GIMP']['FMJ-Software Awave Studio', 'Logipole Konvertor']"], "dbs": ["SQLBase Database File", "Database file created by SQLBase, an embedded database solution for business applications; stores structured data and tracks changes to the data in a \".log\" file; often used for storing data for small desktop programs or mobile applications.", "Windows, Linux, Windows, Linux, ", "['Gupta SQLBase']['Gupta SQLBase']['GAMBIT']['GAMBIT']"], "dbq": ["AutoCAD Query Set", "Set of SQL queries saved by AutoCAD, a professional 3D CAD application; used to access records from a database table; typically created using the Query Editor, which can be accessed through the dbConnect Manager.", "Windows, Mac, ", "['Autodesk AutoCAD 2017']['Autodesk AutoCAD 2017']"], "dbpro": ["DarkBASIC Professional Project File", "Project file created by DarkBASIC Professional, a free IDE used for developing 3D Windows games; saved in a plain text format and contains references to .DBA source code files for the project as well as other project assets, such as 3D models, textures, and other graphics; can be compiled into an .EXE game executable.", "Windows, ", "['The Game Creators DarkBASIC']"], "dbr": ["DeepBurner Disc Project", "Project file created by DeepBurner, a CD and DVD burning application; includes references to the disc content data as well as autorun and disc author information; used for backups, photo albums, and audio and video discs.", "Windows, ", "['Astonsoft DeepBurner']"], "dbproj": ["Visual Studio Database Project File", "Database project created by Visual Studio, a Microsoft software development tool used to create Windows and Web programs; stores project information using XML formatting, such as build preferences, included libraries, and references to source code files and application assets.", "Windows, ", "['Microsoft Visual Studio 2017']"], "dbo": ["DarkBASIC Object", "Program object created with DarkBASIC Pro, a development program for creating 3D games, slideshows, and other applications; developed using the BASIC programming language; may include game levels, 3D models, textures, and other related data.", "Windows, ", "[]"], "dbml": ["Visual Studio OR Design File", "XML file created by Microsoft's Object Relational (OR) Designer, which is included with Visual Studio and other Microsoft database software development tools; contains \"LINQ to SQL\" (Language-Integrated Query to Structured Query Language) entity classes that map to objects within a database.", "Windows, ", "['Microsoft SQL Server 2016', 'Microsoft Visual Studio 2017']"], "dbk": ["Sony Ericsson Mobile Phone Backup File", "Mobile phone backup file created by Sony Ericsson PC Suite, a program used to manage Sony Ericsson mobile phones; stores phone information, such as contacts, in a compressed format.", "Windows, Windows, ", "['Sony Ericsson PC Suite', 'FJ Software Development MyPhoneExplorer', 'Amrak Software phoneMiner']['dBase']"], "dc4": ["ViaThinkSoft (De)Coder 4 File", "Coded file that has been encrypted with (De)Coder, a file encryption program written by Daniel Marschall; includes multilingual support and high security; files can be coded and decoded using a command line interface or using the program's drag and drop capabilities.", "Windows, ", "[]"], "dbm": ["ColdFusion Server File", "Web page written in DBML (Database Markup Language), the predecessor to Adobe's CFML (ColdFusion Markup Language); executed by a web server running ColdFusion, which generates HTML that is sent to a user's computer; similar to a .ASP or .PHP file, but requires ColdFusion to be run.", "Windows, Mac, Linux, Windows, Mac, ", "['Adobe ColdFusion 2016', 'Adobe ColdFusion Builder', 'Microsoft Internet Explorer', 'Mozilla Firefox']['Adobe ColdFusion 2016', 'Adobe ColdFusion Builder', 'MacroMates TextMate', 'Apple Safari', 'Mozilla Firefox']['Mozilla Firefox']['DAZ 3D DAZ Studio 4']['DAZ 3D DAZ Studio 4']"], "dcb": ["Concordance Database File", "Database file created by Concordance, a litigation document management program; saves the database structure but does not save the actual data records; acts as the database \"project file\" because the database loads when it is opened.", "Windows, ", "['LexisNexis Concordance']"], "dbgsym": ["Debug Symbols File", "Debugging file used by various Unix-based applications; stores debugging symbols used to report the status of the application and environment when a crash occurs; enables developers to trace bugs easier.", "Windows, Linux, ", "['Pidgin']['Pidgin']"], "dbl": ["DAZ Brick Light File", "3D shader settings file created by DAZ Studio 3D modeling software; stores settings for a light shader; can be opened and edited with the Shader Mixer, which can be viewed by selecting Tools → Tabs → Shader Mixer; used for saving light shader presets.", "Windows, Mac, ", "['DAZ 3D DAZ Studio 4']['DAZ 3D DAZ Studio 4']"], "dbg": ["Visual FoxPro Debugger Configuration File", "A DBG file is a debugger configuration file used by Visual FoxPro, a database management program for Windows.  It contains symbols used to debug Visual FoxPro database applications.", "Windows, ", "['Microsoft Visual FoxPro']"], "dbf": ["Database File", "A DBF file is a standard database file used by dBASE, a database management system application.  It organizes data into multiple records with fields stored in an array data type.  DBF files are also compatible with other \"xBase\" database programs, which arose because of the file format's popularity.", "Windows, Mac, Linux, Windows, ", "['dBase', 'Microsoft Access 2016', 'Microsoft Excel 2016', 'Microsoft Visual FoxPro', 'Corel Quattro Pro X8', 'Apache OpenOffice', 'HiBase Group DBF Viewer 2000', 'Astersoft DBF Manager', 'DBF Viewer Plus', 'DBFView', 'Swiftpage Act!', 'Alpha Software Alpha Anywhere']['Planamesa NeoOffice', 'Apache OpenOffice', 'GTK DBF Editor']['Apache OpenOffice', 'GTK DBF Editor', 'multisoft FlagShip']['Microsoft Visual FoxPro']"], "dbd": ["DemoShield Project", "Demo project created with DemoShield, a program for creating installable demos of software applications; also used for authoring multimedia presentations; saved in packaged format that can be distributed via disc or the Web.", "Windows, ", "[]"], "dbc": ["FoxPro Database", "A DBC file is a database created with Visual FoxPro, a database development system.  It contains a database saved in the Database Container (DBC) format.", "Windows, Windows, Mac, ", "['Microsoft Visual FoxPro']['DAZ 3D DAZ Studio 4']['DAZ 3D DAZ Studio 4']"], "dbb": ["Skype User Information File", "Contains information about a Skype user, including the user profile and contact list; also stores chat history information, which can be browsed using a Skype utility like skypr.", "Windows, Mac, Linux, ", "['Skype', 'skypr', 'NirSoft SkypeLogView']['Skype']['Skype']"], "db3": ["SQLite Database File", "Database file created by SQLite, a lightweight, self-contained database program that creates databases using plain files; contains the database structure as well as data records; used for storing and retrieving structured data using SQL.", "Windows, Mac, Linux, ", "['SQLite']['SQLite']['SQLite']"], "db1": ["Tekla Structures Model File", "File created with Tekla Structures building information management (BIM) software; saves a structural 3D model of a building or construction site plan and can accurately represent materials and structural complexity; used for saving building plans before they are constructed.", "Windows, ", "['Tekla Structures']"], "dba": ["CryENGINE Animation Database File", "File created by the CryENGINE SDK, a set of game developer programs used for making PC and console games; saves 3D character animation data in a highly optimized and compressed format that is suitable for use with the final constructed game.", "Windows, Windows, Windows, Mac, ", "['Crytek CryENGINE SDK']['The Game Creators DarkBASIC', 'Microsoft Notepad', 'text editor']['Palm Desktop', 'Yahoo! Calendar', 'Yellow River Arts Dba2Csv']['Palm Desktop', 'Yahoo! Calendar']"], "db-shm": ["SQLite Database Shared Memory File", "Temporary file created by SQLite, a compact database program often embedded into mobile and desktop applications; used by the database for shared memory storage and is automatically created and maintained by SQLite; not meant to be opened manually.", "Windows, Mac, Linux, ", "['SQLite']['SQLite']['SQLite']"], "db-wal": ["SQLite Database Write-Ahead Log File", "Temporary database file created by SQLite 3.7.0 or later, a compact database program commonly embedded into mobile and desktop applications; saves write-ahead log (WAL) information for the database; automatically created and managed by the database.", "Windows, Mac, Linux, ", "['SQLite']['SQLite']['SQLite']"], "dax": ["PSP Compressed ISO Disc Image", "Compressed disc image format used by the Sony PlayStation Portable (PSP) device; contains a \"dump\" of the data from a PSP UMD disc in a compressed .ISO file; can be opened with UMDGen or another disc image utility.", "Windows, ", "['UMDGen', 'PSP ISO Compressor', 'CisoPlus!', 'YACC']"], "db": ["Mobile Device Database File", "A DB file is a database file used on mobile devices such as Android, iOS, and Windows Phone 7 mobile phones.  It is often used to store contacts and SMS information but may store any type of device or application data.  DB files are commonly stored in an SQLite database format but may also be locked or encrypted so the user cannot see the data directly.", "Windows, Mac, Linux, iOS, Windows, Mac, Linux, Windows, Windows, Windows, Windows, Mac, Linux, ", "['SQLite']['SQLite']['SQLite']['Apple iOS']['Microsoft Access 2016', 'LibreOffice', 'Synopsys Design Compiler Graphical', 'SQLite']['SQLite', 'LibreOffice']['SQLite', 'LibreOffice']['Microsoft Windows']['Tencent QQ'][]['Skype']['Skype']['Skype']"], "dav": ["DVR365 Video File", "A DAV file is a video created by a DVR365 digital video recorder, such as the DSD304, DSD308, or DSD316 DVR.  It incorporates modified MPEG compression and is saved in an encrypted format.  DAV files are used for recording video captured by CCTV cameras.", "Windows, Mac, ", "['DVR365 Player Software', 'Amcrest Smart Player']['Amcrest Smart Player']"], "dazip": ["Dragon Age: Origins Game File", "Compressed game archive used by Dragon Age: Origins, a dark heroic fantasy game developed by BioWare and published by Electronic Arts (EA); contains a package of exported resources (called Encapsulated Resource Files, or .ERF files) that can be installed into the game; used for adding game content, such as new adventures, battles, creatures, and stories.", "Windows, ", "['Electronic Arts Dragon Age: Origins', 'BioWare Dragon Age Toolset', 'Corel WinZip 21', 'WinRAR 5', '7-Zip']"], "daz": ["DAZ Studio 3D Scene", "Three-dimensional scene created by DAZ Studio, a 3D modeling program often used for creating virtual characters; may store a model of a person as well as the surrounding environment; can include poses, animations, wardrobes, and lighting effects; used as the native scene format for DAZ Studio.", "Windows, Mac, ", "['DAZ 3D DAZ Studio 4']['DAZ 3D DAZ Studio 4']"], "dat_new": ["Minecraft World Level File", "Game file used by Minecraft, a game that allows open-ended 3D exploration and construction; stores data that is used to reconstruct the state of the world when a Minecraft game is restarted; sometimes created when a Minecraft server crashes.", "Windows, Mac, Linux, ", "['Mojang Minecraft']['Mojang Minecraft']['Mojang Minecraft']"], "dat_mcr": ["Minecraft Level.dat Backup File", "File created by Minecraft, an open-ended 3D construction game; saves a backup of the level.dat file when the newer version of the game updates from the older \"Region\" (.MCR) format to the newer \"Anvil\" (.MCA) format.", "Windows, Mac, Linux, ", "['Mojang Minecraft']['Mojang Minecraft']['Mojang Minecraft']"], "dat": ["Data File", "A DAT file is a generic data file created by a specific application.  It may contain data in text or binary format, and text-based DAT files can be viewed in a text editor.  DAT files are typically accessed only by the application that created them.  ", "Windows, Mac, Windows, Windows, Mac, iOS, Windows, Mac, Linux, Windows, Windows, Windows, Mac, Windows, Web, Windows, Mac, Linux, Linux, ", "['text editor']['text editor']['Piriform CCleaner 5', 'Piriform Recuva 1', 'Piriform Defraggler 2', 'Piriform Speccy 1']['File Viewer Plus', 'Microsoft Windows Mail', 'Microsoft Outlook 2016', 'Encryptomatic Message Viewer Lite', 'Traction WinMail Decoder Pro', 'Winmail.dat Reader', 'Biblet WMDecode']['Kupon.BG Klammer']['Kupon.BG Klammer 3', 'Winmail.dat File Viewer Pro']['Mojang Minecraft', 'NBTExplorer', 'INVedit', 'MCPlayerEdit']['Mojang Minecraft', 'NBTExplorer', 'MCPlayerEdit']['Mojang Minecraft', 'NBTExplorer']['Microsoft Windows']['Piriform CCleaner 5', 'Piriform Recuva 1', 'Piriform Defraggler 2', 'Piriform Speccy 1']['Electronic Arts SimCity 4', 'Electronic Arts Building Architect Tool', 'iLive Reader', 'DatGen']['Electronic Arts SimCity 4'][]['U.S. Nonimmigrant Visa Application']['File Viewer Plus', 'CyberLink PowerDirector 15 Ultra', 'CyberLink PowerProducer 6', 'Nero 2017', 'GRETECH GOM Player', 'VideoLAN VLC media player', 'VCDGear', 'MPlayer']['Eltima Elmedia Player', 'VCDGear', 'VideoLAN VLC media player', 'MPlayer']['VCDGear', 'VideoLAN VLC media player', 'MPlayer']['Porteus']"], "dash": ["MPEG-DASH Video File", "Video file created for high quality video playback on sites such as YouTube and Netflix; contains HTTP based segments of media content, such as .MP4 files, that are encoded with different bit rates in order to keep a video playing through changing network conditions.", "Windows, Mac, Windows, Mac, Web, iOS, Android, ", "['VideoLAN VLC 2.0 Twoflower', 'RealNetworks RealPlayer Cloud', 'DASHEncoder']['VideoLAN VLC 2.0 Twoflower']['Dashlane']['Dashlane']['Dashlane']['Dashlane']['Dashlane']"], "daschema": ["RemObjects Data Abstract Schema File", "Database file created by Data Abstract, a database development software included with the RemObjects SDK; uses XML formattting and saves the schema of the database; edited using the Data Abstract Schema Modeler, a program that is part of Data Abstract.", "Windows, ", "['RemObjects SDK', 'RemObjects Data Abstract']"], "das": ["DeltaMaster Analysis Session", "Session file created by DeltaMaster, an integrated Business Intelligence suite used for business data analysis and reporting; contains information about the analysis model (.DAM file), along with the reports, the history of the session, and optionally, the values for a specific view of the reports.", "Windows, ", "['Bissantz DeltaMaster']"], "dart": ["Dart Source Code File", "A DART file is a source code file that contains Dart programming language.  It is used for building web, server, and mobile applications and IoT devices.  Dart programming language an object-oriented language with C-style syntax that supports mixins, abstract classes, optional typing, and interfaces.", "Windows, Mac, Linux, ", "['Dart']['Dart']['Dart']"], "da0": ["Windows Registry Backup File", "Backup of the Registry database used by Windows; contains a copy of original registry files; for example, system.da0 is the backup file for system.dat.", "Windows, ", "[]"], "d88": ["Toshiba Pasopia 7 Disk File", "Disk image saved in the Toshiba Pasopia 7 format; can be created from a Teledisk archive (.TD0 file) using the t2d file conversion program; may be opened by eQC-10, an open-source Epson QC-10/QX-10 emulator for Windows.", "Windows, ", "[]"], "d64": ["Commodore 64 Disk Image", "Disk image saved from a Commodore 64 disk; Commodore 64, or C64, was a popular personal computer in the 1980s", "Windows, Mac, ", "['WinVICE', 'CCS64']['VICE']"], "d3d": ["Game Maker 3D File", "3D model file used by Game Maker, an application used to develop 2D and 3D games; stores a model mesh, which can be texturized; used for loading game objects, such as buildings, monsters, and items.", "Windows, ", "['YoYo Games Game Maker']"], "d2v": ["DVD2AVI File", "Project file generated by DVD2AVI that contains instructions on how to process a group of video files; typically links to several .VOB files with notes about how to process each one; often used for encoding video.", "Windows, ", "['VirtualDub']"], "d3v": ["Datel Video File", "Video format used by Datel's Max Media Player and Games 'n' Music software for the Nintendo DS; saved in a proprietary format that can only be played on the Nintendo DS or on a PC using the Datel MAX Media Player.", "Windows, ", "[]"], "d3dbsp": ["Call of Duty Map File", "Map file used by Call of Duty first-person shooter games; based off of the popular Binary Space Partitioning (.BSP) format but uses proprietary additions and encoding; may store terrain, buildings, textures, lighting, and other map features.", "Windows, Mac, ", "['Activision Call of Duty 4: Modern Warfare', 'Activision Call of Duty: Black Ops', 'Activision Call of Duty 2']['Activision Call of Duty 4: Modern Warfare', 'Activision Call of Duty: Black Ops', 'Activision Call of Duty 2']"], "d01": ["OPL2 FM Audio File", "A D01 file is an audio file generated by the OPL2 FM synthesizer.  It contains music from an OPL2 FM synthesizer that can be played by an emulator.", "Windows, Windows, ", "[]['FarStone VirtualDrive 16 Pro']"], "d00": ["VirtualDrive Disc Image Part File", "Partial disc image file created by VirtualDrive, a disc imaging and burning application; saves one part of an overall disc image where other parts use the extensions \".d01,\" \".d02,\" etc.; used when the size limit of a disc image is exceeded so that the volume is split across multiple files.", "Windows, Windows, ", "['FarStone VirtualDrive 16 Pro']['Nullsoft Winamp with AdPlug or Ganbatte! plug-in']"]}