{"e01": ["EnCase Image File", "Forensics disk image file created by EnCase, a forensics software application; saves an exact copy of the contents extracted from a subject device's disk; can be mounted and read by EnCase or another program that supports the E01 format.", "Windows, ", "['Guidance EnCase Forensic', 'Guidance EnCase eDiscovery', 'Guidance EnCase Cybersecurity', 'GetData Mount Image Pro', 'PassMark OSForensics', 'ASR Data SmartMount', 'Libewf']"], "ecp": ["EasyC Project File", "Project file created by easyC, a drag-and-drop programming environment for programming Vex robots; stores robot logic and commands as a series of visual blocks in a flowchart; can be compiled by easyC and then uploaded to a Vex robot, which executes the instructions.", "Windows, ", "['Intelitek easyC']"], "eco": ["ECCO Database File", "Database of information saved by ECCO, a personal information management program; may include calendar, phone book, spreadsheets, notes, and other data.", "Windows, ", "[]"], "e00": ["ArcInfo Coverage Export File", "Contains Geographic Information Systems (GIS) mapping data exported by ArcGIS software; includes Desktop GIS, Server GIS, Hosted GIS, Mobile GIS, and ArcGIS Online programs.", "Windows, ", "['ESRI ArcGIS for Desktop', 'Safe Software FME Desktop', 'ACD Systems Canvas X 2017', 'Golden Software Voxler', 'TatukGIS Viewer']"], "edat": ["E-DataAid 1.x File", "File created by E-DataAid version 1, a data manipulation tool included with E-Prime psychology study software; saves data in the format of rows and columns; saves participant input data during the data collection phase; can be exported to StatView, SPSS, Microsoft Excel, Compressed IFIS, and text formats for statistical analysis.", "Windows, Windows, ", "['Psychology Software Tools E-Prime']['Microsoft Windows with USB connection']"], "ecm": ["ECM Disc Image", "Disc image created in the Error Code Modeler (ECM) format; stores the disc image by removing redundant error correction codes and checksums; allows the CD image to be reduced in size for transmission over the Internet; often used for compressing game console disc images.", "Windows, Mac, ", "['Gemc', 'ECM']['Rbcafe ECM', 'ECM GUI']"], "ecw": ["Enhanced Compression Wavelet Image", "Compressed image created in the Enhanced Compression Wavelet (ECW) format, which was developed by Earth Resource Mapping, but is now owned and maintained by ERDAS; stores an image designed for use with geospatial data.", "Windows, ", "['ERDAS IMAGINE', 'ACD Systems Canvas X 2017', 'Safe Software FME Desktop', 'ESRI ArcGIS for Desktop', 'TatukGIS Viewer', 'IrfanView']"], "eda": ["Ensoniq ASR Disk Image", "Copy of a disk formatted for the Ensoniq Advanced Sampling Recorder (ASR) digital music production studio", "Windows, ", "[]"], "ecl": ["Touhou Stage Script", "Game file used by Touhou games such as Double Spoiler and Ten Desires; contains a stage script, which provides the locations of enemies and the form of \"danmaku patterns,\" which are the patterns of enemy bullets shot on the screen (e.g., spirals, circles, etc.).", "Linux, Windows, ", "['Touhou Toolkit']['Management-Ware Mass Mailing News']"], "ecf": ["Outlook Add-in", "File that adds extra features to the MS Outlook e-mail program; can be managed using Add-In Manager underneath \"Advanced Options\" within Outlook.", "Windows, Windows, ", "['Microsoft Outlook 2016']['The Sage Group SageCRM']"], "ecx": ["ECCO Corrupted Database File", "Database file created with ECCO, a personal information management (PIM) program; may contain corrupted data that cannot be read by ECCO.", "Windows, ", "[]"], "ect": ["Yozo Office Chart Template File", "Template created by Evermore Integrated Office, an office document creator suite; contains a chart template with customized settings, such as chart colors, data, and graph type; similar to .EIT files.", "Windows, Linux, ", "['Yozosoft Yozo Office']['Yozosoft Yozo Office']"], "ece": ["Escenic Dynamic Web Page", "Web page dynamically generated by the Escenic Content Engine, an advanced platform for Web publishing and content management; typically contains server-side code that is parsed by the Web server, which generates HTML for the Web page.", "Windows, Mac, Linux, ", "['Web browser']['Web browser']['Web browser']"], "ecs": ["Sony Ericsson Phone Backup File", "Backup data file created by Sony Ericsson mobile phones; saved in a compressed .ZIP format that can be read by phones using the Symbian operating system.", "Windows, ", "['Corel WinZip 21', 'WinRAR 5']"], "ecc": ["dvdisaster Error Correction File", "Data file created by dvdisaster, a program used for recovering errors in CDs, DVDs, and Blu-ray discs; stores data used for reconstructing unreadable sectors on a disc; requires an error-free disc or .ISO disc image to generate the error correction data.", "Windows, Mac, Linux, ", "['dvdisaster']['dvdisaster']['dvdisaster']"], "ezw": ["easyOFFER Real Estate Form File", "Form created by easyOFFER, a program used to create forms for real estate transactions in Ontario, Canada; contains a real estate form, such as agreement of purchase; may also include clauses, which are amendments to the original form.", "Windows, ", "['Reagency Systems easyOFFER']"], "ezt": ["EZTitles Subtitles File", "Subtitle format used by EZTitles movie subtitling software; supports DVD, Blu-ray, and HD-DVD formats as well as 3D subtitles; after editing, can be exported to sevral standard subtitling formats, including .SRT, .SUB, .PAC, .890, EBU (.STL), and .SMI.", "Windows, Windows, ", "['EZTitles']['Symantec Norton Security 2017']"], "ezs": ["EZ-R Stats Batch Script", "Scripting routine used to perform various statistical, analytical, and database functions within EZ-R Stats, a data analysis program.", "Windows, ", "[]"], "ec4": ["EPSON Print CD File", "Disc label graphic created by EPSON Print CD, a CD and DVD label design program used for printing disc labels to CDs and DVDs with a supporting EPSON printer; uses an older format that has now been replaced the the .PRINTCD2 format.", "Windows, Mac, ", "['EPSON Print CD']['EPSON Print CD']"], "ezp": ["AutoCAD Ecscad Project Backup File", "CAD project created by AutoCAD Ecscad, a program used for designing electrical circuits; stores a backup of a CAD project in a compressed .ZIP format; can be used for archiving projects on backup media such as CDs and backup drives.", "Windows, ", "['Autodesk AutoCAD Ecscad']"], "ezlog": ["Skype Extras Manager Log File", "Log file created by Extras Manager, a component of Skype that allows third-party plugins, called \"extras,\" to be installed; saved in a proprietary binary format and stores data related to the malfunction of installed extras; used for debugging errors.", "Windows, ", "['Skype']"], "ezdraw": ["EazyDraw Graphic", "Vector graphic created by EazyDraw, a technical drawing and illustration program for Mac; stores shapes, fills, and other drawn objects; supports multiple layers; can be exported to .PDF, .EPS, .SVG, and .DXF formats when complete, as well as .PNG, .JPG, and .TIF formats.", "Mac, ", "['Dekorra Optics EazyDraw']"], "ezc": ["AutoCAD Ecscad Components Backup File", "File used by Ecscad AutoCAD, a program used for designing electric circuits; saves a backup of library components, which contain symbols and circuit information used to build schematics; saved in a compressed .ZIP format.", "Windows, ", "['Autodesk AutoCAD Ecscad']"], "eyetvsched": ["EyeTV Schedule File", "Schedule created and used by EyeTV, a program that allows users to watch and record live TV on their computers; contains a schedule that tells the application what and when to record; deleted after the recording is complete unless the schedule is set to repeat.", "Mac, iOS, ", "['Elgato EyeTV']['Elgato EyeTV']"], "eyb": ["Microsoft Encarta Yearbook Update File", "Provides individual article updates, new feature articles, and a Month in Review summary; similar to a .YBK file, but also updates Web page links referenced by the articles in the encyclopedia.", "Windows, ", "[]"], "eyetvp": ["EyeTV Recording Metadata File", "Metadata file created and used by EyeTV, a program that allows users to watch and record live TV on their computer; contains metadata about the associated .EYETV recording file; includes the title of the show, episode number, season number,  and episode name.", "Mac, iOS, ", "['Elgato EyeTV']['Elgato EyeTV']"], "eyetv": ["EyeTV Recording File", "Recording created and used by EyeTV, a program that allows users to watch and record live TV directly on their computer; contains a video recording of a TV program and related metadata files.", "Mac, iOS, ", "['Elgato EyeTV']['Elgato EyeTV']"], "eye": ["Eyemail Video Recording File", "Video format based on the Eyeris encoding algorithm developed by Eyemail Technology Inc. (ETI); used for storing recordings captured with ETI's Camcorder Pro; related to the .EAR audio format, but may contain both audio and video.", "Windows, ", "[]"], "exx": ["IBM Linkway MsgPut File", "Intermediate file created by IBM Linkway, a software program used in the early 1990s for developing multimedia applications; saved during the development of an application along with other objects stored in Linkway folders.", "Windows, ", "[]"], "exw": ["Euphoria Source code File", "Source code file written in the Euphoria programming language; contains code that can be executed on Windows, MS-DOS, Linux, and FreeBSD platforms using the Euphoria interpreter, which is included with the Euphoria application installation.", "Windows, Linux, ", "['File Viewer Plus', 'Rapid Deployment Euphoria', 'Microsoft Notepad', 'Microsoft WordPad', 'gVim', 'text editor']['Rapid Deployment Euphoria', 'GNU Emacs', 'text editor']"], "exv": ["Adobe Extension Script", "Script included with some plugins used by Adobe Creative Suite applications such as Illustrator and Photoshop; defines how the plugin appears and includes layout information for dialogs, text fields, checkboxes, and other UI components.", "Windows, Mac, ", "['Adobe Photoshop CC 2017', 'Adobe Illustrator CC 2017']['Adobe Photoshop CC 2017', 'Adobe Illustrator CC 2017']"], "extra": ["Google BreakPad Crash Log Extra File", "Crash log file created by Google BreakPad, an open source crash reporting tool used by products such as Mozilla Firefox; may be saved to the local file system upon program crash; can be submitted to the software developers to determine the cause of the crash.", "Windows, Mac, Linux, ", "['Mozilla Firefox']['Mozilla Firefox']['Mozilla Firefox']"], "ext": ["Norton Commander Extension", "Software extension used by Norton Commander for DOS / Windows 95; allows users to modify files, such as change file attributes and synchronize directories, using a text-based interface.", "Windows, Windows, Mac, ", "[][][]"], "exportedui": ["Microsoft Office Exported UI Customization File", "Customization file used by Microsoft Office, a work document production suite; contains XML code that customizes ribbons in Microsoft Office; exported format to easily share custom tabs, commands, groups, etc. that make up the Microsoft Office UI with other users.", "Windows, Mac, ", "['Microsoft Office 2016']['Microsoft Office 2016']"], "exportedfavorites": ["Transmit Exported Favorites File", "File created by Transmit, an FTP and SFTP program for Mac; saves the user's exported favorites (remote logins) in an encrypted, proprietary format so that the file protects sensitive login information; can be imported into another Transmit copy to transfer the favorites.", "Mac, ", "['Panic Transmit 4']"], "exs": ["EXS Instrument", "An EXS file is an instrument used by Logic Pro, a digital audio workstation (DAW).  It contains an instrument, which includes information referenced by Logic to play an audio sample according to its type, such as a piano, guitar, or drums.", "Mac, Windows, Mac, ", "['Apple Logic Pro X']['Blades of Exile']['Blades of Exile']"], "exr": ["OpenEXR Image", "Raster image stored in the OpenEXR format, a high dynamic-range (HDR) image file format developed by Industrial Light & Magic; supports multi-layer images, lossy and lossless compression, and 16-bit and 32-bit pixels; used for storing deep raster images for high-quality graphics; used by raster graphics editing programs and imaging applications.", "Windows, Mac, ", "['Serif PhotoPlus', 'Adobe Photoshop with fnord ProEXR plug-in', 'Adobe After Effects with fnord ProEXR plug-in', 'Adobe SpeedGrade CC 2017']['Adobe Photoshop with fnord ProEXR plug-in', 'Adobe After Effects with fnord ProEXR plug-in', 'Adobe SpeedGrade CC 2017', 'MacPhun ColorStrokes']"], "expressionmap": ["Cubase Expression Map File", "File used by Cubase, a digital audio workstation (DAW) application; contains settings that alter the style of a sampled instrument with player expressions, such as staccatos and tremolos.", "Windows, Mac, ", "['Steinberg Cubase']['Steinberg Cubase']"], "exp": ["Symbols Export File", "Developer file used by various software development IDEs and compilers; stores symbol table data, which is information about a program's data and functions; used for linking program information to another program, such as a debugger.", "Windows, Mac, Windows, Mac, Windows, Mac, Windows, Windows, ", "['Microsoft Visual Studio 2017', 'Freescale CodeWarrior Development Tools']['Apple Xcode']['Intuit QuickBooks Pro 2016']['Intuit QuickBooks for Mac 2016']['Dassault Systemes CATIA', 'Adobe Acrobat DC', 'Okino Computer Graphics PolyTrans']['Adobe Acrobat DC'][][]"], "exopc": ["ExoPC Application", "Application file created for the ExoPC Slate, a Windows-based netbook used to browse the Web and playback multimedia content; stores all application files in an archive; used for various kinds of applications, including games and desktop widgets.", "Windows, ", "[]"], "exo": ["YouTube Video Chunk File", "Video file format used by the YouTube application for Android; stores a chunk of a video that is pieced together with other chunks of the same video in order to be played; downloaded through the application in order to be available for playback offline.", "Android, ", "['YouTube']"], "exm": ["Boson Exam File", "File created by Boson Exam Environment, a program used by IT professionals for preparing for IT certification tests; saves the results of a graded practice exam; allows the exam results to be stored and copied between computers for review.", "Windows, ", "['Boson Exam Environment']"], "exl": ["Export Lister File", "File used by Export Notes, a program used to convert Lotus Notes databases to Microsoft Outlook mailboxes; contains a list of .NSF Lotus Notes files created using the Export Lister tool, which is included with some versions of Export Notes; used for storing a list of files to convert.", "Windows, Windows, Mac, Linux, ", "[]['JSDAI', 'Eclipse IDE for Java Developers']['JSDAI', 'Eclipse IDE for Java Developers']['JSDAI', 'Eclipse IDE for Java Developers']"], "exif": ["Exchangeable Image Information File", "Information file that contains metadata about an image captured with a digital camera; may include information such as the camera model, shutter speed, aperture, exposure, ISO, focal length, flash on/off, and other information.", "Windows, Mac, ", "['Adobe Photoshop CC 2017', 'Adobe Photoshop Elements 15', 'Corel PaintShop Pro X9', 'Axel Rietschin FastPictureViewer', 'picture viewer']['Apple Photos', 'Adobe Photoshop CC 2017', 'Adobe Photoshop Elements 15', 'picture viewer']"], "exe": ["Windows Executable File", "An EXE file contains an executable program for Windows.  EXE is short for \"executable,\" and it is the standard file extension used by Windows programs.  For many Windows users, EXE files are synonymous with Windows programs, making \".exe\" one of the most recognizable file extensions.", "Windows, Mac, Linux, Windows, ", "['Microsoft Windows', '7-Zip', 'WinRAR 5']['Parallels Desktop for Mac with Microsoft Windows installed', 'VMware Fusion with Microsoft Windows installed', 'Oracle VM VirtualBox with Microsoft Windows installed', 'CodeWeavers CrossOver', 'Kronenberg WineBottler', 'Xamarin Mono']['CodeWeavers CrossOver', 'Oracle VM VirtualBox with Microsoft Windows installed', 'Wine', 'Xamarin Mono']['Rare Ideas PortableApps.com Platform']"], "exe4j": ["Exe4j Configuration File", "File created by Exe4j, a program used to create Windows .EXE files using .JAR files; contains application configuration settings, such as the splash screen, compile options, Java invocation options, and executable information; enables Java applications to be generated into Windows executable files.", "Windows, ", "[]"], "exe1": ["Renamed EXE File", "Windows executable (.EXE) file renamed so that it cannot be run natively in Windows by double-clicking the file; can be used by software installers when the developer doesn't want users to be able to run the executable.", "Windows, ", "[]"], "exc": ["eDataSecurity Management Self-extracting File", "Self-extracting file created by eDataSecurity Management, a program used to encrypt private documents; contains the exact same data as the source file but is encrypted in order to protect its contents; similar to the .ENX file.", "Windows, Windows, Mac, ", "['Acer eDataSecurity Management']['Lionhead Studios Black and White']['Lionhead Studios Black and White']"], "exd": ["Control Information Cache File", "Stores cached information about a control that has been inserted into an Microsoft Office document; allows additional controls to be added in less time; in Microsoft Office 2000, the EXD files are stored in the following folders:\r\n\r\nExcel8.0\r\nPpt9.0\r\nWord8.0\r\nVbe\r\n\r\nEXD files are created when a user inserts an ActiveX control into a document using the Control Toolbox in a Microsoft Office program.  They are also created when any type of control is inserted into a custom UserForm in the Microsoft Visual Basic Editor.", "Windows, ", "['Microsoft Word 2016', 'Microsoft Excel 2016', 'Microsoft PowerPoint 2016', 'Microsoft Visual Studio 2017']"], "exb": ["CAXA Draft", "Document created by CAXA, a 3D CAD modeling system; contains 2D drawing views of existing 3D parts/assemblies.", "Windows, iOS, ", "['CAXA CAD', 'IronCAD']['CAXA CAD']"], "example": ["Example Configuration File", "Configuration file used by various programs; often uses a compound file extension such as \".conf.example;\" provides a template, or example, configuration file that can be altered to include specific settings.", "Windows, Linux, ", "['text editor']['text editor']"], "ex_": ["Renamed Windows Executable File", "Windows executable file renamed from \".exe\" to \".ex_\"; contains the exact contents of an .EXE file; commonly found on installation CDs, where the installer must first rename the file before executing it.", "Windows, Windows, ", "['Microsoft Windows']['Microsoft Expand']"], "ex01": ["EnCase Evidence Image File", "Evidence file format created by EnCase Forensic, an application used to collect, process, analyze, and report forensics information; contains sensitive digital forensics, cyber security, and e-discovery information; includes case information such as the examiner's name, date and time of acquisition, and notes on the acquisition.", "Windows, ", "['Guidance EnCase Forensic', 'Guidance EnCase Forensic Imager', 'GetData Mount Image Pro']"], "ex5": ["MetaTrader 5 Program File", "An EX5 file is a compiled program written for MetaTrader, an online trading platform.  It contains executable code that has been compiled from an .MQ5 custom indicator, Expert Advisor, or script source code file.  EX5 files replaced .EX4 files with the release of MetaTrader 5.", "Windows, ", "['MetaQuotes MetaTrader']"], "ex4": ["MetaTrader 4 Program File", "An EX4 file is a compiled program written for MetaTrader, an platform created for online trading of Forex, Futures, and CFD markets.  It contains executable code that has been compiled from .MQ4 files and can be executed on the MetaTrader platform.", "Windows, ", "['MetaQuotes MetaTrader']"], "ex": ["Euphoria Source Code", "Source file written in the Euphoria programming language; available for Windows, Linux, FreeBSD, and MS-DOS.", "Windows, Linux, ", "['File Viewer Plus', 'Rapid Deployment Euphoria', 'Microsoft Notepad', 'text editor']['Rapid Deployment Euphoria', 'GNU Emacs', 'Pico', 'text editor']"], "ews": ["EasyWorship Schedule File", "File created by EasyWorship, an application used for creating church worship schedules; contain the order of service as well as PowerPoint (.PPT or .PPTX) files, sample audio files, and song lyrics; used by worship leaders and pastors when preparing services.", "Windows, ", "['Softouch EasyWorship']"], "ewprj": ["Ultiboard Layout Project", "An EWPRJ file is a project used by Ultiboard and other Printed Circuit Board (PCBs) programs.  It contains a layout of a PCB design, which includes components such as resistors or capacitors, and their connections.", "Windows, ", "['National Instruments Circuit Design Suite']"], "ewd": ["EasyWOOD Design File", "CAD file created by EasyWOOD, a CAD/CAM solution for wood and other similar materials; saves a 3D design for a part, such as a panel or furnishing; can be virtually milled in the software before sending the design on to manufacturing.", "Windows, ", "['DDX EasyWOOD']"], "ewp": ["Ewisoft Website Project File", "Website project created by Ewisoft Website Builder, a template-driven Web design application; saved in plain text and contains a reference to a binary database file that stores all information for the project; used for saving Web development progress.", "Windows, ", "['Ewisoft Website Builder']"], "ewnet": ["Ultiboard Netlist File", "An EWNET file contains a netlist, which is a representation of a PCB design that is saved in ASCII format and used by National Instruments Circuit Design Suite.  It stores a netlist transferred from Multisim to Ultiboard, which includes the unique pin names of each device in the design and the name of the pattern associated with each design component reference ID.", "Windows, ", "['National Instruments Circuit Design Suite']"], "ewb": ["Electronics Workbench Circuit Design File", "CAD file created by Electronics Workbench, a circuit design program now replaced by the newer Multisim software from National Instruments; saves the various components and connections for an electronics circuit.", "Windows, ", "['National Instruments Multisim', 'National Instruments Electronics Workbench']"], "ewl": ["EclipseCrossword Word List File", "An EWL file is a data file created by EclipseCrossword, a program used to generate crossword puzzles.  It contains a list of words that make up a crossword puzzle and clues for each word in plain text.", "Windows, ", "['Green Eclipse EclipseCrossword']"], "evx": ["SeeVogh Player Remote Recording", "Video recording created by SeeVogh Player, an application that allows you to record, playback, and edit SeeVogh meetings; contains a URL address that links to a video located in a remote server that can be streamed.", "Windows, Mac, Linux, ", "['SeeVogh Player']['SeeVogh Player'][]"], "evy": ["Envoy File", "Document created by Corel Envoy, an older word processing program; used as an early competing format to the Portable Document Format (.PDF files) and similar to a PDF file; rarely used anymore since support for the Envoy format has been discontinued.", "Windows, Mac, ", "[][]"], "evtx": ["Windows 7 Event Log File", "Log file created by the Windows 7 Event Viewer; contains a list of events recorded by Windows; saved in a proprietary binary format that can only be viewed within the Event Viewer program.", "Windows, ", "['Microsoft Event Viewer']"], "evrc": ["Enhanced Variable Rate Codec File", "An EVRC file is an audio file saved in the Enhanced Variable Rate Codec (EVRC) format.  It contains a human voice recording or ringtone from a cellular phone, such as a Sony Ericsson, Qualcomm, or Kyocera phone.  EVRC files are used by code-division multiple access (CDMA) networks, which is part of many mobile phone standards.", "Windows, Mac, Linux, ", "[][][]"], "evr": ["Enhanced Variable Rate Audio File", "Sound file compressed using the Enhanced Variable Rate Codec (EVRC); designed primarily for compressing speech with a low bitrate while maintaining high fidelity.", "Windows, Mac, ", "['RealNetworks RealPlayer Cloud']['RealNetworks RealPlayer Cloud']"], "evt": ["Windows Event Viewer Log File", "File created by Windows Event Viewer, a program that logs system events; contains a series of log messages containing an ID and a number of insertion strings; stored in a proprietary binary format; used to review, analyze, and debug system performance.", "Windows, ", "['Microsoft Event Viewer']"], "event": ["Corel Cataloged Folder File", "Hidden file created by some Corel applications, including Video Studio and PaintShop Photo Express; created in each folder that is catalogued by the application and contains information that records whether the contents of the folder have been changed over time (e.g., if picture files have been added or removed).", "Windows, ", "['Corel VideoStudio Pro X10 Ultimate']"], "evp": ["Talisman Online Game Data File", "Game data file referenced by Talisman Online, a free 3D fantasy MMORPG game; contains data, such as server, game sounds, and login information, referenced by the game.", "Windows, ", "['Miracle Castle Talisman Online']"], "evo": ["SeeVogh Player Video Recording", "Video recording created by SeeVogh Player, an application that allows you to record, playback, and edit SeeVogh meetings; contains a standard video recording of a meeting.", "Windows, Mac, Linux, Windows, ", "['SeeVogh Player']['SeeVogh Player']['SeeVogh Player']['CyberLink PowerDVD 16', 'JRiver Media Center', 'Microsoft Windows Media Player with Windows 7 Codec Pack']"], "ev3s": ["LEGO MINDSTORMS EV3 Shared File", "File created by LEGO MINDSTORMS EV3, a LEGO robot creation program; contains an exported .EV3P program file; includes data such as sounds, images, and My Blocks that tell the robot what functions to perform.", "Windows, Mac, ", "['LEGO MINDSTORMS EV3']['LEGO MINDSTORMS EV3']"], "ev3p": ["LEGO MINDSTORMS EV3 Program", "File created by LEGO MINDSTORMS EV3, an application that enables you to build and program LEGO MINDSTORMS EV3 robots; contains program data such as images, sounds, and My Blocks that tell the robot what functions to perform; only exists inside .EV3 files, if exported it becomes an .EV3S file.", "Windows, Mac, ", "['LEGO MINDSTORMS EV3']['LEGO MINDSTORMS EV3']"], "ev3": ["LEGO MINDSTORMS EV3 Project", "Project created by LEGO MINDSTORMS EV3, a program that enables you to create and command LEGO MINDSTORMS EV3 robots; contains all of the project assets such as .EV3P program files, images, sounds, building instructions, videos, and My Blocks.", "Windows, Mac, Windows, Windows, ", "['LEGO MINDSTORMS EV3']['LEGO MINDSTORMS EV3'][][]"], "ev": ["Echoview File", "File created by Echoview, an application used for analyzing marine and lake environments; may contain raw data from echosounder and sonar equipment as well as visualizations and other data analyses; can be used for counting and tracking fish populations.", "Windows, ", "['Myriax Echoview']"], "eum": ["Enterprise User Monitor Configuration File", "Stores settings for an Enterprise User Monitor (EUM); may include IP addresses, radio frequencies, and other information for monitoring various devices; can be saved within the WaveRider EUM Configuration Utility and loaded at a later time.", "Windows, ", "[]"], "eui": ["Ensoniq EPS Compacted Disk Image", "Compressed disk image created by an Ensoniq EPS (Ensoniq Performance Sampler) synthesizer", "Windows, ", "['FMJ-Software Awave Studio']"], "euf": ["Private Character Editor File", "File created by Microsoft Private Character Editor, an accessory program included with Windows; saves a font character set, which contains custom glyphs, or characters bitmaps, edited by the user; can be used in conjunction with Microsoft's Character Map program to type custom characters in Windows.", "Windows, ", "['Microsoft Private Character Editor']"], "euc": ["Extended Unix Code File", "Japanese (Kanji) characters encoded in a text string", "Linux, ", "[]"], "etx": ["TeX Font Encoding File", "Font file used by TeX and LaTeX typesetting systems; saved in a plain text format and contains markup that describes how a font is encoded for its appearance; allows font customization for TeX documents.", "Windows, Mac, Linux, Windows, Mac, ", "['MiKTeX', 'TeXworks', 'Texmaker']['TeXworks', 'Texmaker']['TeXworks', 'Texmaker'][][]"], "ett": ["Kingsoft Spreadsheets Template", "An ETT file is a spreadsheet template created by Kingsoft Spreadsheets, a spreadsheet program included in the WPS Office suite.  It stores a template that can be used as a starting point for creating new Kingsoft spreadsheets (.ET files).  ETT files are often used for creating financial budgets and organizing data.", "Windows, Android, ", "['Kingsoft WPS Office', 'Kingsoft Spreadsheets']['Kingsoft WPS Office for Android']"], "etl": ["Microsoft Event Trace Log File", "An ETL file is a log file created by Microsoft Tracelog, a program that creates logs using the events from the kernel in Microsoft operating systems.  It contains trace messages that have been generated during trace sessions, such as disk accesses or page faults.  ETL files are used to log high-frequency events while tracking the performance of an operating system.", "Windows, ", "['Microsoft Event Viewer', 'Microsoft Tracelog', 'Microsoft Tracerpt']"], "etff": ["Encrypt4all Theme File", "File created by Encrypt4all Theme Maker, a program used for creating themes for the Encrypt4all file encryption software; contains color settings for different user interface elements, such as the toolbar, status bar, text boxes, and combo boxes.", "Windows, ", "['Encrypt4all Software Encrypt4all', 'Encrypt4all Software Encrypt4all Theme Maker']"], "etd": ["Adobe Reader EBX Transfer Data File", "File used by Adobe Reader, a program that allows users to view .PDF files and read eBooks; contains data that allows Adobe Reader to download an eBook; used to provide a secure mechanism for downloading eBooks without violating copyrights or causing books to be illegally distributed.", "Windows, Mac, Linux, ", "['Adobe Acrobat DC', 'Adobe Digital Editions']['Adobe Acrobat DC', 'Adobe Digital Editions']['Adobe Acrobat DC']"], "etf": ["ENIGMA Transportable File", "Text-based format exported by Finale and other MakeMusic programs; similar to a Finale music notation (.MUS) file, but contains data encoded as text instead of binary; designed for sending Finale files over e-mail so they don't get corrupted.", "Windows, Mac, ", "['MakeMusic Finale', 'MakeMusic SmartMusic']['MakeMusic Finale', 'MakeMusic SmartMusic']"], "est": ["Streets & Trips Map File", "Map file saved by Streets & Trips travel and mapping software; includes street maps and locations as well as map view, style, and font settings; can also store custom routes, drawing objects, pushpins (for marking locations), and custom symbols.", "Windows, Windows, ", "['Microsoft Streets & Trips', 'Microsoft MapPoint'][]"], "eta": ["Google Earth Placemark File", "File created by Google Earth, a global mapping program; contains a marker for a location in the world specified by longitude, latitude, zoom, rotation, and tilt; provides users with an overhead view of the location.", "Windows, Mac, Linux, ", "['Google Earth']['Google Earth']['Google Earth']"], "et": ["Easiteach Lesson File", "Teaching lesson created by Easiteach, a program that allows teachers to develop classroom lessons and deliver them through an interactive interface; contains lesson data such as layouts, navigation, images, text, themes, and animations.", "Windows, Windows, Android, ", "['Research Machines Easiteach']['Kingsoft WPS Office', 'Kingsoft Spreadsheets']['Kingsoft WPS Office for Android']"], "esx": ["Xactimate Insurance Claims Estimate", "File created by Xactimate, a program used to create insurance claims; contains an insurance claim estimate, including dates, images, policy information, damages, deductibles, and estimated cost; used for saving and filing insurance claims.", "Windows, ", "[]"], "est_uax": ["Spanish Unreal Audio Package", "Audio file used by Unreal Tournament and other first-person shooter games that use the first Unreal Engine; similar to a .UAX file but contains audio clips for the game that are localized in Spanish; used for speech audio.", "Windows, ", "['Epic Games UnrealEd', 'Dragon UnPACKer', 'FMJ-Software Awave Studio', 'Epic Games Unreal Tournament']"], "ess": ["The Elder Scrolls Saved Game", "Saved game created by The Elder Scrolls (TES) first person role-playing games, including Skyrim (TES 5), Oblivion (TES 4), and Morrowind (TES 3); stores the game progress for quests as well as the character's level and items; also saves the play time.", "Windows, Windows, ", "['Bethesda Softworks The Elder Scrolls 5: Skyrim', 'Bethesda Softworks The Elder Scrolls 4: Oblivion', 'Bethesda Softworks The Elder Scrolls 3: Morrowind'][]"], "esq": ["Embroidery Sequence File", "Data file created by Pfaff embroidery machines; saves references to multiple .EMB embroidery files, but does not contain the embroidery designs themselves; stores information such as the hoop placement for the designs; allows designs to be sequenced one after another.", "Windows, ", "['VSM Group creative 3D Suite']"], "esps": ["ESPS Sampled Data File", "Proprietary audio format created by Entropic Research Laboratories and used for its WAVES+ display program, ESPS signal processing library and the HTK speech recognition toolkit", "Windows, ", "['FMJ-Software Awave Studio']"], "esproj": ["Espresso Project File", "Website project created by Espresso, a Mac program used for creating webpages and editing source code; saves a list of related files for the website project, as well as server publishing settings and other user preferences.", "Mac, ", "['MacRabbit Espresso']"], "esp": ["Elder Scrolls Plugin File", "Plugin file used by The Elder Scrolls (TES) first-person RPGs such as Oblivion and Skyrim; similar to an .ESM file but is used specifically for adding plugin features, such as new graphics, weapons, and world content; used for creating custom game alterations.", "Windows, Windows, Windows, ", "['Bethesda Softworks The Elder Scrolls 5: Skyrim', 'Bethesda Softworks The Elder Scrolls 4: Oblivion', 'The Elder Scrolls Construction Set', 'Bethesda Softworks The Elder Scrolls V: Skyrim Creation Kit']['Bethesda Softworks Fallout 3', 'Bethesda Softworks Fallout: New Vegas', 'Bethesda Softworks GECK'][]"], "esm": ["Elder Scrolls Master File", "Game data file used by The Elder Scrolls IV: Oblivion and The Elder Scrolls V: Skyrim single-player role-playing games; contains various kinds of data, including 3D meshes, textures, video, music, sound, and game menu data.", "Windows, Windows, ", "['Bethesda Softworks The Elder Scrolls 5: Skyrim', 'Bethesda Softworks The Elder Scrolls 4: Oblivion', 'Bethesda Softworks Creation Kit', 'The Elder Scrolls Construction Set']['Bethesda Softworks Fallout 3', 'Bethesda Softworks GECK']"], "eslock": ["ES File Explorer File Manager Encrypted File", "An ESLOCK file is an encrypted file created by ES File Explorer File Manager, an Android file managing app.  It stores a file, such as a .JPG image or .XLSX document, that has been locked and encrypted by the user to protect its contents.", "Android, ", "['ES File Explorer File Manager', 'Roosters Lab ESLock File Recovery']"], "esh": ["Extended Shell Batch File", "DOS text file containing a series of commands to be executed in order; for example, may contain a list of instructions and processes to be run during the computer's boot process.", "Windows, ", "[]"], "esg": ["Enigmo Saved Game File", "Saved game created with Enigmo, a 3D puzzle game in which the player directs droplets of liquid to their destination; saves the player's progress so that the game can be resumed at the current level at a later time.", "Windows, Mac, ", "[][]"], "esf": ["Password Manager Container File", "Encrypted container file that stores passwords created by Privacy Suite or Password Manager, security programs developed by Steganos;  allows users to access all of their online accounts with one password.", "Windows, ", "['Steganos Password Manager', 'Steganos Privacy Suite']"], "esd": ["Windows Electronic Software Download File", "File used by Microsoft's Electronic Software Download (ESD) software, a technology that is used for downloading purchased Microsoft products; saves the downloaded software in an encrypted format (an encrypted .WIM file); used for installing and upgrading purchased software.", "Windows, ", "['Microsoft Windows 8']"], "esc": ["EasySignCut Pro Project", "An ESC file is a project created by EasySignCut Pro, an application used to design signs, logos, lettering, decals, and stickers to be made with cutting plotters.  It contains a design, which may include text, drawn lines, paintbrush strokes, shapes, images, and other objects.  ESC files may also contain effects such as 3D extrude, rhinestones, shadow layers, and bulges.", "Windows, Mac, ", "['EasySignCut Pro']['EasySignCut Pro']"], "ese": ["Millions Email Generator Email List File", "Data file used by Millions Email Generator (MEG), a program used to generate email addresses for advertising campaigns; contains text syntax that can be used for generating millions of email addresses; often contains common first and last names.", "Windows, ", "['Encrypt4all Millions Email Generator']"], "escopy": ["ES Explorer Temporary File", "Temporary file used by ES File Explorer File Manager, an application that helps users manage files on an Android device; stores information about a file, such as an .APK package file, on the device while it is being downloaded or copied. ", "Android, ", "['ES File Explorer File Manager']"], "escape": ["Prison Architect Escape Mode Save File", "Save file created by Prison Architect, a game where players design and maintain high security prisons; contains saved game progress of an escape attempt, which includes the number of prisoners in your squadron and the amount of victims you hurt during your escape.", "Windows, Mac, Linux, ", "['Introversion Prison Architect']['Introversion Prison Architect']['Introversion Prison Architect']"], "esb": ["Es-Builder Book File", "File created by es-Builder, a personal information manager (PIM) software; saves a database of personal data, including contacts, tasks, notes, journal entries, and other information; can include custom data tables and data structures.", "Windows, ", "['Season Workshop es-Builder']"], "es2": ["E-Studio 2.0 Experiment File", "Project file created by E-Studio, a psychological experiment design tool included with the E-Prime application suite; saves objects that define each step taken on the experiment timeline; may specify setup procedures, stimuli to be injected (such as sounds), data logging procedures, and other actions.", "Windows, ", "['Psychology Software Tools E-Prime']"], "ersx": ["Eraser Task List File", "Data file created by Eraser, a Windows program used for securely erasing files and folders from your hard drive; saves a list of erasing tasks as well as the schedule information for when to run each task.", "Windows, ", "['Eraser']"], "es": ["E-Studio 1.x Experiment File", "Project file created by E-Studio, a psychological experiment design tool included with the E-Prime program suite; saves the steps of a behavioral research experiment; includes setup steps as well as injected stimuli (e.g., video or sounds) and data logging procedures.", "Windows, Windows, ", "['Psychology Software Tools E-Prime']['The Sage Group SageCRM']"], "ers": ["ER Mapper Data File", "GIS file created by ER Mapper, an image processing application used for analyzing geospatial images; contains plain ASCII text describing the raster data in a separate file that has the same filename prefix but no extension (e.g., DataSet.ers and DataSet); used for storing raw and processed datasets.", "Windows, Linux, ", "['ERDAS ER Mapper', 'ERDAS IMAGINE', 'ESRI ArcGIS for Desktop', 'PCI Geomatics Geomatica', 'GDAL']['GDAL']"], "erb": ["Ruby ERB Script", "Script written in ERB, a templating language for Ruby; may include any type of plain text or source code, but also includes Ruby ERB code that generates additional text into the resulting file when run with the ERB template engine.", "Windows, Mac, Windows, Windows, ", "['Microsoft Notepad', 'text editor']['Panic Coda 2', 'Apple TextEdit', 'text editor'][]['Braille Music Reader']"], "err": ["Error Log File", "Text file containing error messages generated by a program; may be written as a program loads, executes, or closes; often used by software developers when testing or profiling programs.", "Windows, Mac, Linux, Windows, Windows, ", "['Microsoft Notepad', 'text editor']['Apple TextEdit', 'text editor']['Vim', 'GNU Emacs', 'text editor']['Autodesk AutoCAD 2017']['Microsoft Visual FoxPro']"], "erp": ["Alter Ego Game Archive", "Game file used by Alter Ego, a dark adventure game; stores an archive of game files, which may contain graphics, audio, and other game data; used for loading game content; can be unpacked using the Alter Ego ERP unpacker.", "Windows, Windows, ", "['Future Games Alter Ego', 'Alter Ego ERP unpacker']['Microsoft Encarta']"], "erl": ["GameGuard Error Log File", "File generated by GameGuard, a Windows program that optimizes system performance for gaming; generated each time GameGuard runs and may include performance metrics, error reports, and detected virus information; should be sent to GameGuard support when issues with the software arise.", "Linux, Windows, Mac, ", "['nProtect GameGuard']['File Viewer Plus', 'Erlang', 'Microsoft Notepad', 'text editor']['MacroMates TextMate', 'text editor']"], "erf": ["BioWare Entity Resource File", "Game archive used by the BioWare's game engine technologies, such as the Aurora Engine, Eclipse Engine, and the Odyssey Engine; may contain various types of data for a game, including models, textures, animations, audio, and game levels; used for packaging original game content as well as for creating modifications and add-ons to the game.", "Windows, Windows, Mac, iOS, Android, ", "['Electronic Arts Dragon Age: Origins', 'BioWare Dragon Age Toolset', 'ERF/RIM Editor']['Adobe Photoshop CC 2017', 'Adobe Photoshop Elements 15', 'Microsoft Windows Photos', 'ACD Systems Canvas X 2017', 'ACD Systems ACDSee 20']['Adobe Photoshop CC 2017', 'Adobe Photoshop Elements 15', 'MacPhun ColorStrokes']['Adobe Photoshop Express']['File Viewer for Android', 'Adobe Photoshop Express']"], "er1": ["ERWin Entity Relationship Diagram", "Entity relationship diagram created by ERWin, a data modeling program published by Computer Associates (CA); used for visualizing data structures and managing data complexities.", "Windows, ", "[]"], "eqp": ["MathType Preferences", "Contains settings for configuring MathType, a program for writing mathematical equations", "Windows, Mac, ", "['Design Science MathType']['Design Science MathType']"], "eqn": ["GAL Equation File", "Logic file created for programmable logic devices (PLDs) called GALs (gate array logic); contains logic equations for controlling a programmable GAL chip; saved in a plain text format.", "Windows, Windows, ", "['Altium Designer']['Corel WordPerfect X8']"], "eql": ["MathType Settings", "Contains settings for objects used by MathType; i.e. \"Toolbar.eql;\" may be deleted if corrupt", "Windows, Mac, Linux, ", "['Design Science MathType']['Design Science MathType'][]"], "eqf": ["Winamp Equalizer Preset File", "Contains settings for the Winamp Equalizer (EQ), which adjusts the level of different audio frequencies; can be saved and loaded within Winamp by clicking the Preset button and selecting Save or Load; saved EQF files can be shared with other Winamp users.", "Windows, ", "['Nullsoft Winamp']"], "epw": ["EnergyPlus Weather Data File", "Weather data file saved in the standard EnergyPlus format; used by EnergyPlus energy simulation software, developed by the U.S. Department of Energy (DoE); contains weather data that is used for running energy usage simulations.", "Windows, ", "['U.S. Department of Energy EnergyPlus']"], "epub": ["Open eBook File", "Digital ebook saved in the EPUB format, an open XML-based format for digital books and publications; provides a standard digital publication format for publishers and consumers; can be viewed with supporting software programs and hardware devices, such as the Sony Reader and Barnes & Noble Nook.", "Windows, Mac, Linux, iOS, Android, ", "['Adobe Digital Editions', 'Calibre', 'Geometer Plus FBReader', 'Comic Book Reader', 'Adobe InDesign CC 2017', 'Icecream Ebook Reader']['Apple Pages', 'Adobe Digital Editions', 'Calibre', 'Geometer Plus FBReader', 'Adobe InDesign CC 2017', 'Apple iBooks', 'Sixty Four Kitabu']['Calibre', 'Geometer Plus FBReader', 'KDE Okular']['Apple iBooks', 'Apple Pages']['File Viewer for Android', 'Sony Reader', 'Geometer Plus FBReader', 'Google Play Books']"], "epsf": ["Encapsulated PostScript Format File", "File created in the Encapsulated PostScript Format (EPSF); contains text, images, and drawings as well as page formatting properties; can be imported into another PostScript (.PS) document; used to create final form documents.", "Windows, Mac, Linux, ", "['CorelDRAW Graphics Suite X8', 'Corel PaintShop Pro X9', 'Adobe Illustrator CC 2017', 'Adobe Acrobat DC', 'Adobe Photoshop CC 2017', 'Adobe Photoshop Elements 15', 'ACD Systems ACDSee 20', 'ACD Systems Canvas X 2017']['Apple Preview', 'Adobe Illustrator CC 2017', 'Adobe Acrobat DC', 'Adobe Photoshop CC 2017', 'Adobe Photoshop Elements 15']['XnViewMP']"], "eps": ["Encapsulated PostScript File", "An EPS file is a PostScript (.PS) file.  It may contain 2D vector graphics, bitmap images, and text and include an embedded preview image in bitmap format.  EPS files can also be placed within another PostScript document.", "Windows, Mac, Linux, ", "['Adobe Illustrator CC 2017', 'CorelDRAW Graphics Suite X8', 'Corel PaintShop Pro X9', 'Adobe Acrobat DC', 'Adobe Photoshop CC 2017', 'Adobe Photoshop Elements 15', 'Adobe InDesign CC 2017', 'Microsoft Word 2016', 'ACD Systems Canvas X 2017', 'Corel Presentations X8', 'QuarkXpress', 'Grasshopper PageStream', 'Scribus', 'MAGIX Xara Designer Pro X11', 'Design Science MathType']['Adobe Illustrator CC 2017', 'Apple Preview', 'Adobe Acrobat DC', 'Adobe Photoshop CC 2017', 'Adobe Photoshop Elements 15', 'Adobe InDesign CC 2017', 'Microsoft Word 2016', 'QuarkXpress', 'Grasshopper PageStream', 'Scribus', 'Design Science MathType']['KDE Okular', 'Grasshopper PageStream', 'XnViewMP', 'Scribus']"], "eprt": ["eDrawings File", "An EPRT file is a 2D or 3D drawing created by CAD programs such as eDrawings and SolidWorks.  It contains a 2D or 3D drawing of a mechanical design.  EPRT files are similar to .EDRW and .EASM files and are saved in a smaller file size, making them easier to transfer over the Internet and print.", "Windows, Mac, iOS, Android, ", "['Dassault Systemes SolidWorks eDrawings Viewer', 'Dassault Systemes SolidWorks']['Dassault Systemes SolidWorks eDrawings Viewer', 'Dassault Systemes SolidWorks']['Dassault Systemes SolidWorks eDrawings']['Dassault Systemes SolidWorks eDrawings']"], "epr": ["Photoshop AME Preset File", "Settings file created by Photoshop, a professional graphics editing application; saves Adobe Media Encoder (AME) settings for encoding and exporting video from Photoshop; can be reused to export video with consistent settings.", "Windows, Mac, ", "['Adobe Photoshop CC 2017']['Adobe Photoshop CC 2017']"], "epp": ["EditPad Pro Project", "Stores a list of files that can be edited simultaneously with EditPad Pro software.", "Windows, Mac, Windows, Mac, Windows, Mac, Windows, ", "['JGsoft EditPad Pro']['Eltima Elmedia Player']['TalaSoft TalaPhoto']['TalaSoft TalaPhoto']['Canon Easy-PhotoPrint EX']['Canon Easy-PhotoPrint EX'][]"], "epk2": ["E-Prime 2.0 Package File", "Experiment module created by E-Prime, an application suite used for designing and conducting experiments in psychology; stores a reusable block of E-Basic script that can be used in multiple experiments; can be included using the PackageCall object.", "Windows, ", "['Psychology Software Tools E-Prime']"], "epim": ["EssentialPIM Database File", "File used by EssentialPIM, a personal information manager; stores your personal data, such as added tasks, notes, contacts, passwords, calendar items, and appointments.", "Windows, iOS, Android, ", "['Astonsoft EssentialPIM']['Astonsoft EssentialPIM']['Astonsoft EssentialPIM']"], "epibrw": ["Web File Location", "Generic file extension for a file stored on a Microsoft IIS-based Web server; often used by .PDF files, but may also be used by several other file types.", "Windows, Mac, ", "['Web browser']['Web browser']"], "epk": ["LG Firmware Package", "An EPK file is a firmware package used by LG Electronics Smart TVs.  It contains a firmware update to improve the performance of your TV.  EPK files are signed and encrypted with AES encryption using a 1024-bit private key.", "Windows, Windows, ", "['epk2extract']['Ymir Entertainment Metin2']"], "epi": ["EclipsePackager2000 Compressed File", "Compressed archive created by EclipsePackager2000, a program used for splitting and compressing files; may contain a complete archive or a portion of a split archive; created using Green Eclipse Intelligent Packing Technology.", "Windows, ", "[]"], "epf": ["Edgecam Educational Part File", "Part file created by Edgecam Student Edition, an educational version of Edgecam used to train students for part design and manufacturing; contains a part design, including geometry, toolpaths, and other part properties.", "Windows, Windows, Mac, Linux, ", "['Planit Edgecam']['CadSoft EAGLE']['CadSoft EAGLE']['CadSoft EAGLE']"], "epc": ["Doctor Who Game Data File", "File used by Doctor Who: The Adventure Games, a computer game that follows the Doctor Who BBC television series, which broadcasts in the United Kingdom (UK); contains 3D model data, such as 3D scenes, maps, and rooms; used for rendering 3D visual data in the game.", "Windows, Mac, ", "['BBC Doctor Who: The Adventure Games']['BBC Doctor Who: The Adventure Games']"], "ep": ["Pencil Document", "Document created by Pencil, an open source GUI prototyping tool; saves a page with different design elements for a targeted user interface; used for making software mockups for mobile (iOS, Android, etc.), Web, and desktop platforms.", "Windows, Mac, Linux, ", "['Evolus Pencil']['Evolus Pencil']['Evolus Pencil']"], "eot": ["Embedded OpenType Font", "OpenType (.OTF) font embedded in a document such as a Web page or PowerPoint presentation (.PPS file); often embedded with Microsoft Web Embedding Fonts Tool (WEFT); saved along with the associated document and not meant to be opened manually.", "Windows, Mac, ", "[][]"], "eop": ["EveryonePiano Music Score File", "File created by EveryuonePiano, a piano teaching program; contains a pre-recorded or user-recorded musical score.", "Windows, ", "['EveryonePiano']"], "enw": ["EndNote Import File", "Database import file used by EndNote citations management software; contains citation data and schema information, including author, company, title, publication, and keyword data; used for importing transferred bibliographies.", "Windows, Mac, ", "['Thomson Reuters EndNote']['Thomson Reuters EndNote']"], "enz": ["EndNote Connection File", "File used by EndNote, an application used for managing citations and creating bibliographies; saves connection information for an online citations database; used for connecting and downloading references into EndNote libraries (.ENL files).", "Windows, Mac, ", "['Thomson Reuters EndNote']['Thomson Reuters EndNote']"], "enx": ["Max PC Safe Encrypted File", "Encrypted file created by Max PC Safe, a file encryption and decryption software program; contains the exact same data as the source file but is encrypted in order to protect its contents from being seen by others.", "Windows, Windows, ", "['Max Secure Software Max PC Safe']['Acer eDataSecurity Management']"], "env": ["Now Contact Envelope Template", "Envelope template created by Now Contact, an application that organizes contact information and day-to-day activities; contains a template print layout for your envelope; pre-defined options include \"Baronial 2,\"  \"Announcement A-2,\" \"Commercial 5,\" and \"Postcard.\"", "Windows, Mac, Windows, Mac, Windows, Mac, Windows, ", "['Now Contact']['Now Contact']['Adobe Acrobat DC', 'Adobe Illustrator CC 2017']['Adobe Acrobat DC', 'Adobe Illustrator CC 2017']['E-on Vue']['E-on Vue']['Corel WordPerfect X8']"], "entitlements": ["Mac App Sandboxing Entitlements File", "Developer file used by Mac OS X applications that implement App Sandboxing, which was required for all Mac App Store apps as of June 1, 2012; saved in the .PLIST format and contains entitlements, or privileges, enabled for the app when it runs.", "Mac, ", "['Apple Xcode', 'Apple TextEdit', 'text editor']"], "ent": ["External Entity", "Text file containing parameters and entity declarations for a specific set of tags defined in a DTD; often referenced by XML and SGML documents.", "Windows, Mac, Linux, ", "['SyncRO Soft oXygen XML Editor', 'text editor']['SyncRO Soft oXygen XML Editor', 'text editor']['SyncRO Soft oXygen XML Editor', 'text editor']"], "ens": ["EndNote Style File", "Output formatting file used by EndNote, a program used for managing citations; stores a bibliographic style that can be used to format citations according to different standards; may include indentation, punctuation, textual syntax, alphabetization, and other rules.", "Windows, Mac, ", "['Thomson Reuters EndNote']['Thomson Reuters EndNote']"], "enq": ["EndNote Search Options File", "File created by EndNote, a program used for managing citation information; saves options for performing a citation search; may include author name matches, journal matches, date ranges, or other filtering parameters; helps save complicated search criteria; can be transferred between EndNote users for sharing search options.", "Windows, Mac, ", "['Thomson Reuters EndNote']['Thomson Reuters EndNote']"], "enp": ["EndNote Preferences File", "Application preferences file used by older versions of EndNote citation management software; stores the settings specified in the Edit → Preferences... menu; can be used for transferring preferences between different EndNote installations.", "Windows, Mac, ", "['Thomson Reuters EndNote']['Thomson Reuters EndNote']"], "enml": ["Evernote for Android Note", "File created by the Android version of Evernote, an app used for writing and remembering personal notes; saved to the SD card and stores a note created by the user; saved in the Evernote Markup Language (ENML) format, which is similar to XHTML.", "Android, ", "['Evernote']"], "enlx": ["Archived EndNote Library", "File created by contains all of the data from an EndNote library (.ENL file) but saves it in a compressed format; can be used as an archival format, but more often used for transferring libraries between users over email.", "Windows, Mac, ", "['Thomson Reuters EndNote']['Thomson Reuters EndNote']"], "enl": ["EndNote Library", "Data file used by EndNote, an application used for managing bibliographies; contains a collection of citations, each of which store author, year, title, journal, and other reference information; can also contain links to actual publications, such as .PDF files, for viewing in the software; used as the EndNote native save and load format.", "Windows, Mac, ", "['Thomson Reuters EndNote']['Thomson Reuters EndNote']"], "eng": ["Chess Engine", "Chess engine used by various chess games; contains functions and algorithms used by the computer to play against a user; chess engines may be updated or added to a chess program to provide new types of computer players.", "Windows, ", "['ChessBase Fritz']"], "enf": ["EndNote Filter File", "Data import filter used by EndNote, a program used for managing citations; stores rules that map fields from an external citations database into the EndNote format; used for importing bibliographic references.", "Windows, Mac, ", "['Thomson Reuters EndNote']['Thomson Reuters EndNote']"], "enex": ["Evernote Archive", "File exported by Evernote, a program used for capturing personal notes; saved in the Evernote Export (ENEX) XML format and contains written notes as well as binary file attachments that are encoded as text blocks within the XML markup.", "Windows, Mac, ", "['Evernote']['Evernote']"], "enc": ["Encoded File", "Generic encoded file that may use one of several different types of encodings; helps protect the file from unauthorized use, or helps set up the file for a particular use, such as Internet transfer.", "Windows, Mac, Windows, Windows, Windows, Mac, Windows, ", "[][]['ESTsoft Cabal Online'][]['GVOX Encore']['GVOX Encore'][]"], "emz": ["Windows Compressed Enhanced Metafile", "An EMZ file is a compressed image used by Microsoft programs such as Visio and the Office suite.  It contains an Enhanced Metafile (.EMF file) that has been compressed with the .GZIP compression algorithm.", "Windows, Mac, Linux, ", "['Microsoft Office 2016', 'Microsoft Visio 2016', 'Logipole Konvertor', 'XnViewMP']['XnViewMP']['XnViewMP']"], "emy": ["eMelody Ringtone File", "Simple text-based ringtone file used by some Ericsson mobile phones; may include a sequence of tones to play as well as instructions for vibrating the phone and making the phone display blink; can be opened and edited with any text editor.", "Windows, ", "['FMJ-Software Awave Studio']"], "emrg2": ["E-Merge 2.0 Data File", "File created by E-Merge, a tool that is part of E-Prime psychological study software; saves data merged from two or more .EDAT or .EDAT2 data files; used for combining study participant data sets into a single file.", "Windows, ", "['Psychology Software Tools E-Prime']"], "emx": ["eMusic Download File", "Music file used by eMusic Download Manager, a program that allows users to download .MP3 files; contains information for a music artist, album, and album art; used by Download Manager to download a specified set of MP3 files.", "Windows, Mac, Linux, ", "['eMusic.com Download Manager', 'eMusic/J']['eMusic.com Download Manager', 'eMusic/J']['eMusic.com Download Manager', 'eMusic/J']"], "emulecollection": ["eMule Data File", "Data file used by eMule, a peer-to-peer online file sharing program; contains a sequence of lines of text identifying ed2k (eDonkey Network) links to files; text lines include an ed2k link prefix, the file name, the file size, and a hash code to help recover corrupted files.", "Windows, Mac, ", "['eMule', 'eMule Plus', 'eMule Xtreme']['aMule']"], "emrg": ["E-Merge 1.x Data File", "File created by E-Merge, a tool included with E-Prime psychological study software; saves data merged from mulitple .EDAT data files; enables study participant data sets to be combined into a single file.", "Windows, ", "['Psychology Software Tools E-Prime']"], "emp": ["eMusic Music Download File", "Music file used by eMusic Download Manager, a program that allows users to download .MP3 files and play them in common music player programs, such as Apple iTunes and Windows Media Player; contains information about music artist, album, and album art; used to download a specified set of MP3 files.", "Windows, Mac, Linux, ", "['eMusic.com Download Manager', 'eMusic/J']['eMusic.com Download Manager', 'eMusic/J']['eMusic.com Download Manager', 'eMusic/J']"], "emm": ["MindMaple Map", "An EMM file is a document created by MindMaple, a mind mapping application used to brainstorm and organize ideas.  It contains a map which consists of text, shapes, branches, images, and icons that represent ideas.  EMM files are often used for brainstorming, taking notes, tracking projects, and researching topics.", "Windows, Mac, iOS, ", "['MindMaple']['MindMaple']['MindMaple']"], "emmt": ["MindMaple Map Template", "An EMMT file is a template created by MindMaple, a mind mapping application used to brainstorm and organize ideas.  It contains contents of a map, which includes text, shapes, branches, images, and icons that represent ideas and objectives.  EMMT files are similar to .EMM files but are used to replicate maps for multiple uses.", "Windows, Mac, iOS, ", "['MindMaple']['MindMaple']['MindMaple']"], "emlxpart": ["Mail Message Attachment", "Attachment such as an image or other document attached to a mail message (.emlx file) saved using Mac OS X Mail; may also contain the HTML version of a message; does not contain the message metadata, which is included in the .emlx file", "Mac, ", "['Apple Mail']"], "emlx": ["Mail Message", "Individual e-mail message saved by Apple's Mac OS X Mail program; saved as a plain text file that can also be viewed in a text editor.", "Windows, Mac, Android, ", "['File Viewer Plus']['Apple Mail', 'text editor']['File Viewer for Android']"], "emf": ["Enhanced Windows Metafile", "Windows vector graphics format recognized by many image-editing applications; basically a 32-bit version of the original Windows Metafile Format (.WMF), which only supports 16-bit data; saves image data in an RGB format and does not support CMYK data.", "Windows, Mac, Linux, Windows, Mac, Linux, ", "['File Viewer Plus', 'Microsoft Office 2016', 'Adobe Illustrator CC 2017', 'Newera Graphics Converter Pro', 'Corel PaintShop Pro X9', 'CorelDRAW Graphics Suite X8', 'Corel Presentations X8', 'ACD Systems Canvas X 2017', 'ACD Systems ACDSee 20', 'Microsoft Windows Picture and Fax Viewer', 'Companion Software Metafile Companion', 'IrfanView', 'Apache OpenOffice']['Microsoft Office 2016', 'Adobe Illustrator CC 2017', 'Cristallight WMF Converter Pro', 'Echo One File Juicer', 'Apache OpenOffice', 'Planamesa NeoOffice', 'XnViewMP']['Apache OpenOffice', 'XnViewMP']['Jasspa MicroEmacs']['Jasspa MicroEmacs']['Jasspa MicroEmacs']"], "eml": ["E-Mail Message", "An EML file is an email message saved by Microsoft Outlook or other e-mail programs.  It may also contain an e-mail attachment, which is a file sent with the message.", "Windows, Mac, Linux, iOS, Android, ", "['File Viewer Plus', 'Microsoft Outlook 2016', 'Microsoft Outlook Express', 'Microsoft Internet Explorer', 'Microsoft Windows Live Mail', 'Mozilla Thunderbird', 'Encryptomatic Message Viewer Lite', 'Novell GroupWise', 'Perion IncrediMail', 'Mozilla SeaMonkey']['Microsoft Outlook 2016', 'Apple Mail', 'Mozilla Thunderbird', 'Mozilla SeaMonkey']['Mozilla Thunderbird', 'Mozilla SeaMonkey']['Kupon.BG Klammer 3']['File Viewer for Android']"], "emerald": ["Emerald Theme", "Theme designed for the Compiz Window Manager that can be applied using the Emerald Window Decorator; saved in a package format that includes several button images, a screenshot, and a \"theme.ini\" file; can be installed and edited using the Emerald Theme Manager.", "Linux, ", "[]"], "emd": ["ChessBase Tablebase", "Database format used by ChessBase chess software; used to store chess game scenarios", "Windows, Windows, ", "['ChessBase']['FMJ-Software Awave Studio']"], "emc": ["Striata Reader Encrypted Document", "File used by Striata Reader, a program that allows users to view documents that are encrypted by Striata software; contains an encrypted document such as a bill, letter, invoice, or a collection notice; commonly used by banks and credit card companies for sending high-volume, system generated statements to customers; also used by businesses for eBilling.", "Windows, Mac, Linux, ", "['Striata Reader']['Striata Reader']['Striata Reader']"], "embr": ["Spatial Geodatabase File", "GIS file format developed by GEOREID Pty Ltd, a company that specializes in GIS data collection, site surveying, and analysis; used to store statistical geodatabase data such as calculated lengths or volumes at a set point in time; contains information in plain text.", "Windows, ", "['ESRI ArcGIS for Desktop', 'Microsoft Notepad', 'Microsoft WordPad']"], "embl": ["EMBL Sequence Data File", "DNA and protein sequence file format used by a variety of DNA sequence programs; contains sequence data, along with information about the sequence, such as the name, type, and description; can store multiple sequences.", "Windows, Mac, Linux, ", "['DNASTAR Lasergene', 'GeneStudio SeqVerter']['DNASTAR Lasergene']['DNASTAR Lasergene']"], "email": ["Outlook Express Email Message", "An EMAIL file is an email message created with Microsoft Outlook Express, an email and news client bundled with Internet Explorer 4.0 to 6.0.  It contains a message but may also store an email attachment, which is a file sent with the message.", "Windows, ", "['Microsoft Outlook Express']"], "emb": ["Everest Embedded Bank File", "Sound bank format used by Everest software.", "Windows, Windows, Windows, ", "['FMJ-Software Awave Studio']['Wilcom TrueSizer', 'Wilcom EmbroideryStudio', 'Orchida Embroidery System']['VSM Group creative 3D Suite']"], "els": ["EasyLanguage Storage File", "An ELS file is a data file created by TradeStation, a stock trading platform used to analyze markets, find opportunities, execute trades, and monitor trades.  It contains one or more analysis techniques and strategies configured in the application.", "Windows, ", "['TradeStation']"], "em": ["Encore Menu Template", "DVD menu template created by Encore, a program used for creating DVDs and Blu-ray discs; saves the background image, audio and video clips, and duration and loop configuration for a DVD menu; can be reused across multiple disc projects (.NCORX files).", "Windows, Mac, ", "['Adobe Encore CS6']['Adobe Encore CS6']"], "elm": ["Eternal Lands Map File", "Game file used by Eternal Lands, a free fantasy massively multiplayer online role-playing game (MMORPG); contains information about modifiable 2D and 3D objects for the map; used in conjunction with a .BMP file, which colors the map and defines locations.", "Windows, Mac, Linux, Windows, ", "['Eternal Lands']['Eternal Lands']['Eternal Lands']['Microsoft Office 2016', 'Microsoft FrontPage']"], "elf": ["Nintendo Wii Game File", "Executable file format used by the Nintendo Wii, a video game console released by Nintendo in November, 2006; may be transferred to a PC and played on the Dolphin Emulator.", "Windows, Mac, Linux, Linux, Windows, Linux, ", "['Dolphin']['Dolphin']['Dolphin'][]['PCSX2', 'NeutrinoSX2', 'PS2emu'][]"], "elc": ["Emacs Compiled Lisp File", "Compiled Lisp file created by Emacs, a customizable text editor; generated from a standard Lisp (.EL) file using the Emacs byte-code compiler; may contain Emacs configuration settings or may provide extra program functionality.", "Windows, Mac, Linux, ", "['Gnu Emacs']['Gnu Emacs']['Gnu Emacs']"], "eld": ["Eulumdat Formatted Luminaire Data File", "Luminaire data file used by DIALux, a professional light planning application for various lighting environments; contains lighting data for a light fixture, which include the light intensity, the light distribution curve, and the size of the luminaire; can be used interchangeably with a .LDT file.", "Windows, ", "['DIAL DIALux', 'DIAL LDT Editor']"], "el4": ["Easy-PhotoPrint EX Calendar File", "An EL4 file is a calendar file created by Easy-PhotoPrint EX, a program used to create albums, stickers and calendars from digital photos.  It contains a customizable calendar layout.", "Windows, Mac, ", "['Canon Easy-PhotoPrint EX']['Canon Easy-PhotoPrint EX']"], "el": ["Emacs Lisp Code File", "Lisp file referenced by Emacs, a basic multiplatform text editor; contains Lisp code that may define Emacs configuraton settings or may add additional features to the program.", "Windows, Mac, Linux, ", "['Gnu Emacs']['Gnu Emacs']['Gnu Emacs']"], "ek6": ["Generation 6 Pokémon Save File", "Pokémon save file used by 6th generation Pokémon games for the Nintendo 3DS platform, such as Omega Ruby and Alpha Sapphire; stores information about a Pokémon, including its nickname, friendship, language, ball type, contests stats,  and latest handler.", "Windows, ", "['PKHeX']"], "ekx": ["Encrypted 3DS Pokémon Save File", "Encrypted Pokémon save file used by 3DS Pokémon games, such as Omega Ruby and Alpha Sapphire; contains information about a Pokémon, including its nature, the location it is encountered, abilities, battle stats, and attacks.", "Windows, ", "['PKHeX']"], "ekb": ["ZMC Visual Tablet Data", "Application data used by VisualTablet, a plug-in for AutoCAD that adds a Graphical User Interface designed to enhance the productivity of digitizer template users;  contains the necessary data to run the application.", "Windows, ", "['ZMC VisualTablet for AutoCAD']"], "eix": ["Metin2 Game Data File", "Data file used by Metin2, a Massively Multiplayer Online Role-Playing Game (MMORPG) that takes place in an eastern fantasy world; may contain level data, 3D objects, sounds, textures, scripts, and other data used by the game.", "Windows, ", "['Ymir Entertainment Metin2']"], "eit": ["Yozo Office Template File", "Template created by Evermore Integrated Office, an office document creator suite; contains a template with customized settings for its specific theme; different template themes include default, presentation, spreadsheet or wordprocessor template; similar to .ECT files. ", "Windows, Linux, ", "['Yozosoft Yozo Office']['Yozosoft Yozo Office']"], "eip": ["Enhanced Image Package File", "Raster image created by Capture One, a professional photo-editing application often used in conjunction with Phase One digital cameras; not only stores the RAW image itself, but also includes custom settings, .ICC profiles, and .LCC profiles.", "Windows, Mac, ", "['Phase One Capture One', 'Microsoft Windows Photos']['Phase One Capture One']"], "ehi": ["HTTP Injector Config File", "Config file used by HTTP Injector, an Android app used to modify requests and access blocked websites behind firewall with SSH support and proxy server; contains settings that configure HTTP Injector, which includes server login credentials and security/locking information.", "Android, ", "['Evozi HTTP Injector']"], "eham": ["ExtraHAM Executable File", "File used by the HAM Programmer Toolkit, a program used for developing applications for Zaplots' HAM runtime; similar to a .HAM file but contains \"phrased\" expressions in a slightly different language; can be executed in the HAM runtime.", "Windows, ", "[]"], "eio": ["Yozo Office File", "File created by Evermore Integrated Office, an office suite similar to Microsoft Office; contains document formatting features such as text alignment, font settings, image insertion, and organization charts; holds a text document, worksheet, presentation, or blank binder; similar to a .DOCX, .PPTX, or .XLSX file. ", "Windows, Linux, ", "['Yozosoft Yozo Office']['Yozosoft Yozo Office']"], "egt": ["EagleGet Temporary File", "Temporary file created by EagleGet, a download manager; used to save the contents of a file while it is being downloaded then reverts to the appropriate file extension.", "Windows, ", "['EagleGet']"], "egp": ["Easy Grade Pro Gradebook File", "File created by Easy Grade Pro, a program that allows teachers to store and track grade information for their classes and subjects; contains classes, student names, IDs, attendance, assignments, test scores, and grades.", "Windows, Mac, ", "[][]"], "egm": ["Enigmo Custom Game File", "Custom level created for Enigmo, a 3D puzzle game; includes the layout of the puzzle, various objects, and tools used to complete the puzzle.", "Windows, Mac, ", "[][]"], "eglib": ["Adobe Edge Animate Library File", "Library file created by Adobe Edge Animate, a program used for making animated Web content; contains symbols and their properties that can be shared between different projects; contained symbols are usually vector or bitmap graphics converted into symbols; similar to the .ANSYM file.", "Windows, Mac, ", "['Adobe Edge Animate CC']['Adobe Edge Animate CC']"], "egg": ["Panda3D Model File", "3D model format used by Panda3D, a 3D engine designed primarily for game development; defines all transforms, including joint transforms, relative to the model's parent node; all vertices are defined using global coordinates; can be viewed with PView (Panda Viewer), which is included with the Panda3D software.", "Windows, Mac, Linux, Windows, Mac, Linux, ", "['Panda3D']['Panda3D']['Panda3D']['ESTSoft ALZip', 'Bandisoft Bandizip']['ESTSoft ALZip']['UnEgg']"], "egc": ["EximiousSoft GIF Creator Document", "Project file created by EximiousSoft GIF Creator, a program used to create GIF animations; contains your project, which includes any edits and effects you have applied to your image(s).", "Windows, ", "['EximiousSoft GIF Creator']"], "efv": ["Ensoniq VFX-SD File", "Sound format used by the Ensoniq VFX-SD digital workstation synthesizer", "Windows, Mac, ", "[][]"], "efx": ["eFax Document", "Document created by eFax, a service that sends and receives faxes as document attachments via email; contains email attachment and email body text; can be converted into .PDF or .TIF files using eFax Messenger.", "Windows, Mac, Linux, Windows, Mac, ", "['j2 Global Communications eFax']['j2 Global Communications eFax']['j2 Global Communications eFax']['Raven Software Star Wars Jedi Knight: Jedi Academy']['Raven Software Star Wars Jedi Knight: Jedi Academy']"], "efw": ["Renamed Zip or Executable File", "Compressed .ZIP or executable .EXE file renamed by CA Security Centre to have a \".efw\" extension; typically applies to e-mail attachments scanned by Computer Associates (CA) antivirus software.", "Windows, Mac, Linux, ", "['Corel WinZip 21', 'E-merge WinAce', 'PKZip', 'Smith Micro StuffIt Deluxe for Windows']['Smith Micro StuffIt Deluxe 16']['funzip', 'p7zip']"], "efu": ["Encryptafile Public Key File", "Public Key used to authenticate an encrypted Encryptafile (.EFL) file; contains a hexadecimal representation of the public key; made available to the public and used along with the Private Key (.EFR) file to verify a digitally signed file.", "Windows, ", "[]"], "eftx": ["Office 2007 Theme Effect File", "Theme effect that can be applied to presentations and documents in Microsoft Office 2007 or later; contains effects that may be applied to charts, SmartArt graphics, tables, pictures, shapes, WordArt, and text; includes effects for lines, fills, and special effects, such as 3D and shadow effects.", "Windows, ", "['Microsoft Word 2016', 'Microsoft Excel 2016', 'Microsoft PowerPoint 2016']"], "efs": ["Ensoniq SQ-80 File", "Audio file format used by the SQ-80, a synthesizer released by Ensoniq in 1987", "Windows, Mac, ", "[][]"], "efr": ["Encryptafile Private Key File", "Private Key used to authenticate an encrypted Encryptafile (.EFL) file; contains a hexadecimal representation of the private key used to created the digital signature for the file.", "Windows, ", "[]"], "efq": ["Ensoniq SQ1/SQ2/KS-32 File", "Sound format used by the SQ1, SQ2, and KS-32 synthesizers, a line of digital workstation keyboards released by Ensoniq in the early 1990s", "Windows, Mac, ", "[][]"], "efp": ["Exchange Forms Designer Template", "Form template used by Microsoft Exchange Forms Designer (EFD), an application development tool used for creating electronic forms; contains a basic form outline that is referenced by the Exchange Forms Designer Wizard.", "Windows, ", "['Microsoft Exchange Forms Designer']"], "efl": ["External Format Language File", "Formatting file used by NFBTRANS, a Grade Two braille translation program developed by the National Federation of the Blind (NFB); contains instructions that direct the translator how to process a given input file.", "Windows, Windows, ", "[][]"], "efk": ["Ensoniq KT File", "Sound format used by the Ensoniq KT music production studio", "Windows, Mac, ", "[][]"], "efi": ["Extensible Firmware Interface File", "System file used by both Intel-based computer systems and computer devices such as AppleTVs; contains system-level data that executes between the operating system and the firmware; used for staging firmware updates, booting operating systems, and running pre-boot programs.", "Windows, Mac, Linux, ", "['EFI Developer Kit']['EFI Developer Kit']['EFI Developer Kit']"], "efires": ["EFI Image File", "System file used by Mac laptops and desktops; saved in the Extensible Firmware Interface (EFI) format, an Intel format that defines the interface between the firmware and the operating system.", "Mac, ", "['Apple OS X']"], "efe": ["Ensoniq EPS File", "Ensoniq Performance Sampler (EPS) sound format used by Ensoniq samplers (now owned by E-mu); similar to a .WAV file, but also includes pitch and key information and indicates where the samples are played back on a MIDI keyboard.", "Windows, Mac, ", "[][]"], "efa": ["Ensoniq ASR File", "Audio format used by the Ensoniq Advanced Sampling Recorder (ASR), a digital music production studio released by Ensoniq in the early 1990s", "Windows, Mac, ", "[][]"], "ef2": ["Internet Download Manager Export File", "Export file created by Internet Download Manager (IDM), a program used for speeding up downloads; saves a list of downloaded files, or files queued for download; used for saving download lists for later and for sharing with others.", "Windows, ", "['Internet Download Manager']"], "ef": ["Diploma Exam File", "Exam file used by Wimba Diploma, an application used to create exams; contains custom questions, instructions, answers, chapters, editing marks, and test layout information; can be exported as an .RTF file for convenient sharing.", "Windows, Mac, ", "['Wimba Diploma']['Wimba Diploma']"], "eepf": ["EmuOS Exchangeable Packet File", "File used by EmuOS, a multiplayer hacking simulator where players can play online against one another; stores a packet of information that can be used to transmit data over a network.", "Windows, ", "[]"], "eep": ["EEPROM Data File", "Data file that stores information on EEPROM (Electrically Erasable Programmable Read-Only Memory) media, such as flash memory; contains data in a hexadecimal (\"hex\") format, which defines what contents of the memory device; can be edited with a Hex editor or a programming application like PonyProg.", "Windows, ", "['PonyProg']"], "eek": ["Arachne Network-Enabled Script", "File used by Arachne, a Web browser for DOS now also supported for Linux; similar to an .OOK file but also specifies network command line arguments for for IP address, nameserver, gateway, and netmask; used for starting DOS TCP/IP utilities.", "Windows, Linux, ", "['Arachne']['Arachne']"], "edz": ["EPLAN Electric P8 Data Archive Zipped File", "An EDZ file is a data archive used by EPLAN Electric P8, a program used to plan, document, and manage electrical control, fluid power systems, and control systems projects.  It contains macros for parts and parts data, such as control units, sensor modules, and line modules.", "Windows, ", "['EPLAN Electric P8']"], "edx": ["Edraw XML FIle", "An EDX file is a diagram created by Edraw Max, a professional diagram application.  It contains a diagram, which includes charting shapes, arrows, and text.  EDX files were replaced by .EDDX files, which are also used for storing diagrams but are smaller in size.", "Windows, ", "['EdrawSoft Edraw Max']"], "edxz": ["Edraw Compressed XML FIle", "Compressed file created by Edraw Max, a diagram creating program; contains your customized diagrams created from Edraw Max's default templates; diagrams consist of arrows, shapes, and text; the compressed format is optimal for sharing projects with others. ", "Windows, ", "['EdrawSoft Edraw Max']"], "edv": ["Ensoniq VFX-SD Disk Image", "Copy of a disk formatted for an Ensoniq VFX-SD, a low-cost, high-performance workstation synthesizer released in 1989", "Windows, ", "[]"], "eds": ["Ensoniq SQ-80 Disk Image", "Copy of a disk formatted for an Ensoniq SQ-80 synthesizer, a digital workstation released by Ensoniq in 1987", "Windows, ", "[]"], "edrwx": ["XPS Drawing Document", "Document created in the .XPS format; usually contains a CAD drawing, such as an .EDRW file, that has been exported into the XML Paper Specification (XPS) format from a CAD program; can be viewed with any XPS file viewer.", "Windows, Mac, Linux, ", "['Microsoft XPS Viewer', 'Microsoft Word 2016', 'Pagemark XpsViewer', 'NiXPS View']['Pagemark XpsViewer', 'Microsoft Word 2016', 'NiXPS View']['Pagemark XpsViewer', 'KDE Okular']"], "edrw": ["SolidWorks eDrawings File", "eDrawings CAD mechanical design draft exported by SolidWorks software; can represent various mechanical designs including tools, casings, or building materials; reduces project size by up to 95 percent; commonly used for e-mailing project drafts.", "Windows, Mac, ", "['Dassault Systemes SolidWorks', 'Dassault Systemes SolidWorks eDrawings Viewer']['Dassault Systemes SolidWorks', 'Dassault Systemes SolidWorks eDrawings Viewer']"], "edq": ["Ensoniq SQ1/SQ2/KS32 Disk Image", "Copy of a disk formatted for an Ensoniq SQ1, SQ2, or KS32 music keyboard; can be copied to a disk and loaded on an Ensoniq keyboard; may also be opened and read on a PC using a utility like Chicken Systems Ensoniq Disk Tools.", "Windows, ", "[]"], "edml": ["Adobe Extension Data Markup Language Document", "File used by Adobe Dreamweaver, a program used for building websites and Web applications; contains properties and instructions for how to display and populate data; often used for creating custom server behaviors.", "Windows, Mac, ", "['Adobe Dreamweaver CC 2017']['Adobe Dreamweaver CC 2017']"], "edn": ["EDIF Implementation Netlist File", "File used by Xilinx PLC (programmable logic controller) implementation tools such as Xilinx ISE; created by The CORE Generator component of the software and contains a netlist for a core.", "Windows, Windows, Mac, ", "['Xilinx ISE Design Suite']['Adobe Digital Editions', 'Adobe Acrobat DC', 'Adobe Reader']['Adobe Digital Editions', 'Adobe Acrobat DC', 'Adobe Reader']"], "edmx": ["ADO.NET Entity Data Model Designer File", "Data model file created by the Entity Data Model Designer component of Microsoft Visual Studio; stores the schema for a database, including entities (e.g., database tables), their fields, and their relationships (e.g., one-to-one and one-to-many).", "Windows, ", "['Microsoft Visual Studio 2017']"], "edm": ["Adobe Extension Data Markup Language File", "Settings file used by Adobe Dreamweaver, a program used to create websites; contains user-defined instructions for how to display and populate data within the application; commonly used for developing custom server behaviors.", "Windows, Mac, ", "['Adobe Dreamweaver CC 2017']['Adobe Dreamweaver CC 2017']"], "edl": ["Edit Decision List File", "Video editing file created by programs such as Adobe Premiere Pro, Avid Media Composer, and Apple Final Cut Pro; stores an edit decision list (EDL), which specifies editing choices during production; includes the location of source video data and timecodes for when to use video; allows the original project to be recreated in a separate editing system.", "Windows, Mac, ", "['Adobe Premiere Pro CC 2017', 'Avid Media Composer', 'Adobe SpeedGrade CC 2017']['Adobe Premiere Pro CC 2017', 'Avid Media Composer', 'Apple Final Cut Pro X', 'Adobe SpeedGrade CC 2017']"], "edi": ["Electronic Data Interchange File", "Data file formatted using one of several Electronic Data Interchange (EDI) standards; contains structured data stored in a plain text format; designed for transferring data between multiple organizations.", "Windows, Mac, ", "['Microsoft Excel 2016', 'Progress Stylus Studio', 'Etasoft Extreme Translator', 'Etasoft EDI Validator']['Microsoft Excel 2016']"], "edk": ["Ensoniq KT Disk Image", "Copy of a disk formatted for an Ensoniq KT synthesizer", "Windows, ", "[]"], "edj": ["Enlightenment Theme File", "Theme file used with Edje, a graphic design and layout library; contains graphics, GUI elements, user interaction functions, and fonts; commonly used for changing the look and feel of the Enlightenment Desktop Environment.", "Linux, ", "['Enlightenment', 'Editje', 'Edje_Viewer']"], "edf": ["ESRF Data File", "ESRF data file (EDF) used as a container to store text and binary data; contains header information and associated binary data; commonly used in scientific research applications to store collections of images.", "Windows, Windows, Windows, ", "[]['Acca Software Edificius']['Dunstad Estimator']"], "edge": ["Adobe Edge Project File", "HTML project created by Adobe Edge, a program used for developing Web animations with HTML/HTML5, JavaScript, and CSS; saved in a plain text format and stores a multitrack timeline for animating webpage elements; uses jQuery (a JavaScript library) for enabling the animation; can be used as an alternative to creating webpages with Flash.", "Windows, Mac, ", "['Adobe Edge Animate CC']['Adobe Edge Animate CC']"], "edg": ["Edge Diagrammer File", "Diagram created by Edge Diagrammer, a tool used for creating technical, presentation, and other types of diagrams; stores the drawing layout as well as blocks, arrow, and text labels; can be used for various types of diagrams, including flowcharts, organizational charts, network diagrams, and block diagrams.", "Windows, ", "['Pacestar Edge Diagrammer']"], "edfx": ["Estimator.NET Estimate File", "Estimate file created by Estimator.NET, a program used to create financial estimates; stores one or more estimates, which include financial data such as prices, expenses, delivery schedules, and cost; used to estimate budgets and send financial reports to customers.", "Windows, ", "['Dunstad Estimator.NET']"], "ede": ["Ensoniq EPS Disk Image", "Copy of a disk formatted for the Ensoniq Performance Sampler (EPS), one of the original digital music production tools", "Windows, ", "[]"], "eddx": ["Edraw XML FIle", "An EDDX file is a file created by Edraw Max and Network Diagram Maker, professional diagram applications.  It contains a diagram, which may include text, shapes, arrows, connectors, or images.  EDDX files are used to create various types of diagrams, such as flowcharts, mind maps, floor plans, infographics, and organizational charts. ", "Windows, Mac, Linux, Web, ", "['EdrawSoft Edraw Max', 'EdrawSoft Network Diagram Maker']['EdrawSoft Edraw Max', 'EdrawSoft Network Diagram Maker']['EdrawSoft Edraw Max']['EdrawSoft Edraw Viewer']"], "edc": ["Kryptel Lite Encrypted File", "File encrypted by Kryptel Lite, a program used to securely store and backup files using Advanced Encryption Standard (AES) encryption; contains the encrypted contents of a source file; used to protect individual files for secure storage.", "Windows, ", "[]"], "edat2": ["E-DataAid 2.0 File", "File created by E-DataAid version 2, a data entry and tracking tool that is part of the the E-Prime application suite; stores data using rows and columns like a spreadsheet; used for saving participant data; may be exported to StatView, SPSS, or Microsoft Excel formats for statistical analysis.", "Windows, ", "['Psychology Software Tools E-Prime']"], "edb": ["Exchange Information Store Database", "Database created by Microsoft Exchange Server; serves as the main repository for the mailbox data saved by Exchange; stores both in-process and stored non-SMTP messages; formatted using a b-tree structure, which includes a top level node and many child nodes.", "Windows, ", "['Microsoft Exchange Server', 'Stellar Phoenix Mailbox Exchange Recovery']"], "ec3": ["EPSON Print CD File", "CD label project created by older versions of EPSON Print CD, whereas newer versions use the .PRINTCD2 format; saves the design of the label, including graphics and text; can be printed on a disc inserted into the supporting EPSON printer.", "Windows, Mac, ", "['EPSON Print CD']['EPSON Print CD']"], "ec0": ["MetroCount Traffic Data File", "Data file used by MetroCount Traffic Executive, a program that generates traffic and vehicle classification reports for traffic surveys; contains report graphs, charts, and properties such as vehicle filter settings, units of measurement, colors, speed bins, classification schemes, and statistical settings. ", "Windows, ", "[]"], "ebuild": ["Portage eBuild Script", "Installer script for Portage, a package management system used by Gentoo Linux; contains compilation and installation procedures for software packages; used by the Portage emerge tool, which installs the software.", "Linux, ", "[]"], "ebs2": ["E-Run 2.0 Script File", "Script executed by E-Run, a program included with E-Prime experimentation software; saves an executable experiment that was generated from a design (.ES2 file); enables psychology experiments to be run standalone using E-Run.", "Windows, ", "['Psychology Software Tools E-Prime']"], "ebs": ["E-Run 1.x Script", "Script executed by E-Run, an application included with E-Prime, an application suite used for designing experiments in psychology; saves an executable experiment that was generated from a design (.ES file); allows experiments to be run standalone in E-Run.", "Windows, ", "['Psychology Software Tools E-Prime']"], "ebn": ["Philips Firmware Update File", "File used to update the firmware of a Philips electronic device, such as a portable digital music player; updates the device's system software; typically named \"Firmware.ebn\" or \"FWImage.ebn.\"", "Windows, ", "[]"], "ebm": ["EXTRA! Basic Macro", "Macro that automates processes within EXTRA!, a terminal emulation program from Attachmate; contains code with functions that can be run within the program; basic macros, such as Flag.ebm, Loop.ebm, and Captu32.ebm are included with the EXTRA! software.", "Windows, Windows, ", "['Attachmate EXTRA!']['Embla Systems RemLogic', 'PhiTools PRANA Software Suite']"], "ebd": ["Windows EBD System File", "System file used by the Windows operating system; not meant to be opened manually but instead is used by Windows when running the operating system.", "Windows, ", "['Microsoft Windows']"], "ebk": ["eBook Pro eBook File", "An EBK file is an eBook file created by eBook Pro, a program used to create eBooks and protect copyrighted information.  It stores a compressed and encrypted version of an eBook and can be read using the free eBook Viewer when proper user credentials are supplied.", "Windows, ", "[]"], "eaz": ["ArcGIS Explorer Add-in File", "Add-in file used by ArcGIS Explorer, a free ESRI application used for exploring, visualizing, and sharing maps; stores a compressed file archive, which includes an XML file, compiled code, and supporting files for the add-in; used for extending the base functionality of the software by storing new buttons, dockable windows, and other extensions.", "Windows, ", "['ESRI ArcGIS Explorer', 'Microsoft Visual Studio with ESRI ArcGIS Explorer SDK']"], "eba": ["Emergence BASIC Source Code File", "Source code file created by Emergence BASIC (EBasic), a simple IDE used to develop small Windows 32-bit applications; written in the EBasic programming language, which is similar to BASIC; often used for building small Windows utilities.", "Windows, ", "['File Viewer Plus', 'IonicWind IWBasic']"], "easm": ["eDrawings Assembly File", "CAD drawing created by eDrawings Publisher, a CAD program plugin used for generating eDrawings; stores a drafted assembly of parts; used for electronic transfer of CAD drawings over the Internet, as well as for printing.", "Windows, Mac, Linux, ", "['Dassault Systemes SolidWorks eDrawings Viewer', 'Dassault Systemes SolidWorks', 'Autodesk Inventor with eDrawings Publisher plug-in', 'Trimble Sketchup with eDrawings Publisher plug-in']['Dassault Systemes SolidWorks eDrawings Viewer', 'Dassault Systemes SolidWorks', 'Trimble Sketchup with eDrawings Publisher plug-in'][]"], "eas": ["RSLogix Symbol File", "ASCII-delimited file used by RSLogix, an IEC-1131-compliant application used to create programmable controller documentation; contains the address symbols and descriptions for a documentation database; used to reference and lookup common symbols in documents.", "Windows, ", "['Rockwell Automation RSLogix']"], "ear": ["Java Enterprise Archive File", "Application archive used by Java EE (Enterprise Edition), a platform used for programming server-side software such as Web applications; can contain .JAR and .WAR files, which together comprise a Java EE application package; used for running the application on a Java EE-enabled server, such as GlassFish Server or Geronimo.", "Windows, Mac, Linux, Windows, ", "['Oracle GlassFish Server', 'Apache Geronimo', 'IBM WebSphere Application Server']['Oracle GlassFish Server', 'Apache Geronimo']['Oracle GlassFish Server', 'Apache Geronimo', 'IBM WebSphere Application Server'][]"], "eap": ["Enterprise Architect Project", "Project file for Enterprise Architect, a CASE (Computer Aided Software Engineering) tool for the design and construction of software systems; supports the UML 2.0 specification.", "Windows, Windows, Mac, ", "['Sparx Systems Enterprise Architect']['Adobe Photoshop CC 2017']['Adobe Photoshop CC 2017']"], "eal": ["Kindle End Actions File", "File created by Amazon Kindle, an e-reading device; saved in an XML format; stores information that the reader sees after the last page of their book.", "Windows, Mac, ", "['Microsoft Notepad', 'text editor']['Apple TextEdit', 'text editor']"], "ea": ["Kindle End Actions File", "File created by the Amazon Kindle e-reading device; contains information that the reader sees after the last page of their book; saved in an XML format.", "Windows, Mac, ", "['Microsoft Notepad', 'text editor']['Apple TextEdit', 'text editor']"], "e_e": ["Renamed EXE File", "Windows executable (.EXE) file that has been renamed with the \".e_e\" extension, possibly to escape being filtered by an email program that detects file attachments with the \".exe\" extension.", "Windows, ", "['Microsoft Windows']"], "e57": ["LIDAR Point Cloud Data File", "3D image file created in the ASTM E57 format, a format used for storing data captured by 3D imaging systems; saves LIDAR (light detection and ranging) data, which was captured by 3D range cameras; enables remote sensing data to be saved in a vendor-neutral format.", "Windows, ", "['FARO Scene', 'RIEGL RiSCAN PRO', 'libE57']"], "e4a": ["Encrypt4all Archive", "Encrypted archive created with Encrypt4all, a document encryption program; may contain one or more files and folders; password-protected and can only be opened if the correct password is provided.", "Windows, ", "['Encrypt4all']"], "e2p": ["PonyProg Device File", "An E2P file is a device file used by PonyProg, a free universal programmer for serial devices.  It contains a configuration of a device, which includes the device type, security bits, and notes associated with the device.", "Windows, ", "['PonyProg']"], "e2gm": ["Pangea Enigmo 2 Custom Game File", "Custom game file used by Enigmo 2, an outer space puzzle game; contains one or more game levels, including walls, locations of obstacles, dynamic puzzle parts, player parts, and solution conditions; used for storing custom puzzles as well as downloading new puzzles from the Internet.", "Mac, ", "['Pangea Enigmo 2']"]}