{"g": ["BRL-CAD Geometry File", "Binary geometry file format used by BRL-CAD, an open source Constructive Solid Geometry (CSG) solid modeling system; saved in a database format that provides a robust and flexible object storage framework.", "Windows, Mac, Linux, ", "['BRL-CAD']['BRL-CAD']['BRL-CAD']"], "gamedata": ["Sandlot Game Data File", "Gaming file used to store saved data; often contains player's profile data; also holds gameplay information such as maps, animations, sounds, and textures; used in games like Sandlot Games' Ballhalla.", "Windows, ", "['Sandlot Games Ballhalla']"], "game": ["Apple Chess Saved Game", "Chess game saved with Apple Chess, the chess program included with Mac OS X; saves the match progress so that the game can be opened and resumed at a later time; may also be used to test different strategies from a certain point in the game.", "Mac, Windows, Mac, ", "[]['GameSalad Creator']['GameSalad Creator']"], "gam": ["Saved Game File", "A GAM file is created by various video games to store saved games.    It allows the gamer to continue where he or she left off the next time the program is opened.  GAM files may be manually saved by the user or automatically saved by the program, for example, at the end of each level.", "Windows, Mac, ", "[][]"], "gan": ["GanttProject Project File", "Project created with GanttProject, a open-source, cross-platform project scheduling program; contains a tree of tasks as well as a list of project resources and deadlines; can be visually rendered within GanttProject.", "Windows, Mac, Linux, ", "['GanttProject']['GanttProject']['GanttProject']"], "gb": ["Game Boy ROM File", "Read-only memory (ROM) file containing Game Boy game data; contains an exact copy of the data from a Nintendo Game Boy cartridge; can be played on a Mac or PC using Game Boy emulation software.", "Windows, Mac, Windows, Mac, Web, ", "['VisualBoyAdvance', 'BGB', 'TGB Dual', 'KiGB', 'gnuboy']['VisualBoyAdvance']['Heracle BioSoft DNA Baser', 'Genome Compiler']['Genome Compiler']['Genome Compiler']"], "gb1": ["Game Maker Backup File", "Backup of a game project created with Game Maker, a game development program; created in case the original project file becomes corrupted or is accidentally deleted.", "Windows, ", "['Yo Yo Games GameMaker: Studio']"], "gameproj": ["GameSalad Project File", "Game development project created by the Mac version of GameSalad Creator, a program used for making Android, iOS, Kindle, Nook, HTML5, and Mac OS X games; saves a series of \"scenes,\" \"actors,\" and \"tables,\" as well as behaviors that define how the actors interact in each scene; also saves all assets, including sounds and images.", "Windows, Mac, ", "['Scirra Construct']['GameSalad Creator']"], "gau": ["Flight Simulator Gauge File", "Aircraft gauge used by Microsoft Flight Simulator; includes altimeters, GPS displays, weather radars, radio stacks, etc; can be imported and used with various airplanes.", "Windows, ", "['Microsoft Flight Simulator X Gold Edition']"], "gb2": ["Game Maker Backup File", "Backup file created by Game Maker: Studio, a game development application for Windows; created as a backup of the original project file.", "Windows, ", "['Yo Yo Games GameMaker: Studio']"], "gar": ["Farming Simulator Game Archive File", "Game data file used by Farming Simulator, a game in which players plant and harvest crops as well as manage equipment and cattle; contains game content and is often seen with the filename DataS.gar.", "Windows, Windows, ", "['GIANTS Farming Simulator']['GridGain']"], "galleryitem": ["SMART Notebook Gallery Item File", "Gallery document file used by SMART Technologies' classroom management and whiteboard software; contains one or more gallery items from a teacher's classroom database; may include clip art images, video, audio, .NOTEBOOK files, or other types of content; used for exporting gallery documents and sharing them over email or the Internet.", "Windows, Mac, Linux, ", "['SMART Technologies Notebook']['SMART Technologies Notebook']['SMART Technologies Notebook']"], "gallerycollection": ["SMART Notebook Gallery Collection File", "Document collection file used by SMART Technologies' whiteboard and classroom management applications; contains a document set, which can include clip art, multimedia content, lesson activities, and .NOTEBOOK files; used for distributing packages of classroom lesson content over the Internet.", "Windows, Mac, Linux, ", "['SMART Technologies Notebook']['SMART Technologies Notebook']['SMART Technologies Notebook']"], "gallery": ["SMART Notebook Gallery File", "Document gallery used by SMART Technologies' classroom management applications; can contain clip art, background images, multimedia content and .NOTEBOOK files; used by teachers for organizing classroom materials and creating classroom lectures; also used for distributing content with other teachers or to classroom computers.", "Windows, Mac, Linux, ", "['SMART Technologies Notebook']['SMART Technologies Notebook']['SMART Technologies Notebook']"], "galaxy": ["Blizzard Galaxy File", "Source code file created using Blizzard's Galaxy language, which is used to program game triggers and computer artificial intelligence modules for StarCraft II: Wings of Liberty; contains variables, instructions, and other logic for the game; used for controlling the way the computer plays against human players, or for scripting game triggers.", "Windows, Mac, ", "['Blizzard StarCraft 2', 'Blizzard StarCraft 2 Editor', 'Microsoft Notepad', 'text editor']['Blizzard StarCraft 2', 'Blizzard StarCraft 2 Editor', 'Apple TextEdit', 'MacVim', 'Bare Bones TextWrangler', 'text editor']"], "gal": ["GenePix Array List File", "Biological data file created in the GenePix Array List (GAL) format; contains the names and locations (sector, row, and column) of \"features\" on a on a microarray slide; used for capturing flourescent spots on microarrays in biological experiments and can be used for quantitative analysis.", "Windows, ", "['Molecular Devices GenePix Pro Software', 'Microsoft Excel 2016', 'text editor']"], "gzip": ["Gnu Zipped File", "Compressed archive created using the Gnu gzip compression algorithm; gzip (GNU Zip) is an open source compressor included with many Unix systems.", "Windows, Mac, Linux, Android, ", "['File Viewer Plus', 'Smith Micro StuffIt Deluxe for Windows', 'Corel WinZip 21', '7-Zip']['Smith Micro StuffIt Deluxe 16', 'Apple Archive Utility']['gzip', 'Xarchive']['File Viewer for Android']"], "gza": ["IZArc BGA Archive File", "Archive file created by IZArc, an application used for file compression and decompression; stores one or more files that are compressed using the \"GZA\" method of BGA compression, which is an uncommon compression format; can be decompressed in IZArc to restore the original files.", "Windows, ", "['IZArc']"], "gz": ["Gnu Zipped Archive", "A GZ file is an archive file compressed by the standard GNU zip (gzip) compression algorithm.  It contains a compressed collection of one or more files and is commonly used on Unix operating systems for file compression.", "Windows, Mac, Linux, Android, ", "['File Viewer Plus', 'Smith Micro StuffIt Deluxe for Windows', 'Corel WinZip 21', 'WinRAR 5', 'E-merge WinAce', 'Acubix PicoZip', '7-Zip', 'PeaZip']['Smith Micro StuffIt Deluxe 16', 'Incredible Bee Archiver', 'Apple Archive Utility']['gzip', 'Xarchive', 'Ark', 'PeaZip']['File Viewer for Android', 'RARLAB RAR']"], "gz2": ["Misnamed BZ2 File", "Compressed file that actually should use the .BZ2 file extension; used on Unix-based systems and mistakenly named with the \".gz2\" extension, likely because the user thought it was related to the .GZ format; should be renamed as a \".bz2\" file and opened with a bzip2 compatible utility.", "Windows, Mac, Linux, ", "['Smith Micro StuffIt Deluxe for Windows', 'Corel WinZip 21', '7-Zip']['Apple Archive Utility', 'The Unarchiver', 'Smith Micro StuffIt Deluxe 16']['bzip2', 'Archive Manager']"], "gym": ["Sega Genesis Sound File", "Sega Genesis, aka Mega Drive for regions outside of North America, sound format created by the Genecyst emulator; contains video game audio data that was logged from the data sent to the YM2612 sound chip.", "Windows, ", "[]"], "gxt": ["Grand Theft Auto Text File", "File used by Grand Theft Auto (GTA), a game where players steal cars and complete missions; contains text that is displayed during gameplay; often included with GTA mods and may be translated into multiple languages.", "Windows, ", "['Rockstar Games Grand Theft Auto', 'X GXT Editor', 'GTA: Vice City GXT Editor']"], "gxm": ["General CADD Pro Macro File", "Macro file used by General CADD Pro, a CAD drawing application for Windows; saves a macro that contains a series of instructions that are automated in the software; useful for executing repetitive operations and writing small, custom programs.", "Windows, ", "['General CADD Pro']"], "gxl": ["Graph Exchange Language File", "Graph data file created in the GXL (Graph Exchange Language) format, a format used for transferring graphs between software applications; stores the nodes and edges and properties that make up the graph; uses an XML format that allows interoperability between programs.", "Windows, Mac, Linux, ", "['Graphviz', 'jGraph']['Graphviz', 'jGraph']['Graphviz', 'jGraph']"], "gxk": ["Galaxkey Secured File", "Encrypted archive created by Galaxkey, a program used for securely storing and transferring files; incorporates encryption as well as password protection; requires a registered Galaxkey identity as well as the Galaxkey software to extract files from the archive.", "Windows, Mac, iOS, Android, ", "['Galaxkey', 'Microsoft Outlook with Galaxkey Addin']['Galaxkey']['Galaxkey']['Galaxkey']"], "gxh": ["General CADD Pro Hatch Pattern File", "CAD file used by General CADD Pro, a CAD drawing program for Windows; contains a hatch pattern, which is a vector pattern that can be used to texturize or fill an area; used for applying various material patterns, such as brick, metal, glass, and plastic, to drawn objects.", "Windows, ", "['General CADD Pro']"], "gxf": ["General eXchange Format File", "General eXchange format used to transfer audiovisual clips between television program storage systems; may contain video, audio, time code, and metadata.", "Windows, Mac, Linux, Windows, ", "['File Viewer Plus', 'VideoLAN VLC media player']['VideoLAN VLC media player']['VideoLAN VLC media player']['General CADD Pro']"], "gxd": ["General CADD Pro Drawing", "CAD drawing created with General CADD Pro (GCP), a redeveloped version of Generic CADD for Windows; typically used for architectural designs and building floor plans; compressed internally by General CADD when saved.", "Windows, ", "['General CADD Pro']"], "gws": ["GeoMedia GeoWorkspace File", "Configuration file that stores user settings, legends, warehouse connections, and other preferences for GeoMedia; has a default coordinate system assigned to it, which can be changed by opening the GeoWorkspace Coordinate System dialog box.", "Windows, Windows, ", "['Intergraph GeoMedia']['Geosoft Oasis montaj']"], "gxc": ["General CADD Pro Component", "Drawing component file created with General CADD Pro (GCP), the successor to Generic CADD for Windows; used for saving drawing components, or objects, that can be added to a General CADD drawing (.GXD) file.", "Windows, ", "['General CADD Pro']"], "gwp": ["Greetings Workshop Project File", "File saved by Greetings Workshop, a program used to create cards, invitations, flyers, and other prints; contains formatted graphics and text as well as page layout settings; used to save and load Greetings Workshop projects.", "Windows, ", "[]"], "gwk": ["GraphiCode PCB Job File", "Printed circuit board (PCB) design created with GraphiCode Gerber manufacturing and design software; may contain PCB layers, names, aperture lists, drill lists, editing changes, and feature settings.", "Windows, ", "['GraphiCode GC-Prevue']"], "gwi": ["GroupWise Database Shortcut File", "File used by GroupWise, a collaboration program used in professional environments; contains a pointer to a GroupWise database object; may include a user ID, version, item type, message ID, and folder path.", "Windows, Mac, Linux, ", "['Novell GroupWise']['Novell GroupWise']['Novell GroupWise']"], "gwb": ["Interwrite Presentation File", "A GWB file is a presentation file created by Interwrite Workspace, a program used to enhance classroom lessons.  It contains one or more pages that may include annotations such as notes, highlights, drawings, screenshots, and graphs.  GWB files can be opened by InterWrite Reader.", "Windows, ", "['InterWrite Reader']"], "gwd": ["Gear Watchface Design File", "A GWD file is a watchface design project created by Gear Watch Designer, an application used by developers to create faces for Samsung watches such as Gear S, Gear S2, Gear S3, and Gear Fit2.  It contains a design for a watchface which includes the background, index, images, animation, complications (battery, heart rate, workout, etc.), and watch hands.", "Windows, Mac, ", "['Samsung Gear Watch Designer']['Samsung Gear Watch Designer']"], "gvsp": ["Geocortex Viewer for Silverlight Project", "A GVSP file contains a project created by Geocortex Viewer for Silverlight, a GIS program used to enhance ArcGIS software for web-GIS users.  It stores a project, which includes a map with plotted coordinates and drawn lines, areas, points, and text.  GVSP files also contain the layer symbolization and layer drawing order of the map. ", "Windows, Mac, ", "['Geocortex Viewer for Silverlight']['Geocortex Viewer for Silverlight']"], "gvy": ["Groovy Source Code File", "Source code fIle written in Groovy format, a Java inspired programming language; written in object-oriented programming language, which is helpful for designing applications and programs; easily integrates into the Java platform.", "Windows, Mac, Linux, ", "['Oracle Java Virtual Machine', 'Eclipse', 'Sublime Text 3', 'Oracle NetBeans']['Oracle Java Virtual Machine', 'Eclipse', 'Sublime Text 3', 'MacroMates TextMate', 'Oracle NetBeans']['Oracle Java Virtual Machine', 'Eclipse', 'Sublime Text 3', 'Oracle NetBeans']"], "gvp": ["Google Video Pointer", "Shortcut that contains the location of a Google Video Player (.GVI) file on the Internet; does not contain actual video data, but rather a reference to the video file.", "Windows, Mac, Linux, ", "['VideoLAN VLC media player']['VideoLAN VLC media player']['VideoLAN VLC media player']"], "gvimrc": ["GVim Runtime Configuration File", "File used by Gvim, a graphical version of the Vim text editor for the desktop; specifies default settings for the editor, such as the font, colors, the window size, and tab widths; similar to a .VIMRC file but can contain additional configuration options specific to Gvim.", "Windows, ", "['gVim']"], "gzi": ["Unix Gzip File", "File archive compressed using gzip (GNU zip) compression; used by Unix-based systems and replaces the older \"compress\" algorithm; offers better compression and does not use patented algorithms.", "Windows, Mac, Linux, ", "['Smith Micro StuffIt Deluxe for Windows', 'ConeXware PowerArchiver', 'Corel WinZip 21', '7-Zip']['Smith Micro StuffIt Deluxe 16']['gzip']"], "gvi": ["Google Video File", "Video format used by Google Video Player, a video playback program developed by Google; similar to an .AVI file and encoded in DivX4 with an MP3 compressed audio track; can also be played by VLC if the file does not incorporate DRM encryption.", "Windows, Mac, Linux, ", "['VideoLAN VLC media player']['Eltima Elmedia Player', 'VideoLAN VLC media player']['VideoLAN VLC media player']"], "guides": ["xScope Guides File", "File created by xScope, a program used for designing user interface mockups for mobile applications; saves a set of guides, which are vertical or horizontal markers on the the user interface mockup; allows the guides to remembered and reused across multiple interface designs.", "Mac, ", "['The Iconfactory xScope 4']"], "gv": ["Graphviz DOT File", "Document that contains a text description of graphs of nodes and edges; written in the DOT language and can be read by Graphviz compatible software programs.", "Windows, Mac, Linux, ", "['AT&T Graphviz']['AT&T Graphviz']['AT&T Graphviz']"], "gui": ["Dr.Explain Project File", "Project file created by Dr.Explain, a help authoring tool; contains help topics and articles written by the help documentation developer; used for publishing help manuals in Windows Help (.CHM), .PDF, and online HTML formats.", "Windows, ", "['Indigo Byte Systems Dr.Explain']"], "gts": ["Gerber Top Solder Mask Data File", "Data file created by CAD Printed Circuit Board (PCB) programs like Altium Designer and utilized by PCB manufacturing machines to designate electrical connections between components with pads and tracks; contains solder mask data for the top side of boards with multiple layers; includes information about all the pads that need soldering to prevent solder bridging of traces and pads during production; similar to the .GBS file extension. ", "Windows, Mac, Linux, Windows, ", "['Altium Designer', 'CadSoft EAGLE', 'Viewplot', 'Gerbv']['CadSoft EAGLE', 'Gerbv', 'gEDA']['CadSoft EAGLE', 'gEDA', 'Gerbv']['VSO ConvertXtoDVD', 'DRD Systems VideoReDo']"], "gtp": ["Gerber Top Solder Paste Data File", "Data output file created by Printed Circuit Board (PCB) CAD tools such as CadSoft EAGLE;  contains layout data for the top paste layer of the PCB for creating stencils to apply paste to the board; written in RS-274X, which is the most common and contemporary Gerber format. ", "Windows, Mac, Linux, Windows, Mac, Linux, Linux, ", "['CadSoft EAGLE', 'Altium Designer', 'Viewplot', 'Gerbv']['CadSoft EAGLE', 'Gerbv', 'gEDA']['CadSoft EAGLE', 'gEDA', 'Gerbv']['Arobas Music Guitar Pro', 'TuxGuitar']['Arobas Music Guitar Pro', 'TuxGuitar']['TuxGuitar']['GNOME Desktop']"], "gto": ["Gerber Top Overlay Data File", "Data output file created by CAD Printed Circuit Boards (PCB) tools and used by PCB manufacturing machines; contains layout data for the top silk screen layer of the PCB; written in RS-274X, which is the most common and contemporary Gerber format. ", "Windows, Mac, Linux, ", "['Altium Designer', 'CadSoft EAGLE', 'Viewplot', 'Gerbv']['CadSoft EAGLE', 'Gerbv', 'gEDA']['CadSoft EAGLE', 'gEDA', 'Gerbv']"], "gtm": ["GreekToMe Translation File", "File used by GreekToMe, a Greek New Testament study program; saves a New Testament Bible translation (e.g., KJV, ESV, etc.) provided for use with the GreekToMe software; contains both Greek words and their translations.", "Windows, Mac, Linux, ", "['GreekToMe']['GreekToMe']['GreekToMe']"], "gtl": ["Gerber Top Layer Data File", "Data output file created by Printed Circuit Board (PCB) CAD tools like Altium Designer and used by PCB manufacturing machines to designate electrical connections; contains RS-274X formatted data for multiple layer boards about the layout for top copper layers; similar to the .GBL file extension. ", "Windows, Mac, Linux, ", "['Altium Designer', 'CadSoft EAGLE', 'Viewplot', 'Gerbv']['CadSoft EAGLE', 'Gerbv', 'gEDA']['CadSoft EAGLE', 'gEDA', 'Gerbv']"], "gtkrc": ["GTK+ Theme File", "Settings file used by GTK+, a toolkit used for building graphical user interfaces; stored in a plain text format and contains settings that set the appearance of interface components; often used for theming the Linux GNOME desktop environment, which uses GTK+.", "Windows, Mac, Linux, ", "['GTK+', 'text editor']['GTK+', 'text editor']['GTK+', 'text editor']"], "gtable": ["Google Drive Fusion Table", "Fusion table file created by Google Drive, a desktop client that synchronizes files with the Google Drive cloud-based file storage service; contains a reference to a Google Docs fusion table stored with the user's Google account and opens the fusion table in the default browser when double-clicked.", "Windows, Mac, Web, ", "['Google Drive']['Google Drive']['Google Drive']"], "gthr": ["Gather Log File", "Text file that contains a log of data collected by a Microsoft logging utility; created by Windows Search, Microsoft Exchange, and SharePoint Portal Server after each file indexing process.", "Windows, ", "['text editor']"], "gtemplate": ["OmniGraffle Template", "Diagram template created by OmniGraffle diagramming and sketching software for Mac OS X; saves the layout dimensions, styles, and default elements for a diagram; used for drawing flowcharts and other diagrams with a similar look and feel.", "Mac, ", "['The Omni Group OmniGraffle']"], "gtar": ["GNU Tar Archive", "File archive created using the GNU Tar standard, which was originally developed for tape archives; contains a group of uncompressed files; commonly compressed into a .TGZ format using .GZ gzip compression.", "Windows, Mac, Linux, ", "['Smith Micro StuffIt Deluxe for Windows', 'Corel WinZip 21', 'ESTSoft AlZip', 'Zipeg']['Smith Micro StuffIt Deluxe 16', 'Apple Archive Utility', 'Incredible Bee Archiver'][]"], "gta": ["Microsoft Groove Tool Archive", "Mini-application created for Microsoft SharePoint Workspace (formerly named Groove), a program used for sharing documents and other content in collaborative environments; can be added to a SharePoint user's workspace to customize its functionality; used for distributing tools.", "Windows, ", "['Microsoft SharePoint Workspace']"], "gszip": ["GameSalad Marketplace Asset File", "File used by GameSalad Creator, a multi-platform game development program used for building iOS, Android, and HTML5 games; saves an archive of assets, such as art, music, or game development components, that can be sold and distributed on the GameSalad Marketplace; allows game developers to purchase and download assets for inclusion in their games.", "Windows, Mac, ", "['GameSalad Creator']['GameSalad Creator']"], "gsx": ["Sega Genesis Emulator Saved State File", "Game file created by Sega Genesis/Megadrive emulators such as Kega Fusion; contains a freeze state of the ROM (e.g., .32X file) while it is being run in the emulator; allows users to resume games at a specific point in time.", "Windows, Mac, Linux, ", "['Kega Fusion', 'Gens/GS']['Kega Fusion']['Kega Fusion', 'Gens/GS']"], "gstencil": ["OmniGraffle Stencil", "Vector graphics library used by OmniGraffle, a diagramming and sketching application; similar to a clipart library since it contains pre-made images, called stencils, that can be inserted into a diagram; saved in an XML format but encodes the image data as blocks of text.", "Mac, ", "['The Omni Group OmniGraffle']"], "gst": ["MapInfo Geoset File", "Map format used by MapInfo MapX and MapXtreme mapping software; contains a visual map and data about locations within the mapped area; may include extra layers, such as rasterized images placed on the map.", "Windows, ", "[]"], "gsr2": ["Golden Software Reference File", "GIS file used by Golden Software's mapping and visualization programs; saves georeferncing information for a corresponding spatial data set; enables the spatial data to be mapped to a real-world coordinate system.", "Windows, ", "['Golden Software Surfer', 'Golden Software Grapher', 'Golden Software Strater', 'Golden Software Voxler', 'Golden Software MapViewer', 'Golden Software Didger']"], "gsr": ["Golden Software Reference File", "GIS file used by Golden Software mapping and visualization applications; stores georeferencing information that maps a raster graphic or other spatial data to a real-world coordinate system; enables visualized data to map to real-world coordinates.", "Windows, ", "['Golden Software Surfer', 'Golden Software Grapher', 'Golden Software Strater', 'Golden Software Voxler', 'Golden Software MapViewer', 'Golden Software Didger']"], "gsproj": ["GameSalad Windows Project File", "Game development project created by the Windows version of GameSalad Creator, a program used for making Android, iOS, HTML5, and Mac OS X games; saves a game in terms of \"scenes,\" \"actors,\" and \"tables,\" as well as the behaviors for how actors interact with a scene; can be published and sold online when complete.", "Windows, ", "['GameSalad Creator', 'Scirra Construct']"], "gsp": ["IMail Error Message File", "File sent by IMail Server, an email server program used by small to medium-sized businesses; contains an error message or flag indicating a problem with the email delivery; typically generated by the mail server postmaster.", "Windows, Windows, Windows, Mac, ", "['Ipswitch IMail Server'][\"Key Curriculum Press Geometer's Sketchpad\"][][]"], "gsm": ["Global System for Mobile Audio File", "Audio format designed for telephony use in Europe; optimized for recording vocal audio, such as a telephone conversation.", "Windows, Mac, Linux, Windows, Mac, Linux, Windows, Mac, Windows, ", "['File Viewer Plus', 'NCH Switch', 'SoX', 'VideoLAN VLC media player']['NCH Switch', 'ShedWorx Smart Converter', 'SoX', 'VideoLAN VLC media player']['SoX', 'VideoLAN VLC media player']['j2 Global Communications eFax']['j2 Global Communications eFax']['j2 Global Communications eFax']['Graphisoft ArchiCAD']['Graphisoft ArchiCAD']['Golden Software MapViewer']"], "gslides": ["Google Drive Presentation", "A GSLIDES file is a presentation created by Google Slides, an online presentation editor included with Google Drive.  It contains a URL reference to a Google Slides presentation stored in Google Drive.  GSLIDES presentations store text, images, shapes, charts, tables, animations, and video similarly to a .PPTX file.", "Windows, Mac, Web, ", "['Google Drive']['Google Drive']['Google Drive']"], "gsi": ["Golden Software Interchange File", "Exchange data format used by Golden Software's mapping and visualization software products; contains map data and visualization appearance settings for the data; used for interchanging data between Golden Software applications.", "Windows, ", "['Golden Software Surfer', 'Golden Software Grapher', 'Golden Software Strater', 'Golden Software Voxler', 'Golden Software MapViewer', 'Golden Software Didger']"], "gsheet": ["Google Drive Spreadsheet", "A GSHEET file is a spreadsheet created by Google Sheets, an online spreadsheet program included with Google Drive.  It contains a URL reference to a Google Sheets spreadsheet in Google Drive.  GSHEET spreadsheets store data in cells arranged in a grid of rows and columns similarly to an .XLSX file.", "Windows, Mac, Web, ", "['Google Drive']['Google Drive']['Google Drive']"], "gsflib": ["Game Boy Advance Song Library", "Library of Game Boy Advance (GBA) song files (.MINIGSF); stores a list of music from a GBA game that is referenced by the audio program to play the correct music; needs to be located in the same directory as the MINIGSF song files in order to load appropriately.", "Windows, ", "['Nullsoft Winamp with Highly Advanced plugin']"], "gsf": ["Game Boy Advance Sound File", "Sound format used by Game Boy Advance (GBA) games; stores the music of GBA video games; contains assembly code ripped from the GBA ROM that produces the sound; sub-format of the .PSF format.; similar to the .USF format used to store Nintendo 64 game soundtracks.", "Windows, Mac, ", "['Nullsoft Winamp with Highly Advanced plugin']['Audio Overload']"], "gsc": ["Call of Duty Game Script", "File used by Call of Duty (CoD) games, including Modern Warfare 2 (MW2), MW3, MW4, and MW5; saved in a plain text format and may contain gameplay settings for maps, graphics, audio, and other gameplay properties often used for describing game maps.", "Windows, ", "['Activision Call of Duty 4: Modern Warfare', 'Activision Call of Duty: Black Ops', 'Notepad++', 'text editor']"], "gs3": ["GameStarter File", "File saved by GameStarter, a program that includes a wizard for building FPS Creator games; includes controller, sound, video, and performance settings, as well as other game information.", "Windows, ", "[]"], "gsb": ["Golden Software Boundary File", "GIS file used by spatial visualization and mapping products developed by Golden Software; contains geographical boundaries, such as country, state, or county boundaries; used for importing boundaries and then overlaying them with spatial data sets.", "Windows, ", "['Golden Software Surfer', 'Golden Software Grapher', 'Golden Software Strater', 'Golden Software Voxler', 'Golden Software MapViewer', 'Golden Software Didger']"], "gsd": ["General Station Description File", "ASCII text configuration file used for PROFIBUS DP (Decentralized Peripherals) or PA (Process Automation) devices; contains keywords and configuration information separated by line breaks; can be created with a text editor, the PROFIBUS GSD Editor, or another tool that supports PROFIBUS.", "Windows, Windows, ", "['PROFIBUS GSD Editor', 'PROCENTRIC ProfiTrace', 'OMRON CX-Profibus', 'Siemens SIMATIC Manager', 'Microsoft Notepad', 'Notepad++', 'text editor'][]"], "gsba": ["Game Save Backup Archive", "Archive created by GameSave Manager, a program that locates saved game files and backs them up; contains saved game files from your computer detected by GameSave Manager.", "Windows, ", "['InsaneMatt GameSave Manager']"], "gs0": ["Sega Genesis Emulator Quick Slot 0 Save File", "Saved state file created by Sega Genesis emulators such as Kega Fusion and Gens/GS; allows the user to resume the game from the specific point in time that the state was saved; used as one of 10 slots (*.gs0 - *.gs9).", "Windows, Mac, Linux, ", "['Kega Fusion', 'Gens/GS']['Kega Fusion']['Kega Fusion', 'Gens/GS']"], "grv": ["Office Groove File", "File used by Microsoft Office Groove, a collaboration program used in professional environments; contains account information or a Groove invitation; used for logging into Groove or inviting associates and co-workers to view a document or Web page.", "Windows, ", "[]"], "grt": ["Grapher Template", "File created by Grapher 2D and 3D graphing  software; saves a graph template, which specifies predefined settings for generating a graph; may include the graph type, axis labels, colors, layout formatting, and other settings.", "Windows, ", "['Golden Software Grapher']"], "grr": ["Gradekeeper Class Roster File", "Roster or list of students in a class created with Gradekeeper, a classroom attendance and grade tracking program; referenced by Gradekeeper when taking attendance and saving scores.", "Windows, Mac, ", "[][]"], "gs": ["Google Apps Script", "Script written in Google Apps Script, a programming language based on JavaScript and used for automating tasks across Google products online; used for creating online Web applications, such as a Web interface, a program that sends custom emails, or a program that automatically fills and formats Google Docs documents.", "Web, Windows, Mac, Windows, ", "['Google Apps Script'][][]['Geosoft Oasis montaj']"], "gry": ["Grayscale Image", "Raw image file that can be viewed with both XnView and Newera Graphics Converter Pro graphics programs; stores an image that includes only shades of grey; rarely used or seen anymore.", "Windows, Mac, Linux, ", "['XnViewMP', 'Newera Graphics Converter Pro']['XnViewMP']['XnViewMP']"], "growlticket": ["Growl Notification File", "Stores notification settings used by Growl, a notification program for Mac OS X; gives information to a specific program about what alerts and messages should be displayed to the user.", "Mac, ", "['Growl']"], "grp": ["StarCraft Graphics Group File", "Collection of frame images used for units, weapons, spells, wireframes, and menu graphics within Starcraft; each object may contain anywhere from a few to several hundred frames.", "Windows, Mac, Windows, Windows, Windows, ", "['Blizzard StarCraft']['Blizzard StarCraft']['SmarterTools SmarterMail'][][\"Ken Silverman's Build Engine\"]"], "growlregdict": ["Growl Temp File", "Temporary file created by Growl, an application notification program for Mac OS X; stores information used by the Growl Dictionary (GrowlDict).", "Mac, ", "['Growl']"], "groupproj": ["Delphi Project Group File", "Project file created by Delphi 2007 and later software development IDEs; stores a project group, which combines multiple projects (.DPROJ files) into a single working project; uses XML formatting and is suitable for version control.", "Windows, ", "['Embarcadero Delphi']"], "group": ["Windows Contacts Group File", "Collection of contacts created by Windows Contacts, an embedded contact management program included with Windows; contains a list of contacts saved into a group; can be used to create a mailing list for sending email messages to multiple addresses at once.", "Windows, ", "['Microsoft Windows Contacts']"], "groovy": ["Groovy Source Code File", "FIle containing source code written in Groovy format, a programming language similar to Java; object-oriented programming language, which is helpful for designing applications and programs; easily integrates into the Java platform.", "Windows, Mac, Linux, ", "['Oracle Java Virtual Machine', 'Eclipse', 'Sublime Text 3', 'Oracle NetBeans']['Oracle Java Virtual Machine', 'Eclipse', 'Sublime Text 3', 'MacroMates TextMate', 'Oracle NetBeans']['Oracle Java Virtual Machine', 'Eclipse', 'Sublime Text 3', 'Oracle NetBeans']"], "groove": ["ACID Groove File", "Rhythm texturing file used by MAGIX ACID, an audio-editing and mixing program; contains a \"groove,\" which can alter the rhythm of a track; used for adding feel to linear loop tracks.", "Windows, ", "['MAGIX ACID Pro 7']"], "grob": ["Graphic Object Bitmap File", "Bitmap image called a \"GROB\" (GRaphic Object Bitmap); created with a Hewlett-Packard scientific graphing calculator, such as the HP-48 and HP-49; may contain a graph, chart, or other graphic created on the calculator.", "Windows, Mac, ", "['XnViewMP']['XnViewMP']"], "grn": ["Granny 3D File", "Three-dimensional model or animation created with Granny 3D, a toolkit for building 3D games; supports 3D meshes, texture mapping, and animations; used in many 3D games and can be viewed with Granny Viewer.", "Windows, Mac, Linux, ", "['RAD Game Tools Granny 3D']['RAD Game Tools Granny 3D']['RAD Game Tools Granny 3D']"], "gro": ["Graphic Object Bitmap", "Bitmap image format sometimes referred to as a GROB (GRaphic Object Bitmap); used by Hewlett-Packard scientific calculators, such as the HP-48 and HP-49; used for storing graphs, charts, and other graphics created on the calculator.", "Windows, Mac, Windows, Mac, Linux, ", "['XnViewMP', 'Newera Graphics Converter Pro']['XnViewMP']['Audacity']['Audacity']['Audacity']"], "grl": ["Windows Update Status File", "Status file used by Windows Update; stores information about the current Windows configuration; named either \"active.grl\" or \"pending.grl\" and is stored in the \\windows\\winsxs directory by default.", "Windows, ", "['Microsoft Windows Update']"], "grk": ["Gradekeeper Class Gradebook File", "Gradebook created with Gradekeeper, a school attendance and grade tracking program; stores grades and attendance information for all students in a class.", "Windows, Mac, ", "[][]"], "grindx": ["Juice Grinder Recipe File", "Recipe file created by Juice Grinder, a program used to create and save eJuice recipes for personal vaporizers; contains a recipe calculated from information in the Juice Grinder .DEFT file; includes flavor, nicotine, PG, and VG ingredients; can be exported as a .PDF, .CSV, and .XLSX file.", "Windows, ", "['Juice Grinder']"], "grind": ["Juice Grinder Recipe File", "Recipe file created by Juice Grinder, a program used to create and save juice recipes; contains recipe results calculated from information in the Juice Grinder .DEFT file; includes ingredients, mL or g amount, number of drops, and ingredient percentages.", "Windows, ", "['Juice Grinder']"], "grib2": ["GRIB2 Meteorological Data File", "A GRIB2 file is a binary file saved in the World Meteorological Organization (WMO) format.  It contains gridded meteorological data and is used by meterological centers to store and exchange gridded fields.", "Windows, Mac, Linux, ", "['GrADS', 'zyGrib', 'wgrib2']['GrADS', 'zyGrib', 'wgrib2']['GrADS', 'zyGrib', 'wgrib2']"], "grib": ["Gridded Binary File", "Format used to store and transfer meteorological data between computer systems; more commonly seen with the .GRB extension.", "Windows, Mac, ", "['GrADS']['GrADS']"], "grf": ["Ragnarok Client Archive", "Compressed file archive used by Ragnarok Online, a Korean multiplayer game; includes compressed images, sounds, and other data files loaded by Ragnarok.", "Windows, Windows, Windows, Linux, Windows, Mac, Linux, Windows, Windows, ", "['GRAVITY Ragnarok Online']['Hydesoft Computing DPlot', 'Hydesoft Computing DPlot Viewer']['Transport Tycoon', 'OpenTTD', 'GRFCodec']['OpenTTD', 'GRFCodec']['Javlin CloverETL Designer']['Javlin CloverETL Designer']['Javlin CloverETL Designer']['Golden Software Grapher'][]"], "greenfoot": ["Greenfoot Project Archive", "Project file created by Greenfoot, a Java development environment; holds Greenfoot properties specific to a certain project; examples of property types contained in the file include class, target destination, and dependency.", "Windows, Mac, Linux, ", "['Greenfoot']['Greenfoot']['Greenfoot']"], "grdb": ["Gramps Database File", "A GRDB file is a database created by Gramps, a free, open source program used to analyze genealogy.  It contains database information for a family tree, which includes records of people, their relationships, ancestry line, events, and places.", "Windows, ", "['Gramps']"], "grd": ["Surfer Grid File", "File saved in Golden Software's grid format, which is used to generate maps; contains two-dimensional uniform lattices (regularly spaced, rectangular array) of XYZ data (e.g. easting, northing, and elevation); may be in a binary or text format, but is most often saved in the binary format.", "Windows, Windows, Mac, ", "['Golden Software Surfer', 'Golden Software Grapher', 'Golden Software Didger', 'Golden Software Voxler']['Adobe Photoshop CC 2017', 'Adobe Photoshop Elements 15']['Adobe Photoshop CC 2017', 'Adobe Photoshop Elements 15']"], "grb": ["GRIB Meteorological Data File", "Meteorological data file created in the GRIdded Binary format; may contain both historical and forecasted weather data; can specify temperature, humidity, precipitation, and hundreds of other factors; used for interchanging weather data between software systems.", "Windows, Linux, ", "['Smartcom SmartMet', 'Unidata Integrated Data Viewer', 'Climate Data Operators', 'GDAL']['GDAL']"], "grasp": ["GRASP Animation", "Animation created by GRASP (Graphical System for Presentation) software.", "Windows, Mac, Linux, ", "[][][]"], "graphmlz": ["Zip Compressed GraphML File", "GraphML file (.GRAPHML) compressed with .ZIP compression; contains a graph comprised of nodes and edges as well as their properties; used for reducing the file size of standard GraphML files for sharing and storage.", "Windows, Mac, Linux, ", "['yWorks yEd Graph Editor']['yWorks yEd Graph Editor']['yWorks yEd Graph Editor']"], "graphml": ["GraphML File", "Document defined in the GraphML format, an XML format used for describing mathematical graphs; specifies edges and vertices as well as their properties; used for visualization, performing proofs, and implementing algorithms.", "Windows, Mac, Linux, ", "['Gephi', 'yWorks yEd Graph Editor', 'Microsoft Excel 2016', 'Monkfish XMLBlueprint XML Editor']['Gephi', 'yWorks yEd Graph Editor']['Gephi', 'yWorks yEd Graph Editor']"], "graffle": ["OmniGraffle Drawing", "Drawing saved by OmniGraffle, a program used to create diagrams, charts, and other graphics; stores text, images, drawn objects, styles, and page layout information; can be used for saving and printing flow charts, sketches, network diagrams, and other drawings.", "Mac, ", "['The Omni Group OmniGraffle']"], "gradientlibrary": ["Painter Gradient Library", "Library of gradients created and used by Corel Painter, a program used to create digital artwork; includes Stainless Steel, Light Streak, Oxidation, and Jungle Neon gradients.", "Windows, Mac, ", "['Corel Painter 2017']['Corel Painter 2017']"], "gradients": ["Painter Gradation Library", "Library created by Corel Painter, an application used to create digital artwork; contains one or more gradient styles such as Light Streak, Oxidation, Stainless Steel, and Jungle Neon.", "Windows, Mac, ", "['Corel Painter 2017']['Corel Painter 2017']"], "grade": ["GradeStat Document", "Data file saved by GradeStat, a statistical program for exploratory data analysis; allows rapid investigation of large data sets; saved in a binary format that contains a data table along with optional plots, maps, and analysis results.", "Windows, ", "[]"], "gra": ["Microsoft Graph File", "Graph or chart created by Microsoft Graph, a program included with Microsoft  Office; may be generated within Microsoft Word, Excel, or PowerPoint; most often created from Excel spreadsheet data.", "Windows, Mac, ", "['Microsoft Excel 2016', 'Microsoft Word 2016', 'Microsoft PowerPoint 2016']['Microsoft Excel 2016', 'Microsoft Word 2016', 'Microsoft PowerPoint 2016']"], "gr2": ["Granny 3D File", "File created by version 2 of Granny 3D, a program used to create 3D gaming models and animations; contains 3D textures, images, and shapes; may be exported and used in a variety of other 3D content development tools.", "Windows, Mac, Linux, ", "['RAD Game Tools Granny 3D']['RAD Game Tools Granny 3D']['RAD Game Tools Granny 3D']"], "gqsx": ["Microsoft Office SmartArt Styles File", "Graphic styles file used by the SmartArt component of Microsoft Office 2007 and later; stores settings that stylize a SmartArt graphic layouts (.GLOX files); can be accessed from the SmartArt Styles gallery in Microsoft Office applications.", "Windows, ", "['Microsoft Office 2016', 'Microsoft Word 2016', 'Microsoft PowerPoint 2016', 'Microsoft Excel 2016']"], "gpx": ["GPS Exchange File", "A GPX file is a GPS data saved in the GPS Exchange format, an open standard that can be freely used by GPS programs. It contains longitude and latitude location data, which includes waypoints, routes, and tracks.  GPX files are saved in XML format that allows GPS data to be more easily imported and read by multiple programs and web services.", "Windows, Mac, Linux, Windows, Mac, Linux, ", "['Google Earth', 'TopoGrafix EasyGPS', 'Safe Software FME Desktop', 'Fugawi Global Navigator', 'Garmin MapSource', 'TatukGIS Viewer', 'GPS Utility', 'Merkaartor']['Google Earth', 'GPSRouteX', 'MacGPS Pro', 'Merkaartor', 'Apple Xcode']['Merkaartor', 'gedit', 'GottenGeography', 'JOSM']['Arobas Music Guitar Pro']['Arobas Music Guitar Pro']['Arobas Music Guitar Pro']"], "gpu": ["GP2X Utility Program", "Utility program written for the GP2X, a portable video game console and media player; developed by GamePark Holdings in South Korea; GPU files will only run on the GP2X device.", "Windows, ", "[]"], "gpscan": ["GrandPerspective Scan File", "Disk scan file created by GrandPerspective, an OS X utility that displays the disk usage of a file system; contains scan data in XML format, which includes the name of the scanned folder, its contents, when it was accessed, and how much space is being used.", "Mac, ", "['GrandPerspective']"], "gps": ["GenePix Settings File", "File created by GenePix Pro, a microarray image analysis program; contains settings for acquisition (the laser used, voltages, and scan area), analysis (location and identification of features on the image), and display (brightness, contrast, and color mappings) of an image.", "Windows, Windows, Windows, ", "[][]['GRETECH GOM Player', 'Corel WinZip 21', 'ESTsoft ALZip']"], "gpp": ["Guitar Practiced Perfectly 2 Data File", "File created by Guitar Practiced Perfectly (GPP) version 2, a program that helps guitar students practice and manage their practice schedules; saves a backup of the player's data and includes exercises and a record of past and future practice sessions.", "Windows, ", "['Guitar Practiced Perfectly']"], "gpr": ["GenePix Results File", "Data file created by GenePix Pro Software, an analysis program for biological experiments; saves results for an experiment conducted using a GenePix Array List (.GAL file); used for storing quantitative analyses from microarray data.", "Windows, Mac, Linux, Windows, ", "['Molecular Devices GenePix Pro Software', 'Avogadro', 'Microsoft Excel 2016', 'text editor']['Avogadro']['Avogadro']['Babylon Glossary Builder']"], "gpn": ["GlidePlan Map Document", "Map generated by GlidePlan pre-flight planning software; contains a pointer to a rasterized FAA Sectional aviation map (saved in a standard .JPEG format); also includes data used to overlay graphics on the map.", "Windows, Mac, ", "[][]"], "gprx": ["Geoxa Project File", "GIS document created by Geoxa spatial visualization software; saves the layout of a mapped region (or other spatial data) created in the software; supports imported layers from ESRI shapefiles (.SHP), MrSid (.SID) files, GeoTIFF (.TIF) files,  and other GIS formats.", "Windows, ", "['Creative GIS Solutions Geoxa Viewer', 'Creative GIS Solutions Geoxa Editor']"], "gpj": ["MULTI IDE Project File", "File created by MULTI IDE, an IDE used for developing and testing embedded applications; similar to a Makefile and maintains project dependencies and build options; can be managed in the MULTI Project Builder program included in the MULTI IDE software package.", "Windows, Windows, Windows, Mac, Linux, ", "['Green Hills MULTI IDE']['Golden Software Grapher']['jGRASP']['jGRASP']['jGRASP']"], "gpi": ["Garmin Point of Interest File", "File used by Garmin personal navigation devices; stores the name and location of a user-defined point of interest; can be used to generate navigational routes as a destination or inter-route point.", "Windows, Mac, Windows, Mac, Linux, ", "['Garmin POI Loader']['Garmin POI Loader']['Altium Designer', 'CadSoft EAGLE', 'Viewplot', 'Gerbv']['CadSoft EAGLE', 'Gerbv', 'gEDA']['CadSoft EAGLE', 'gEDA', 'Gerbv']"], "gpf": ["Gecko Patch File", "File used by Gecko OS, a program used to load Nintendo Wii games and apply cheat codes; contains data and logic that modify game content; often used by third-party homebrew developers for creating cheat codes; commonly created with hex editor programs.", "Windows, Windows, Windows, Windows, ", "['Gecko OS']['GRAVITY Ragnarok Online']['Geosoft Oasis montaj', 'Geosoft Oasis montaj Viewer']['European Commission GPF Editor']"], "gpe": ["GP2X Video Game", "Video game playable on the GP2X, an open-source portable video game console and media player; developed by GamePark Holdings in South Korea and designed primarily to run video game emulation software.", "Windows, ", "[]"], "gpd": ["Generic Printer Description File", "Text file describing a printer to the Windows operating system when printing with the Unidrv (Universal Printer Driver); uses the GPD language to describe a printer providing various types of information including: printer attributes, printer commands, printer features, printer options, printer font descriptions, and conditional statements.", "Windows, Windows, Mac, Windows, ", "['Microsoft Windows']['Apple QuickTime Player with the PhotoDefiner component']['Apple QuickTime Player with the PhotoDefiner component']['HxD', 'HEXplorer']"], "gpbank": ["Guitar Pro Sound Bank File", "File used by Guitar Pro, a tablature application for guitar, bass, and other fretted instruments; contains audio data used to play back instrument sounds; enables the software to simulate instrument sounds while playing a musical score.", "Windows, Mac, Linux, ", "['Arobas Music Guitar Pro']['Arobas Music Guitar Pro']['Arobas Music Guitar Pro']"], "gp5": ["Guitar Pro 5 Tablature File", "Guitar tab file created with Guitar Pro 5; can be used to save musical scores or compositions for the guitar, bass, or banjo; scores can be used to play back guitar sounds, but GP5 files do not contain actual audio data.", "Windows, Mac, Linux, ", "['Arobas Music Guitar Pro', 'TuxGuitar']['Arobas Music Guitar Pro', 'TuxGuitar']['TuxGuitar']"], "gp4": ["Guitar Pro 4 Tablature", "Guitar tabs format used by Guitar Pro 4, a multitrack guitar composition and accompaniment program; may contain guitar, bass, or banjo tabs; saves data in a music notation format that can be opened by Guitar Pro or other open-source guitar notation programs.", "Windows, Mac, Linux, Windows, ", "['Arobas Music Guitar Pro', 'TuxGuitar']['TuxGuitar']['TuxGuitar']['SFaxTools Studio FaxSee Pro']"], "gpg": ["GNU Privacy Guard Public Keyring", "A GPG file is a security key used to decrypt an encrypted file generated by GNU Privacy Guard (GnuPG), a file encryption program.  The secure format is based on the OpenPGP standard defined by RFC2440, the same standard Pretty Good Privacy (.PGP) files use.", "Windows, Mac, Linux, ", "[][][]"], "gom": ["GOM Media File", "File used by GOM Player, an audio and video playback program; may contain various kinds of audio or video data that is used for playback in the software.", "Windows, ", "['GRETECH GOM Player']"], "gorm": ["Gorm Interface Resource File", "Static representation of interface objects and their relationships in a GNUstep application; may be opened and loaded into memory only when needed", "Windows, Mac, Linux, ", "[][][]"], "gp3": ["Guitar Pro 3 File", "Musical score format used by Guitar Pro 3, a music composition program for guitar and other plucked string instruments; contains tablatures for guitar, bass, or banjo; used for creating scores that can be played back using MIDI data or printed to a hard copy.", "Windows, Mac, Linux, ", "['Arobas Music Guitar Pro', 'TuxGuitar']['TuxGuitar']['TuxGuitar']"], "goomod": ["World of Goo Add-on", "Add-on file used by GooTool, a program that installs addons for the puzzle game World of Goo; may be either a mod, which can replace any game file, or a level, which adds a new playable level and an in-game menu option for selecting the level.", "Windows, Mac, Linux, ", "['2D Boy GooTool', 'Corel WinZip 21', 'WinRAR 5']['2D Boy GooTool', 'Apple Archive Utility']['2D Boy GooTool']"], "god": ["Gore Game Data File", "Game data file used by Gore games, such as Special Edition and Ultimate Soldier; contains data in plain text that is referenced by the game to describe gameplay, such as explosions, ricochet effects, body armor, items, missions, and other level information.", "Windows, Linux, Windows, ", "['Gore Special Edition', 'Gore Ultimate Soldier']['Synbioz God']['Bullfrog Populous II: Trials of the Olympian Gods']"], "go": ["Go Source Code File", "Source code for a program written in Go, a programming language originally developed by Google;  contains code written in plain text format that must be compiled before being run as a program.", "Windows, Mac, Linux, ", "['LiteIDE', 'Sublime Text with plugin', 'Jetbrains IntelliJ IDEA', 'Oracle NetBeans with plugin']['LiteIDE', 'Sublime Text with plugin', 'Jetbrains IntelliJ IDEA', 'Oracle NetBeans with plugin', 'MacroMates TextMate with bundle']['LiteIDE', 'Sublime Text with plugin', 'Jetbrains IntelliJ IDEA', 'Oracle NetBeans with plugin']"], "gnutar": ["GNU Tar Archive", "File archive created in the GNU .TAR format; stores a collection of uncompressed files; often compressed into a .TGZ or .TAR.GZ file using .GZ gzip compression.", "Windows, Mac, ", "['Smith Micro StuffIt Deluxe for Windows', 'Corel WinZip 21', 'ESTsoft ALZip', '7-Zip']['Smith Micro StuffIt Deluxe 16', 'Apple Archive Utility', 'Incredible Bee Archiver']"], "gpk": ["WaveLab Audio Peak File", "Contains a summary of sound wave data for an audio file opened with WaveLab; enables faster reloading of audio files in the program; created automatically when an audio file is opened in WaveLab.", "Windows, ", "['Steinberg WaveLab']"], "gnp": ["GNPeak Output File", "Output file generated by gnpeak, an atomic analysis program for Unix systems; contains information about atomic structures.", "Linux, Windows, Mac, iOS, ", "[]['GenePool']['GenePool']['GenePool']"], "gnumakefile": ["GNU Makefile", "File used by the GNU Make utility, a tool designed to build libraries and programs by executing source code, or makefiles; contains a list of commands that direct the shell it's running; other makefile extensions include .MAKEFILE and .MK; its commands are shell-specific, not universal.", "Windows, Mac, Linux, ", "['GNU Make', 'Sublime Text 3']['GNU Make', 'Sublime Text 3']['GNU Make', 'Sublime Text 3']"], "gno": ["GenoPro Genealogy Tree File", "Project file created by GenoPro, a free program used to create genealogies; contains genealogy project data, including family trees, pedigrees, pictures, dates, and other genealogy information; used to record family history, analyze ancestries, and print family tree reports.", "Windows, ", "['GenoPro']"], "gmx": ["GameMaker File", "Compressed project file created by Yo Yo Games GameMaker: Studio, a game development application; contains a game project; includes sounds, scripts, sprites, backgrounds, rooms, objects, fonts, shaders, and constants used to build the game.", "Windows, ", "['Yo Yo Games GameMaker: Studio']"], "gnm": ["Gnumeric Spreadsheet", "Spreadsheet file created by Gnumeric, an open source spreadsheet application developed by the GNOME Project;  stores formatting information, charts, and other data used in the spreadsheet; similar to Excel spreadsheet files (.XLSX), both containing data stored in the XML format; compressed using GZIP compression.", "Windows, Linux, Android, ", "['Gnumeric']['Gnumeric']['Gnumeric']"], "gne": ["Flickr Web Page", "Dynamic Web page from the Flickr photo sharing website; similar to a .PHP or .ASP page, but written in a proprietary programming language; originally used by \"Game Never Ending,\" a computer game created by Ludicorp.", "Windows, Mac, ", "['Web browser']['Web browser']"], "gnumeric": ["Gnumeric Spreadsheet", "Spreadsheet created by Gnumeric, an open source spreadsheet program that is part of the GNOME Free Software Desktop Project;  stores the formatting information, charts, mathematical formulas, and data used in the spreadsheet.", "Windows, Linux, Android, ", "['Gnumeric']['Gnumeric']['Gnumeric']"], "gmz": ["Compressed GameMaker File", "Compressed project file created by Yo Yo Games GameMaker: Studio, a game development application; contains a project (.GMX file) that has been compressed for sharing; includes scripts, sprites, sounds, backgrounds, objects, fonts, shaders, constants, and rooms.", "Windows, ", "['Yo Yo Games GameMaker: Studio']"], "gmt": ["rFactor Model File", "Three-dimensional model used by rFactor, a car racing simulation game; saves the 3D model for a vehicle, vehicle upgrade component, or a track; used for loading graphics in the rFactor 3D game engine.", "Windows, ", "['Image Space rFactor', 'Zanoza ZModeler']"], "gmv": ["Gens Game Recording", "Game recording created with Gens, a Sega Genesis emulator; contains a recording of the gameplay of a Genesis game; saved in a proprietary format that can only be played back within the Gens emulator.", "Windows, Linux, ", "['Gens'][]"], "gmw": ["Global Mapper Workspace File", "Workspace file created and used by Global Mapper, a GIS application; contains information about any layers displayed on the map, along with settings and configuration applied to the layers.", "Windows, ", "['Blue Marble Geographics Global Mapper']"], "gmspr": ["Game Maker Sprite File", "Graphics file created by Game Maker, a program used for developing cross-platform video games, supporting iOS, Android, Windows, Mac OS X, and HTML5 platforms; saves a collection of sprites that are used for displaying graphics in the game.", "Windows, ", "['YoYo Games Game Maker']"], "gms": ["Gesture and Motion Signal File", "Low-level, binary, minimal but generic format used to organize and store Gesture and Motion Signals in a flexible and optimized way; gesture-related signals are used in computer graphics, computer music, animation, etc.", "Windows, Mac, Linux, ", "[][][]"], "gmres": ["Game Maker Resource File", "File used by Game Maker, a program that allows users to create computer games; contains project resources, such as game objects, scripts, and images; used to save and export resources from one game to another.", "Windows, ", "['YoYo Games Game Maker']"], "gmp": ["Global Mapper Package File", "Data package file created and used by Global Mapper, a GIS application that allows users to view and convert vector, raster, and elevation data; contains map data from imported layers and all of the configuration settings and edits that have been made to the layers.", "Windows, ", "['Blue Marble Geographics Global Mapper']"], "gmo": ["GNU Machine Object File", "Contains machine object data specific to a GNU program, such as gettext; may be generated or output by a Unix program and is used for translating program code; similar to a .MO file, but uses the GNU format.", "Windows, Mac, Linux, ", "[][][]"], "gmmp": ["WCS Gamut Map Model Profile", "File used by the Windows Color System (WSC), a technology used to render colors for different displays in the Windows operating system; contains a gamut model model, which is used for displaying colors a certain way on a monitor.", "Windows, ", "['Microsoft Windows']"], "gmmod": ["Game Maker 3D Model File", "3D model created by Model Creator for Game Maker, a program used for designing 3D models; uses the same formatting as a Game Maker .D3D file but has a different file extension; saved in a plain text format and specifies the three-dimensional structure of the model, including vertices and shapes; used for rendering 3D objects in Game Maker games.", "Windows, ", "['Model Creator for Game Maker', 'YoYo Games Game Maker']"], "gmf": ["Leadwerks Game Model File", "3D model file created in the Game Model Format (GMF), a format used by the Leadwerks game engine; contains both model and animation data; used for storing 3D game characters and their movements.", "Windows, Windows, ", "['Leadwerks Engine']['ESRI ArcGIS for Desktop']"], "gml": ["Geography Markup Language File", "Geography data format created by Galdos Systems and supported by the Open Geospatial Consortium; used by geographers for storing geographical data in a standard interchangeable format.", "Windows, Mac, Linux, Windows, Windows, Mac, Linux, Windows, Mac, Linux, ", "['ACD Systems Canvas X 2017', 'Safe Software FME Desktop', 'TatukGIS Viewer', 'Merkaartor']['Merkaartor']['Merkaartor']['YoYo Games Game Maker']['CadSoft EAGLE', 'Altium Designer', 'Viewplot', 'Gerbv']['CadSoft EAGLE', 'Gerbv', 'gEDA']['CadSoft EAGLE', 'gEDA', 'Gerbv']['yWorks yEd Graph Editor', 'Cytoscape', 'Gephi']['yWorks yEd Graph Editor', 'Cytoscape', 'Gephi']['yWorks yEd Graph Editor', 'Cytoscape', 'Gephi']"], "gmk": ["Game Maker Project File", "Game development project created with Game Maker 7 or later; contains source code, project settings, and references to resources used by the project; resources may include sprites, sounds, backgrounds, paths, and other objects.", "Windows, Mac, ", "['Yo Yo Games GameMaker: Studio']['Yo Yo Games GameMaker: Studio']"], "gme": ["DexDrive Game Card File", "Game file created by DexDrive, a PlayStation card reader used for transferring PlayStation saved game data to the PC; contains the saved game information that was on the original memory card; can be opened with DexPlorer, the software that is bundled with DexDrive purchases.", "Windows, ", "['PSXMemTool']"], "gmd": ["Game Maker Program Code", "Game development file created with Game Maker; allows games to be created using drag-and-drop actions, without writing any programming code.", "Windows, Windows, ", "['YoYo Games Game Maker']['Infacta GroupMail']"], "gmc": ["Game Music Creator Sound File", "Audio file created by Game Music Creator, a program used to create game music on older Amiga personal computers; stores 8-bit audio in the GMC module format.", "Windows, Mac, Linux, ", "['MilkyTracker']['MilkyTracker']['MilkyTracker']"], "gmbl": ["Logger Lite Document", "Data file created by Logger Lite, a free program that allows students to collect and analyze data in science and math education programs; contains columns of data such as temperature readings recorded during a scientific experiment or exercise experiment.", "Windows, Mac, iOS, ", "['Vernier Logger Lite']['Vernier Logger Lite']['Vernier Graphical Analysis']"], "gma": ["Garry's Mod Addon File", "Addon file used by Garry's Mod, a sandbox game that revolves around building random objects; contains data that modifies gameplay, such as character appearance, game modes, weapon skin, environment layout, maps and more. ", "Windows, Mac, ", "[\"Facepunch Studios Garry's Mod\"][\"Facepunch Studios Garry's Mod\"]"], "gm81": ["Game Maker 8.1 Project File", "Project file created by Game Maker, a video game development application that enables games to be created using drag-and-drop actions; may include source code as well as references to game resources, such as graphics, sound effects, and music.", "Windows, ", "['Yo Yo Games GameMaker: Studio']"], "gmbck": ["Game Maker Background Image File", "Graphic file used by games created with Game Maker, a game development IDE published by YoYo Games; contains a collection of images that can be tiled in the background of a game scene; also stores the background's name and target image size.", "Windows, ", "['YoYo Games Game Maker']"], "gmap": ["Garmin Map File", "Map bundle used by some Garmin navigation devices; saves a map of specific regions in the world (e.g., City Navigator North America); can be used with PC and Mac software such as Garmin BaseCamp and MapInstall, as well as with Garmin devices.", "Windows, Mac, Windows, Mac, Linux, Web, iOS, Android, ", "['Garmin BaseCamp']['Garmin BaseCamp']['Google Drive']['Google Drive']['Google Drive']['Google Drive']['Google Drive']['Google Drive']"], "gm6": ["Game Maker 6 Project File", "Computer game created with Game Maker 6, a video game development program; allows games to be created using drag-and-drop actions; may include animated graphics, 3D images, music, and sound effects.", "Windows, ", "['Yo Yo Games GameMaker: Studio']"], "gm": ["GameMonkey Script", "Script written for GameMonkey Script, a scripting language used for embedding logic into games and other applications; uses syntax similar to the C language and uses concepts similar to the Lua language; can be used for custom software modifications.", "Windows, Windows, ", "['GameMonkey Script', 'Microsoft Notepad', 'text editor']['Microprose Transport Tycoon', 'Microprose Transport Tycoon Deluxe']"], "gly": ["Word Glossary File", "Glossary file used by Microsoft Word, a word processing program; includes data that helps convert glossary terms between versions of Word.", "Windows, Mac, ", "['Microsoft Word 2016']['Microsoft Word 2016']"], "gls": ["Babylon Glossary File", "Glossary text file created by Babylon Glossary Builder, a program used to create Babylon glossaries; contains terms and their definitions in a proprietary text format; may also store alternates for each term; used to build .BGL binary glossary files.", "Windows, Windows, Linux, Windows, ", "['Babylon Glossary Builder'][][]['SourceTec Sothink SWF Easy', 'SourceTec Sothink SWF Quicker']"], "glox": ["Microsoft Office SmartArt Graphics Layout File", "Graphics file used by Microsoft Office productivity applications; contains the layout and styles for a graphic and includes placeholders for inserting text; used for conveying information and ideas in presentations, charts, and documents.", "Windows, ", "['Microsoft Office 2016', 'Microsoft Word 2016', 'Microsoft PowerPoint 2016', 'Microsoft Excel 2016']"], "glo": ["RoboHelp Glossary File", "File created by RoboHelp, a Windows help documentation authoring program; saves glossary terms that are used for the help documentation; saved as part of the RoboHelp project (.XPJ) and can be compiled into the final help documentation.", "Windows, ", "['Adobe RoboHelp']"], "global": ["Global Makefile", "Configuration file that defines the locations of source files used to compile a program; used by PHP, C/C++, and other languages; automates the compilation process and compiles only new or modified files; commonly named makefile.global.", "Windows, Mac, Linux, ", "['text editor']['text editor']['text editor']"], "glm": ["Ghoul 2 Model File", "Model file used by games such as Star Wars Jedi Knight: Jedi Academy; compiled from a .XSI file; contains model data for light sabers and players referenced by game files such as the .SAB file; used by with the .GLA file to animate characters.", "Windows, Mac, Linux, ", "['Blender', 'CADSoftTools ABViewer', 'Raven Software Star Wars Jedi Knight: Jedi Academy']['Blender', 'Raven Software Star Wars Jedi Knight: Jedi Academy']['Blender']"], "glksave": ["Zoom Game Save Package", "Game save package used by Zoom, a program that plays text adventure games; contains several files that store saved game progress, including a .DAT file titled \"save.dat.\"", "Mac, Linux, ", "['Zoom']['Zoom']"], "glink": ["Google Drive External File Shortcut", "File used by Google Drive cloud storage service; created by the Google Drive desktop client and contains a shortcut to a file that is linked to the Google Drive account but is stored in a non-Google Drive cloud location; acts as a shortcut and opens the referenced file in the user's Web browser when double clicked.", "Windows, Mac, Web, ", "['Google Drive']['Google Drive']['Google Drive']"], "glf": ["Space Engine Shader File", "File used by Space Engine, a realistic space simulation software; saves a shader which is used to render the surface appearance of a 3D object such as a planet, galaxy, or nebula; located in the /cache/shaders/glsl/ directory of the Space Engine installation.", "Windows, ", "['Space Engine']"], "gld": ["Ground Loop Design Work File", "Project file created by Ground Loop Design (GLD), an application used for designing ground source heat pump systems; includes design data such as an energy analysis, building heating and cooling capacities, costs, summary information, installation, and C02 (carbon dioxide) emissions.", "Windows, Windows, ", "[]['Microchip Technology MPLAB IDE']"], "glade": ["Glade Project File", "User interface design project created with Glade, a tool for developing GUIs for the GTK+ and the GNOME desktop environment; may contain windows, text, buttons, icons, and other user interface objects; each object within the interface has a set of properties, which may include actions.", "Windows, Mac, Linux, ", "['Glade']['Glade']['Glade']"], "glb": ["STK Globe File", "File used by STK, a program used for modeling and operating missions for space, defense systems, and electronic systems; stores a globe, which is a 3D model of simulated or real world terrain; used for sharing globes with other STK users; can be imported and exported using STK's Globe Manager component.", "Windows, Windows, ", "['Analytical Graphics STK']['Mountain King Studios DemonStar', 'Ghisler Total Commander']"], "gla": ["Sothink SWF Easy Project File", "Project file created by Sothink SWF Easy, a program used for developing Web banners for Flash, HTML5, .AVI, and .GIF formats; supports text, images, audio, video, and animation settings; also supports multiple animated \"scenes,\" which can be thought of as slides in a slideshow.", "Windows, Windows, Mac, Linux, ", "['SourceTec Sothink SWF Easy']['Blender', 'Raven Software Star Wars Jedi Knight: Jedi Academy']['Blender', 'Raven Software Star Wars Jedi Knight: Jedi Academy']['Blender']"], "gl": ["GRASP Animation", "Animation format created by GRASP (Graphical System for Presentation), which was used in the 1980s and 1990s, but is not commonly used anymore.", "Windows, ", "[]"], "gks": ["Graphics Kernel System File", "Vector graphics file format defined by the International Organization for Standards (ISO) in 1977; contains 2D or 3D graphical data used for charts or other plots; designed as a cross-platform graphics format.", "Windows, ", "[]"], "gkh": ["Ensoniq EPS Family Disk Image", "Disk image format used by Ensoniq synthesizers, including the EPS, VFX, SD, TS, and ASR models; stores voice and song data on disks used by the synthesizers", "Windows, ", "[]"], "gjd": ["The 7th Guest Media File", "File used by The 7th Guest, an older 3D interactive puzzle game developed by Trilobyte using the Groovie engine; may store various media clips for the game; accompanied by an .RL file that specifies the format of data in the GJD file.", "Windows, Mac, ", "['Trilobyte The 7th Guest', 'The 7th Guest Toolset', 'The 11th Hour Toolset']['Trilobyte The 7th Guest']"], "gitkeep": ["Git Keep File", "A GITKEEP file is an empty file that Git users create so that a Git repository preserves an otherwise empty project directory.  By convention, empty directories that contain no files are not committed to Git repositories.  However, a single GITKEEP file in a directory causes Git to preserve the directory in the repository.", "Windows, Mac, Linux, ", "['Git']['Git']['Git']"], "gitattributes": ["Git Attributes File", "Path-specific setting file used by Git, a version control system used for storing source code; contains attributes that dictate what settings Git applies to certain subdirectories or subsets of files; located in the root directory of the project; similar to the .GITIGNORE file.", "Windows, Mac, Linux, ", "['Git']['Git']['Git']"], "gitignore": ["Git Ignore File", "File used by Git, a version control system used for storing source code; contains a list of files that should not be committed to the Git source code repository; often used for omitting non-text (binary) files, OS files (e.g., .DS_STORE and Thumbs.db files), and temporary files from the repository.", "Windows, Mac, Linux, ", "['Git']['Git']['Git']"], "gih": ["GIMP Image Hose File", "Image pipe used by GIMP, an open source image editing application; contains one or more images stored across multiple sequential layers; also stores settings such as the brush spacing between each image in the pipe.", "Windows, Mac, Linux, ", "['GIMP']['GIMP']['GIMP']"], "gis": ["CFS Console Game Installer Settings File", "Settings file used by CFS Console, a program used to install games developed by Zaplots; saved in plain text and contains a reference to a .CFS file, which can be loaded and played in CFS console.", "Windows, ", "[]"], "gio": ["Adagio Score", "Musical score written in the Adagio score language; may contain MIDI data and other information.", "Linux, Linux, ", "[][]"], "ginspect_prj": ["GOM Inspect Project File", "Project file created by GOM Inspect, a program used for visualizing and dimensioning 3D models, often those captured by an ATOS optical scanning device; saves 3D objects as well as measurements and analysis reports.", "Windows, ", "['GOM Inspect']"], "gin": ["GEMS Engine Control Unit File", "Engine Control Unit (ECU) file used by GEMS calibration software, which allows users to analyze vehicle engines; contains settings that determine the options, parameters, maps, and tables for a specific ECU; used to communicate with an ECU.", "Windows, ", "[]"], "gim": ["PlayStation Portable Image File", "Image used by the PlayStation Portable (PSP), a portable gaming device created by Sony; contains an image, which supports 256 colors, a 32 color look-up table, and alpha channels; used to store previews and images of theme icons and other graphics.", "Windows, ", "[]"], "gid": ["Windows Help Global Index File", "Index created the first time you search Windows Help; used as a configuration file in Windows 95 and Windows 98; allows for faster, more efficient access to Help documentation by indexing the help topics.", "Windows, ", "['Microsoft Windows Help']"], "gifv": ["GIF Video File", "Video format developed by Imgur that improves upon the GIF format; contains video compressed in the H.264 format and stored inside an .MP4 file container.", "Web, Android, ", "['Imgur']['Imgur']"], "gig": ["Tascam GigaSampler File", "Sound sample format used by Tascam GigaSampler, a sampling program that produces realistic instrument voices and other sounds", "Windows, Linux, ", "['Tascam GigaStudio', 'LinuxSampler']['LinuxSampler']"], "gif": ["Graphical Interchange Format File", "A GIF file is an image file often used for web graphics.  It may contain up to 256 indexed colors with a color palette that may be a predefined set of colors or may be adapted to the colors in the image.  GIF files are saved in a lossless format, meaning the clarity of the image is not compromised with GIF compression.", "Windows, Mac, Linux, Web, iOS, Android, ", "['File Viewer Plus', 'Microsoft Windows Photos', 'Microsoft Windows Photo Viewer', 'Adobe Photoshop CC 2017', 'Adobe Photoshop Elements 15', 'Adobe Illustrator CC 2017', 'CorelDRAW Graphics Suite X8', 'Corel PaintShop Pro X9', 'ACD Systems Canvas X 2017', 'ACD Systems ACDSee 20', 'Laughingbird The Logo Creator', 'Nuance PaperPort 14', 'Nuance OmniPage Ultimate', 'Roxio Creator NXT Pro 5', 'picture viewer', 'Web browser']['Apple Preview', 'Apple Safari', 'Adobe Photoshop CC 2017', 'Adobe Photoshop Elements 15', 'Adobe Illustrator CC 2017', 'Laughingbird The Logo Creator', 'Roxio Toast 15', 'picture viewer', 'Web browser']['GIMP', 'picture viewer', 'Web browser']['Google Drive']['Google Drive']['Google Drive']"], "gi": ["Global Image", "Disk image format created by several possible disc creation software programs; used for duplicating CD/DVDs or copying disc information to a hard drive.", "Windows, ", "['Roxio Creator NXT Pro 5', 'Lightning UK! ImgBurn', 'Smart Projects IsoBuster', 'EZB Systems UltraISO', 'HP RecordNow']"], "ghs": ["Norton Ghost Image Segment", "Segment of a disk image created with Norton Ghost that is spanned over several files; typically saved with other GHS file segments and a .GHO file, which contains the initial segment of the disk image.", "Windows, ", "['Symantec Ghost Solution Suite']"], "gho": ["Norton Ghost Backup File", "Contains a \"snapshot\" of a hard drive or other media device; saves data as an exact copy of the disk; often used for creating full hard disk backups.", "Windows, ", "['Symantec Ghost Solution Suite']"], "ghb": ["Lego Ghost Path File", "A GHB file is a ghost path file created by Lego Racers, a racing video game.  It contains the path of a time trial race, which includes the starting position of the racer and the waypoints that the racer follows.  GHB files are referenced by the game when a player wants to race against a previous race time in time trial mode.", "Windows, ", "[]"], "ggr": ["GIMP Gradient File", "File used by GIMP, an cross platform, open source image editor; contains gradients that can be used to fill images or shapes with varying degrees of colors, as specified by each gradient; loaded automatically by GIMP on startup and not meant to be opened manually by the user.", "Windows, Mac, Linux, ", "['GIMP']['GIMP']['GIMP']"], "ggb": ["GeoGebra Document", "Data file saved with GeoGebra, a free multi-platform mathematics program designed for educational purposes; may contain geometry, algebra, or calculus data that can be viewed in a graphical format with GeoGebra.", "Windows, Mac, Linux, ", "['GeoGebra']['GeoGebra']['GeoGebra']"], "gg": ["Google Desktop Gadget File", "Gadget designed for Google Desktop, a desktop widget and application manager; often provides information such as news, finance, and sports stories, but also can include small games, search interfaces, and other types of simple programs.", "Windows, Mac, Windows, Mac, Linux, ", "['Google Desktop']['Google Desktop']['Fusion', 'MESS']['SMS Plus', 'MacMESS']['Osmose']"], "gfx": ["GFx Scaleform File", "Animation file used by video games, such as Batman: Arkham Asylum and Mass Effect; similar to the .SWF file format; contains vector and raster graphics; also may include ActionScript interactive actions.", "Windows, iOS, Android, ", "['Autodesk Scaleform']['Autodesk Scaleform Mobile SDK']['Autodesk Scaleform Mobile SDK']"], "gfw": ["GIF World File", "GIS file used by GIS application such as ArcGIS Desktop; saves georeferencing information for a corresponding .GIF raster image; allows the GIF image to be placed in a real-world coordinate system when displaying and printing the image.", "Windows, ", "['ESRI ArcGIS for Desktop', 'Microsoft Notepad', 'text editor']"], "gfs": ["Glarysoft Split File", "Split file created by Glary Utilities, a Windows utility that enables you to clean and organize your computer; contains a file that has been split up in order to create smaller files for transfer purposes; each file is a smaller part of a whole; can only be opened by joining it together with its other parts through the Glary Utilities program.", "Windows, ", "['Glarysoft Glary Utilities 5']"], "gfp": ["GreenForce-Player Protected Media File", "Audio or video file created by GreenForce-Player, a free multimedia player; stores the multimedia data using a proprietary DRM copyright protection technique; includes password protection and may contain metadata.", "Windows, ", "['GreenForce-Player']"], "gform": ["Google Drive Form", "Form document file used by Google Drive, a cloud storage service; links to a Google Form online, which contains a set of input fields that users can fill in; can be double-clicked to open the form in Google Docs (in the user's Web browser).", "Windows, Mac, Web, ", "['Google Drive']['Google Drive']['Google Drive']"], "gfi": ["GIFI File", "Financial information file saved in the General Index of Financial Information (GIFI) format; commonly used by corporations to assign codes to sections of financial statements; represents financial information, such as total assets, sales, accounts receivable, and income taxes, in balance sheets and income statements.", "Windows, Mac, ", "['Intuit QuickBooks Pro 2016', 'Intuit TurboTax Deluxe']['Intuit QuickBooks for Mac 2016', 'Intuit TurboTax Deluxe']"], "gfe": ["Glarysoft Encrypted File", "Encrypted file created by Glary Utilities, a Windows utility that helps clean and organize your computer; contains an encrypted file that can only be opened by providing the correct password.", "Windows, ", "['Glarysoft Glary Utilities 5']"], "gfb": ["GIFBlast Compressed Image File", "Standard .GIF image compressed further by GIFBlast, an lossless image compression utility; reduces the file size of an already compressed GIF image by applying an additional compression algorithm.", "Windows, ", "[]"], "gfie": ["Greenfish Icon Editor Pro Graphic", "Icon graphic created by Greenfish Icon Editor (GFIE) Pro, a program used for editing Windows icons, cursors, and icon library files; saves one or more \"pages,\" which store graphics for a particular icon image size (e.g., 48x48 or 32x32); also saves layers within each page as well as the current editing state.", "Windows, ", "['Greenfish Icon Editor Pro']"], "gfar": ["Greenfoot Archive", "Archive associated with Greenfoot, a Java development environment; proprietary format of a .JAR archive; similar to a .GREENFOOT file but contains game and simulation scenarios that can be downloaded from the Greenfoot site.", "Windows, Mac, Linux, ", "['Greenfoot']['Greenfoot']['Greenfoot']"], "gf": ["METAFONT Bitmap File", "Font file generated by TeX typesetting applications; saves the bitmap representation of a font that was originally in the equation-based METAFONT .MF format; used for generating glyphs (characters) into TeX documents as well as printing fonts for document proofs.", "Windows, Mac, ", "['BaKoMa TeX', 'MikTeX', 'TeXworks']['TeXworks']"], "gexf": ["Graph Exchange XML Format File", "Graph file written in the GEXF (Graph Exchange XML Format) language, a language used for describing network structures; specifies the nodes and edges of the graph as well as user-defined attributes such as node weights or edge directions; can be used as an interchange format between graphing applications.", "Windows, Mac, Linux, ", "['Gephi', 'gexf4j']['Gephi', 'gexf4j']['Gephi', 'gexf4j']"], "geo": ["VRML Geography File", "Virtual world created in the Virtual Reality Markup Language (VRML) format; contains a three-dimensional scene, which users can walk through using a computer interface; often used for simulating building and landscape designs.", "Windows, Mac, Windows, ", "['IMSI TurboCAD Pro 2017']['IMSI TurboCAD Deluxe v10']['TRUMPF TruTops Boost']"], "gedcom": ["GEDCOM Genealogy File", "Genealogy file formatted using the GEDCOM (GEnealogical Data COMmunication) standard; contains genealogy data, such as a family tree and information about individuals within the family tree; saved in a text format.", "Windows, Mac, Linux, ", "['Ancestral Author', 'LifeLines', 'Ages!']['GeneWeb', 'GEDitCOM']['LifeLines', 'Gramps']"], "genbank": ["GenBank Data File", "Sequence file format used to store DNA and protein sequences; stores information for one or more sequences; also contains metadata such as annotations, comments, and references.", "Windows, Mac, Web, ", "['Heracle BioSoft DNA Baser', 'Genome Compiler']['Genome Compiler']['Genome Compiler']"], "gen": ["Sega Genesis ROM", "Game ROM used by Sega Genesis/Megadrive emulators; saves a copy of the contents of an original game cartridge and allows the game to be played on a PC with supporting emulation software, such as Kega Fusion or Genesis Plus.", "Windows, Mac, Windows, ", "['Kega Fusion', 'Gens+', 'HazeMD', 'Ages']['Genesis Plus', 'Kega Fusion']['ESRI ArcGIS for Desktop', 'Safe Software FME Desktop']"], "gemspec": ["Gem Specification File", "Developer file that specifies the attributes of a RubyGems .GEM package; saves information such as the author, a description, an example usage, and the usage license; saved in a simple plain text format.", "Mac, Linux, ", "['RubyGems', 'text editor']['RubyGems', 'text editor']"], "gem": ["RubyGems Package", "Package that may contain Ruby programs and libraries; saved in a self-contained format called a \"gem;\" can be installed using the RubyGems package manager application included with the Ruby software.", "Windows, Mac, Linux, Windows, Mac, Windows, ", "['RubyGems']['RubyGems']['RubyGems']['CorelDRAW Graphics Suite X8', 'ACD Systems Canvas X 2017'][]['CorelDRAW Graphics Suite X8', 'Corel PaintShop Pro X9']"], "gedata": ["Qlucore Data File", "Data file used by Qlucore Omics Explorer, a bioinformatics data analysis and visualization program; contains a complete data frame, including sample and variable annotations; saved in a tab-delimited text format.", "Windows, ", "['Qlucore Omics Explorer']"], "ged": ["GEDCOM Genealogy Data File", "Stores family history and genealogical event data in the standard GEDCOM genealogy format; saves data in an ASCII text format that can be opened by different genealogy programs on multiple computer systems.", "Windows, Mac, Linux, Windows, Linux, ", "['Ages!', 'RootsMagic', 'Ancestral Author', 'Thoughtful Creations Genbox Family History', 'Taurus FamilyTree', 'LifeLines', 'GeneWeb', 'Gramps', 'Behold']['GEDitCOM', 'Leister Productions Reunion', 'Taurus FamilyTree', 'GeneWeb', 'Gramps']['LifeLines', 'GeneWeb', 'Gramps'][][]"], "gdw": ["Jaws Unleashed Data File", "Game data file used by Jaws Unleashed, an action game that takes after the the movie Jaws; saved in the \\data\\ folder of the game installation and contains level information; uses names such as AQUARIUM.GDW, BEACH.GDW, and DEEPSEA.GDW.", "Windows, ", "[]"], "gdtb": ["gretl Binary Datafile", "Datafile used by gretl, an open source econometrics program; stores economic data, which includes observations, variables, and descriptions of the included information, in binary format.", "Windows, Mac, ", "['gretl']['gretl']"], "gdt": ["gretl Datafile", "Datafile created and used by gretl, an open source econometrics program; contains economic information, such as descriptions, observations, and variables of the included data, in gretl's XML format that is used by the application for analysis.", "Windows, Mac, ", "['gretl']['gretl']"], "gds": ["Graphic Data System File", "Integrated Circuit (IC) design created by various CAD programs; contains information about the layout of a circuit, including the layers, geometric shapes, and text labels; used as a standard interchange format between IC design applications.", "Windows, Mac, ", "['Static Free Electric VLSI Design System', 'Juspertor LayoutEditor', 'WieWeb CleWin', 'Tanner L-Edit MEMS Design', 'Zeni Physical Design Tool']['Static Free Electric VLSI Design System']"], "gdrive": ["Gizmo Virtual Drive File", "File created by Gizmo Manager, a virtual drive creation program included with the Gizmo Central software package; stores a password protected disk image in a proprietary format; used for storing sensitive data.", "Windows, ", "['Arainia Solutions Gizmo Central']"], "gdraw": ["Google Drive Drawing", "Graphics file used by Google Drive, a cloud-based file storage service; stores a URL reference to a Google Docs drawing, which may include vector and raster graphics; can be double-clicked to open the drawing in Google Docs (in the user's Web browser).", "Windows, Mac, Web, ", "['Google Drive']['Google Drive']['Google Drive']"], "gdr": ["Symbian OS Font File", "Font file used by Symbian OS devices, such as Nokia Series 60 smartphones; saves font characters in a bitmap format; can be transferred from a PC to the phone via Bluetooth or USB.", "Windows, Linux, ", "[][]"], "gdoc": ["Google Drive Document", "A GDOC file is a document created by Google Docs, an online document editor included with Google Drive.  It contains a URL reference to a Google Docs document stored in Google Drive.  GDOC documents store text, images, equations, drawings, charts, and tables.  ", "Windows, Mac, Web, ", "['Google Drive']['Google Drive']['Google Drive']"], "gdiagramstyle": ["OmniGraffle Diagram Style File", "Settings file used by OmniGraffle, a diagramming application used for capturing ideas and business concepts; acts as a theme file for a new diagram and contains the default colors and styles for the diagram.", "Mac, ", "['The Omni Group OmniGraffle']"], "gdi": ["Dreamcast Gigabyte Disc Image", "File created for Sega Dreamcast emulators; contains a raw copy of the original game data used by emulators; may hold .BIN and .RAW files.", "Windows, ", "['nulldc']"], "gdg": ["GDevelop Project File", "A GDG file is a project file used by GDevelop, an open source program used to create games without programming knowledge.  It contains information about a game such as events, objects, and scenes.  The file allows you to save and resume your progress when developing a game.", "Windows, Mac, Linux, ", "['GDevelop']['GDevelop']['GDevelop']"], "geojson": ["GeoJSON File", "JSON file created in the GeoJSON format, a format used for geospatial data interchange; supports points, lines, polygons, and other similar primitives; used for defining objects such as roads, bodies of water, buildings, and points of interest.", "Windows, Mac, ", "['GDAL', 'Safe Software FME Desktop', 'text editor']['Apple Xcode', 'text editor']"], "gdfmakerproject": ["GDF Editor Project File", "Project file created by Game Definition File Editor (GDF Editor), a game localization program included with the Microsoft DirectX SDK; saves text and graphics for different languages; enables developers to provide game translations.", "Windows, ", "['Microsoft DirectX SDK']"], "gdf": ["GUESS Graph Data Format File", "File used by GUESS (Graph Exploration System), a visualization tool used for displaying networks and mathematical graphs; stores node and edge data that comprises the graph and subgraphs; used for exploratory visualization in research and academic environments.", "Windows, Mac, Linux, ", "['GUESS']['GUESS']['GUESS']"], "gdb": ["GPS Database File", "Database file created by MapSource, a GPS route editing and trip-planning application; contains waypoints, routes, and tracks that can be transferred to a Garmin navigation device; similar to the universally transferrable .GPX file.", "Windows, Mac, Windows, ", "['Garmin BaseCamp', 'Garmin MapSource']['Garmin BaseCamp']['Embarcadero InterBase']"], "gcw": ["Microsoft Mathematics Worksheet", "Worksheet that contains mathematical expressions created with Microsoft Mathematics, a educational calculator program; may include equations, graphs, and handwritten calculus expressions created using the Ink tool.", "Windows, ", "['Microsoft Mathematics']"], "gcz": ["Compressed GameCube/Wii ROM", "Nintendo GameCube or Nintendo Wii game file saved as a compressed disk image; contains a copy of the data from a game disc, but compresses it to save disk space; similar to a .GCM file, except that is it compressed; can be created and opened with the Dolphin emulator.", "Windows, Mac, Linux, ", "['Dolphin']['Dolphin']['Dolphin']"], "gcx": ["Grapher Graph File", "2D or 3D graph created with Grapher, a graphing program included with Mac OS X; can create graphs from standard, logarithmic, and polar equations; includes zooming and animation capabilities.", "Mac, ", "[]"], "gcs": ["GameCube SharkSave File", "GameCube saved game also called a \"SharkSave\" file; created with the GameShark for the Nintendo GameCube, a cheat program for GameCube games; allows games to be saved whenever the user chooses to save the gameplay; may be opened with a supporting GameCube emulator.", "Windows, Mac, Linux, Windows, Mac, ", "['Dolphin']['Dolphin']['Dolphin']['GoPro Cineform Studio']['GoPro Cineform Studio']"], "gcm": ["GameCube ROM", "Nintendo GameCube game saved as a disk image; contains the exact contents of a GameCube disc; can be burned to a mini-DVD for the GameCube console or played on a PC using a GameCube emulator.\r\n", "Windows, Mac, Linux, ", "['Dolphin', 'Dolwin']['Dolphin']['Dolphin']"], "gci": ["GameCube Save File", "Save file created when playing a Nintendo GameCube game; stores the player's current progress so the game can be resumed at a later time; may be loaded on a PC using a GameCube emulator.", "Windows, ", "['Dolphin']"], "gch": ["Precompiled Header File", "File created for program development applications such as GNU project C and C++ compiler (GCC) and Microsoft Visual C++; contains a precompiled header .H file in order to reduce the process time for compilers; similar to precompiled header .PCH files; contains C/C++ programming language referenced by other source code files, such as .CPP files.", "Windows, Mac, Linux, ", "['Microsoft Visual Studio 2017']['GNU Compiler Collection (GCC)']['GNU Compiler Collection (GCC)']"], "gcg": ["GCG DNA Sequence File", "Data file created in the GCG format, a DNA sequencing format used in medical research; stores a single sequence using a plain text format; also contains identifying information and often a short description.", "Windows, Mac, ", "['MEGA']['MEGA']"], "gcf": ["Game Cache File", "Cache file used by Valve's Steam game distribution software; contains a virtual file system that may include file fragments, metadata, checksums and other game information; used for storing downloaded games and game updates from the Valve distribution service.", "Windows, Mac, ", "['Valve Steam', 'GCFScape', 'GCFExplorer']['Valve Steam', 'GridMount']"], "gcproj": ["Genome Compiler Project", "Project created by Genome Compiler, an application used to explore and test DNA sequences, amino acids, and other biological components; contains project data such as protein combinations, number of parts, and nucleotide count.", "Windows, Mac, Web, ", "['Genome Compiler']['Genome Compiler']['Genome Compiler']"], "gct": ["Ocarina Cheat Code Manager File", "File created by Ocarina Cheat Code Manager, a homebrew application used to create cheat codes for the Ninendo Wii game console; saves an exported cheat file, which subsequently can be uploaded to a Wii SD card and run by the Ocarina homebrew program.", "Windows, ", "['Ocarina Cheat Code Manager']"], "gcdp": ["Greeting Card Studio Design Project", "Project file created by Greeting Card Studio, an application used for creating various types of cards; stores the design for the front, inside, and back of a card; may include graphics, text, clip art, and shapes; can be printed using a standard printer.", "Windows, ", "['Software Depot Online Greeting Card Studio']"], "gbs": ["Generic Build Support Metadata File", "File created by Generic Build Support (GBS), a build automation system that helps users develop software projects; contains data referenced by the GBS application that specifies different functions within the application, such as where files are exported or the general settings for system generation.", "Windows, Linux, Windows, Mac, Linux, Windows, Mac, Linux, ", "['Randy Marques Consultancy Generic Build Support']['Randy Marques Consultancy Generic Build Support']['Altium Designer', 'CadSoft EAGLE', 'Viewplot', 'Gerbv']['CadSoft EAGLE', 'Gerbv', 'gEDA']['CadSoft EAGLE', 'gEDA', 'Gerbv']['Nullsoft Winamp with NEZPlug++ plug-in', 'Nullsoft Winamp with Meridian plug-in', 'Nullsoft Winamp with Chiptune plug-in']['Audio Overload', 'Cog']['gbsplay', 'Audacious']"], "gca": ["GCA File Archive", "File or files compressed with GCA, the predecessor to the DGCA compression utility (which creates .DGC files; has a better compression ratio than .ZIP files, but is not a widely-used compression format.", "Windows, ", "['DGCA']"], "gc": ["GraphClick File", "Graph saved with GraphClick, a graph digitizing program that retrieves original data from a scanned graph, image, or QuickTime movie; includes the graph image, data points, and any modifications made to the graph.", "Mac, Windows, ", "[][]"], "gcd": ["Generic CADD Drawing File", "Drawing created with Generic CADD, an older CAD program for Windows; used for creating floor plans, building layouts, and other architectural designs.", "Windows, Windows, Windows, ", "['General CADD Pro']['Smart Projects IsoBuster', 'EZB Systems UltraISO']['Bethesda Softworks Fallout 2']"], "gbr": ["Gerber File", "Industry-standard file format used for creating printed circuit board (PCB) designs; recognized by PCB manufacturing machines and contains instructions for drilling and milling the board; also includes information about the board's electrical connections.", "Windows, Mac, Linux, Windows, Mac, Linux, Windows, ", "['Altium Designer', 'GraphiCode GC-Prevue', 'PentaLogix ViewMate', 'PTC Creo View Express', 'Artwork Conversion GBR2DXF', 'Gerbv']['Gerbv', 'gEDA']['gEDA', 'Gerbv']['GIMP']['GIMP']['GIMP']['Gameboy Tile Designer']"], "gbx": ["Nadeo Game File", "A GBX file is a game file created by Nadeo virtual racing, sailing, and shooting games.  It contains compressed data for course challenges, replays, player profiles, and scores.  GBX files can also be used for storing new racing maps, road designs, graphics, replays, and racing movies.", "Windows, Windows, ", "['Nadeo TrackMania', 'Nadeo Virtual Skipper', 'Nadeo Shootmania Storm']['PentaLogix ViewMate', 'GraphiCode GC-Prevue']"], "gcsx": ["Microsoft Office SmartArt Color File", "File used by the SmartArt component of Microsoft Office; saves a custom color that can be added to the SmartArt Colors gallery; can be created by the user or may be one of the preinstalled Office colors; used for stylizing SmartArt graphic layouts, which are stored in .GLOX files.", "Windows, ", "['Microsoft Office 2016', 'Microsoft Word 2016', 'Microsoft PowerPoint 2016', 'Microsoft Excel 2016']"], "gbm": ["Gameboy Map File", "File created by Gameboy Map Builder (GBMB), an application that allows users to design maps used in Gameboy games; contains map information such as the width and height of the map in tiles and number of property colors; includes the path to the .GBR tileset file that is used to create the map.", "Windows, ", "['Gameboy Map Builder']"], "gbproj": ["GarageBand Project", "Audio project file created by GarageBand, a home audio production program; may contain MIDI data as well as recorded or imported audio tracks; used for saving music compilations during the production process.", "Mac, ", "['Apple GarageBand 10']"], "gbp": ["Genie Timeline Backup Index File", "Archive index file created by Genie Timeline, a backup and recovery program for desktop computer and mobile device files; contains the index of a collection of files that the user has chosen to backup; may reference a single archive or a multi-volume spanned archive; used for restoring the backed up files.", "Windows, Windows, Mac, Linux, ", "['Genie-Soft Genie Timeline']['CadSoft EAGLE', 'Altium Designer', 'Viewplot', 'Gerbv']['CadSoft EAGLE', 'Gerbv', 'gEDA']['CadSoft EAGLE', 'gEDA', 'Gerbv']"], "gbo": ["Gerber Bottom Overlay Data File", "Data output file created by Printed Circuit Board (PCB) CAD tools such as CadSoft EAGLE and used by PCB manufacturing machines to designate layouts of electrical connections; contains layout data for bottom silk screen layers; written in RS-274X, which is the most common and contemporary Gerber format. ", "Windows, Mac, Linux, ", "['Altium Designer', 'CadSoft EAGLE', 'Viewplot', 'Gerbv']['CadSoft EAGLE', 'Gerbv', 'gEDA']['CadSoft EAGLE', 'gEDA', 'Gerbv']"], "gblorb": ["Glulx Blorb Game File", "Game file used by Interactive Fiction (IF) interpreters, such as Spatterlight or Zoom; contains a Glulx story in Blorb format, which is a format used to bundle different game resource files into a single archive; different resource files include music, graphics, and level information.", "Windows, Mac, Linux, Android, ", "['Windows Frotz']['Zoom', 'Spatterlight']['Zoom']['Twisty']"], "gbl": ["Gerber Bottom Layer Data File", "Data output file created by Printed Circuit Board (PCB) CAD tools like Altium Designer and used by PCB manufacturing machines to designate electrical connections; contains data for multiple layer boards about the layout for bottom copper layers; similar to the .GTL file extension; written in RS-274X, which is the most common and contemporary Gerber format. ", "Windows, Mac, Linux, ", "['Altium Designer', 'CadSoft EAGLE', 'Viewplot', 'Gerbv']['CadSoft EAGLE', 'Gerbv', 'gEDA']['CadSoft EAGLE', 'gEDA', 'Gerbv']"], "gbk": ["GenBank Data File", "File created in the GenBank format, a file format used for storing genome information; saves DNA sequences in a plain text format; also contains metadata such as the sample source, a description, and author information.", "Windows, Mac, Web, ", "['Heracle BioSoft DNA Baser', 'Genome Compiler']['Genome Compiler']['Genome Compiler']"], "gbi": ["gBurner Project File", "Disk authoring project created with gBurner, a CD/DVD burning tool; stores a list of files and disc burning settings; can be used to create data and audio CDs, DVDs, bootable disks, and multisession CDs and DVDs.", "Windows, ", "[]"], "gbcskin": ["Game Boy Color Controller Skin File", "File referenced by GBA4iOS, a Game Boy Advance emulator for iOS devices; contains controller configuration information; customizes the skin, or appearance, of the Game Boy Advance controller used to play Game Boy Color games on your iOS device; similar to the .GBASKIN file, which is used for playing Game Boy Advance games in GBA4iOS.", "iOS, ", "['GBA4iOS 2']"], "gbas": ["GLBasic Source File", "Source code text file written in the GLBasic programming language; defines variables, functions, and application logic; commonly used with other source files in a GLBasic project (.GBAP file), which can be compiled into an executable program.", "Windows, ", "['Dream Design Entertainment GLBasic SDK']"], "gbaskin": ["Game Boy Advance Controller Skin File", "File used by GBA4iOS, a Game Boy Advance emulator for iOS devices; contains texture data that customizes the appearance, or skin, of the Game Boy Advance controller used to play games on your iOS device; similar to the .GBCSKIN file.", "iOS, ", "['GBA4iOS 2']"], "gbap": ["GLBasic Project File", "Project file created by GLBasic, a software development IDE used to create programs for multiple platforms; stores project information as well as references to project source code files (.GBAS files); used for developing project and then compiling them into executable programs.", "Windows, ", "['Dream Design Entertainment GLBasic SDK']"], "gba": ["Game Boy Advance ROM", "A GBA file is a ROM image of a Nintendo Game Boy Advance (GBA) video game.  It contains an exact copy of a GBA game, saved in a software format.  GBA files can be played on a Mac or PC using a Game Boy emulator.", "Windows, Mac, Linux, Android, ", "['NO$GBA', 'VisualBoyAdvance', 'DreamGBA', 'RascalBoy Advance', 'BoycottAdvance', 'KiGB']['VisualBoyAdvance', 'BoycottAdvance', 'KiGB']['KiGB']['GBAoid']"], "gbc": ["Game Boy Color ROM", "ROM image of a classic Nintendo Game Boy video game; may contain up to 32,768 colors, but only 56 can be displayed at one time; can be played on a Mac or PC using a Game Boy emulator.", "Windows, Mac, ", "['VisualBoyAdvance', 'BGB', 'KiGB', 'BasicBoy', 'PlayGuy', 'GEST', 'TGB Dual', 'gnuboy']['VisualBoyAdvance', 'KiGB']"], "gadgeprj": ["Gadge It Project", "Project file created by Gadge It, a program used for adding gadgets to the Windows desktop; can be a standalone gadget, a gadget for the Windows sidebar, or a gadget for the user's browser menu; can contain interactive buttons, scripted actions, graphics, and text.", "Windows, ", "['Ashampoo Gadge It']"], "gadget": ["Windows Gadget", "A GADGET file is a small program that runs within the Windows Vista or Windows 7 sidebar.  It stores several web-based files in a Zip archive format and may include .HTML, .CSS, .JS files, as well as other web files.  GADGET files are used for small programs such as news feeds, search tools, system utilities, and small games.", "Windows, ", "['Microsoft Windows']"], "ga3": ["Graphical Analysis 3 Document", "Document created and used by Graphical Analysis, an application used by middle and high school science students to produce, analyze, and print graphs; may contain graphs, data tables, histograms, text and calculated columns.", "Windows, Mac, iOS, ", "['Vernier Graphical Analysis']['Vernier Graphical Analysis']['Vernier Graphical Analysis']"], "g721": ["G.721 Audio File", "Audio format that contains raw G.721 4bit ADPCM (Adaptive Differential Pulse-Code Modulation) data; defined by the CCITT (International Telegraph and Telephone Consultative Committee)", "Windows, Mac, ", "[][]"], "g723": ["G.723 Audio File", "Audio format that contains raw G.723 5-bit ADPCM (Adaptive Differential Pulse-Code Modulation) data; defined by the CCITT (International Telegraph and Telephone Consultative Committee)", "Windows, Mac, ", "[][]"], "g726": ["G.726 Audio File", "Audio format that contains raw G.726 2, 3, 4, or 5-bit ADPCM (Adaptive Differential Pulse-Code Modulation) data; defined by the CCITT (International Telegraph and Telephone Consultative Committee).", "Windows, Mac, ", "[][]"], "g64": ["Genetec Video File", "Genetec video format used to share video recorded through Genetec's Security Center software; can be played by the Portable Archive Player, which is included with Security Center.", "Windows, ", "['Genetec Security Center']"], "g41": ["Commodore 1541 Disk Image", "Disk image file used by Commodore 64 emulation software; saves data in the same format as a floppy disk used by the Commodore 1541 floppy disk drive, which supported 5.25\" disks and was used with some older Commodore 64 systems; uses GCR (Group Code Recording) methods to save the data.", "Windows, Mac, ", "['CCS64', 'WinVICE']['VICE']"], "g3x": ["RealFlight Content File", "File used by RealFlight, a program used for flight simulation and training; contains a model of an airplane, helicopter, or other flight simulator object; used to create custom RealFlight content.", "Windows, ", "[]"], "g3d": ["GOM 3D File", "CAD file created by an ATOS optical 3D scanner, a device that uses optical methods to digitally construct the geometry of a real-world object; supports data such as meshes and point clouds; used for visualization and dimensional analysis.", "Windows, ", "['GOM Inspect', 'Geomagic Studio', 'Dassault Systemes CATIA']"], "g3a": ["Casio Prizm Add-in File", "Add-in file used by the Casio Prizm, a graphing calculator; often used for adding small games or handy utilities; written in C or low-level assembly language; can be packaged using the mkg3a program and then uploaded to the storage card on the Prizm.", "Windows, ", "['mkg3a']"], "g2m": ["GoToMeeting Recording File", "A G2M file is a temporary recording created by GoToMeeting, a professional video conferencing application.  It contains a recording of a video session.  G2M files must be converted to a .MP4 (Windows and Mac versions), .WMV (Windows version only) or .MOV (Mac version only) file in order to be viewed.  ", "Windows, Mac, ", "['Citrix GoToMeeting']['Citrix GoToMeeting']"], "g3": ["CCITT Group 3 Fax Image", "Fax image created in the CCITT Group 3 compressed format, which is used for digital transmission of fax data and supports 1 bit per pixel; can be viewed by programs such as GIMP and IrfanView.", "Windows, Mac, Linux, ", "['GIMP', 'IrfanView']['GIMP']['GIMP']"]}