{"h": ["C/C++/Objective-C Header File", "An H file is a header file referenced by a C, C++ or Objective-C source code document.  It may contain variables, constants, and functions that are used by other files within a programming project.  H files allow commonly used functions to be written only once and referenced by other source files when needed. ", "Windows, Mac, Linux, ", "['File Viewer Plus', 'Microsoft Visual Studio 2017', 'Code::Blocks', 'Eclipse CDT', 'Embarcadero C++Builder', 'Borland C++ Compiler', 'BloodshedSoftware Dev-C++', 'gVim', 'text editor']['Apple Xcode', 'Code::Blocks', 'Eclipse CDT', 'GNU Compiler Collection (GCC)', 'MacroMates TextMate', 'MacVim', 'text editor']['Eclipse CDT', 'Code::Blocks', 'GNU Compiler Collection (GCC)', 'GNU Emacs', 'text editor']"], "h5m": ["Age of Heroes Online Map", "An H5M file is a map used by Age of Heroes Online, an RPG multiplayer fantasy game.  It contains game map files compressed together as an archive with Zip compression.  H5M files are the same as .ZIP files but renamed for organizational purposes.", "Windows, ", "['Age of Heroes Online', 'Corel WinZip 21', 'WinRAR 5']"], "h5e": ["Line 6 POD HD500 Edit Preset File", "Preset file created by Line 6 POD HD500 Edit, an instrument effects editing program; contains settings for \"FX,\" \"AMPS,\" \"Mixer,\" and \"Controllers\" that customize the sound of your instrument; different settings include drive, bass, treble, channel volume, parameters, tone, tempo sync, and speed.", "Windows, Mac, ", "['Line 6 POD HD500X Edit']['Line 6 POD HD500X Edit']"], "ham": ["Descent 2 Resource File", "Contains properties of objects used in the Descent 2 3D action game", "Windows, Mac, Windows, Mac, Linux, ", "['Interplay Descent 2']['Interplay Descent 2']['HAM Runtime Environment 6']['HAM Runtime Environment 6']['HAM Runtime Environment 6']"], "hal": ["HansaWorld Application Language File", "File used by HansaWorld ERP system Enterprise, an Enterprise Resource Planning (ERP) application; contains program code written in the HansaWorld Application Language (HAL); used to create customized components, such as business reports and database forms.", "Windows, Mac, Linux, Windows, ", "['HansaWorld ERP system Enterprise']['HansaWorld ERP system Enterprise']['HansaWorld ERP system Enterprise']['HotDocs']"], "h5u": ["Age of Heroes Online Mod File", "An H5U file is a mod file used by Age of Heroes Online, a multiplayer fantasy game.  It contains game content modification files compressed together as an archive with Zip compression.  H5U files are the same as .ZIP files but renamed for organizational purposes.", "Windows, ", "['Age of Heroes Online', 'Corel WinZip 21', 'WinRAR 5']"], "h5s": ["Line 6 POD HD500 Edit Setlist File", "Set list created by Line 6 POD HD500 Edit, a program that enables you to edit instrument effects (DAW); contains up to 64 presets that, when loaded, replace the currently loaded Set list within the application; presets contained within the set list file change the settings for \"FX,\" \"AMPS,\" \"Mixer,\" and \"Controllers,\" which customize the sound of your instrument.", "Windows, Mac, ", "['Line 6 POD HD500X Edit']['Line 6 POD HD500X Edit']"], "h6x": ["Soft6502 Trainer/Simulator Hex File", "Data file used by Soft6502 Trainer/Simulator, a program that simulates the behavior of a single board 650 computer; contains 6502 code and data that can be saved and loaded at a later time.", "Windows, ", "['CRBond Soft6502 Trainer/Simulator']"], "h77t": ["MGD77T Header File", "Header file created and used by GEODAS ReFormat to MGD77T, a program used to format geophysical data into the Marine Geophysical Data Exchange (MGD77T) format; contains data that documents the content and structure of the data contained in the associated .M77T data file; includes the survey ID, format, ship name, country platform, project funding date, and navigation instrument.", "Windows, ", "[]"], "ha": ["HA Compressed Archive", "File or group of files compressed using HA compression, and older file compression algorithm; not commonly used, but supported by various third-party file decompression utilities.", "Windows, ", "['WinRAR 5', 'ESTsoft ALZip', 'IZArc']"], "h5": ["Hierarchical Data Format 5 File", "An H5 file is a data file saved in the Hierarchical Data Format (HDF).  It contains multidimensional arrays of scientific data.  H5 files are commonly used in aerospace, physics, engineering, finance, academic research, genomics, astronomy, electronics instruments, and medical fields.", "Windows, Mac, Linux, ", "['The HDF Group HDFView', 'GDAL', 'WaveMetrics IGOR Pro']['The HDF Group HDFView', 'Basic ENVISAT Atmospheric Toolbox', 'WaveMetrics IGOR Pro']['The HDF Group HDFView', 'Basic ENVISAT Atmospheric Toolbox', 'GDAL']"], "h4r": ["Heroes of Might and Magic IV Data File", "Game data file used by Heroes of Might and Magic 4 (HOMM4), a turn-based strategy game; contains data such as maps, game music, and software updates.", "Windows, ", "[]"], "h4b": ["Line 6 POD HD400 Edit Bundle", "Bundle created by Line 6 POD HD400 Edit, a program that enables you to edit instrument effects; contains up to 128 custom presets that customize the sound of your guitar; changes the settings under categories such as \"AMP,\" \"FX,\" and \"REVERB,\" when loaded.", "Windows, Mac, ", "['Line 6 POD HD400 Edit']['Line 6 POD HD400 Edit']"], "h4e": ["Line 6 POD HD400 Edit Preset File", "Preset file created by Line 6 POD HD400 Edit, an instrument effects editor; contains user-defined settings that customize the sound of your instrument; different settings include drive, bass, treble, speed, and channel volume; settings are categorized under \"FX,\" \"AMP,\" \"REVERB,\" and \"GATE.\"", "Windows, Mac, ", "['Line 6 POD HD400 Edit']['Line 6 POD HD400 Edit']"], "h4": ["Hierarchical Data Format File", "An H4 file is a data file saved in the Hierarchical Data Format (HDF).  It typically contains arrays of multidimensional data, tables, or raster images.  H4 files are commonly used to store scientific data and are used in environmental science, neutron scattering, non-destructive testing, and aerospace applications.", "Windows, Mac, Linux, ", "['The HDF Group HDFView', 'GDAL', 'WaveMetrics IGOR Pro']['The HDF Group HDFView', 'Basic ENVISAT Atmospheric Toolbox', 'WaveMetrics IGOR Pro']['The HDF Group HDFView', 'Basic ENVISAT Atmospheric Toolbox', 'GDAL']"], "hz": ["Chinese (Hanzi) Text", "Chinese characters encoded in ASCII text", "Windows, Mac, ", "[][]"], "hyv": ["Team Manager Meet Event File", "File used by older versions of HY-TEK Team Manager, which is a program used to schedule swimming and track meets; contains the meet name, events, course, and entry qualification times; used to store and distribute meet information to participants.", "Windows, ", "[]"], "hypetemplate": ["Hype Document Template", "Document template created by Hype, an application used to create animated and interactive website content with HTML5; saves the layout of a website project, which may include text, graphics, and other content; can be exported to web files for publishing on a webpage; useful for creating multiple web content documents that use the same layout and theme.", "Mac, ", "['Tumult Hype 3']"], "hyperesources": ["Hype Resources Folder", "Resource folder created and used by Hype, a program used to create interactive, animated website content; contains resources, such as .PNG images, .JS files, and a .PLIST file, that are used by a corresponding .HTML file. ", "Mac, ", "['Tumult Hype 3']"], "hypesymbol": ["Hype Symbol File", "Symbol file created by Hype, a program used to create interactive, animated website content with HTML5; stores a reusable component, which contains an element, timeline, action, behavior, or animation.", "Mac, ", "['Tumult Hype 3']"], "hype": ["Hype Document", "Website project created by Hype, a program used for creating interactive, animated website content with HTML5; contains graphics, text, animation timelines, and other content; used as the native project save format and can be exported to Web files for publishing on a webpage; commonly used for making advertisement banners.", "Mac, ", "['Tumult Hype 3']"], "hyp": ["HYPER Compressed Archive", "File or files compressed using HYPER compression algorithm.", "Windows, Windows, Mac, ", "[]['Adobe Illustrator CC 2017', 'Adobe InDesign CC 2017', 'ACD Systems Canvas X 2017']['Adobe Illustrator CC 2017', 'Adobe InDesign CC 2017']"], "hydra": ["Hydra Image Filter Program File", "Image filter program created using Hydra, an application used for creating filters for Photoshop, After Effects, and Flash Player; used as the older extension for Hydra, the predecessor to Pixel Bender, which now uses .PBK files for kernel programs.", "Windows, Mac, ", "['Adobe Pixel Bender Toolkit']['Adobe Pixel Bender Toolkit']"], "hxx": ["C++ Source Code Header File", "Source code header file written in the C++ programming language; may include data types, constants, variables, and other definitions; used for declaring and storing reusable components of code.", "Windows, Mac, Linux, ", "['Microsoft Visual Studio 2017', 'Eclipse CDT', 'Embarcadero C++Builder', 'Digia Qt SDK']['Eclipse CDT', 'Digia Qt SDK', 'MacroMates TextMate', 'GNU Compiler Collection (GCC)']['Eclipse CDT', 'Digia Qt SDK', 'GNU Compiler Collection (GCC)']"], "hxt": ["Microsoft Help 2 Table of Contents File", "File used by Microsoft Help 2.x help document projects; contains information about the help documentation's table of contents; enables the help information to be browsed in a structured manner; used for compiling a .HXS help file.", "Windows, ", "['Innovasys HelpStudio']"], "hxn": ["Hexagon Model File", "3D image created by Hexagon, a 3D modeling program that prepares models for rendering; stores the polyhedral 3D mesh as well as texture settings; used for building simple to complex characters, structures, and other objects.", "Windows, Mac, ", "['DAZ 3D Hexagon']['DAZ 3D Hexagon']"], "hxs": ["Help 2 Compiled Help File", "Help file compiled for Microsoft Help 2.0; contains help documentation for Windows or other programs; uses HTML for content and XML for metadata.", "Windows, Mac, Linux, ", "['Help Explorer Viewer', 'Web browser']['Web browser']['Help Explorer Viewer']"], "hxm": ["Descent 2 Resource Modification", "Replaces elements in the DESCENT2.HAM file; used for modifying objects, such as robots, that appear in the game; must be created for individual levels", "Windows, Mac, ", "['Interplay Descent 2']['Interplay Descent 2']"], "hxk": ["Microsoft Help 2 Index File", "File used by Microsoft Help 2.x projects; specifies information about how a help index is organized; often used for keyword, context-sensitive, and other help indexes defined in the .HXS help documentation bundle.", "Windows, ", "['Innovasys HelpStudio']"], "hxe": ["Microsoft Help 2 Sample Definition File", "File used by Microsoft Help 2 help documentation; contains information about sample files that can be included in the help documentation bundle, such as source code examples; enables the sample files to be compiled into the final .HXS help file.", "Windows, ", "['Innovasys HelpStudio']"], "hxa": ["Microsoft Help 2 Attribute Definition File", "File used by Microsoft Help 2.x help documents; contains a list of name-value pairs that allow the help documentation to be filtered based on user search criteria; saved in an XML format.", "Windows, ", "['Innovasys HelpStudio']"], "h5b": ["Line 6 POD HD500 Edit Bundle", "Bundle created by Line 6 POD HD500 Edit, a program that enables you to edit instrument effects; similar to the .H5E file but contains up to 8 setlists with presets; once loaded, will change the settings for \"FX,\" \"AMPS,\" \"Mixer,\" and \"Controllers,\" which customize the sound of your instrument.", "Windows, Mac, ", "['Line 6 POD HD500X Edit']['Line 6 POD HD500X Edit']"], "hwp": ["Hanword Document", "Document created by Hanword (formerly Hangul Word Processor), a Korean word processing application; contains document formatting, graphics, and text; used specifically for saving documents written in Hangul, which is the native alphabet of the Korean language.", "Windows, Mac, iOS, Windows, Mac, ", "['IMSI TurboPDF']['Planamesa NeoOffice']['Hancom ThinkfreeOffice Viewer']['text editor']['text editor']"], "hws": ["Hedgewars Saved Game", "Saved game created by Hedgewars, a free turn-based game similar to the Worms series games, but with hedgehogs instead of worms; saves the progress in a map, including the health of each hedgehog, inventory items, and shots fired.", "Windows, Mac, Linux, ", "['Hedgewars']['Hedgewars']['Hedgewars']"], "hwmap": ["Hedgewars Drawn Map File", "Map file created by Hedgewars, a free turn-based strategy game similar to the Worms series; stores a hand-drawn map that is created using the in-game editor; used for saving custom user generated maps.", "Windows, Mac, Linux, ", "['Hedgewars']['Hedgewars']['Hedgewars']"], "hvpl": ["iTunes Visual Plug-in File", "Plug-in created for iTunes, an audio and video player for Mac and Windows; contains a package that extends the functionality of the application; used for add-ons such as audio visualizers and music selection players that make intelligent decisions.", "Windows, Mac, ", "['Apple iTunes']['Apple iTunes']"], "hwd": ["Hedgewars Demo File", "Game replay file, or \"demo,\" created by Hedgewars, a turn-based game similar to the Worms series, but uses hedgehogs instead of worms; saves a replay of a map played by the user; allows users to review previously played games.", "Windows, Mac, Linux, ", "['Hedgewars']['Hedgewars']['Hedgewars']"], "hvc": ["HotDocs Variable Collection File", "File used by HotDocs, an application used to prepare digital document templates, such as legal and contractual forms; used for collecting user data when for conducting HotDocs Server interviews; used with a JavaScript (.JS) interview file.", "Windows, ", "['HotDocs']"], "hwdt": ["Thinkfree Office NEO Word Template", "An HWDT file is a template created by Word, a word processing application included with the Thinkfree Office NEO suite.  It contains layouts and settings for a document, which includes themes, fonts, shapes, images, and text.  HWDT files are used as a baseline to create multiple documents with the same formatting.", "Windows, Mac, Linux, ", "['Hancom Thinkfree Office NEO Word']['Hancom Thinkfree Office NEO Word']['Hancom Thinkfree Office NEO Word']"], "htz5": ["HyperMaker 5 Publication", "EBook publication created by HyperMaker, a program used for generating publications from .HTML files; stores both the publication text and included multimedia such as images, audio, video, and Flash animations.", "Windows, ", "[]"], "hum": ["OMSI Human Configuration File", "File created by OMSI The Bus Simulator, a bus driving simulation program; contains configuration data for humans that appear during gameplay, such as bus passenger and pedestrian movement; can be customized; similar to other OMSI configuration files like .SCO, .SLI, .BUS, and .OVH files.", "Windows, ", "['MR Software OMSI The Bus Simulator 2']"], "huh": ["HydroCAD Unit Hydrograph Definitions File", "Definitions file used by HydroCAD, a CAD water drainage solutions program; contains unit hydrograph definitions that predict water runoff from short bursts of rainfall; stored in ASCII text format; represents one of several files in an overall HydroCAD project.", "Windows, ", "['HydroCAD Software Solutions HydroCAD', 'HydroCAD Software Solutions HydroCAD Sampler']"], "htz4": ["HyperMaker 4 Publication", "Publication or eBook created from an .HTML document using HyperMaker, a professional website compiler; includes text and related media, such as images, videos, Flash animations, and PDFs.", "Windows, ", "[]"], "hus": ["Husqvarna Embroidery File", "CAM (computer aided manufacturing) file format used by by Viking Husqvarna sewing machines; contains instructions for creating embroideries with a sewing machine; includes codes such as \"stop,\" \"jump,\" and \"trim;\" supported by most major sewing programs.", "Windows, ", "['BALARAD Embird Studio', 'S & S Computing SewWhat!', \"Designer's Gallery StudioPlus\", 'Buzz Tools']"], "htx": ["HTML Extension File", "HTML document that uses the Microsoft Indexing Service; contains code that defines how results from a database should be displayed within a Web page; often created with Microsoft FrontPage Web development software.", "Windows, ", "['Microsoft FrontPage', 'text editor']"], "hxc": ["Microsoft Help 2 Collection Definition File", "File used by Microsoft Help 2.x help documents; defines the contents of a help collection and includes information such as the help project title, the help registration information, and pointers to the various help content files; used for building the .HXS help file.", "Windows, ", "['Innovasys HelpStudio']"], "htt": ["Hypertext Template File", "Hypertext file that is used for defining certain settings in Windows; the file \"Folder.htt\" contains HTML code that customizes the way folder contents are displayed and includes scripts that access and display information from the FileList control.", "Windows, ", "[]"], "htpasswd": ["Apache HTACCESS File", "File used to create and update the flat-files used to store usernames and password for basic authentication of HTTP users; encrypts passwords using either a version of MD5 modified for Apache HTTP server, or the system's own crypt routine.", "Windows, Mac, Linux, ", "[][][]"], "htmlz": ["Zipped HTML eBook", "File that contains an eBook saved in the HTMLZ format, which is a .ZIP file with the \".htmlz\" extension; contains multiple files, including .HTML files, images, and a metadata.opf (.OPF) file; used for packaging eBook content into a single archive.", "Windows, Mac, Linux, ", "['Calibre']['Calibre']['Calibre']"], "html0": ["Book Designer File", "eBook file saved by Book Designer, a program used to convert text documents into various eBook formats; contains HTML code used to format the layout of the pages and text.", "Windows, ", "['Book Designer']"], "html": ["Hypertext Markup Language File", "An HTML file is a webpage coded in HTML that can be displayed in a web browser.  It is used to format text, tables, images, and other content that is displayed on a webpage.  HTML files are widely used on the web as most pages within static websites have an \".html\" extension.", "Windows, Mac, Linux, iOS, Android, ", "['File Viewer Plus', 'web browser', 'Microsoft Edge', 'W3C Amaya', 'Adobe Dreamweaver CC 2017', 'Adobe ColdFusion Builder', 'Microsoft Visual Web Developer', 'Microsoft Visual Studio 2017', 'Blumentals WeBuilder', 'KompoZer', 'Notepad++', 'text editor']['web browser', 'Adobe Dreamweaver CC 2017', 'Adobe ColdFusion Builder', 'W3C Amaya', 'KompoZer', 'text editor']['web browser', 'text editor', 'W3C Amaya', 'KompoZer', 'SCREEM']['Fornace Espresso HTML', 'Alexander Blach Textastic Code Editor']['File Viewer for Android']"], "htm": ["Hypertext Markup Language File", "An HTM file is an HTML web page used by web browsers.  It contains markup code that is stored a plain text format and is used to display and format text and images in a web browser.", "Windows, Mac, Linux, Android, ", "['File Viewer Plus', 'Microsoft Internet Explorer', 'Web browser', 'Adobe Dreamweaver CC 2017', 'Adobe ColdFusion Builder', 'Microsoft Visual Web Developer', 'Microsoft Visual Studio 2017', 'Microsoft Notepad', 'text editor']['Apple Safari', 'Mozilla Firefox', 'Web browser', 'Adobe Dreamweaver CC 2017', 'Adobe ColdFusion Builder', 'text editor']['Web browser', 'text editor']['File Viewer for Android']"], "htg": ["HackTheGame Mission Pack", "File used by HackTheGame, a text-based simulation where players complete assignments as a computer hacker; contains hacking mission text, data, and instructions written in a plain text format.", "Windows, ", "[]"], "htc": ["HTML Component File", "File used by Internet Explorer, a common  Web browser that displays the content of Web pages; contains definitions for HTML Components that define dynamic behavior within Web pages; designed to contain functions that are reusable across multiple .HTML pages; stored in plain text format.", "Windows, Mac, ", "['Microsoft Internet Explorer']['MacroMates TextMate']"], "ht": ["HyperTerminal Session File", "Settings file used by HyperTerminal, a terminal emulation program; contains connection settings for connecting to a remote location; used for saving and reusing dial-up and TCP/IP connection information.", "Windows, ", "['Hilgraeve HyperTerminal']"], "htb": ["Audacity Help File", "Help file used by Audacity, a free sound editing program; stores a compressed archive of Windows help files, .HTML files, and images; used for displaying help information when selecting Help → Contents in Audacity.", "Windows, Mac, Linux, ", "['Audacity']['Audacity']['Audacity']"], "htaccess": ["Apache HTACCESS File", "Configuration file used by an Apache Web server that provides instructions for different directories of a website; \"htaccess\" is short for HTTP access, which is the protocol used for transmitting Web pages.", "Windows, Mac, Linux, ", "['Apache Web Server', 'Microsoft Notepad', 'text editor']['Apache Web Server', 'MacRabbit Espresso', 'MacroMates TextMate', 'text editor']['Apache Web Server', 'text editor']"], "hta": ["HTML Application", "Program that can be run from an HTML document; an executable file that contains hypertext code and may also contain VBScript or JScript code; can be created by simply changing the file extension of an .HTM file to an \".HTA\" extension; run by the Microsoft HTML Application Host (Mshta.exe).", "Windows, ", "['Microsoft Internet Explorer', 'Microsoft HTML Application Host']"], "hst": ["History File", "Contains a history of events related to a specific program; similar to a .LOG file, but may be used for a broader range of purposes.", "Windows, Mac, ", "[][]"], "hsk": ["Huskey Truss & Building Supply Import File", "Data format used for importing product data into point-of-sale (POS) programs; typically generated from data stored in an Excel spreadsheet (.XLS file); uses a unique syntax structure that identifies line items, and includes remarks and header information; each line item identifies the SKU code, quantity, description, price, and cost of the product.", "Windows, Mac, ", "['text editor']['text editor']"], "hsh": ["Windows Catalog Search Index File", "System file created by Indexing Service, a component of the Windows operating system used for creating a searchable file system index; commonly created in the C:\\System Volume Information\\catalog.wci\\ directory.", "Windows, ", "['Microsoft Windows']"], "hsf": ["HOOPS Stream Format File", "File created in the HOOPS Stream Format (HSF), a CAD publishing format developed by Tech Soft 3D for visualization; supported via plug-in or as a native publishing format by several CAD applications, including SolidWorks and CATIA v5.", "Windows, ", "['Dassault Systemes CATIA', 'Dassault Systemes SolidWorks']"], "hsdt": ["Thinkfree Office NEO Presentation Template", "An HSDT file is a show template created by Presentation, an application included with the Thinkfree Office NEO suite used to create presentations.  It contains a collection of slides, which includes text, shapes, images, themes, and formatting.  HSDT files are used to create multiple presentations with the same formatting.", "Windows, Mac, Linux, ", "['Hancom Thinkfree Office NEO Presentation']['Hancom Thinkfree Office NEO Presentation']['Hancom Thinkfree Office NEO Presentation']"], "hsc": ["Aspen HYSYS Simulation File", "File created by Aspen HYSYS, a program used by the oil and gas industry for process improvement; saves a simulation diagram, behaviors, parameters, and other associated data; used in the process of studying and refining plant efficiency, pipeline flows, greenhouse gas emissions, and other related petrochemical engineering issues.", "Windows, ", "['Aspen HYSYS']"], "hsb": ["HALion Sound Bank File", "Audio data file used by Steinberg HALion audio sampler and playback applications; contains a sound bank of audio samples for one or more instruments; used for distributing sound library packs and importing audio content for loops and other purposes.", "Windows, Mac, ", "['Steinberg HALion', 'Steinberg HALion Player', 'Steinberg Cubase with HALion One plug-in']['Steinberg HALion', 'Steinberg HALion Player', 'Steinberg Cubase with HALion One plug-in']"], "hs2": ["HyperRESEARCH 2 Study File", "Data file created with HyperRESEARCH 2, a cross-platform qualitative analysis program; contains coding information recorded from source data, including text, audio, and video files; may be analyzed within HyperRESEARCH and used to test hypotheses and generate reports.", "Windows, Mac, ", "[][]"], "hs": ["Haskell Script", "Source code of a program written in Haskell, a purely functional programming language, meaning the code is based on strictly on functions; also uses non-strict semantics, which allows the user to define functions and data structures; similar to a .LHS file.", "Windows, Mac, Linux, Windows, Mac, Linux, Windows, Windows, ", "['File Viewer Plus', 'The Haskell Platform', 'Leksah Project Leksah', 'EclipseFP', 'Helium', 'WinHugs', 'gVim']['The Haskell Platform', 'Leksah Project Leksah', 'MacroMates TextMate', 'EclipseFP', 'MacVim', 'Helium', 'Hugs']['The Haskell Platform', 'Leksah Project Leksah', 'EclipseFP', 'Hugs', 'GNU Emacs']['text editor']['text editor']['text editor'][]['JEK Software LaserTank']"], "htxt": ["Hanvon eBook File", "eBook format used by Hanvon WISEreader eReader devices; often stores Chinese text and is used for Chinese books; saved in a binary format and may incorporate DRM protection; cannot be read by Desktop software programs, but can be transferred to the device via USB connection.", "Windows, ", "[]"], "hrz": ["Compressed Poser Hair File", "Contains character hair information in a compressed format; used by Poser, a 3D figure modeling program; may include either strand-based or transparency-mapped hair, which can be applied to Poser 3D models.", "Windows, Mac, ", "['Smith Micro Poser 11']['Smith Micro Poser 11']"], "hrl": ["Erlang Header File", "Source code file written in Erlang, a programming language used for developing real-time systems for instant messaging, e-commerce, and computer telephony; used as a header file that is included in Erlang source files (.ERL extension); generally used for storing macros shared by different software components.", "Windows, Mac, ", "['Erlang', 'Microsoft Notepad', 'text editor']['MacroMates TextMate', 'text editor']"], "hrf": ["Hitachi Raster Format File", "Bitmap image stored in a proprietary format developed by Hitachi; may contain a color, grayscale, or monochrome raster graphic; used to store scanner output data.", "Windows, ", "[]"], "hr": ["TRS-80 Image", "Raster graphic used by the Tandy TRS-80 computer systems, which were released in 1977 and discontinued in 1981; can still be opened using the XnView image viewing application.", "Windows, Mac, Linux, ", "['XnViewMP']['XnViewMP']['XnViewMP']"], "hr2": ["Poser Hair File", "Contains character hair information, used by Poser, a 3D figure modeling program; may include either strand-based or transparency-mapped hair information; can be applied to various Poser 3D models.", "Windows, Mac, ", "['Smith Micro Poser 11']['Smith Micro Poser 11']"], "hqm": ["Hardcore Questing Mode Data File", "An HQM file is a data file used by Minecraft with the Hardcore Questing Mode mod.  It stores quest data, which includes the map of the quest, number of lives, and rewards achieved.  HQM files are generated when you install the Hardcore Questing Mode mod to Minecraft and begin a quest.", "Windows, Mac, Linux, ", "['Hardcore Questing Mode']['Hardcore Questing Mode']['Hardcore Questing Mode']"], "hqx": ["BinHex 4.0 Encoded File", "An HQX file is a binary to hexadecimal text file created for Mac computers.  It contains data that has been compressed and encoded from an 8-bit binary format into a 7-bit text format.  HQX files can be useful for transferring binary images, documents, and multimedia as text in email attachments.", "Windows, Mac, ", "['Smith Micro StuffIt Deluxe for Windows', 'Corel WinZip 21', 'ESTsoft ALZip']['Smith Micro StuffIt Deluxe 16', 'Incredible Bee Archiver', 'Apple Archive Utility']"], "hpt": ["HotDocs PDF Template", "Template created by HotDocs, a document preparation application; stores a template for a digital form that contains fillable fields; can be published to an .HPD document, which then can be filled with user answers.", "Windows, ", "['HotDocs']"], "hps": ["HPL Script", "Game script used by HPL, a Frictional Games game engine that is used for first-person horror games such as Amnesia: The Dark Descent and Penumbra: Black Plague; saved in a plain text format and contains functions that define events that occur in a game map, such as doors slamming, scream sounds, or other horror events.", "Windows, Mac, Linux, Windows, Windows, ", "['HPL Editor Suite', 'Frictional Games Amnesia: The Dark Descent', 'Frictional Games Amnesia: A Machine for Pigs', 'Frictional Games Penumbra: Black Plague', \"Apjjm's Amnesia Lang Editor Tool\", 'Microsoft Notepad', 'text editor']['HPL Editor Suite', 'Frictional Games Amnesia: The Dark Descent', 'Frictional Games Amnesia: A Machine for Pigs', 'Frictional Games Penumbra: Black Plague']['HPL Editor Suite', 'Frictional Games Amnesia: The Dark Descent', 'Frictional Games Amnesia: A Machine for Pigs', 'Frictional Games Penumbra: Black Plague'][]['Nullsoft Winamp with the vgmstream plugin']"], "hpr": ["Internal RoboHelp File", "Internal help file used by RoboHelp, an application used to create help and policy content across mobile devices; contains configuration information used internally when opening and saving RoboHelp projects.", "Windows, ", "['Adobe RoboHelp']"], "hpj": ["Help Project File", "Help project created with either WinHelp or RoboHelp help authoring software; used for creating program Help documentation; contains information that defines the behavior, look, and content of the Help system.", "Windows, Mac, ", "['Adobe RoboHelp']['Adobe RoboHelp']"], "hpp": ["C++ Header File", "Header file written in the C++ programming language; may contain data types, constants, and variables; can be inserted into a .CPP source code file using the #include directive; used for storing reusable components of code.", "Windows, Mac, Linux, Web, ", "['File Viewer Plus', 'Microsoft Visual Studio 2017', 'Code::Blocks', 'Embarcadero Technologies C++ Builder', 'BloodshedSoftware Dev-C++']['Apple Xcode', 'Code::Blocks', 'MacroMates TextMate', 'GNU Compiler Collection (GCC)']['Code::Blocks', 'GNU Compiler Collection (GCC)']['Haluha Pearls']"], "hpk": ["HPack Compressed Archive", "File or files compressed by HPack 0.79a0, a multi-platform archiver", "Windows, Mac, Windows, ", "[][]['PopTop Tropico', 'HPK Archiver']"], "hpg": ["HPGL Plot File", "Plotter file created in the Hewlett-Packard Graphics Language (HPGL); includes a line series of two-letter codes, such as \"SS,\" which declares the standard font for the plot; may include optional parameters with codes; used by various drawing programs to create printable plotter documents.", "Windows, ", "['Autodesk AutoCAD 2017', 'CADSoftTools ABViewer', 'Corel Presentations X8', 'ACD Systems Canvas X 2017', 'Trix DrawingCenter', 'IrfanView']"], "hpl": ["HP-GL Plotter File", "Vector image format that includes printer instructions written in the HP-GL (Hewlett-Packard Graphics Language); used by plotter printers, which draw images using lines instead of dots.", "Windows, Mac, Linux, ", "['IMSI TurboCAD Pro 2017', 'Corel PaintShop Pro X9', 'Software Companions ViewCompanion Pro', 'XnViewMP']['IMSI TurboCAD Deluxe v10', 'Lemkesoft CADintosh', 'Lemkesoft GraphicConverter', 'vhf interservice Cenon', 'XnViewMP']['vhf interservice Cenon']"], "hpi": ["Hemera Photo Objects Image File", "Proprietary image format used by Hemera Technologies for stock photos and royalty-free images; contains a header similar to a .PNG image and stores color information much like a .JPG image.", "Windows, Mac, ", "['HPI Converter', 'XnViewMP']['XnViewMP']"], "hpgl": ["HP Graphics Language Plotter File", "Printer instruction file based on the plotter language developed by Hewlett-Packard; used for sending information to plotter printers, which draw images using lines instead of dots like an ordinary laser or inkjet printer.", "Windows, Mac, Linux, ", "['ideaMK HPGL Viewer', 'CorelDRAW Graphics Suite X8', 'Corel PaintShop Pro X9', 'ACD Systems Canvas X 2017', 'CADSoftTools ABViewer', 'ArtSoft Mach', 'XnViewMP']['Lemkesoft CADintosh', 'Lemkesoft GraphicConverter', 'vhf interservice Cenon', 'XnViewMP']['vhf interservice Cenon', 'hp2xx']"], "hpf": ["High Performance Fortran File", "Program written in High Performance Fortran (HPF), a programming language that provides a set of extensions to Fortran 90; enables access to features included in modern high-performance architectures.", "Linux, Linux, ", "['text editor'][]"], "hpd": ["HotDocs PDF Document", "Document created by HotDocs, an application used for digital document preparation; saves filled fields (populated answers), labels, and page layout formatting for a digital form; often used for legal or insurance documents.", "Windows, ", "['HotDocs']"], "how2": ["Visma Performit Player Configuration File", "A HOW2 file is a configuration file used by Visma Performit Player, an application used to create step-by-step guides for using applications.  It contains an on-screen user guide that describes a process in a program.  HOW2 files store text, screenshots, and focus arrows.", "Windows, ", "['Visma Performit Player']"], "hot": ["The Sims Sound File", "Audio file format used playing sounds in The Sims, a human simulation game by developed by Maxis/Electronic Arts; the file \"vacsnd.hot\" is stored in the \"\\Program Files\\Maxis\\The Sims\\ExpansionShared\\Sound\\\" directory.", "Windows, Mac, ", "['Electronic Arts The Sims']['Electronic Arts The Sims']"], "honmod": ["HON Modification Manager File", "Game mod file created by HON Modification Manager, a program used to manage game alteration packages for Heroes of Newerth (HON); saved in a compressed .ZIP format and contains an optional 48x48 pixel .PNG icon image for the mod as well as a required XML file that describes how the mod is applied.", "Windows, ", "['HON Modification Manager']"], "hol": ["Outlook Holidays File", "Calendar file used by Microsoft Outlook, an email and calendar application; saves the dates of holiday events that are displayed on the Outlook calendar view when the application is open; can be customized manually with a text editor to share company-specific calendar events.", "Windows, ", "['Microsoft Outlook 2016']"], "hmxp": ["Help & Manual XML Project", "XML project file created by Help & Manual, a program used for creating help documentations; saves references to project files as well as project settings, but does not store the referenced project assets, such as images; differs from .HMXZ files, which store all assets in a single archive.", "Windows, ", "['EC Software Help & Manual']"], "hog": ["Descent Mission File", "Contains mission data for a specific level in the Descent 2 3D action game", "Windows, Mac, ", "['Interplay Descent', 'Interplay Descent 2']['Interplay Descent', 'Interplay Descent 2']"], "hmxz": ["Help & Manual Compressed Project", "Help documentation project created by Help & Manual technical documentation software; contains help content, including help page text, images, and formatting; stores all files, including the XML project file, as a compressed .ZIP archive.", "Windows, ", "['EC Software Help & Manual']"], "hmx": ["Help & Manual 4 Project", "Help documentation project created by Help & Manual version 4; saves help content and project settings; can be exported to a variety of formats, including HTML Help (.CHM), Winhelp (.HLP), .PDF, Visual Studio Help, Word documents, eBooks, or print manuals.", "Windows, ", "['EC Software Help & Manual']"], "hmt": ["HighMAT File", "File used by High Performance Media Access Technology (HighMAT), a technology developed jointly by Microsoft and Panasonic that is used to save and playback digital media on CDs; contains images, audio, and video saved in a proprietary format.", "Windows, ", "[]"], "hms": ["HostMonitor Script File", "Contains commands that can be run within HostMonitor, a server monitoring program; formatted as a text file with one command per line; commands are case insensitive, while parameters are case sensitive; comments begin with a semicolon.", "Windows, ", "['KS-Soft HostMonitor']"], "hmp": ["Worms Height Map File", "File used by Worms 3D and Worms Mayhem turn-based action games; saves the height map for a level (.XAN file) and describes the elevation of the terrain and buildings in the three-dimensional world.", "Windows, ", "['Team17 Worms Mayhem', 'Team17 Worms 3D']"], "hml": ["HostMonitor TestList File", "Contains a list of tasks to be run with HostMonitor, a server monitoring program; typically includes a list of servers with status information for each one.", "Windows, ", "['KS-Soft HostMonitor']"], "hmk": ["Hallmark Card Studio File", "Greeting card project created with Hallmark Card Studio; may be a birthday card, invitation, letter, or other kind of card; can include images (user photos or pictures bundled with the program) and custom-formatted text.", "Windows, ", "['Hallmark Card Studio']"], "hmi": ["HMI Audio File", "Audio file created in the Human Machine Interfaces (HMI) format, which is similar to MIDI; used by older video games such as Carmageddon, Hover, and The Terminator: SkyNET; now an obsolete format but can still be played by some MIDI audio players.", "Windows, ", "['Nullsoft Winamp', 'foobar2000 with MIDI Component plugin']"], "hme": ["Windows Mobile Theme File", "Theme file used by Windows Mobile devices; contains home screen graphics and other theme settings such as the color scheme; used to modify the look and feel of the mobile device's user interface.", "Windows, ", "['Microsoft ActiveSync']"], "hma": ["Sony HI-MD Audio File", "Audio file created by Sony Hi-MD (MiniDisc) players; contains audio data recorded using the proprietary Sony ATRAC3plus codec; can be copied to a PC using Sony SonicStage.", "Windows, ", "['Sony SonicStage']"], "hm3": ["Help & Manual 3 Project", "Windows help documentation project created by Help & Manual 3; saves help pages formatted using RTF text; can be exported to several different formats, including Winhelp (.HLP) and HTML Help (.CHM).", "Windows, ", "['EC Software Help & Manual']"], "hlx": ["ATI Radeon Video Driver Support File", "Supports the ATI Radeon video card and related video driver files", "Windows, Mac, ", "[][]"], "hlsl": ["High Level Shader Language File", "Source code file written in the High Level Shader Language (HLSL), a graphics shading language developed by Microsoft; may be used for a geometry shader, a vertex shader, or a pixel shader; used for programming how 3D objects appear in Direct3D games and programs.", "Windows, ", "['Microsoft Visual Studio 2017']"], "hlp": ["Windows Help File", "File used by Windows Help, a program provided with Windows that lets users read help information; contains documentation and indexes for Windows programs or the Windows operating system; compiled using Microsoft Help Workshop (HCW.exe).", "Windows, Mac, Linux, ", "['Adobe RoboHelp', 'Microsoft Windows Help Viewer', 'Help Explorer Viewer', 'YpgSoft Windows HLP To RTF']['Adobe RoboHelp']['Help Explorer Viewer']"], "hlb": ["VMS / VAX Help Library", "Library of help documentation for a VMS / VAX system", "Windows, ", "['HP OpenVMS', 'text editor']"], "hl": ["HeuristicLab Storage File", "Data file saved by HeuristicLab, a program designed for developing and testing optimization methods; contain workbenches or problem-definitions.", "Windows, ", "['HeuristicLab']"], "hkm": ["Havok Movie File", "Movie or animation created with Havok game development software; typically a 3D physics animation or similar type of video; can be viewed with Havok's Visual Debugger, a cross-platform performance diagnostic tool.", "Windows, ", "[]"], "hki": ["WinHKI Archive", "File archive compressed with the WinHKI file compression tool; can also compress files with different types of open-source compression algorithms; includes a \"best compression ratio,\" option which provides the most efficient compression for different file types.", "Windows, ", "[]"], "hki3": ["WinHKI HKI3 Archive", "File archive compressed with the WinHKI file archiving program; uses HKI3 compression, which is optimized for file types that are not compressed efficiently with the .HKI1 or .HKI2 compression formats.", "Windows, ", "[]"], "hki2": ["WinHKI HKI2 Archive", "File archive compressed with the WinHKI file archiving program; uses file compression optimized for program data such as Office documents, Internet files, and programs themselves.", "Windows, ", "[]"], "hki1": ["WinHKI HKI1 Archive", "File archive compressed with the WinHKI file archiving program; uses compression optimized for media files such as images, audio, and video files.", "Windows, ", "[]"], "hkdb": ["Apple iTunes Library File", "Music library generated by iTunes, a multimedia playback program; stores a database of music metadata, including song titles, genres, composers, lengths, and other music information; used by the software for organizing music collections.", "Windows, Mac, ", "['Apple iTunes']['Apple iTunes']"], "hjt": ["TreePad 6 Database File", "File created by TreePad 6 or earlier personal information management software; contains a set of documents structured as a hierarchy of \"nodes;\" supports text, images, hyperlinks, structured data, and other personal content for each node.", "Windows, ", "['Freebyte.com TreePad']"], "hiv": ["Windows Registry Hive File", "Registry file created by reg.exe, a Windows program used for saving, loading, and deleting registry information; contains a registry \"hive,\" which saves key-value data used by the operating system and installed programs; used for backups or for loading groups of registry keys; saved in a binary format.", "Windows, ", "['Microsoft Reg']"], "hit": ["The Sims Sound File", "Audio file format used for sounds in The Sims simulation game", "Windows, Mac, ", "['Electronic Arts The Sims']['Electronic Arts The Sims']"], "his": ["FindinSite Database Definition File", "Descriptor file that describes a full text searchable database; used by FindinSite search engines developed by PHD Computer Consultants Ltd; provides a standard means of describing the structure and contents of a FindinSite database.", "Windows, ", "[]"], "hip": ["Houdini Project File", "Project file created by Houdini, a three-dimensional modeling and animation program; contains 3D shape definitions; may store points, lines, surfaces, fluids, and other objects; may also include project assets, such as embedded images; can be rendered into a 3D scene using Houdini.", "Windows, Mac, Linux, ", "['Side Effects Houdini']['Side Effects Houdini']['Side Effects Houdini']"], "hin": ["HyperChem Input File", "Chemistry file format used by HyperChem, a molecular modeling program; contains multiple records of atoms, atom properties, and bonds; also stores information about the Viewer's Coordinate System, which is referenced by the program when opening the file to restore the previous view of the molecular system. ", "Windows, Mac, Linux, ", "['Hypercube HyperChem', 'Avogadro', 'Agile Molecule Ascalaph']['Hypercube HyperChem', 'Avogadro']['Avogadro']"], "hif": ["Quicken Online File", "File type used to store financial data in older versions of Quicken personal and business finance software; saves information such as transactions and investments; not supported by recent Quicken software versions.", "Windows, Mac, ", "['Intuit Quicken']['Intuit Quicken']"], "hipnc": ["Houdini Apprentice File", "3D image file created by Houdini Apprentice, the trial version of the full Houdini 3D modeling software; stores three-dimensional objects and animation properties for a scene; can be rendered with the software, but at a reduced resolution from the full version; \r\noften used in educational settings or by artists for personal portfolio development.", "Windows, Mac, Linux, ", "['Side Effects Houdini Apprentice']['Side Effects Houdini Apprentice']['Side Effects Houdini Apprentice']"], "hid2": ["KeepSafe File", "Security file created by KeepSafe, an Android and iOS application that hides your images and videos; also appears with the .HID file extension; contains a video or image that is hidden from the user until the appropriate pin is entered.", "iOS, Android, ", "['KeepSafe Private Photo Vault']['KeepSafe Vault']"], "hid": ["Sony Ericsson Remote Settings File", "Stores configuration information for using a Sony Ericsson cell phone as a Bluetooth remote control; maps keys on the phone to certain keys or commands on the computer.", "Windows, Mac, iOS, Android, ", "[][]['KeepSafe Private Photo Vault']['KeepSafe Vault']"], "hi": ["MacMAME High Scores File", "Game file saved by MAME arcade video game emulators, such as MAME and MacMAME; stores a high score list for a video game; used for saving records of gameplay.", "Windows, Mac, ", "['MAME', 'ExtraMAME']['MacMAME', 'MAME OS X']"], "hhsl": ["Hockey High Score List File", "File created by Shooting Practice, a hockey game where players shoot goals for high scores; contains a collection of high scores stored as a series of lines in a plain text format; used to retain a history of high scores within the game.", "Windows, ", "[]"], "hhp": ["HTML Help Workshop Project", "An HHP file is a help project created by HTML Help Workshop, a program that helps users create help systems to distribute with software or a website.  It contains help project information used to compile into a .CHM file.  HHP files are created when a user saves a project in HTML Help Workshop.", "Windows, ", "['Microsoft HTML Help Workshop', 'HelpScribble']"], "hht": ["Help and Support Center HHT File", "File that defines content classifications for help documents created with Microsoft Help and Support Center; specifies the way content is mapped to taxonomy terms and how new nodes are created in the taxonomy; stores elements in an .XML format.", "Windows, ", "['text editor']"], "hhk": ["HTML Help Index", "Help index file created by Microsoft HTML Help, a program used for creating Windows help documentation; saves an index of keywords that each open a help page when clicked; enables quicker lookups for common terms.", "Windows, ", "['Microsoft HTML Help Workshop']"], "hhh": ["Power C Precompiled Header File", "Precompiled header that contains information referenced by a Power C program; similar to a .HH file, but used specifically by Power C development software.", "Windows, ", "[]"], "hhc": ["HTML Help Table of Contents", "File created by HTML Help Workshop, a program used for creating HTML Windows software documentation; saves the table of contents (or site map) used by Microsoft Help; enables help documentation to be navigated in a Web browser.", "Windows, ", "['Microsoft HTML Help Workshop']"], "hh": ["C++ Header File", "Contains header information referenced by a C++ source code file; may include extra variables, constants, functions, or other data used by the C++ program; typically referenced at the beginning of the source code.", "Windows, Mac, ", "['Microsoft Visual Studio 2017', 'Embarcadero Technologies C++ Builder', 'text editor']['Apple Xcode', 'MacroMates TextMate', 'Freescale CodeWarrior Development Tools', 'text editor']"], "hgt": ["SRTM Elevation Data File", "GIS data file stored in the Shuttle Radar Topography Mission (SRTM) format; contains global elevation data captured during NASA space missions; may include up to a one arcsecond resolution; used for analyzing the earth's topography and for generating topographical images.", "Windows, Linux, ", "['Safe Software FME Desktop', 'ESRI ArcGIS for Desktop', 'DG Terrain Viewer', 'DG SRTM Void Killer', 'SRTMFill', 'VTBuilder']['DG Terrain Viewer']"], "hgl": ["HP Graphics Language File", "Printer control language developed by Hewlett-Packard (often referred to as HPGL); used by plotters from HP and other manufacturers, which print images using lines instead of dots.", "Windows, Mac, Linux, ", "['Corel PaintShop Pro X9', 'ACD Systems Canvas X 2017', 'Software Companions ViewCompanion Pro', 'CADSoftTools ABViewer']['vhf interservice Cenon']['vhf interservice Cenon']"], "hfv": ["HFS Disk Image", "Disk image used by emulation software, typically to run older versions of Mac operating systems; stores a disk image using Apple's HFS file system format; used for running Mac OS in a Windows or Linux environment.", "Windows, Mac, Linux, ", "['HFVExplorer']['SheepShaver']['SheepShaver']"], "hft": ["HotDocs Form Template", "Document template created by HotDocs, a software package used for document generation; saves a template for a digital form, often for a legal or insurance form; can be published to an .HFD document by filling the fields with user answers.", "Windows, ", "['HotDocs']"], "hfs": ["HFS Disk Image File", "Disk image file created in the Hierarchical System Format (HFS), the file system format used by Mac computers; contains files and folders as they would be stored by a Mac computer; can be opened by 7-Zip on PCs.", "Windows, ", "['File Viewer Plus', '7-Zip']"], "hfd": ["HotDocs Form Document", "Document created by HotDocs, a software package used for automating document generation; saves form information, fields data (populated answers), and page layout formatting for a digital form; used for legal, insurance, and contracting forms; generated from .HFT templates and filled with user answers.", "Windows, ", "['HotDocs']"], "hf": ["HF Image", "Graphic created in the HF image format; may still be opened and converted to other image formats by XnView and Graphics Converter Pro, even through the file format is very rare.", "Windows, Mac, Linux, ", "['XnViewMP', 'Newera Graphics Converter Pro']['XnViewMP']['XnViewMP']"], "hex": ["Hexadecimal Source File", "Contains settings, configuration information, or other data saved in a hexadecimal format; may be stored in either a binary or text format.", "Windows, Mac, Windows, Mac, Linux, ", "[][]['Smith Micro StuffIt Deluxe for Windows']['Smith Micro StuffIt Deluxe 16', 'Mac Binary Converter'][]"], "helpindex": ["Help Index Document", "Document used by Narrator, a narration audio producing application; contains data indexing HTML files found inside the Narrator application; some data held in the file includes the paths to each HTML help file.", "Mac, ", "['Mariner Software Narrator']"], "help": ["Mac OS X Help Book", "File used by Help Viewer, a help documentation viewer included with Mac OS X; contains a bundle of documents, which may include HTML and CSS files as well as indexing information; commonly used for Mac OS X application help documentation.", "Mac, ", "[]"], "heif": ["High Efficiency Image Format", "A HEIF file is an image container that stores raster images in a lossy compressed format.  It may contain still images, image collections, image bursts,  and image sequences.  HEIF files also store metadata that describes each image.", "Mac, iOS, ", "['Apple Photos']['Apple iOS']"], "heartssave-ms": ["Microsoft Hearts Save File", "Saved game file created by Microsoft Hearts, a cards game included with Windows; saves the cards in each player's hand as well as the number of tricks won; allows the player to continue where he left off last.", "Windows, ", "['Microsoft Hearts']"], "he2": ["Humongous Entertainment Game Archive", "Game archive used by Humongous Entertainment games, such as Fatty Bear and Backyard Soccer; contains speech and dialog files spoken by characters in the game.", "Windows, Mac, Linux, ", "['ScummVM']['ScummVM']['ScummVM']"], "he1": ["Humongous Entertainment Game Archive", "Game archive used by Humongous Entertainment games, such as Backyard Baseball and the Spy Fox game series; contains graphics that make up the environments that appear in the game.", "Windows, Mac, Linux, ", "['ScummVM']['ScummVM']['ScummVM']"], "he0": ["Humongous Entertainment Game Archive", "Game resource file used by Humongous Entertainment games, such as Freddi Fish and the Putt Putt game series; contains game data that describes characters and places that appear in the game.", "Windows, Mac, Linux, ", "['ScummVM']['ScummVM']['ScummVM']"], "he": ["Humongous Entertainment Game Archive", "Game resource archive used by Humongous Entertainment games, such as Pajama Sam 4 and Putt-Putt: Pep's Birthday Surprise; contains game resources that make up characters and locations.", "Windows, ", "['7-Zip']"], "hdz": ["Compressed Poser Hand Pose File", "Compressed hand pose data file used by Poser, a 3D character modeling and animation program; includes pose data specific to a character's hands, such as hand motions and finger positions.", "Windows, Mac, ", "['Smith Micro Poser 11']['Smith Micro Poser 11']"], "hdx": ["Delphi MultiHelp Index File", "Help documentation file used by older versions of AutoCAD design software; uses the filename ACAD.HDX and supplies an index for an associated ACAD.HLP (.HLP) file; not used by recent versions of AutoCAD.", "Windows, ", "['Autodesk AutoCAD 2017']"], "hdv": ["High Definition Video Format", "Format for the recording of high-definition video on DV cassette tape; HDV is a a tape-based format and although a number of solutions for tapeless recording of HDV video are available, these are not covered by the HDV specification. ", "Windows, ", "['MAGIX Vegas Pro 14']"], "hdumx": ["HotDocs User Mapping XML File", "File used by HotDocs, a digital form preparation program often used for designing legal and insurance forms; saves variable mapping information that enables third-party applications to interface with HotDocs.", "Windows, ", "['HotDocs']"], "hds": ["Microsoft PlayReady Data File", "File used by Microsoft PlayReady, a Digital Rights Management (DRM) program used for streaming online video; named mspr.hds (Microsoft PlayReady HDS file) and stored in the C:\\ProgramData\\Microsoft\\PlayReady\\ directory in Windows or /Library/Application Support/Microsoft/PlayReady/ in Mac OS X.", "Windows, Mac, ", "['Microsoft PlayReady']['Parallels Desktop 12 for Mac']"], "hdrp": ["HDRtist Pro Document", "Image created by HDRtist Pro, a program used for enhancing and adding effects to digital photos; stores the original imported image (e.g., a .JPG file) as well as the effects and other alterations applied to the image; allows the image to be saved, opened, and edited.", "Mac, ", "['Ohanaware HDRtist Pro']"], "hdt": ["Photoshop HDR Toning Preset File", "Settings file created by Photoshop professional CS5 or later image editing software; saves settings for adjusting an HDR (High Dynamic Range) photo; includes color, tone, and other settings.", "Windows, Mac, ", "['Adobe Photoshop CC 2017']['Adobe Photoshop CC 2017']"], "hdr": ["High Dynamic Range Image File", "Raster image or digital photo saved in HDRsoft's High Dynamic Range (HDR) image format; used for enhancing the color and brightness range of a digital image; can be processed to fix dark shadows or washed out areas of a picture.", "Windows, Mac, Android, Windows, ", "['HDRSoft Photomatix', 'Adobe Photoshop CC 2017', 'ACD Systems Canvas X 2017', 'ACD Systems ACDSee 20']['HDRSoft Photomatix', 'Adobe Photoshop CC 2017', 'Lemkesoft GraphicConverter']['File Viewer for Android']['ESRI ArcGIS for Desktop', 'Blue Marble Geographics Global Mapper', 'GDAL']"], "hdpmx": ["HotDocs Publisher Mapping XML File", "File used by HotDocs, a document preparation application commonly used for generating legal and insurance forms; saves variable mapping information that allows third-party applications to interface with HotDocs.", "Windows, ", "['HotDocs']"], "hdp": ["HD Photo File", "Compressed raster image format developed by Microsoft; used primarily for high resolution photographic images; similar to a .JPG file, but uses greater compression and also supports lossless compression.", "Windows, Mac, Windows, ", "['Microsoft Windows Photos', 'Serif PhotoPlus', 'Adobe Photoshop with HD Photo plugin', 'Alchemy Mindworks Graphic Workshop Professional', 'Axel Rietschin FastPictureViewer', 'CoolUtils Total Image Converter']['Adobe Photoshop with HD Photo plugin']['MAGIX Samplitude Music Studio 2016']"], "hdml": ["Handheld Device Markup Language File", "Web page created for mobile devices using the Handheld Device Markup Language (HDML); an extension of the SGML language, which is used for creating .SGML files; designed to be displayed on smartphones and other portable electronic devices.", "Windows, Mac, ", "['text editor']['text editor']"], "hdmp": ["Windows Heap Dump", "Uncompressed error dump file generated by Windows XP/Vista when a program has an error or crashes; contains a \"dump\" of the program state when the error happened and other relevant system data recorded at the time of the error.", "Windows, ", "['Microsoft Visual Studio 2017']"], "hdmov": ["QuickTime HD Movie File", "Movie file used by QuickTime, an audio and video playback program; contains audio and video data stored in H.264 format, an Apple \"High Definition\" movie file format; may be played using H.264 codecs that are installed with commonly known audio and video players.", "Windows, Mac, Linux, ", "['Apple QuickTime Player', 'Microsoft Windows Media Player', 'Media Player Classic', 'VideoLAN VLC media player']['Apple QuickTime Player', 'VideoLAN VLC media player']['VideoLAN VLC media player']"], "hdm": ["HDML File", "Web page written in the Handheld Device Markup Language (HDML); designed for portable electronic devices, such as smartphones and PDAs; HDML files are transferred to devices using HDTP (the Handheld Device Transport Protocol) rather than HTTP, which is used for .HTML pages.", "Windows, Mac, ", "['text editor']['text editor']"], "hdk": ["HotDocs Registration File", "File used by HotDocs, a document preparation program; contains a publisher key required to register templates for commercial use with the HotDocs Player; provided to the customer by a HotDocs sales representative after purchase.", "Windows, ", "['HotDocs']"], "hdi": ["Hard Disk Image", "Disk image file used by emulation software for older NEC PC-98 computer systems, including Anex86 and T98-Next; often contains older PC-98 video games and allows them to be run in Windows with the supporting emulation software.", "Windows, Windows, ", "['Anex86', 'T98-Next']['HotDocs']"], "hdl": ["HotDocs Library File", "File created by HotDocs digital form preparation software; saved in an XML format and contains references to resources used by the program; may reference text templates (.WPT, .DOT, or .RTF files) called \"clauses,\" user answers (.ANX files), or even external Web URLs; also contains a description for each referenced resource.", "Windows, ", "['HotDocs']"], "hdf": ["Hierarchical Data Format File", "Standardized file format for storing scientific data; used in environmental science, non-destructive testing, neutron scattering, and aerospace applications; HDF utilities can manipulate, view, analyze, visualize, and convert scientific data from HDF files.", "Windows, Mac, Linux, ", "['The HDF Group HDFView', 'GDAL', 'WaveMetrics IGOR Pro']['The HDF Group HDFView', 'Basic ENVISAT Atmospheric Toolbox', 'WaveMetrics IGOR Pro']['The HDF Group HDFView', 'Basic ENVISAT Atmospheric Toolbox', 'GDAL']"], "hdd": ["Parallels Desktop Hard Disk File", "Virtual hard disk created by Parallels Desktop virtualization software; stores the data for a virtual machine's hard drive (you can think of it containing the Windows C:\\ drive for Windows VMs); used for loading the VM's files when the VM is started.", "Mac, ", "['Parallels Desktop 12 for Mac']"], "hdb": ["HansaWorld Database File", "Database file created by HansaWorld ERP system Enterprise, an ERP (Enterprise Resource Planning) application for medium to large-sized businesses; contains company financial and logistical data, including invoices, receipts, and reports.", "Windows, Mac, Linux, ", "['HansaWorld ERP system Enterprise']['HansaWorld ERP system Enterprise']['HansaWorld ERP system Enterprise']"], "hda": ["HotDocs Auto-Assemble File", "Template created with HotDocs, a document template creation program; may include rules and formulas that can be used to automatically include or remove information from a document; publishes a template that is used to automatically assemble a document.", "Windows, ", "['HotDocs']"], "hd2": ["Poser Hand Pose File", "Hand pose data file used by Poser, a three-dimensional character modeling program; includes pose data specific to character hands, such as finger positions and hand motions.", "Windows, Mac, ", "['Smith Micro Poser 11']['Smith Micro Poser 11']"], "hcx": ["ChartXL Chart", "2D or 3D chart generated by ChartXL, a Harvard Graphics data analysis and presentation application; stores data and display information; can be used for saving surface plots, line graphs, polar charts, XYZ bar graphs, Gantt charts, and other visualizations.", "Windows, ", "['Harvard Graphics ChartXL']"], "hcu": ["Hydrograph Units Definitons File", "File used by HydroCAD, a CAD program that helps to design water drainage solutions; contains unit definitions for the HydroCAD project in text format; represents one of several files that comprise a HydroCAD project.", "Windows, ", "['HydroCAD Software Solutions HydroCAD', 'HydroCAD Software Solutions HydroCAD Sampler']"], "hcr": ["Half-Fold Card File", "File created by Broderbund PrintMaster and American Greetings Creatacard programs, which allow users to create customized greeting cards, scrapbook pages, labels, banners, and posters; contains layout and image data for a half-fold card design.", "Windows, Mac, Windows, ", "['Broderbund PrintMaster v7 Platinum']['Broderbund PrintMaster v7 Platinum']['HydroCAD Software Solutions HydroCAD', 'HydroCAD Software Solutions HydroCAD Sampler']"], "hcp": ["HydroCAD Project File", "Project file used by HydroCAD, a program that models stormwater activity for water drainage solutions; contains all essential data for the structure and setup of a HydroCAD project; stored in ASCII text format.", "Windows, ", "['HydroCAD Software Solutions HydroCAD', 'HydroCAD Software Solutions HydroCAD Sampler']"], "hcl": ["HotDocs Clause Archive", "Library archive created by HotDocs, a digital form preparation application often used for insurance and legal forms; saves a collection of \"clauses,\" which are text templates that can be inserted into a form; saved in a compressed .ZIP format.", "Windows, ", "['HotDocs']"], "hci": ["HydroCAD IDF Data File", "Data file used by HydroCAD, a stormwater drainage solutions modeling program; contains Intensity-Duration-Frequency (IDF) data for the rainfall intensity over a specified period of time; used in conjunction with several other data files that comprise a HydroCAD project.", "Windows, ", "['HydroCAD Software Solutions HydroCAD', 'HydroCAD Software Solutions HydroCAD Sampler']"], "hcf": ["Compact Ham Library", "File used by the HAM Runtime, a program used for running .HAM and .EHAM executables; can store both HAM and EHAM files; may also contain an md5 checksum, developer information, and other program information.", "Windows, ", "['Zaplots HAM Runtime']"], "hce": ["HydroCAD Hydrograph Data File", "Data file used by HydroCAD, a stormwater drainage solutions program; contains hydrograph data using a text format; stores changes in river water flows over time for the HydroCAD project.", "Windows, ", "['HydroCAD Software Solutions HydroCAD']"], "hcdt": ["Thinkfree Office NEO Cell Template", "An HCDT file is a workbook template created by Cell, a spreadsheet application included with the Thinkfree Office NEO suite.  It contains formatting of one or more worksheets of data.  HCDT files are used to create multiple spreadsheets with the same formatting.", "Windows, Mac, Linux, ", "['Hancom Thinkfree Office NEO Cell']['Hancom Thinkfree Office NEO Cell']['Hancom Thinkfree Office NEO Cell']"], "hcd": ["Samsung Android Firmware File", "An HCD file is a firmware file used by some Android-based Samsung mobile phones such as S series devices.  The file contains binary data used by the Android device to initialize a component such as a Bluetooth adapter or WiFi capabilities.  HCD files can be found in the /vendor/firmware directory.", "Android, ", "['Google Android']"], "hc": ["VeraCrypt Container File", "An HC file is a container file created by VeraCrypt, disk encryption software.  It contains a virtual encrypted disk. HC files can be configured to a specific KB, MB, or GB volume size and are password protected.", "Windows, Mac, Linux, ", "['VeraCrypt']['VeraCrypt']['VeraCrypt']"], "hcc": ["HydroCAD Prefab Chamber Data File", "Data file used by HydroCAD, a CAD water drainage solutions modeling program; contains stormwater storage chamber parameters in plain ASCII text format; stored with several other HydroCAD files that comprise a HydroCAD project.", "Windows, ", "['HydroCAD Software Solutions HydroCAD', 'HydroCAD Software Solutions HydroCAD Sampler']"], "hbx": ["BinHex Encoded File", "Binary to Hexadecimal text file created for Mac computers; contains compressed and encoded data that was originally in an 8-bit binary format, but now is in a 7-bit text format; typically used for transferring binary images, documents, and multimedia data using a textual format in email attachments.", "Windows, Mac, ", "['Corel WinZip 21', 'ESTsoft ALZip', 'Smith Micro StuffIt Deluxe for Windows']['Smith Micro StuffIt Deluxe 16']"], "hbk": ["Mathcad Handbook File", "File created by Mathcad, engineering calculating software; specifies the order for the indivdual files in the Mathcad electronic book as the reader goes through it; acts very similar to the book binding on a physical book; can be created using any text editor or word processor but must be saved as text-only.", "Windows, ", "['PTC Mathcad Prime 3.0']"], "hbe": ["HyperBac Compressed and Encrypted Archive", "File archive compressed and encrypted with the HyperBac file compression utility; used primarily for compressing database files, including Oracle, MySQL, SQL Server, SharePoint, Sybase, IBM DB/2, and SAP BRBackup database formats; can provide up to a 90% reduction in required storage space.", "Windows, Windows, Mac, ", "['Red Gate SQL HyperBac']['Line 6 POD HD500X Edit']['Line 6 POD HD500X Edit']"], "hbb": ["Line 6 POD HD Edit Bundle", "Bundle created by Line 6 POD HD Edit, an application that enables you to edit your guitar output; similar to the .HBS file but contains up to 8 set lists with each set list containing up to 64 presets; once loaded, will change the settings for \"FX,\" \"AMPS,\" \"Mixer,\" and \"Controllers,\" which customize the sound of your instrument.", "Windows, Mac, ", "['Line 6 POD HD500X Edit']['Line 6 POD HD500X Edit']"], "hbs": ["Handlebars Template", "Template created by Handlebars, a web template system; contains a template written in HTML code and embedded with handlebars expressions; same as the .HANDLEBARS file.", "Windows, Mac, Windows, Mac, ", "['Handlebars', 'Adobe Edge Code CC']['Adobe Edge Code CC']['Line 6 POD HD500X Edit']['Line 6 POD HD500X Edit']"], "hat": ["Duck Game Hat File", "A HAT file is a custom hat file used by Duck Game, a multiplayer 2D duck battle game.  It contains a hat, which is a 64x32 .PNG image.  HAT files are used for sharing and adding hats to ducks that appear in the game.", "Windows, ", "['Duck Game']"], "hbc2": ["HyperBac Compressed File Archive", "Compressed file archive created with the HyperBac compression utility; similar to a standard .HBC file, but tuned for lower compression and faster decompression times.", "Windows, ", "['Red Gate SQL HyperBac']"], "hbc": ["HyperBac Compressed Archive", "Compressed file archive created with the HyperBac compression utility; used primarily for compressing database files; supported database systems include Oracle, SQL Server, MySQL, SharePoint, IBM DB/2, Sybase, and SAP BRBackup.", "Windows, ", "['Red Gate SQL HyperBac']"], "has": ["Haskell Script", "Source code of a program written in Haskell, a purely functional programming language, which means the code is based on functions; uses non-strict semantics, which allows functions and data structures to be defined by the user.", "Windows, Mac, Linux, ", "['Helium', 'WinHugs', 'text editor']['Helium', 'Hugs', 'text editor']['Hugs', 'text editor']"], "handlebars": ["Handlebars Template", "File created by Handlebars, a web template framework; contains a template written in HTML code and embedded with handlebars expressions; same as the .HBS file.", "Windows, Mac, ", "['Handlebars', 'Adobe Edge Code CC']['Adobe Edge Code CC']"], "han": ["Amazon Kindle eBook Data File", "A HAN file is an eBook data file used by the Amazon Kindle reading device and Kindle Fire tablet computer.  It contains information about a book such as notes, bookmarks, and reading progress.  HAN files are similar to .MBP files and replaced them with the firmware 3.4 update.", "Windows, Mac, Linux, ", "['text editor']['text editor']['text editor']"], "haml": ["Haml Source Code File", "Source code file written in Haml, (HTML abstraction markup language); stores a template written in Haml language that is used to generate the HTML of a web document; can be used to replace Ruby template scripts (.ERB files) with its abbreviated syntax.", "Windows, Mac, ", "['File Viewer Plus', 'Microsoft Notepad', 'text editor']['Apple TextEdit', 'text editor']"], "h3m": ["Heroes 3 Map File", "Map file for the turn-based strategy game, \"Heroes of Might and Magic 3\" (also known as \"Heroes 3\" or \"HOMM3\"); includes terrain information and the location of objects and characters on the map.", "Windows, Mac, ", "[][]"], "h3e": ["Line 6 POD HD300 Edit Preset File", "Preset file created by Line 6 POD HD300 Edit, a guitar effects editor; contains settings that customize the sound of your guitar; settings are found under categories such as \"FX,\" \"REVERB,\" and \"GATE;\" different settings include speed, bass, drive, treble and channel volume.", "Windows, Mac, ", "['Line 6 POD HD300 Edit', 'Line 6 POD HD400 Edit']['Line 6 POD HD300 Edit', 'Line 6 POD HD400 Edit']"], "h3b": ["Line 6 POD HD300 Edit Bundle", "Bundle created by Line 6 POD HD300 Edit, a program that enables you to edit the sound output of your guitar effects; contains custom presets that customize the sound of your guitar; changes the settings under categories such as \"GATE,\" \"VOL,\" and \"REVERB,\" when loaded; holds up to 128 presets, which is the alternative option to storing individual presets in the .H3E file.", "Windows, Mac, ", "['Line 6 POD HD300 Edit', 'Line 6 POD HD400 Edit']['Line 6 POD HD300 Edit', 'Line 6 POD HD400 Edit']"], "h2p": ["Zebra2 Preset", "Preset format used by Zebra2, a virtual studio technology (VST) synthesizer plugin that is designed to be added on to DAWs such as Steinberg Cubase or Avid Pro Tools; stores audio settings, including the preset author and usage, in a text-editable format.", "Windows, Mac, ", "['u-he Zebra2']['u-he Zebra2']"], "h1s": ["Windows Assistance Platform Help File", "Compiled help document format introduced with Windows Vista and also supported in Windows 7; run by the Assistance Platform client (HelpPane.exe), which is installed by default in Windows; used by Microsoft and OEMs for producing help documents, but not used by third-party software developers.", "Windows, ", "['Microsoft Assistance Platform', 'Help-Info xHelpMarkup']"], "h1q": ["Microsoft Help Merged Query Index File", "Query index used by Microsoft Help, a system help program included with the Windows operating system; stored in the \"\\Documents and Settings\\All Users\\Application Data\\Microsoft Help\" in Windows XP and the \"\\ProgramData\\Microsoft\\Assistance\\Client\\1.0\\en-US\" directory in Windows Vista.", "Windows, ", "[]"], "h2o": ["Battle Realms Game Data File", "Compressed game data container file used by Battle Realms, an older real-time strategy game developed by Liquid Entertainment and released by Ubisoft; can store various types of game data, including sounds, models, animations, terrain, textures, and other data.", "Windows, Windows, ", "['Liquid Entertainment Battle Realms', 'Ghisler Total Commander', 'H2OTool']['H2OMAP Water']"], "h16": ["H&R Block Canada 2016 Tax Return", "A 2016 tax return created by H&R Block Canada, a Canadian tax preparation program.  It contains Canadian federal income tax forms and other tax data such as personal information and income earned.", "Windows, Web, ", "['H&R Block Canada Tax Software']['H&R Block Canada Online']"], "h264": ["H.264 Encoded Video File", "An H264 file is a video file encoded with H.264 compression, which is a popular format for high definition video.  It is often used as the video format for AVCHD camcorders, HDTV, Blu-ray, and HD DVD.  H264 generally refers to a video file that is actually an .MP4 file.", "Windows, Mac, Linux, ", "['Microsoft Windows Media Player', 'Apple QuickTime Player', 'Roxio Creator NXT Pro 5', 'Corel VideoStudio Pro X10 Ultimate', 'CyberLink PowerDVD 16', 'VideoLAN VLC media player']['Apple QuickTime Player', 'Apple iTunes', 'Roxio Toast 15', 'VideoLAN VLC media player']['VideoLAN VLC media player']"], "h15": ["H&R Block Canada 2015 Tax Return", "2015 tax return created and used by H&R Block Canada, a Canadian tax preparation program; contains tax data entered by the user such as personal information and income earned; also includes Canadian federal income tax forms; ", "Windows, Mac, Web, ", "['H&R Block Canada Tax Software', 'Intuit Canada TurboTax']['Intuit Canada TurboTax']['H&R Block Canada Online']"], "h14": ["H&R Block Canada 2014 Tax Return", "Tax return created and used by H&R Block Canada 2014, a Canadian tax preparation program; contains tax data entered by the user along with Canadian federal income tax forms; saves the progress of a tax return so it can be resumed at a later time.", "Windows, Mac, Web, ", "['H&R Block Canada Tax Software', 'Intuit Canada TurboTax']['Intuit Canada TurboTax']['H&R Block Canada Online']"], "h13": ["H&R Block Canada 2013 Tax Return", "Tax return saved by H&R Block Canada 2013, a Canadian tax preparation program; contains tax data entered by the user along with Canadian federal income tax forms; enables you to save your tax return progress and resume it at a later time.", "Windows, Mac, Web, ", "['H&R Block Canada Tax Software', 'Intuit Canada TurboTax']['Intuit Canada TurboTax']['H&R Block Canada Online']"], "h12": ["At Home Canada 2012 Tax Return", "Tax return saved by H&R Block Canada 2012, a Canadian tax preparation program; contains Canadian federal income tax forms and user-entered tax data; saves the progress of a tax return so it can be resumed at a later time.", "Windows, Mac, Web, ", "['H&R Block Canada Tax Software', 'Intuit Canada TurboTax']['Intuit Canada TurboTax']['H&R Block Canada Online']"], "h11": ["At Home Canada 2011 Tax Return", "Tax return created with H&R Block Canada's At Home tax preparation software; includes Canadian income tax forms and personal tax data entered by the user; used to save the progress of a tax return so it can be opened and resumed at a later time.", "Windows, Mac, Web, ", "['H&R Block Canada Tax Software', 'Intuit Canada TurboTax']['Intuit Canada TurboTax']['H&R Block Canada Online']"], "h10": ["At Home Canada 2010 Tax Return", "Tax return created with the Canadian version of H&R Block At Home; includes federal Canada tax forms and information entered by the user; created by the 2010 version of At Home Canada, but may be imported by At Home Canada 2011 and other tax software programs.", "Windows, Mac, Web, ", "['H&R Block Canada Tax Software', 'Intuit Canada TurboTax']['Intuit Canada TurboTax']['H&R Block Canada Online']"], "h0": ["Movie Edit Pro Waveform Information File", "Audio data file created by Movie Edit Pro (MEP), an application used to create movies; contains a visual representation of a movie project sound file; used by the MEP interface to display the audio waveform.", "Windows, ", "[]"], "h2w": ["H2testw File", "An H2W file is a data file created by H2testw, a program used to scan USB drives and SD cards for read and write errors.  It contains data generated by H2testw to test a USB drive or SD card.  H2W files are created and placed on the drive being tested in order to test the drive's read + write functionality. ", "Windows, ", "['H2testw']"]}