{"i": ["Visual Studio Intermediate File", "File generated by the Microsoft Visual Studio compiler when compiling a Visual C++ project; contains the output from the preprocessor operation; may be used to diagnose and fix compilation errors.", "Windows, Linux, ", "['Microsoft Visual Studio 2017'][]"], "ibk": ["IncrediMail Account Backup File", "Backup file created by IncrediBackup, a program that allows users to bad up their Incredimail email accounts; stores a backup of an IncrediMail account, which includes emails, folders, contacts, and other content.", "Windows, ", "['Perion IncrediBackup']"], "ibch": ["IncrediBots Challenge File", "Challenge file used by IncrediBots, a robot physics puzzle game that is played in a web browser; contains a challenge, which includes shapes and challenge conditions and restrictions.", "Web, ", "['IncrediBots']"], "ibro": ["IncrediBots Robot File", "File used by IncrediBots, a robot physics puzzle game written in Flash; saved in a text format and contains properties for the constructed robot; used for saving custom robots created in the Challenge Editor.", "Web, ", "['IncrediBots']"], "ibp": ["IsoBuster Managed Image Information File", "Disc image informational file that corresponds to one or more .IBQ files; must have the same filename except for the extension", "Windows, ", "['Smart Projects IsoBuster']"], "ibre": ["IncrediBots Replay File", "Replay file used by IncrediBots, a robot physics puzzle game written in Flash; stores a replay of a user's gameplay.", "Web, ", "['IncrediBots']"], "ibt": ["Texture and Model File", "Contains textures and models used by the \"Thief: Deadly Shadows\" video game, also known as \"Thief 3;\" installed along with other Thief 3 game files and required for the game to run.", "Windows, ", "['Eidos Thief Deadly Shadows', 'T3Ed']"], "ibooks": ["Multi-Touch iBook", "Digital book created for the Apple iPad; saved in the ePub 3 format with a few proprietary Apple-specific additions; may include text, images, videos, 3D objects, presentations, and other media; supports user interaction through multi-touch gestures.", "Mac, iOS, ", "['Apple iBooks Author']['Apple iBooks']"], "ibcd": ["InstantBingoCard Document", "Bingo card design created by InstantBingoCard, an application that allows user to create and print bingo cards; stores the card grid size and theme, as well as words and pictures for each call item on the card; supports multiple character sets, including Unicode; can be printed using any standard printer.", "Windows, ", "['InstantBingoCard']"], "ibq": ["IsoBuster Managed Image File", "Disc image format that enables disc image extraction to be stopped and started again later, even using different equipment; provides redundancy for reading over disc errors", "Windows, ", "['Smart Projects IsoBuster']"], "ibplugin": ["Interface Builder Plug-in", "Plugin file used by Interface Builder, an Apple development tool used to design software interfaces; contains data and functions that add new features to the tool; may add new menu items, custom views, or other features.", "Mac, ", "[]"], "ibb": ["ImgBurn Project File", "Disk burning project created by ImgBurn, a program used for burning data, audio, and video discs; saves a list of files, folders, and/or disk images to be burned to a disc; can be used for CDs, DVDs, HD DVDs, and Blu-ray discs.", "Windows, ", "['Lightning UK! ImgBurn']"], "ib3": ["IncrediBots 3 Saved Challenge File", "Game file created by IncrediBots 3, a simulation game that uses physics principles and allows users to create their own custom worlds, called Challenges; saves objects and physical conditions of the world.", "Web, ", "['IncrediBots 3']"], "ibatemplate": ["iBooks Author Document Template", "Book design template created by iBooks Author, a program used to create digital books for the Apple iPad; stores design presets such as page layout and font settings; used as the starting point for a book design project (.IBA file).", "Mac, ", "['Apple iBooks Author']"], "iba": ["Lectra Clothing Design Pieces File", "CAD file used by Lectra Modaris, a clothing and fashion design application; describes the geometry of the pieces that comprise a clothing design; saved with a .VET file that provides the \"cutter's must\" sheet.", "Windows, Mac, iOS, ", "['Lectra Modaris', 'SoftFashion StyleCAD', 'PAD Pattern Design']['Apple iBooks Author', 'Apple iBooks']['Apple iBooks']"], "ib2": ["IncrediBots 2 Saved Challenge File", "Game file created by IncrediBots 2, a physics-based simulation game that allows players to create their own worlds, called Challenges; saves objects and physical properties of the world.", "Web, ", "['IncrediBots 2']"], "izzy": ["Isadora Project", "Media project saved by Isadora; contains a graphic programming environment for managing digital media, such as video, audio, and MIDI data.", "Windows, Mac, ", "[][]"], "izz": ["Isadora Media Control Project", "Media project saved by Isadora; provides a graphic programming environment for managing digital media and external devices; allows for interactive control of digital media, with an emphasis on the real-time manipulation of digital video; supports audio, video, and MIDI data.", "Windows, Mac, ", "[][]"], "ize": ["IZArc Archive", "Proprietary compression format used by IZArc, a file compression and decompression program; saves an archive of files and folders; supports encryption and password protection for secure storage and transfer of archives.", "Windows, ", "['IZArc']"], "ixb": ["Ulead Disc Image", "File created by Ulead DVD MovieFactory and Ulead Burn.Now, which are programs used for disc authoring and burning; contains a disc image that stores the file structure and all contents of a disc; used to burn CDs and DVDs.", "Windows, ", "[]"], "ixa": ["Ulead Disc Image format", "DVD disc image file created with Ulead disc authoring software; saved in a proprietary format readable only by Ulead applications, such as DVD Workshop, DVD Movie Factory, and Copy.Now.", "Windows, ", "[]"], "iwz": ["InstallShield Express 2 Project File", "Project file created by InstallShield Express 2.x, a program that allows users to create InstallScript-based installation packages; stores project information, including settings, InstallScript code, file names, dialog images and text.", "Windows, ", "['Flexera InstallShield']"], "ix2": ["WordPerfect Address Book File", "File used by WordPerfect, a word processing program; contains contact information, including names, street addresses; phone numbers, and email addresses; found with the name addrbk.ix2.", "Windows, ", "['Corel WordPerfect X8']"], "ix": ["dtSearch Index File", "Index file created by dtSearch, a program used for text searching; contains index search information, including filters, exclusions, locations, and crawl depth; used to direct searches and filter search results.", "Windows, ", "[]"], "iwxdata": ["iWorx Data File", "File created by LabScribe, a software application that interfaces with iWorx devices, which are used in biomedical research and analysis; contains data recorded by a connected device, taken from a human subject; allows the data to be stored and analyzed in the software.", "Windows, Mac, ", "['iWorx Systems LabScribe3', 'NI LabVIEW Biomedical Toolkit']['iWorx Systems LabScribe3']"], "iws": ["IntelliJ IDEA Web Page", "Dynamic Web page created with IntelliJ IDEA, a Java IDE (Integrated Development Environment); when accessed by a user, the Java syntax is processed on the Web server and the resulting HTML is sent to the client's Web browser.", "Windows, Mac, Linux, Windows, ", "['Jetbrains IntelliJ IDEA', 'Web browser']['Jetbrains IntelliJ IDEA', 'Web browser']['Jetbrains IntelliJ IDEA', 'Web browser'][]"], "iwi": ["Infinity Ward Texture File", "Graphics file used by the Infinity Ward game engine, which was used for some Call of Duty and James Bond first-person shooter games; stores textures for game models; used for overlaying graphics on NPCs, weapons, buildings, terrain, and other objects.", "Windows, ", "['Activision Call of Duty: Black Ops', 'Activision Call of Duty: World at War', 'Activision Call of Duty 4: Modern Warfare', 'Activision Call of Duty: Modern Warfare 2', 'Diego Logic IWI_X_DDS']"], "iwdgt": ["iWeb Widget File", "Widget bundle used by Apple iWeb, a Web development tool for Mac OS X; contains a Web resource bundle, which can be included as a standalone Web page component; used for inserting navigation bars, headers, footers, RSS feeds, and other components into Web pages.", "Mac, ", "['Apple iWeb']"], "iwd": ["Call of Duty Game Data File", "Contains game data used by Call of Duty 2 (CoD2) and Call of Duty 4; may store graphics, weapons, scripts, or other information; compressed using ZIP compression to save disk space.", "Windows, Mac, ", "['Activision Call of Duty 2', 'Activision Call of Duty 4: Modern Warfare', 'Corel WinZip 21']['Activision Call of Duty 2', 'Activision Call of Duty 4: Modern Warfare']"], "iwb": ["IWBasic Source Code File", "Source code file created by IWBasic (formerly Emergence BASIC), an IDE used to develop Windows 32-bit applications; written in the iBasic programming language, which is similar to BASIC and was developed by IonicWind Software.", "Windows, ", "['File Viewer Plus', 'IonicWind IWBasic']"], "iwa": ["iWork Archive File", "Archive file format used by the iWork suite; contains serialized components, such as theme style sheets, tables, and metadata, in a Protobuf stream, which is compressed in the Snappy compression format; located inside the Index.zip file in an iWork document bundle.", "Mac, ", "['Apple Pages', 'Apple Numbers 4', 'Apple Keynote 7']"], "iw": ["Chain Engineering Database File", "Drive chain calculation project created with IWIS Chain Engineering software; contains chain specs, such as the length, shape, number of teeth, etc; can be tested within Chain Engineering to calculate torque, speed, and other data.", "Windows, ", "['IWIS Chain Engineering']"], "ivue": ["Live Picture IVUE Image", "Raster image created by Live Picture, an image editing application for Mac OS Classic that is now discontinued; uses the IVUE format, which is a multi-resolution image format used as the basis for FlashPix (.FPX files).", "Mac, ", "[]"], "ivt": ["International Volleyball 2006 Data File", "Game data file referenced by International Volleyball 2006, a 3D volleyball game; may include data such as player information, game rules, actions, or graphics used by the game.", "Windows, Windows, ", "[]['Beyond 20/20 Professional Browser']"], "ivs": ["Initialization Vector File", "File used by Aircrack-ng and other WEP wireless network key cracking applications; contains initialization vectors (\"IVs\"), which are the seeds used for generating encrypted data on the network; processed by a cracking utility to get the WEP key for the network.", "Windows, Windows, Mac, ", "['Aircrack-ng']['video player']['video player']"], "ivr": ["Internet Video Recording", "Video format developed by RealNetworks for sharing video clips on the Web; may be created by using the \"Record\" feature in RealPlayer 11 or later; saved in a proprietary format that can only be opened with RealPlayer.", "Windows, Mac, Linux, Windows, Mac, ", "['RealNetworks RealPlayer Cloud']['RealNetworks RealPlayer Cloud']['RealNetworks RealPlayer Cloud'][][]"], "ivf": ["Indeo Video Format File", "Video file created in the Indeo Video Format (IVF), which is also often called the \"Intel Video Format;\" encodes the video data using the Indeo video codec; uses the MIME type video/x-ivf and is created by Intel video-editing software.", "Windows, ", "['Microsoft Windows Media Player', 'CoolUtils Total Movie Converter']"], "ive": ["OpenSceneGraph Binary File", "Three-dimensional model file created by OpenSceneGraph (OSG), an open source 3D graphics toolkit used for modeling and animation; contains a 3D scene created with the software; used for visualizations, simulation, games, virtual reality, and other modeling scenarios.", "Windows, Mac, Linux, ", "['OpenSceneGraph']['OpenSceneGraph']['OpenSceneGraph']"], "iv2i": ["Norton Ghost Incremental Virtual Volume Image", "Incremental backup created with Norton Ghost; typically created on a regular basis after the initial volume backup (.V2I) file has been saved; can be restored to another volume using Norton Ghost backup software.", "Windows, ", "['Symantec Ghost Solution Suite']"], "ivd": ["Bitdefender Incremental Virus Definitions File", "File used by Bitdefender antivirus and Internet protection software; saves virus definition updates which help the software recognize the most recent viruses; used for supplementing the base .CVD virus definitions file with new updates.", "Windows, Mac, ", "['Bitdefender Total Security 2017', 'Bitdefender Antivirus Plus 2017']['Bitdefender Antivirus for Mac']"], "ivc": ["InteliSea Vessel Configuration File", "XML project file used by InteliSea Configuration Manager, an application used to configure vessel alarm monitoring and control systems; contains the XML dataset schema and data elements resulting from the specifications of the control system; used for saving configurations for large luxury yachts.", "Windows, ", "['InteliSea Configuration Manager', 'text editor']"], "ius": ["InfoTMIC Firmware Update File", "Firmware file used by infoTMIC tablet PCs, which use the Android operating system; stores data for updating the low-level system code on the device; enables users to update tablets with the latest patches, bug fixes, and other upgrades.", "Linux, ", "['iusutils']"], "iup": ["Fritz Update File", "Software update file used by Fritz, an online chess playing program; contains data that upgrades the software from one version to another version; typically is downloaded automatically when a new update to the software is available.", "Windows, ", "['ChessBase Fritz']"], "iva": ["Surveillance Video File", "Video format used by multiple video surveillance systems; typically contains video recordings captured on closed-circuit television (CCTV) devices; may be saved as a backup file, which can usually be viewed with the software included with the video camera system.", "Windows, Windows, ", "[][]"], "iv": ["Open Inventor Scene Graph File", "Scene graph file created by Open Inventor, an object-oriented toolkit used for developing 3D scenes and animations; saved in a text format and contains \"nodes,\" \"fields,\" and their connections and properties; used to describe 3D objects and to compile them together into a scene.", "Windows, Linux, ", "['VSG Open Inventor', 'SGI Open Inventor', 'Golden Software Voxler']['VSG Open Inventor', 'SGI Open Inventor', 'ivview', 'ivToVRML']"], "itx": ["ITX Form Template", "Form template created with FileNet eForms Designer; used as a starting point for developing and distributing multiple forms with a similar structure and layout.", "Windows, Mac, ", "[][]"], "itw": ["InTouch With Database File", "Proprietary database format used by InTouch With, a free-form database application for the Mac OS; customized for storing names and addresses and printing envelopes and labels.", "Mac, ", "[]"], "itr": ["Icy Tower Replay File", "Game replay created by Icy Tower, a jumping game where players try for high scores; saves the game inputs and movements for a level that was previously played; can include player comments; used for sharing replays with friends.", "Windows, Mac, ", "['Muskedunder Interactive Icy Tower']['Muskedunder Interactive Icy Tower']"], "itt": ["IconTweaker Theme File", "File created by IconTweaker, a free utility that allows users to change Windows icons; contains settings for a theme, including a mapping of theme icons to their Windows equivalents; stored in an XML format.", "Windows, ", "[]"], "its": ["Impulse Tracker Sample", "Audio sample format used by Impulse Tracker, an audio tracking program; supported by other tracking programs as well.", "Windows, Mac, Windows, ", "['Impulse Tracker', 'OpenMPT']['CocoModX']['Microsoft Windows']"], "itpc": ["iTunes Podcast Link File", "Link file used by iTunes, a music shopping, management, and playback application; contains link information for subscribing to a podcast; used for sharing podcast subscriptions over the Internet.", "Windows, Mac, ", "['Apple iTunes', 'JRiver Media Center']['Apple iTunes', 'JRiver Media Center']"], "itn": ["TomTom Navigator Itinerary File", "Travel itinerary saved by TomTom Navigator GPS software; saves travel routes and points of interest as an ASCII text file; marks locations as pass-by locations or destination points and flags them as visited or not visited.", "Windows, Mac, ", "['TomTom HOME']['TomTom HOME']"], "itmsp": ["iTunes Store Package", "Package created for the iTunes Store; may store videos, music, a digital book, an application, or other content to be sold on iTunes; used by content providers for packaging iTunes submissions, which are first reviewed by Apple before releasing for sale on the iTunes Store.", "Mac, ", "['Apple Application Loader', 'Apple iTunes Producer', 'Apple iBooks Author']"], "itms": ["iTunes Music Store Link File", "Music store link file used by iTunes, a program used to shop, organize, and play music; stores a link to a location within the iTunes music store; often hosted within Web pages so that the iTunes music store location is launched when the user clicks on the file in a Web browser.", "Windows, Mac, ", "['Apple iTunes']['Apple iTunes']"], "itm": ["iThink Model File", "Business model created with iThink, a business management and planning program; used for modeling and simulating different business environments; may include workflow charts, supply and demand animations, and other types of diagrams.", "Windows, Mac, ", "[][]"], "itls": ["iTunes Live Stream URL", "Link to a live audio stream that can be streamed by iTunes, Apple's media playback application; similar to .M3U and .PLS files, but designed specifically for iTunes.", "Windows, Mac, ", "['Apple iTunes']['Apple iTunes']"], "itlp": ["iTunes LP Album File", "Bundled album file used by iTunes, a music shopping, management, and playback program; contains a DRM-free album audio as well as optional videos, photos, and other album content; supports 256kbps AAC audio and high-definition video; used for storing and playing the \"deluxe\" versions of albums downloaded from the iTunes music store.", "Windows, Mac, ", "['Apple iTunes']['Apple iTunes', 'Apple TuneKit']"], "itk": ["ScummVM Game Data File", "Data file packaged for ScummVM, a virtual machine designed for playing old adventure games; contains data that has been reverse engineered from the original game file; saved in a proprietary ScummVM format that can be loaded by the ScummVM engine.", "Windows, Mac, Linux, ", "['ScummVM']['ScummVM']['ScummVM']"], "iti": ["Impulse Tracker Instrument", "Instrument format used by Impulse Tracker, an audio tracking program; contains samples that can be played back using MIDI data.", "Windows, Mac, ", "['Impulse Tracker', 'OpenMPT']['CocoModX']"], "ithmb": ["iPod and iPhone Photo Thumbnails File", "File used by iPhones and photo-capable iPods; contains a collection of thumbnail images that are stored on the media device; used for browsing images on iPods or iPhones, as well as for organizing images in photo management programs.", "Windows, Mac, ", "['Dec Software iThmb Converter', 'DigiDNA iMazing', 'Tansee iPod Transfer Photo', 'Tansee iPhone Transfer Photo', 'CompuClever Ultra File Opener']['DigiDNA iMazing', 'Echo One File Juicer', \"Keith's iPod Photo Reader\", 'Lemkesoft GraphicConverter']"], "itl": ["iTunes Library File", "Database used by iTunes to organize files in the iTunes music library; contains a list of songs in the library, playlists created by the user, song ratings, and comments.", "Windows, Mac, ", "['Apple iTunes']['Apple iTunes']"], "itemdata-ms": ["Windows 8 Start Screen Item Data File", "System file used by the Windows 8 operating system; contains user settings that define the layout of items on the Windows 8 Start screen; arranges tiles  for items such as news, weather, Windows programs, and user applications.", "Windows, ", "['Microsoft Windows']"], "ite": ["iTunes Extras File", "File bundle created for iTunes, an application used for music shopping, organization, and playback; stores a collection of Web  and multimedia files, which can include HTML, CSS, JavaScript, images, audio files, and video files; acts as a self-contained website that can be navigated and played back in iTunes.", "Windows, Mac, ", "['Apple iTunes']['Apple iTunes']"], "itdb": ["iTunes Database File", "Contains information about songs and other audio files stored in an iTunes Library; the files \"iTunes Library Extras.itdb\" and \"iTunes Library Genius.itdb\" are stored in the iTunes folder along with the iTunes library file.", "Windows, Mac, ", "['Apple iTunes']['Apple iTunes']"], "itc2": ["iTunes Cover Flow Data File 2", "File used by iTunes, a digital music player; contains an image and metadata associated with a music album; cannot be opened directly since the album image is stored in an encrypted format.", "Windows, Mac, ", "['Apple iTunes']['Apple iTunes']"], "itc": ["iTunes Cover Flow Data File", "Contains album artwork and metadata for songs that have cover artwork; used by iTunes to speed up browsing songs in Cover Flow mode; saved by default within the ~/Music/iTunes/Album Artwork/Local/... directory.", "Windows, Mac, ", "['Apple iTunes']['Apple iTunes']"], "ita": ["IconTweaker Theme Archive", "Theme archive created by IconTweaker, a free program used to change Windows icons; contains an .ITT theme file and a single .ICL file or multiple .ICO files; stored in a compressed .ZIP file format.", "Windows, Windows, ", "[]['VTech Learning Lodge Navigator']"], "it": ["Impulse Tracker Module", "Music module created by Impulse Tracker, an audio tracking program; contains a sequences of notes, or patterns, that play back sound samples which are also stored in the file; similar to an .S3M file, but supports more data per pattern and higher quality samples.", "Windows, Mac, Linux, ", "['Impulse Tracker', 'Nullsoft Winamp', 'ModPlug Player', 'VideoLAN VLC media player', 'AIMP', 'Schism Tracker', 'MikMod']['CocoModX', 'XimpleMOD', 'VideoLAN VLC media player', 'Schism Tracker', 'MikMod']['VideoLAN VLC media player', 'Schism Tracker', 'MikMod']"], "isz": ["Zipped ISO Disk Image", "An ISZ file is a file compressed in a disk image format (a.k.a. \"ISO Zipped\") developed by ESB Systems.  It is similar to a regular .ISO file, but compressed to save disk space and may also be password-protected and encrypted using AES128, AES192, or AES256 encryption.", "Windows, ", "['EZB Systems UltraISO', 'WinMount International WinMount', 'Alcohol 120%', 'DT Soft DAEMON Tools']"], "isx": ["SimulationX Project", "An ISX file is a project file used by SimulationX, an application used to simulate technical systems.  The file is a compressed archive that contains CAD, recorded results, and animation data.", "Windows, ", "['ESI ITI GmbH SimulationX']"], "isu": ["InstallShield Uninstaller Script", "Uninstall script run by the InstallShield software installation program; locates and removes all files installed with a program when the \"Uninstall\" command is run.", "Windows, ", "['Flexera InstallShield']"], "ist": ["InstallShield Project Template File", "Project template created by InstallShield, a program used to create Windows Installer (.MSI) and InstallScript-based installation packages; contains a reusable template, including default settings, code, and design elements; may include directory structures, custom scripts, default images, and text.", "Windows, Windows, ", "['Flexera InstallShield']['Inspiration Software Inspiration']"], "isp": ["IIS Internet Service Provider Settings", "Contains Internet connection settings for Microsoft Internet Information Services (IIS); stores server information for connecting to an Internet service provider, or (ISP).", "Windows, ", "['Microsoft IIS']"], "isr": ["GoMoku Game File", "Game file used by Gomoku, a board game for two players, typically played on a 18x18 board; the first player to get exactly five stones in a row (horizontally, vertically, or diagonally) wins.", "Windows, ", "[]"], "iss": ["Inno Setup Script", "Script used by Inno Setup, a free program used to create Windows program installers; contains a series of text commands that specify installation files, target installation locations, and other settings; used to control all aspects of the installation. ", "Windows, Windows, ", "['File Viewer Plus', 'Jrsoftware Inno Setup', 'Microsoft Notepad', 'PSPad', 'text editor']['Flexera InstallShield']"], "isoz": ["Compressed Arbortext IsoDraw Illustration", "Document created by Arbortext IsoDraw, a program used for creating 2D technical illustrations; saves an IsoDraw illustration (.ISO file) in a compressed format; may contain a drawing for a part catalog, service manual, or for another technical purpose.", "Windows, ", "['PTC Arbortext IsoDraw']"], "iso": ["Disc Image File", "An ISO file is a common CD or DVD disc image format based on the ISO-9660 standard.  It contains an exact duplicate of data from the original disc, which includes the data saved on the disc as well as the filesystem information, such as directory structures, file attributes, and boot code.  ISO files are often used for making copies of CDs and DVDs.", "Windows, Mac, Linux, Android, Windows, Windows, Linux, ", "['Nero 2017', 'Roxio Creator NXT Pro 5', 'Corel WinZip 21', 'ISO Master', 'PowerISO', 'Alcohol 120%', 'DT Soft DAEMON Tools', 'NeoSmart Technologies EasyBCD', '7-Zip', 'VideoLAN VLC media player', 'WinRAR 5']['Apple Disk Utility', 'Roxio Toast 15', 'Parallels Desktop 12 for Mac', 'VMware Fusion 8.5', 'VideoLAN VLC media player']['Canonical Furius ISO Mount', 'VideoLAN VLC media player', 'ISO Master', 'Brasero', 'K3b']['RARLAB RAR']['PTC Arbortext IsoDraw', 'PTC Creo View Express']['PCSX2']['PCSX2']"], "ispc": ["Image Surfer Pro Collection File", "File used by Image Surfer Pro, an Internet Explorer plug-in used for customizing the use of the browser; stores a collection of image URLs as well as descriptive information about the image collection; can be shared with other users.", "Windows, ", "['Image Surfer Pro']"], "isn": ["Installer Source File", "An ISN file is an installer source file used by InstallShield, a tool used to create installers for Windows software packages.  It contains a list of the source files required for installing a software package.  ISN files also contain information about the order the files are extracted and where to install them.", "Windows, ", "['Flexera InstallShield']"], "ismv": ["IIS Smooth Streaming Video File", "Video file encoded for Smooth Streaming on a Microsoft IIS Web server; saves an MPEG-4 (.MP4) file in a fragmented format, which stores the video in smaller parts within the overall video container; provides a suitable format for streaming because the video can be requested one fragment at a time.", "Windows, ", "['Microsoft IIS', 'mp4split']"], "ismclip": ["iStopMotion Animation Clip", "Animation clip created by iStopMotion, a program used for making stop sequence animation clips; stores a series of frames that comprise the animation clip; also stores effects, audio, and any other video clip information.", "Mac, ", "['Boinx iStopMotion 3']"], "ismc": ["Smooth Streaming Client Manifest File", "File used by Smooth Streaming, an extension for Microsoft's IIS Web server for streaming multimedia content; hosted on the IIS Web server and contains information about the codecs, resolutions, and fragments (the video chunks in .ISMV files) for hosted multimedia files; saved in an XML format.", "Windows, ", "['Microsoft IIS']"], "isma": ["IIS Smooth Streaming Audio File", "Audio file created for Smooth Streaming on a Microsoft IIS Web server; saves encoded audio that is suitable for streaming over the Internet; may incorporate DRM protection and encryption; uses Microsoft's Protected Interoperable File Format (PIFF), which is based on the MPEG-4 format.", "Windows, ", "['Microsoft IIS']"], "ism": ["IIS Smooth Streaming Manifest File", "File used by the Smooth Streaming extension of Microsoft's IIS Web server; uses XML formatting and contains bit rate and track information for audio (.ISMA) and video (.ISMV) files hosted on the Web server for streaming; saved in the same server directory as the multimedia files; allows the server to know which bit rates map to which multimedia files, which is useful for determining the streaming quality after negotiating the connection speed with a client.", "Windows, Windows, ", "['Microsoft IIS']['Flexera InstallShield']"], "ish3": ["Animation-ish Advanced-ish Document", "Advanced drawing sequence, or \"Advanced-ish,\" created by Animation-ish, a creative drawing application for K-12 students; stores a sequence of frames drawn by the student; used for storing creative thinking ideas and presenting them.", "Windows, Mac, ", "['FableVision Animation-ish']['FableVision Animation-ish']"], "ish2": ["Animation-ish FlipBook-ish Document", "Flipbook, or \"Flipbook-ish,\" document created by Animation-ish, a drawing creativity application; contains a sequence of frames, which are drawn by the user; can be animated in the software at multiple speeds.", "Windows, Mac, ", "['FableVision Animation-ish']['FableVision Animation-ish']"], "ish1": ["Animation-ish Wiggledoodle-ish Document", "Drawing doodle, or \"Wiggledoodle-ish,\" created by Animation-ish, an educational drawing and animation program; contains a sequence of three drawing frames, each of which can store brush strokes and color fills; can be animated in the software after the frames are drawn.", "Windows, Mac, ", "['FableVision Animation-ish']['FableVision Animation-ish']"], "ish": ["ISH Compressed Archive", "File or files compressed using ISH compression (more common in Japan).", "Windows, ", "[]"], "isf": ["Inspiration Flowchart Document", "Flowchart, also called a \"concept map,\" created with Inspiration, an educational diagraming program; used by students for planning, researching, and completing projects; can be viewed as a visual diagram or in a textual outline format.", "Windows, Mac, ", "['Inspiration Software Inspiration']['Inspiration Software Inspiration']"], "ise": ["InstallShield Express Project File", "Project file created by InstallShield Express, a program that allows users to create Windows installers; contains project settings and code, including installation file names, target locations, and dialog settings; used to build an installation package.", "Windows, Windows, ", "['Flexera InstallShield']['Xilinx ISE Design Suite']"], "isallic": ["iSale License File", "File used by iSale, an application that helps you sell items through eBay; contains data that verifies the purchase of the iSale application and the use of the application on the computer, such as your equinux ID.", "Mac, ", "['equinux iSale']"], "isd": ["Flexera InstallShield Dialog Box File", "File created by InstallShield, a program used for creating Windows program installers; contains a saved dialog box that can be imported or exported into an installer; used for inserting dialog box templates and custom dialog boxes into an installer sequence; can be \"interior\" or exterior\".", "Windows, ", "['Flexera InstallShield']"], "isc": ["Xilinx Device Configuration File", "Settings file that stores configuration information for a Xilinx ISE (Integrated Software Environment) project; used for programming customizable integrated circuits, such as  field-programmable gate arrays (FPGAs).", "Windows, Linux, ", "['Xilinx ISE Design Suite']['Xilinx ISE Design Suite']"], "is2": ["Thermal Image Data File", "An IS2 file is a thermal image data file created by Fluke thermal imager devices, such as Ti90, Ti95, Ti100 series, and Ti200.  It contains image data, which includes raw and calibrated temperatures, an RGB image, and metadata, recorded by the thermal imager device.", "iOS, ", "['Fluke SmartView Mobile']"], "isaletemplate": ["iSale Template", "Template created by iSale, an application that assists you in selling items through eBay; contains a layout used to present items on eBay; organized under different categories, such as Beauty, Books, Fashion, and Music.", "Mac, ", "['equinux iSale']"], "isale": ["iSale Auction", "File created by iSale, a program that helps you sell items through eBay; contains an auction; includes information such as the layout, eBay site location, category, duration, payment options, shipping method, and starting price.", "Mac, ", "['equinux iSale']"], "is1": ["M3 Sakura Real-Time Save 1 File", "Data file created by M3 Sakura, a loader for the Nintendo DS that runs on the M3DS Real and M3i Zero flashcarts; stores the state of a game as it is played; used for saving game snapshots, even when the game does not allow you to save at that time.", "Windows, Windows, Linux, ", "['M3 Sakura']['Synergex Synergy/DE']['Synergex Synergy/DE']"], "irx": ["Brewer Irradiation File", "Contains irradiance data used for calibrating lamps in UVBrewer, a Brewer UV data analysis program; includes the responsitivity and irradiance properties of a specific lamp calibrated in UVBrewer.", "Windows, ", "[]"], "irs": ["Adobe Save For Web Settings", "Settings file created by Adobe Photoshop and Illustrator; contains settings for the \"Save for Web\" dialog; stores the image format (GIF, JPEG, PNG-8, PNG-24, or WBMP), quality, size, and other optimization options; enables Web designers to save multiple images that have the same formatting and quality specifications.", "Windows, Mac, ", "['Adobe Photoshop CC 2017', 'Adobe Illustrator CC 2017']['Adobe Photoshop CC 2017', 'Adobe Illustrator CC 2017']"], "irp": ["Internet Researcher Project File", "Project file created by Internet Researcher, a program that allows users to download websites and browse them offline; contains project settings as well as Web page content, such as .HTML, JavaScript (.JS), and image files.", "Windows, ", "[]"], "irf": ["CCTV DVR H.264 Video File", "Video file format recorded by some CCTV (closed-circuit television) DVRs, such as iVIEW Technology DVRs; saves H.264 video in a proprietary container format, but can be played back with the iFile Playback program and converted to .AVI files with the Irftool program.", "Windows, ", "['iVIEW Technology Irftool', 'iVIEW Technology iFile Playback']"], "irrmesh": ["Irrlicht Static Mesh File", "Mesh file created by Irrlicht, an open source 3D engine written in C++; written in the XML format; contains mesh data which is linked to nodes contained in .IRR files that are referenced by Irrlicht to create game scenes; mesh data includes bounding box descriptions and parameters for vertices and indices.", "Windows, Mac, Linux, ", "['Irrlicht', 'Ambiera CopperCube 5']['Irrlicht', 'Ambiera CopperCube 5']['Irrlicht', 'Ambiera CopperCube 5']"], "irr": ["Irrlicht 3D Scene", "3D file created by Irrlicht, an open source 3D engine written in C++; contains a scene graph, which includes particle systems, animators, and materials in XML format that are referenced by Irrlicht to create game scenes; may include user data, such as links to .IRRMESH mesh files, for scene nodes contained in the file.", "Windows, Mac, Linux, Windows, ", "['Irrlicht', 'Ambiera CopperCube irrEdit']['Irrlicht', 'Ambiera CopperCube irrEdit']['Irrlicht', 'Ambiera CopperCube irrEdit'][]"], "iros": ["Adobe Save For Web Settings File", "Properties file created by Adobe Photoshop and Adobe Illustrator; stores settings for the \"Save for Web\" tool; saves the image format (JPEG, PNG-8, PNG-24, GIF, or WBMP), quality, size, and other optimization options; used for producing Web page images that use the same image format and quality specifications.", "Windows, Mac, ", "['Adobe Photoshop CC 2017', 'Adobe Illustrator CC 2017']['Adobe Photoshop CC 2017', 'Adobe Illustrator CC 2017']"], "irock": ["intelliRock Sensor Data File", "Data file format used by intelliRock and intelliRock II concrete measurement devices; records physical properties of in-place concrete in real-time.", "Windows, ", "[]"], "ircp": ["SpeedGrade IRIDAS Composite File", "File created by Adobe SpeedGrade, a color grading application used in video production; saves a timeline of video clips as well as color settings and masks to be applied to each clip; used for adjusting the color of videos and may be used for color correction or for giving a certain look and feel (e.g., cold or warm look) to video during post production.", "Windows, Mac, ", "['Adobe SpeedGrade CC 2017']['Adobe SpeedGrade CC 2017']"], "iqy": ["Internet Query", "Contains a URL and other parameters for making a query over the Internet; allows information to be retrieved from an .ASP Web page and imported into Microsoft Excel; saved in the \\Program Files\\Microsoft Office\\Queries directory by default.", "Windows, Mac, ", "['Microsoft Excel 2016', 'Microsoft Notepad', 'text editor']['Microsoft Excel 2016', 'Apple TextEdit']"], "ipynb": ["Jupyter Notebook", "An IPYNB file is a notebook document used by Jupyter Notebook, an interactive computational environment designed to help scientists work with the Python language and their data.  It contains all the content from the Jupyter Notebook web application session, which includes the inputs and outputs of computations, mathematics, images, and explanatory text.  IPYNB files can be exported to .HTML, .PDF, reStructuredText, and LaTeX formats.", "Windows, Mac, Linux, Web, ", "['Jupyter Notebook']['Jupyter Notebook']['Jupyter Notebook']['Jupyter Notebook Viewer']"], "ipx": ["IPIX Image", "Image file created by IPIX image authoring tools, which are used to create 360 degree images; contains a full-360 degree, full-environment still photograph or rendering that has been stitched together from multiple images; stores settings for scripting, panning, zooming, and movement.", "Windows, Mac, Linux, ", "['Minds-Eye-View IPIX Viewer', 'Minds-Eye-View IPIX Interactive Studio', 'Minds-Eye-View IPIX i-Linker', 'Minds-Eye-View IPIX Browser Plug-in', 'Minds-Eye-View IPIX Java Viewer']['Minds-Eye-View IPIX Viewer', 'Minds-Eye-View IPIX Interactive Studio', 'Minds-Eye-View IPIX i-Linker', 'Minds-Eye-View IPIX Browser Plug-in', 'Minds-Eye-View IPIX Java Viewer']['Minds-Eye-View IPIX Java Viewer']"], "ipsw": ["iPod and iPhone Software Update File", "Contains data used by Apple iTunes for software restores and minor updates to the iPhone and iPod Touch; can be deleted if corrupted, which will allow iTunes to download a new copy of the software update.", "Windows, Mac, Linux, ", "['Apple iTunes', 'iPhone Dev Team redsn0w']['Apple iTunes', 'iPhone Dev Team PwnageTool']['iPhone Dev Team redsn0w']"], "iptheme": ["IconPackager Raw Theme File", "File used by IconPackager, a program that allows users to create Windows icons; contains settings for an icon theme, including which packaged icons map to which Windows icons; used to save and load IconPackager themes.", "Windows, ", "['Stardock IconPackager']"], "ipt": ["Inventor Part File", "Part or object created with Autodesk Inventor, a program for designing three-dimensional prototypes; consists of a single 2D or 3D object that can be combined with other parts in an assembly (.IAM) file.", "Windows, Mac, Web, iOS, Android, Windows Phone, ", "['Autodesk Inventor 2017', 'Autodesk Inventor View 2017', 'Autodesk Fusion 360', 'SpaceClaim Engineer']['Autodesk Fusion 360']['Autodesk Fusion 360']['Autodesk Fusion 360']['Autodesk Fusion 360']['Autodesk Fusion 360']"], "ipspot": ["iPhoto Spot File", "File created by iPhoto, a photo editing application; contains location of other data referenced by the iPhoto application; not meant to be manually opened.", "Mac, ", "['Apple iPhoto 9.6']"], "ips": ["Internal Patching System Patch File", "Patch (or update) for a common game ROM that can contain graphics, models, and other data; used mainly for small patches less than 16MB in size; can be modified and applied to games using various IPS software utilities.", "Windows, Mac, Linux, ", "['CodeIsle IPS Peek'][][]"], "iproject": ["iClone Project File", "Project file created by iClone, a program used for 3D animation; contains project settings and assets such as backgrounds, props, avatars, animations, music, and other editable 3D media files; used to save and load iClone projects; may be exported to video file formats, including .AVI and .WMV.", "Windows, ", "['Reallusion iClone']"], "ipr": ["InstallShield Professional Project File", "Project file created by InstallShield Professional, a program used for creating InstallScript-based installation packages; contains project information, including settings, directory structures, scripts, and installer dialog settings.", "Windows, Windows, Mac, Linux, Mac, iOS, ", "['Flexera InstallShield']['Jetbrains IntelliJ IDEA']['Jetbrains IntelliJ IDEA']['Jetbrains IntelliJ IDEA']['iProcrastinate']['iProcrastinate']"], "ipp": ["Inline Guard Macro File", "C++ source code file that contains inline functions for a program; wraps functions with a macro that can include or exclude the functions when running a program; used to turn off inlining functions during the debugging process, and turn them back on again for production code.", "Windows, Mac, Linux, ", "['Microsoft Visual Studio 2017', 'Eclipse CDT']['Eclipse CDT']['Eclipse CDT']"], "ipod": ["Rockbox Firmware File", "System file used by Rockbox, a custom firmware for iPods, SanDisk MP3 players, and other portable music players; saves system-level data and bootloader binaries that are used to run the operating system.", "Windows, Mac, Linux, ", "['Rockbox Utility']['Rockbox Utility']['Rockbox Utility']"], "ipn": ["Inventor Presentation File", "Presentation file created by Inventor, a CAD program used to develop and simulate mechanical designs; stores animations and still shots of parts and assemblies used in a 3D design; may also store the viewing angle and distance, as well as animation behaviors.", "Windows, ", "['Autodesk Inventor 2017']"], "ipmeta": ["Apple iPhoto Metadata File", "Metadata file used by Apple iPhoto, a program used to manage digital photos; stores information about the user's library of images; stores the schema for the metadata as well as search, browsing, organization, and previewing information used by iPhoto.", "Mac, ", "['Apple iPhoto 9.6']"], "ipl": ["GTA Item Placement File", "Game file used by some Grand Theft Auto (GTA) games such as GTA III and GTA: Vice City; saves item placement information within a map and may include objects, spawn points, weapon locations, and custom zone information; saved in a text format and can be edited with a text editor.", "Windows, ", "['Rockstar Games Grand Theft Auto 3', 'Rockstar Games Grand Theft Auto: Vice City']"], "iplb": ["iPhoto Library Archive Document", "Library file created by iPhoto, an image organizer and editor; contains data referenced by iPhoto's Library feature; not meant to be manually opened.", "Mac, ", "['Apple iPhoto 9.6']"], "ipj": ["Inventor Project File", "Project file created by Autodesk Inventor, CAD application used for 3D mechanical design; saved in an XML format and contains reference paths to the files used in an Inventor project; used for locating project files.", "Windows, ", "['Autodesk Inventor 2017']"], "ipk": ["Itsy Package", "Compressed archive format derived from the Debian package (.DEB) format; used for handheld software installations.", "Linux, ", "[]"], "ipick": ["iPick Football Image", "Image used by iPick Football, an iOS and Android app used to record and share NFL weekly football picks; stores a JPEG image depicting NFL football picks (winners, confidence rankings) for a given week of the NFL season; also stores actual pick data as EXIF metadata within the JPEG image.", "iOS, Android, ", "['iPick Football']['iPick Football']"], "iphotoproject": ["iPhoto Print Project", "Printing file created by iPhoto, a photo editing application; created when an image is selected to be printed; contains data referenced for printing purposes.", "Mac, ", "['Apple iPhoto 9.6']"], "iphoto": ["iPhoto Library File", "File created by iPhoto, an image organizer; contains information from imported photos such as image size and format; located in subfolders of iPhoto.", "Mac, ", "['Apple iPhoto 9.6']"], "ipd": ["BlackBerry Backup File", "Saved data from a BlackBerry mobile phone; created when a BlackBerry is backed up to a computer; saved in a database format and includes all data from the phone; can be used to restore a BlackBerry if the software on the phone becomes corrupted.", "Windows, Mac, ", "['Research In Motion BlackBerry Desktop Manager', 'Reincubate BlackBerry Backup Extractor']['Research In Motion BlackBerry Desktop Manager']"], "ipg": ["iPod Game File", "Installer package for an iPod-based video game; contains installation files in a compressed .ZIP archive; can be installed on an iPod using Apple iTunes.", "Windows, Mac, ", "[][]"], "ipf": ["Interchangeable Preservation File", "Preservation format used to preserve the content of Amiga floppy disks; formatted similarly to the .IFF (Interchangeable File Format) used  on Amiga systems; developed by the Software Preservation Society (SPS) as a means of saving and archiving Amiga games and programs that are no longer developed.", "Windows, Windows, Windows, Windows, Mac, Linux, ", "['WinUAE']['Microsoft System Management Server']['Xilinx ISE Design Suite']['text editor']['text editor']['text editor']"], "ipch": ["Intellisense Precompiled Header File", "Developer file used by Microsoft Visual C++, an IDE used for Windows C++ programming; contains precompiled header information used by Intellisense, Microsoft's code assistance module used for code hinting, documentation, and autocompletion while the programmer types source code.", "Windows, ", "['Microsoft Visual Studio 2017']"], "ipcc": ["iPhone Carrier Bundle", "Zip archive created to hold all carrier customized settings for iPhones; organizes data such as voice mail numbers and APN settings; contains the Payload folder, which holds the bundle and symbolic link.", "Windows, Mac, ", "['Apple iTunes']['Apple iTunes']"], "ipalias": ["iPhoto Alias File", "File created by iPhoto, a photo editor and organizer; created to assist applications that are older, 3rd party, or non-updated to link to the original photo file; hidden in the iPhoto library; not meant to be opened by the user and should not be deleted.", "Mac, ", "['Apple iPhoto 9.6']"], "ipa": ["iOS Application", "Program written for Apple iOS devices such as the iPhone, iPod Touch, or iPad; downloaded from the Apple iTunes App Store and can be transferred to the iOS device via iTunes when the device is connected to the computer.", "Windows, Mac, iOS, ", "['Apple iTunes']['Apple iTunes']['Apple iOS']"], "ip": ["IconPackager Theme File", "Collection or \"package\" of icons saved as a desktop theme by IconPackager; can be used to replace most of Windows' standard icons with custom variations; may contain anywhere from only a few icons to more than a hundred.", "Windows, ", "['Stardock IconPackager', '7-Zip']"], "ioplist": ["Mac OS X IOPLIST File", "Apple .PLIST file used by Mac OS X; uses the \".ioplist\" extension instead of the standard \".plist\" extension; used for saving and caching information for Mac OS X Kernel extensions (.KEXT) and other system uses.", "Mac, ", "['Apple OS X']"], "ion": ["File Description File", "Text-based file used for describing the contents of another file or files; may specify the other files' filename, file extension, metainfo, and other information; often named descript.ion; used by file system managers and software programs for organizing and reading file information.", "Windows, ", "['4DOS', 'Microsoft Notepad', 'text editor']"], "iobit": ["Advanced SystemCare Rollback File", "File created by Advanced SystemCare, a program used for repairing the Windows registry and cleaning up unwanted files; saved as the file ntuser.dat.iobit in the C:\\[user]\\ directory and contains information that allows registry modifications made by Advanced SystemCare to be rolled back.", "Windows, ", "['IObit Advanced SystemCare']"], "internetconnect": ["Apple Internet Connect Document", "Document created for Apple's System Preferences, an application included on the Apple operating system; contains data that assists your computer connect and disconnect to your ISP and to your bluetooth devices.", "Mac, ", "[]"], "inx": ["Adobe InDesign Interchange File", "Document exported by Adobe InDesign in XML format; completely describes an InDesign (.INDD) file, including pages, page content, text frames, colors, margins, guides, etc.", "Windows, Mac, Windows, Mac, Linux, Windows, ", "['Adobe InDesign CC 2017']['Adobe InDesign CC 2017']['Inkscape']['Inkscape']['Inkscape']['Flexera InstallShield']"], "inv": ["INVedit File", "File created by INVedit, a program used to create and modify inventories for the game Minecraft; contains game inventory item information, such as resources, weapons, mining tools, and other equipment; also stores quantities of each inventory item.", "Windows, ", "['INVedit', 'MCEdit']"], "int": ["Fallout Compiled Script", "Compiled script written for Fallout 1 & 2 to animate the Fallout environment; stores the compiled version of an .SSL file, which dictates the behavior of objects on the maps, NPC character existence, dialogue between characters, and other gameplay elements. ", "Windows, Windows, Mac, Linux, Windows, Mac, Linux, iOS, Android, Windows, ", "['Jargo Fallout Script Editor', 'Bethesda Softworks Fallout 1', 'Bethesda Softworks Fallout 2']['ACD Systems Canvas X 2017', 'ACD Systems ACDSee 20', 'XnViewMP']['XnViewMP']['XnViewMP']['Epic Games Unreal Engine']['Epic Games Unreal Engine']['Epic Games Unreal Engine']['Epic Games Unreal Engine']['Epic Games Unreal Engine']['Sony Picture Motion Browser']"], "ino": ["Arduino Sketch File", "Software program created with Arduino, an open-source electronics prototyping platform; contains source code written in the Arduino programming language; used for controlling an Arduino circuit board.", "Windows, Mac, Linux, ", "['Arduino']['Arduino']['Arduino']"], "inprogress": ["Time Machine Backup Progress File", "Backup file created by Time Machine, the default backup program included with Mac OS X 10.5 and later; stores the backup progress of files as they're being backed up and is removed when the backup process is complete.", "Mac, ", "['Apple Time Machine']"], "ins": ["LaTeX Installer Script", "Installer script used by LaTeX typesetting software; often distributed with a .DTX DOCTex package and contains instructions for extracting the DTX content into separate files, such as .STY or .TEX files.", "Windows, Mac, Linux, Windows, Mac, Windows, Mac, Windows, Windows, Windows, Mac, Windows, Windows, ", "['MiKTeX', 'TeXworks', 'Texmaker', 'text editor']['LyX/Mac', 'TeXworks', 'Texmaker', 'text editor']['Texmaker', 'text editor'][][]['Propellerhead ReCycle', 'FMJ-Software Awave Studio']['Propellerhead ReCycle']['Microsoft Windows', 'Microsoft Internet Explorer'][]['Inspiration Software Inspiration']['Inspiration Software Inspiration']['Reality Adlib Tracker', 'Adlib Tracker II']['AGiliTy']"], "inp": ["Urdu InPage Document", "An INP file is a document created by Urdu InPage, a multilingual publishing application for the Urdu, Arabic, Persian, and English languages.  It contains text saved in the Noorinastaliq font, which displays Urdu in nastaliq script.  INP files also support standard page layout formatting.", "Windows, Windows, Windows, Windows, Mac, Windows, Mac, ", "['Concept Software Urdu InPage']['Dassault Systemes Abaqus']['Sony Picture Motion Browser']['gretl']['gretl']['MAME', 'ExtraMAME']['MacMAME', 'MAME OS X']"], "inms": ["Adobe InDesign Menu Set File", "Settings file used by Adobe InDesign, a program used to create professional page layouts; contains the hide or show settings for menu items, as well as the location of the menu items; used for customizing the user interface.", "Windows, Mac, ", "['Adobe InDesign CC 2017']['Adobe InDesign CC 2017']"], "inm": ["FaxMaster Document", "Fax document created by FaxMaster, an older faxing/OCR program for Windows.", "Windows, ", "[]"], "inlk": ["Adobe InDesign Lock File", "Document lock file created by Adobe InDesign, a professional page layout program; created when an InDesign document (.INDD file) is opened so that other instances of InDesign show warnings when trying to open or edit the document.", "Windows, Mac, ", "['Adobe InDesign CC 2017']['Adobe InDesign CC 2017']"], "inl": ["C++ Inline File", "Source code file used by Microsoft C++ compilers; contains inline functions that can be included into C++ programs; used for storing reusable program components.", "Windows, ", "['Microsoft Visual Studio 2017']"], "inform": ["Inform Project", "Project created by Inform, an IDE that enables you to create Interactive Fiction (IF) programs used by Z-code interpreters, such as Zoom or Frotz; contains project contents, such as the story, index data, and source files used to build a game.", "Windows, Mac, Linux, ", "['Inform']['Inform']['Inform']"], "ing": ["MasterCook Ingredients File", "Contains a list of ingredients referenced by the MasterCook cooking program", "Windows, ", "['ValuSoft MasterCook']"], "ink": ["Mimio Ink Data File", "\"Electronic whiteboard\" format saved by Mimio, a program that allows the user to draw on a tablet computer screen using a digital pen; records notes, diagrams, charts, and illustrations drawn on the whiteboard in Digital Ink Recording mode; saves data in an object-based vector format.", "Windows, Mac, Linux, Windows, Mac, Linux, Windows, Windows, ", "['MimioStudio']['MimioStudio']['MimioStudio']['Core InkML Libraries']['Core InkML Libraries']['Core InkML Libraries']['CorelDRAW Graphics Suite X8'][]"], "ini": ["Windows Initialization File", "An INI file is a configuration file used by Windows programs to initialize program settings.  It contains sections for settings and preferences (delimited by a string in square brackets) with each section containing one or more name and value parameters.", "Windows, Mac, Windows, Windows, Mac, Windows, Mac, ", "['File Viewer Plus', 'Microsoft Windows', 'Microsoft Notepad', 'Microsoft WordPad', 'text editor']['Parallels Desktop for Mac with Windows installed']['FMJ-Software Awave Studio']['text editor']['text editor']['MakeMusic Finale']['MakeMusic Finale']"], "infopathxml": ["Microsoft InfoPath Form", "File created by InfoPath, a program used for making document forms; saves a form and can be used as an alternative to the .XSN extension, which is the default used by InfoPath; used for saving form designs.", "Windows, ", "['Microsoft InfoPath']"], "info": ["Texinfo Document", "Formatted information document created by Texinfo, a GNU Project help document generation tool; stores documentation in a book format with chapters, sections, and subsections; can contain up to four layers of depth.", "Linux, Windows, Mac, Linux, Windows, Windows, Windows, Mac, Linux, ", "['GNU Texinfo', 'GNU Emacs']['Microsoft Notepad', 'Microsoft WordPad', 'Notepad++', 'text editor']['Apple TextEdit', 'Bare Bones TextWrangler', 'MacroMates TextMate', 'text editor']['gedit', 'GNU Emacs', 'text editor']['Minecraft Forge']['Canon ZoomBrowser EX']['Drupal', 'text editor']['Drupal', 'text editor']['Drupal', 'text editor']"], "inf_loc": ["Windows Driver Information Cache File", "File used by Windows for storing information about drivers; used internally by Windows when installing and configuring drivers; acts as a cache for driver data; saved in a plain text format and can be viewed with a text editor such as Notepad.", "Windows, ", "['Microsoft Windows']"], "inf": ["Setup Information File", "An INF file is a plain text configuration file that defines what files are installed with a certain software program or update.  It may also list the location of the files and the directories where the files are to be installed.  INF files are used by the Windows operating system, or by the program or installer that includes the INF file.", "Windows, Mac, ", "['File Viewer Plus', 'Microsoft Windows', 'Microsoft Notepad', 'text editor']['MacroMates TextMate', 'text editor']"], "indp": ["Adobe InDesign CS3 Package File", "Package used by InDesign, a desktop publishing program used to create professional page layouts; stores the changes that have been made to a .INCP package by an editor; used to import finished content back into an InDesign document (.INDD file).", "Windows, ", "['Adobe InCopy CC 2017', 'Adobe InDesign CC 2017']"], "indt": ["Adobe InDesign Template", "Page layout template for designing pages in Adobe InDesign; typically used when creating multiple pages that have a similar format; may be included with the InDesign software or created by the user.", "Windows, Mac, ", "['Adobe InDesign CC 2017', 'QuarkXpress with ID2Q XTension']['Adobe InDesign CC 2017', 'QuarkXpress with ID2Q XTension']"], "inetloc": ["Internet Location", "Shortcut to an Internet location, such as an RSS feed or a telnet location; contains the server address and possibly a username and password for SSH and telnet connections; can be created by typing a URL in a text editor and dragging the text to the Desktop", "Mac, ", "['Apple Finder', 'Apple Safari', 'Apple Terminal']"], "inds": ["Adobe InDesign Snippet File", "Snippet created by InDesign, a professional page layout program; contains a subset of an InDesign document, such as a page item or a group of page items; stored in an XML format; used to export and reuse portions of a document.", "Windows, Mac, ", "['Adobe InDesign CC 2017', 'Adobe InCopy CC 2017']['Adobe InDesign CC 2017', 'Adobe InCopy CC 2017']"], "indk": ["Adobe Shortcut Set File", "Keyboard shortcuts file used by InDesign and InCopy, which are page layout and publishing programs; stores hotkeys and key combinations used to activate program functions; used for backing up a shortcut set, or exporting shortcuts to another InDesign installation.", "Windows, Mac, ", "['Adobe InDesign CC 2017', 'Adobe InCopy CC 2017']['Adobe InDesign CC 2017', 'Adobe InCopy CC 2017']"], "indesignplugin": ["Adobe InDesign Plug-in", "Plugin file used by Adobe InDesign, a professional page layout application; adds new features to the program, such as UI components, file format support, and page layout options; can be written by third-party developers.", "Windows, Mac, ", "['Adobe InDesign CC 2017', 'Adobe InCopy CC 2017']['Adobe InDesign CC 2017', 'Adobe InCopy CC 2017']"], "indl": ["Adobe InDesign Library", "Object library created by InDesign, an application used to create professional page layouts; may contain graphics, text, and pages, as well as ruler guides, grids, drawn shapes, and grouped images; allows users to organize and reuse common page elements together.", "Windows, Mac, ", "['Adobe InDesign CC 2017']['Adobe InDesign CC 2017']"], "indd": ["Adobe InDesign Document", "An INDD file is a professional page layout project created with Adobe InDesign.  It includes page formatting information, page content, linked files, styles, and swatches.  INDD files are commonly used for creating and formatting books, magazines, newspapers, flyers, and brochures.", "Windows, Mac, ", "['Adobe InDesign CC 2017', 'Adobe InCopy CC 2017', 'QuarkXPress with ID2Q XTension']['Adobe InDesign CC 2017', 'Adobe InCopy CC 2017', 'QuarkXPress with ID2Q XTension', 'Stellar Phoenix InDesign Repair']"], "indb": ["Adobe InDesign Book File", "Book file created by Adobe InDesign, a professional page layout and publishing program; contains multiple .INDD documents, which comprise the pages and chapters of the book; also stores the page numbers, indexes, and other formatting information.", "Windows, Mac, ", "['Adobe InDesign CC 2017']['Adobe InDesign CC 2017']"], "ind": ["Adobe InDesign Document", "Document created with InDesign, a professional print and digital layout program; may include formatted text, links, images, and other embedded media; supports multiple pages and page transitions.", "Windows, Mac, Windows, Mac, ", "['Adobe InDesign CC 2017']['Adobe InDesign CC 2017'][][]"], "incx": ["InCopy CS3 Interchange File", "File used by InCopy, a word processing program used with the Adobe InDesign page layout application; contains page layout graphics and frames that are exported from InDesign; used to submit a subset of an .INDD file for editing.", "Windows, Mac, ", "['Adobe InCopy CC 2017', 'Adobe InDesign CC 2017']['Adobe InCopy CC 2017', 'Adobe InDesign CC 2017']"], "incp": ["InCopy CS3 Package File", "Package used by InCopy, a professional writing and editing program that tightly integrates with the Adobe InDesign page layout program; contains an .INCA file and its associated .INCX files; used to package a subset of an InDesign document for remote editing.", "Windows, Mac, ", "['Adobe InCopy CC 2017', 'Adobe InDesign CC 2017']['Adobe InCopy CC 2017', 'Adobe InDesign CC 2017']"], "inct": ["InCopy Template", "Template created by InCopy, a writing and editing program that integrates with Adobe InDesign; contains default frames, text, and graphics for a single .INCX file; used to create pages with elements that have the same look and feel.", "Windows, Mac, ", "['Adobe InCopy CC 2017']['Adobe InCopy CC 2017']"], "incd": ["InCopy Document", "File used by Adobe InCopy, a professional writing program that integrates with Adobe InDesign; contains document text, graphics, page formatting, and styles; often used for editing smaller portions of a larger document.", "Windows, Mac, ", "['Adobe InCopy CC 2017', 'Adobe InDesign CC 2017']['Adobe InCopy CC 2017', 'Adobe InDesign CC 2017']"], "inca": ["InCopy CS3 Assignment File", "File used by InCopy, a word processor that integrates with the Adobe InDesign page layout program; contains page element previews from a subset of an InDesign document (.INDD file), as well as access permissions for modifying associated .INCX linked content files; used to divide the work necessary for editing a publication.", "Windows, Mac, ", "['Adobe InCopy CC 2017', 'Adobe InDesign CC 2017']['Adobe InCopy CC 2017', 'Adobe InDesign CC 2017']"], "inc": ["Include File", "Text file containing declarations, headers, functions, or other data referenced by a program's source code; can be used with C/C++, Pascal, Java, PHP (Web pages), and other languages.", "Windows, Mac, Linux, ", "['File Viewer Plus', 'Microsoft Visual Studio 2017', 'Adobe Dreamweaver CC 2017', 'text editor']['MacroMates TextMate', 'Bare Bones BBEdit', 'Bare Bones TextWrangler', 'Adobe Dreamweaver CC 2017', 'text editor']['GNU Emacs', 'Vim']"], "in": ["Input File", "File used by the Consolidated Model of Fire and Smoke Transport (CFAST), a program used to model fire and smoke impact on buildings; contains input data, like room specifications, accessed by the program to model fire and smoke effects.", "Windows, Mac, Windows, ", "['CFAST', 'text editor']['text editor'][]"], "imz": ["WinImage Compressed Disk Image", "Compressed disk image created with WinImage, a disk image utility; contains an exact copy of a physical disk, but is also compressed to save disk space; can be mounted as a physical disk when opened with WinImage.", "Windows, ", "['Gilles Vollant WinImage']"], "imy": ["iMelody Ringtone File", "Monophonic ringtone format developed by the irDa (infrared communications) association; supports volume modification and special codes that can control the phone's backlight, LED lights, and vibration.", "Windows, Mac, Android, ", "['FMJ-Software Awave Studio'][]['File Viewer for Android']"], "imx": ["iMindMap Map File", "Map file used by iMindMap, a mind mapping application that helps users organize their ideas; contains a map of the user's central idea, which may include branches, text, flowcharts, and sketches.", "Windows, Mac, iOS, Android, ", "['ThinkBuzan iMindMap']['ThinkBuzan iMindMap']['ThinkBuzan iMindMap']['ThinkBuzan iMindMap']"], "imtx": ["iMindMap Template File", "Template used by iMindMap, a program that allows users to organize their ideas in one location; similar to the .IMX file as it contains a map of the user's central idea; may include branches, text, images, flowcharts, and sketches.", "Windows, Mac, iOS, Android, ", "['ThinkBuzan iMindMap']['ThinkBuzan iMindMap']['ThinkBuzan iMindMap']['ThinkBuzan iMindMap']"], "imt": ["My Time Data File", "Data file created by Intuit My Time, a time tracking application for Mac OS X; saves timesheet information in an XML format; can be imported into QuickBooks 2010 for Mac.", "Mac, ", "['Intuit My Time', 'Intuit QuickBooks for Mac 2016']"], "imr": ["Impromptu Report File", "Report file created by Cognos Impromptu, an IBM application used for generating reports from different data sources; saves the page layout information and includes references to the data sources that supply the data for the report's fields; used for generating business reports.", "Windows, Linux, ", "['IBM Cognos Impromptu']['IBM Cognos Impromptu']"], "imp": ["Improv Spreadsheet", "Native spreadsheet file created by the Lotus Improv application; divides data, views of the data, and formulas into three segments, which is different than most spreadsheet applications and makes it difficult to transfer to more common applications like Excel.", "Windows, Windows, ", "['Lotus Improv']['Adobe Audition CC 2017']"], "imovieproject": ["iMovie Project", "Video project created with iMovie, a video-editing program included with Apple's iLife software; contains the timeline, video and audio clips, titles, chapter markers, and effects used in the movie.", "Mac, ", "['Apple iMovie 10', 'Roxio Toast 15']"], "imovieproj": ["iMovie Project File", "Video-editing project created with Apple iMovie; contains video and audio clips and a timeline for organizing the clips into a movie; may also include special effects, text overlays, and chapter markers for exporting to a DVD.", "Mac, ", "['Apple iMovie 10', 'Apple Final Cut Pro X', 'Roxio Toast 15']"], "imoviemobile": ["iOS iMovie Project File", "Project file created and used by the mobile version of iMovie, a video editing application for iOS; contains an iMovie project, similar to the .RCPROJECT file; includes the project timeline, effects, transitions, audio tracks, and other project settings. ", "Mac, iOS, ", "['Apple iMovie 10']['Apple iMovie']"], "imovielibrary": ["iMovie Library File", "Library archive created and used by iMovie 10 and later, a video editing application; contains files that make up a user's iMovie library, which includes dated folders with IMOVIEEVENT files and media folders with project contents.", "Mac, ", "['Apple iMovie 10']"], "imovieevent": ["iMovie Event File", "iMovie event file created and used by iMovie, a video editing application; contains metadata describing an event in iMovie. ", "Mac, ", "['Apple iMovie 10']"], "immodules": ["GTK+ Module File", "Application support file used by programs that use the GTK+ user interface development framework; saves information used for loading GTK+ application components.", "Linux, ", "['GTK+']"], "iml": ["ACT! Internet Mail Message", "Mail message sent with ACT! contact software.", "Windows, Windows, Mac, Linux, ", "['Swiftpage Act!']['Jetbrains IntelliJ IDEA', 'Google Android Studio', 'text editor']['Jetbrains IntelliJ IDEA', 'Google Android Studio', 'text editor']['Jetbrains IntelliJ IDEA', 'Google Android Studio', 'text editor']"], "imm": ["iMindMap Map File", "Map file used by iMindMap, an application that helps users organize brainstorming sessions; contains a map of the user's central idea, with optional branches, flowcharts, sketches, and text; includes styles, such as Default, Deep Blue, Inspiration, Creative, and Impact; can be exported as a .PDF file.", "Windows, Mac, iOS, Android, ", "['ThinkBuzan iMindMap']['ThinkBuzan iMindMap']['ThinkBuzan iMindMap']['ThinkBuzan iMindMap']"], "img3": ["iPhone IMG3 File", "System file used by iPhones and iPods; contains an encrypted image that is used for loading core system software and data; can be found within iPhone software update (.IPSW) files; sometimes edited by users for creating \"jailbroken\" iPhones.", "Windows, Mac, Linux, iOS, ", "['image3decrypt', 'xpwn']['xpwn']['xpwn']['Apple iOS']"], "imga": ["Aleph One Image File", "Image file used by Aleph One, an open source gaming engine based on the first-person shooter game Marathon 2: Durandal; contains images, including graphics for the splash screen and menus; used to customize in-game graphics.", "Windows, Mac, Linux, ", "['Aleph One']['Aleph One']['Aleph One']"], "imj": ["JFIF Bitmap Image", "Variation of a .JFIF file that is based on the Microsoft Windows bitmap (.BMP) format; uses a more efficient color palette than standard bitmap images; created by Pegasus Image Corporation and is used by screensaver applications.", "Windows, Mac, ", "[][]"], "imd": ["GIS Image Metadata File", "GIS file that contains georeferencing information for a corresponding raster image, such as a GeoTIFF (.TIF); can store coordinate location information as well as the referenced raster image; maps GIS images onto real-world geography.", "Windows, Windows, ", "['ERDAS IMAGINE', 'ESRI ArcGIS for Desktop']['Microsoft VisioModeler']"], "imi": ["Magellan Map File", "Map file used by Magellan GPS navigation systems, including eXplorist and Triton devices; contains a map, including streets, topography, and points of interest; used to access map information while driving, hiking, camping, hunting, fishing, or boating.", "Windows, ", "[]"], "img": ["Disc Image Data File", "An IMG file is a disc image file created by various disc imaging applications, such as HH Software Virtual CD.  It stores an exact copy of the data on a CD or DVD and is used for backups and burning new discs.", "Windows, Mac, Windows, Windows, Windows, Linux, Windows, Linux, Windows, Mac, ", "['H+H Software Virtual CD', 'Lightning UK! ImgBurn', 'Smart Projects IsoBuster', 'EZB Systems UltraISO', 'MagicISO']['Apple Disk Utility', 'Roxio Toast 15']['Rockstar Games Grand Theft Auto 3', 'Rockstar Games Grand Theft Auto: Vice City', 'Rockstar Games Grand Theft Auto: San Andreas', 'Rockstar Games Grand Theft Auto 4', 'IMG Tool', 'SparkIV', 'OpenIV', 'ImgEd']['ERDAS IMAGINE', 'ESRI ArcGIS for Desktop', 'GDAL'][][]['RawWrite', 'DiskCopy']['RawWrite']['Adobe Photoshop CC 2017', 'CorelDRAW Graphics Suite X8', 'Corel PaintShop Pro X9', 'Corel Presentations X8']['Adobe Photoshop CC 2017']"], "imf": ["Id Music File", "Id Music File (IMF) created for use in id Software video games; contains data similar to MIDI files in that the files do not contain sampled digital audio, but rather contain musical notes; used to send music data for playback on AdLib sound cards.", "Windows, Mac, Linux, ", "['AdPlug', 'NullSoft Winamp with AdPlug plug-in', 'id Software Wolfenstein 3D', 'Apogee Duke Nukem']['CocoModX']['AdPlug']"], "ime": ["Windows Input Method Editor File", "File used by the Windows operating system for converting keystroke combinations to characters; often used when authoring Chinese or Japanese text, which requires multiple keystrokes for outputting a single character.", "Windows, ", "['Microsoft Windows']"], "imapmbox": ["IMAP Mailbox", "Folder created by Apple Mail, the default email client for Mac OS X; includes subdirectories named /Attachments/ (for storing email attachments, which may include .EMLXPART files) and /Messages/ (for storing .EMLX email messages); saves local copies of email messages from an IMAP account that has been setup in the software.", "Mac, ", "['Apple Mail']"], "ima": ["Sage ACT! Email Message", "HTML-compatible email message saved by ACT!, a contact management application; may contain plain text email message or HTML email message, and may also include one or more attachments.", "Windows, Windows, ", "['Swiftpage Act!']['WinImage', 'Nero 2017', 'EZB Systems UltraISO', 'MagicISO']"], "im4p": ["IMG4 Payload File", "An IM4P file is an IMG4 payload file used by iPad and iPhone mobile devices.  It stores a payload for an IMG4 file, which is the actual content of the file such as the firmware key and iv.", "iOS, ", "['Apple iOS']"], "imageportfoliolibrary": ["Painter Image Portfolio Library", "Library created and used by Corel Painter, an application used to create digital artwork; contains a collection of images that makes for easier and quicker image insertion onto your canvas; includes default images such as a piano, guitar, strawberry, tree, candle, and leaf.", "Windows, Mac, ", "['Corel Painter 2017']['Corel Painter 2017']"], "ilk": ["Incremental Linking File", "File used by Microsoft Visual Studio, an IDE used for developing Windows applications; contains linker data for a compiled executable file (e.g., .EXE or .DLL); enables faster project compilation and linking, especially for larger projects.", "Windows, ", "['Microsoft Visual Studio 2017']"], "ilg": ["InstallScript Log File", "An ILG file is a log file created by an InstallScript or InstallScript MSI installation.  It contains a recording of the procedures your installation performed, which allows you to analyze the performance of your installation.  ILG files can be viewed by the Log File Viewer and InstallShield Cabinet tools included with the InstallShield application.", "Windows, ", "['Flexera InstallShield']"], "ildoc": ["QuickSilver Document", "Document created with QuickSilver, a high-level desktop publishing program; may be assembled from multiple sources, including text, graphic, and database files; authored in Unicode and supports all European and Asian languages.", "Windows, Linux, ", "['BroadVision QuickSilver']['BroadVision QuickSilver']"], "image": ["Apple Disk Image", "File containing exact copy of data from a Mac-formatted disk; can be mounted on the desktop like a CD or other disk; used by Disk Copy and ShrinkWrap.", "Mac, Windows, Mac, Linux, ", "['Apple Disk Utility', 'Roxio Toast 15', 'Roxio Popcorn']['OpenQwaq']['OpenQwaq']['OpenQwaq']"], "ilbm": ["Interleaved Bitmap Image", "Bitmap image format based on the Interchange File Format (.IFF files); originally designed for use with Amiga chipsets; stores bitplanes, which contain one bit of data for each image pixel; supports bitonal and color images, as well as RLE (Run-length encoding) compression.", "Windows, Mac, Linux, ", "['ACD Systems Canvas X 2017', 'XnViewMP', 'J-T-L Development Ultimate Paint', 'IrfanView with FORMATS plug-in']['XnViewMP']['XnViewMP']"], "ikmp": ["IK Multimedia Preset FIle", "Preset created by SampleTank, a sample workstation that enables you to mix and create sound samples; contains customized settings such as channel volume, instruments, output, synth, and velocity.", "Windows, Mac, ", "['IK Multimedia SampleTank']['IK Multimedia SampleTank']"], "iix": ["Translation Memory Index File", "Contains index data for a translation memory used by Trados translation software; organizes the contents of a translation memory; will be regenerated by Trados Translator's Workbench if deleted.", "Windows, ", "[]"], "ikf": ["INTUS Keyboard File", "File used by INTUS RemoteConf, a program used for configuring INTUS terminals; contains a mapping between touchscreen events and the underlying functions that are invoked when the events are activated.", "Windows, ", "['PCS Systemtechnik INTUS RemoteConf']"], "ik": ["CryENGINE IK Animation File", "File used by the CryENGINE SDK, a program suite used for building 3D games; saves inverse kinematics (IK) data, which specifies character joint positions and movements; edited with the 3D application included with the SDK.", "Windows, ", "['Crytek CryENGINE SDK']"], "iit": ["Install Creator Project File", "File used by Install Creator, a program that allows users to make Windows program installers; contains installation settings, such as destination directory, installation file names, and Windows Start Menu location; used by Install Creator to create a Windows installer with the specified properties.", "Windows, ", "['Clickteam Install Creator']"], "iiq": ["Phase One RAW Image", "Proprietary Camera RAW format created by Phase One, a company that produces high-end digital cameras; saves a picture taken by a Phase One camera and stores the image data in a RAW, unprocessed format; supported by some image editing programs.", "Windows, Mac, ", "['File Viewer Plus', 'Phase One Capture One', 'Microsoft Windows Photos', 'Adobe Photoshop Elements 15', 'Corel PaintShop Pro X9']['Phase One Capture One', 'Adobe Photoshop Elements 15']"], "iip": ["Install Creator Pro Project File", "File created by Install Creator Pro, a program used to make Windows program installers; contains settings such as the destination directory, files to install, target Windows version, and Windows Start Menu location; used to create a Windows installer with customized properties.", "Windows, Windows, ", "['Clickteam Install Creator'][]"], "iim": ["iMacro Macro File", "Executable macro created with iMacro, an Internet automation program; may contain multiple commands that can be run in sequence; used for automating common Internet tasks.", "Windows, Mac, Linux, ", "['Mozilla Firefox with iMacros add-on']['Mozilla Firefox with iMacros add-on']['Mozilla Firefox with iMacros add-on']"], "iil": ["CleanSweep Installation Log", "Log file containing information about programs and files scanned or removed by Norton CleanSweep", "Windows, ", "['text editor']"], "iif": ["Intuit Interchange Format File", "Generic data format used by Intuit QuickBooks for exporting financial data; saved in a text-based tab-delimited format, similar to a .TSV file; can be imported by QuickBooks and most spreadsheet programs.", "Windows, Mac, ", "['Intuit QuickBooks Pro 2016', 'Microsoft Excel 2016', 'Microsoft Notepad', 'text editor']['Intuit QuickBooks for Mac 2016', 'Microsoft Excel 2016']"], "ii": ["IconWorkshop Extended Information File", "Information file created by IconWorkshop, a program used for creating custom icons for Mac OS, Windows, and Unix; stores metadata associated with an image or icon, including the title, description, author, and keywords.", "Windows, ", "['Axialis IconWorkshop']"], "ihx": ["IN-HEH Timeline Database", "Database file format used by IN-HEH Timeline, a program for creating historical databases; may include events, people, locations, and genealogical information; can be viewed as a hierarchical list or in a graphical format using the IN-HEH program.", "Windows, ", "[]"], "igs": ["IGES Drawing File", "2D/3D vector graphics format based on the Initial Graphics Exchange Specification (IGES); used by many CAD programs as a standard ASCII text-based format for saving and exporting vector data; can store wireframe models, surface or solid object representations, circuit diagrams, and other objects.", "Windows, Mac, Linux, Windows, Mac, Linux, ", "['IMSI TurboCAD Pro 2017', 'Autodesk AutoCAD with IGES Import plug-in', 'Autodesk Fusion 360', 'Nemetschek Vectorworks', 'ACD Systems Canvas X 2017', 'Oracle AutoVue', 'ideaMK IGSViewer', 'Dassault Systemes CATIA', 'Actify SpinFire Professional', 'Dassault Systemes SolidWorks', 'Siemens Solid Edge', 'CADSoftTools ABViewer']['IMSI TurboCAD Deluxe v10', 'Nemetschek Vectorworks', 'FreeCAD']['FreeCAD']['Glare Technologies Indigo Renderer', 'Glare Technologies Indigo RT']['Glare Technologies Indigo Renderer', 'Glare Technologies Indigo RT']['Glare Technologies Indigo Renderer', 'Glare Technologies Indigo RT']"], "ihw": ["IN-HEH Timeline Workspace", "Saved workspace for IN-HEH Timeline, a program that creates historical and genealogy databases; stores view options such window sizes and positions as well as filters used for filtering what event data is displayed.", "Windows, ", "[]"], "igx": ["iGrafx Document", "Diagram created by iGrafx software products such as iGrafx FlowCharter and iGrafx Process; can contain visual objects, information flows, text, and other drawn objects; may be a flowchart, an organizational chart, a cause and effect diagram, or one of many other supported diagram types.", "Windows, ", "['iGrafx FlowCharter', 'iGrafx Process']"], "igt": ["iGrafx Document Template", "Diagram template created by iGrafx, a business diagramming application; saves a diagram that can be used for creating iGrafx documents (.IGX files) from the same starting point and with a similar appearance.", "Windows, ", "['iGrafx FlowCharter', 'iGrafx Process']"], "igr": ["Igor Engraver File", "Musical notation file created by Igor Engraver, a program used for making musical charts; saves musicians, instruments, and the musical score itself; used for saving compositions; can be played back in the software.", "Windows, Mac, Windows, ", "['NoteHeads Igor Engraver']['NoteHeads Igor Engraver']['Act-3D Quest3D']"], "igq": ["Indigo Queue File", "Queue file used by Indigo Renderer, an application used to generate photorealistic images; contains the scene and output paths, along with other queue settings.", "Windows, Mac, Linux, ", "['Glare Technologies Indigo Renderer']['Glare Technologies Indigo Renderer']['Glare Technologies Indigo Renderer']"], "igma": ["INTUS Graph Mask Archive", "File used by INTUS terminals, which are devices used for timecard management, data collection, and access control; saves an archive of GUIs for a terminal, each of which provides a different user interface for the terminal screen; used for bundling all graph mask files together for a terminal.", "Windows, ", "['PCS Systemtechnik INTUS RemoteConf']"], "igp": ["Igor Published Music Notation File", "File created by Igor Engraver, a music notation application; stores the sheet music for a musical composition and may specify different instrumental parts; can be downloaded in a demo state, viewed with the Igor Reader application (also called NoteHeads Reader), and then purchased over the Internet using Igor Reader.", "Windows, ", "[]"], "ign": ["RoboHelp Ignore List File", "File created by RoboHelp, a program used for creating help documents for Windows; saves a list of words that are ignored when the help user searches the resulting help documentation; saved in a plain text format.", "Windows, ", "['Adobe RoboHelp']"], "igm": ["Indigo Renderer Material File", "File used by Indigo Renderer, a program used for generating photorealistic 3D images; contains a material, which stores graphical properties that give the surface of a 3D object a realistic appearance, such as that of metal, wood, plastic, brick, or another material; can be included as part of an Indigo Renderer scene (.IGS file).", "Windows, Mac, Linux, ", "['Glare Technologies Indigo Renderer', 'Glare Technologies Indigo RT']['Glare Technologies Indigo Renderer', 'Glare Technologies Indigo RT']['Glare Technologies Indigo Renderer', 'Glare Technologies Indigo RT']"], "igi": ["Indigo Image File", "Image file used by Indigo Renderer, an application that enables users to generate photorealistic images; stores all the information about a 3D scene render in progress.", "Windows, Mac, Linux, ", "['Glare Technologies Indigo Renderer']['Glare Technologies Indigo Renderer']['Glare Technologies Indigo Renderer']"], "igg": ["SuiteProfiler Color Map File", "Color Map data file created by SuiteProfiler, a program that allows users to create device independent color maps and then use the color maps to produce device dependent ICC color map profiles for soft proofing and image printing; can include multiple color map profiles that together comprise a suite of profiles for a given profiling environment.", "Mac, ", "['SuiteProfiler']"], "iges": ["IGES File", "Vector format for saving wireframe models that represent 2D or 3D designs; based on the IGES (Initial Graphics Exchange Specification) standard; stores data in a ASCII text format, which makes it easy to transfer to different programs and platforms.", "Windows, Mac, Web, ", "['IMSI TurboCAD Pro 2017', 'Autodesk AutoCAD 2017', 'Autodesk Fusion 360', 'Nemetschek Vectorworks', 'ACD Systems Canvas X 2017', 'ideaMK IGSViewer', 'Actify SpinFire Professional', 'CADSoftTools ABViewer']['IMSI TurboCAD Deluxe v10', 'Nemetschek Vectorworks']['ShareCAD.org']"], "igc": ["Anime List Builder Input File", "List of media files created by Anime List Builder, a free multimedia cataloging program; contains information about the files in a multimedia collection, such as anime series, TV episodes, movies, etc; organizes data in an XML format and can be exported as HTML, XML, or plain text.", "Windows, ", "[]"], "ifw": ["INTUS Firmware File", "Firmware file used by PCS Systemtechnik's INTUS terminals, which are used for timecard management, access control, and data collection; used for updating the firmware on the terminal device using the INTUS RemoteConf software.", "Windows, ", "['PCS Systemtechnik INTUS RemoteConf']"], "ifl": ["3ds Max Image File List", "File created by 3ds Max, a 3D modeling and animation application; stores a sequence of image filenames in plain text; used for including single-frame bitmaps in a series of rendered frames; also used for generating animated bitmaps.", "Windows, ", "['Autodesk 3ds Max 2017', 'Gizmo Animation IFL Maker']"], "ifs": ["InfoSlips Package", "An IFS file is an interactive document generated by InfoSlips, an e-billing program used for sending financial documents to customers.   It contains a document such as a newsletter, quarterly statement, welcome pack, commission stement, or letter.  ", "Windows, Mac, Linux, iOS, Android, Windows Phone, ", "['InfoSlips ForMe Viewer']['InfoSlips ForMe Viewer']['InfoSlips ForMe Viewer']['InfoSlips ForMe Viewer']['InfoSlips ForMe Viewer']['InfoSlips ForMe Viewer']"], "ifp": ["GTA Animation File", "Game animation file used by Grand Theft Auto (GTA) III and subsequent GTA games; may contain multiple animations in a single file, and each animation includes the 3D model and animation frames; used for game cutscenes.", "Windows, ", "['Rockstar Games Grand Theft Auto 3', 'Rockstar Games Grand Theft Auto: San Andreas', \"Autodesk 3ds Max with Kam's All-in-one Mod Scripts\"]"], "ifd": ["InForm Document", "Electronic form created by InForm Designer, a program used for making paper forms, e-forms, and Web forms; may include multiple pages, each with text, fillable fields, and graphics; can be printed, filled electronically online, or filled with the InForm Filler software.", "Windows, ", "['Fly Software InForm Designer', 'Fly Software InForm Filler']"], "ifo": ["DVD-Video Disc Information File", "An IFO file is a DVD-Video disc information file used by DVD players.  It contains information referenced by the DVD player which allows users to navigate and play the contents of the DVD.  IFO files work in conjunction with .VOB and .VRO files, which contain the actual audio and video data.", "Windows, Mac, ", "['CyberLink PowerDVD 16', 'Roxio Creator NXT Pro 5', 'Corel WinDVD 11', 'Nero 2017', 'GRETECH GOM Player', 'IfoEdit']['Apple DVD Player', 'Roxio Toast 15', 'Roxio Popcorn']"], "ifiction": ["iFiction Metadata File", "File created by Zoom, a text adventure machine; contains metadata about a game; includes game origination date, the generator (author), game name, headline, language, genre, identification (indicating the type of game, i.e., Z-code), description, and more information.", "Mac, Linux, ", "['Zoom']['Zoom']"], "iff": ["Interchange File Format", "An IFF file is a universal file format created by Electronic Arts.  It may contain image, text, or audio data and is used for interchanging different types of data across applications and platforms.  IFF files are supported by many programs and are used as the basis for several other file formats, including AIFF.", "Windows, Mac, Linux, Android, ", "['Adobe Audition CC 2017', 'Apple QuickTime Player', 'Corel PaintShop Pro X9', 'ACD Systems Canvas X 2017', 'ACD Systems ACDSee 20', 'Cloanto Amiga Forever', 'XnViewMP', 'IrfanView']['Adobe Audition CC 2017', 'Apple QuickTime Player', 'ShedWorx Smart Converter', 'IFFSnooper', 'Cloanto Amiga Forever']['Cloanto Amiga Forever', 'XnViewMP']['File Viewer for Android']"], "ifczip": ["Compessed IFC File", "Compressed .IFC or .IFCXML file created by some CAD programs; can significantly reduce the size of the text-based IFC and IFCXML formats for archival purposes or for digital transmission.", "Windows, ", "['Tekla BIMsight']"], "ifaith": ["iFaith SHSH File", "Data file created by iFaith, a program used for dumping .SHSH blobs and building signed .IPSW files for iOS devices (e.g., iPhone, iPod Touch, and iPad); saves a cache of SHSH blobs dumped by the software; generally used in the process of \"jailbreaking\" iOS devices.", "Windows, ", "[]"], "ifc": ["Industry Foundation Classes File", "Model file created in the Industry Foundation Classes (IFC) format, which is an open file format used by Building Information Modeling (BIM) programs; contains a model of a building or facility, including spatial elements, materials, and shapes.", "Windows, Mac, ", "['Adobe Acrobat DC', 'Autodesk AutoCAD 2017', 'GRAPHISOFT ArchiCAD', 'Tekla BIMsight', 'Safe Software FME Desktop', 'Constructivity Model Viewer', 'Trimble SketchUp with IFC2SKP plug-in', 'CYPE Engineers CYPECAD', 'Autodesk Revit 2017']['Adobe Acrobat DC', 'GRAPHISOFT ArchiCAD']"], "if": ["Procedimientos-Uno IFWin Project File", "Project file created by IFWin, a program used for designing photovoltaic installations, which use solar cells to convert light into electric power; contains a 3D design, including the electrical components; used for planning photovoltaic structures before constructing them.", "Windows, ", "['Procedimientos-Uno IFWin']"], "ies": ["IES Photometric Data File", "Data file created in the standardized IES (Illuminating Engineering Society) photometric format; contains measurements of light and light quantities; commonly used to simulate lighting systems in buildings before they are installed.", "Windows, ", "['Autodesk AutoCAD Architecture 2017']"], "ifcxml": ["Industry Foundation Classes XML File", "CAD file created in the Industry Foundation Classes XML (IFCXML) XML format, which is an alternative to the plain text .IFC format; uses XML formatting so that the building model data can be exchanged and parsed more easily.", "Windows, ", "['Tekla BIMsight']"], "idx255": ["Runescape Cache File", "Cache file saved by Runescape, an online multiplayer game; stores game progress on a player's local machine; used when resuming a game online; typically named \"main_file_cache.idx255\" and is saved with several other cache files.", "Windows, ", "['Jagex Runescape']"], "idx0": ["Runescape Cache Index File", "Index of cache files created by Runescape, an online multiplayer game; stores data about cache files (e.g. .IDX255 and other files) saved by Runescape; index files are typically named \"main_file_cache.idx0\" and should not be opened manually.", "Windows, ", "['Jagex Runescape']"], "idx": ["Movie Subtitle File", "File used by various DVD playback programs to display subtitles; contains the subtitle text as well as cue points for when each subtitle should be shown during the movie timeline; saved with a corresponding video file.", "Windows, Mac, Linux, Android, Windows, Windows, Windows, Windows, ", "['CyberLink PowerDVD 16', 'VideoLAN VLC media player', 'URUWorks Subtitle Workshop', 'DVDSubEdit']['MPlayer', 'VideoLAN VLC media player']['SMPlayer', 'VideoLAN VLC media player']['J2 Interactive MX Player'][]['ESRI ArcGIS for Desktop', 'ICQ'][]['Microsoft Outlook Express']"], "idw": ["Inventor Drawing", "2D or 3D vector-based drawing created by Autodesk Inventor, a program used to design, visualize, and simulate mechanical products; may contain parts (.IPT files), assemblies (.IAM files), and presentation materials (.IPN files).", "Windows, ", "['Autodesk Inventor 2017', 'Autodesk Inventor View 2017']"], "idt": ["Windows Installer Database Text Archive File", "Text file created by exporting a table from a Windows Installer database; contains the ASCII text representation of the relational data stored in the table; used for reviewing database information in a human-readable format; also used for committing the text version of a table to a source code control system.", "Windows, ", "[]"], "idpp": ["Adobe InDesign Preflight Profile", "File used by InDesign, a professional publishing application; contains settings that check whether there are problems with the document; used for validating documents before they are published to final draft.", "Windows, Mac, ", "['Adobe InDesign CC 2017']['Adobe InDesign CC 2017']"], "idv": ["Inventor Design View File", "Design View file created by Autodesk Inventor, a 3D CAD mechanical design tool; stores a snapshot view of an assembly (.IAM) file; includes component visibility, viewing angles, magnification, and colors; enables draft reviewing of assemblies.", "Windows, ", "['Autodesk Inventor 2017']"], "idlk": ["Adobe InDesign Lock File", "Source control file created when an InDesign (.INDD) file is opened; allows the file to be \"checked out\" and prevents the InDesign document from being edited by more than one person at a time.", "Windows, Mac, ", "['Adobe InDesign CC 2017']['Adobe InDesign CC 2017']"], "idpk": ["Adobe InDesign Package for GoLive File", "Exported file created by Adobe InDesign, a digital and print publishing program; contains InDesign publication content that is meant to be repurposed for the Web; used for transferring publication data from InDesign and importing it into Adobe GoLive.", "Windows, Mac, ", "['Adobe InDesign CC 2017']['Adobe InDesign CC 2017']"], "idms": ["Adobe InDesign Snippet", "Snippet created by InDesign, a desktop publishing program used to create professional page layouts; contains a subset of a document, which includes one or more objects and their relative placement to each other; used for exporting and reusing portions of a page.", "Windows, Mac, ", "['Adobe InDesign CC 2017', 'Adobe InCopy CC 2017']['Adobe InDesign CC 2017', 'Adobe InCopy CC 2017']"], "idml": ["Adobe InDesign Markup Language File", "Document created by InDesign, a program used to create professional page layouts; contains several XML files, which represent a complete InDesign document; stored as compressed package using Zip compression.", "Windows, Mac, ", "['Adobe InDesign CC 2017', 'Adobe IDMLTools']['Adobe InDesign CC 2017', 'Adobe IDMLTools']"], "idl": ["Interface Definition Language File", "Source code file created using the Microsoft Interface Definition Language (MIDL); contains interface and type library definitions; used for defining interfaces between client and server applications; also used for generating type libraries (.TLB files) for OLE automation.", "Windows, ", "['Microsoft Visual Studio 2017']"], "idi": ["EVA Controller Event Log", "Event log created by Enterprise Virtual Array (EVA), a data management hardware/software solution created by HP;  contains a history of errors that have occurred in the system.", "Windows, ", "['HP Command View EVA']"], "idf": ["MIDI Instrument Definition File", "Defines the parameters for a specific MIDI instrument, such as a MIDI keyboard or other MIDI controller; provides an instrument ID, patch names (voices), a key map, channel assignments, and other information.", "Windows, Mac, ", "['text editor']['text editor']"], "ideplugin": ["Xcode IDE Plug-in", "Plugin used by Apple Xcode, an IDE used for developing iOS and OS X applications; stores resources that provide capabilities to Xcode; examples include application interface elements, iCloud functions, and a PDF viewer.", "Mac, ", "['Apple Xcode']"], "idea": ["Tresor IDEA Encrypted File", "Encrypted file created by Tresor, a file and folder encryption program; contains an encrypted file that can only be opened in the Tresor application with the same password that was used to encrypt it.", "Mac, Windows, Mac, iOS, ", "['Warlord Tresor']['Adobe Illustrator CC 2017']['Adobe Illustrator CC 2017']['Adobe Illustrator Draw']"], "ide": ["Inventor iFeature File", "iFeature file formerly referred to as an \"Inventor Design Element\" (IDE); contains a feature, which is a 3D design of a part and its properties; saves time by allowing designers to reuse design elements.", "Windows, Windows, ", "['Autodesk Inventor 2017']['Rockstar Games Grand Theft Auto 3', 'Rockstar Games Grand Theft Auto: San Andreas', 'Rockstar Games Grand Theft Auto 4', 'Rockstar Games Grand Theft Auto: Vice City']"], "iddx": ["Static Default File", "File created by InDesign and InCopy, professional page layout creation applications; contains default document settings; imported by InDesign right before .IDML files to keep consistent document default settings; should not be manually opened or edited.", "Windows, Mac, ", "['Adobe InDesign CC 2017', 'Adobe InCopy CC 2017']['Adobe InDesign CC 2017', 'Adobe InCopy CC 2017']"], "idc": ["Internet Database Connector File", "Component of Microsoft's Internet Information Server (IIS) Web server that enables access to an ODBC-compliant database; contains queries that are sent to the database, which are often generated by user input via a Web page.", "Windows, ", "['Microsoft Internet Information Services (IIS)']"], "idb": ["IDA Database File", "File created by IDA (The Interactive Disassembler), a program that disassembles executable files (.EXE) into low-level assembly language code; stores the disassembled data in a compressed format; used in the process of exploring executables, often for revealing potential security threats or exploitation routes.", "Windows, Windows, ", "['Hex-Rays IDA']['Microsoft Visual Studio 2017']"], "idap": ["Adobe InDesign Assignment Package", "File used by InDesign, a desktop publishing application used to create professional page layouts; contains a subset of an InDesign document (.INDD file) that has been modified by an editor; used to import edited page content back into the original InDesign document.", "Windows, Mac, ", "['Adobe InDesign CC 2017', 'Adobe InCopy CC 2017']['Adobe InDesign CC 2017', 'Adobe InCopy CC 2017']"], "id3tag": ["MP3 Skype Recorder Temporary File", "An ID3TAG file is a temporary file created by MP3 Skype Recorder, a free program used to record Skype conversations.  It contains metadata about a recorded conversation that is deleted once the recording is finished.", "Windows, ", "[]"], "id2": ["Windows Live Messenger Emoticon File", "File used by Windows Live Messenger (WLM), an online chat program; contains metadata such as emoticon name and keyboard shortcut; used in combination with an associated .DT2 image file to display an emoticon; can be used to create custom emoticons.", "Windows, ", "['Microsoft Windows Live Messenger']"], "icr": ["Image Comparer Results File", "File generated by Image Comparer, a program used for identifying duplicate or similar images on the hard drive; saves the results of comparing images with each other; allows users to review the results later without having to re-process the comparisons again.", "Windows, ", "['Bolide Image Comparer']"], "id": ["Lotus Notes User ID File", "Contains identifying information for a Domino Server aand Lotus Notes user; created by the Domino administrator; includes the user's name, Notes license number, secure certificate, public and private key, and a password.", "Windows, ", "['IBM Lotus Notes', 'IBM Domino']"], "icursorfx": ["iCursor Effect File", "Data file that stores settings for an iCursor effect; used to apply special effects to the cursor in Mac OS X; can be customized by selecting iCursor → Customize Effect... within the iCursor application.", "Mac, ", "['GioFX iCursor']"], "icst": ["InCopy Document Preset File", "File created by InCopy, a professional collaborative writing and editing program; contains default or customized document presets; customizable settings include: whether the pages are facing, the width, depth, and measurement units of a text area and the width and height of the page size.", "Windows, Mac, ", "['Adobe InCopy CC 2017']['Adobe InCopy CC 2017']"], "ics": ["Calendar File", "An ICS file is a calendar file saved in a universal calendar format used by several email and calendar programs, including Microsoft Outlook, Google Calendar, and Apple Calendar.  It enables users to publish and share calendar information on the web and over email.  ICS files are often used for sending meeting requests to other users, who can import the events into their own calendars.", "Windows, Mac, Linux, Web, Windows, Windows, ", "['Microsoft Outlook 2016', 'Mozilla Lightning']['Apple Calendar', 'Mozilla Lightning']['Mozilla Lightning', 'Horde Kronolith', 'Claws Mail']['Google Calendar', 'ICS File Converter']['IronCAD']['Sony Digital Voice Player', 'Microsoft Windows Media Player with Sony Player Plug-in']"], "icpr": ["IconUtils Project File", "Project file created by IconUtils, a software package used to create and edit Windows icons (.ICO); saves edited graphics for an icon, icon library, cursor, or cursor library; used for saving icons and cursors that can be used for styling the look and feel of the Windows environment.", "Windows, ", "['Aha-Soft IconUtils', 'Aha-Soft ArtIcons Pro']"], "icontainer": ["CandyBar iContainer File", "Collection of Macintosh icons saved in a single file; supports icons up to 512x512 pixels in size; also includes display settings and information about each icon; used for replacing the default icons in Mac OS X.", "Windows, Mac, ", "['Axialis IconWorkshop']['Panic CandyBar', 'FreeMacSoft LiteIcon']"], "iconset": ["Mac OS X Icon Set Folder", "Folder used by various programs when developing OS X applications; contains a set of icons, often .PNG files, that are used by developers to create high-resolution .ICNS files for an application.", "Mac, ", "['Apple Xcode', 'Apple Terminal', 'Iconset Generator']"], "iconpackage": ["IconPackager Theme File", "File created by IconPackager, a program used to create Windows icons; contains a raw theme for an icon package, including  which packaged icons map to which Windows icons; used to save and load IconPackager themes.", "Windows, ", "['Stardock IconPackager']"], "icon": ["Icon Image File", "Contains image data for a computer icon used to represent files, folders, applications, etc; typically saved as small square bitmap image ranging from 16x16 to 256x256 pixels in size.", "Windows, Mac, Linux, ", "['GIMP']['GIMP']['GIMP']"], "icn": ["Windows Icon File", "Icon image file used for Windows file and folder icons; saved in a bitmap image format that can be opened by various image editors.", "Windows, Mac, ", "['Adobe Photoshop with IconBuilder plugin', 'ACD Systems ACDSee 20', 'XnViewMP']['Adobe Photoshop with IconBuilder plugin', 'XnViewMP']"], "icmt": ["InCopy Template", "Template created by InCopy, a professional writing and editing program; contains preset page size dimensions, XML tags, swatches, paragraph styles, text area dimensions, and other page layout settings.", "Windows, Mac, ", "['Adobe InCopy CC 2017']['Adobe InCopy CC 2017']"], "ico": ["Icon File", "An ICO file is an image format used to store icons for Windows programs, files, and folders.  It contains two bitmaps: 1) the AND bitmap - the image mask (which determines what part of the icon is transparent) and 2) the XOR bitmap - contains the icon which is mapped onto the image mask.  ICO files can be modified to create custom icons.", "Windows, Mac, Linux, Android, ", "['File Viewer Plus', 'IcoFX', 'Axialis IconWorkshop', 'Newera IconCool Editor', 'ACD Systems ACDSee 20', 'SibCode Sib Icon Editor', 'Program4Pc PC Icon Editor', 'IconEdit2', 'Inkscape', 'IvanView', 'GIMP']['Apple Preview', 'Lemkesoft GraphicConverter', 'Iconographer', 'Inkscape', 'GIMP', 'Snap Converter']['Inkscape', 'GIMP']['File Viewer for Android']"], "icns": ["Mac OS X Icon Resource File", "An ICNS file is an icon file used by Mac OS X applications.  It stores one or more images, typically which were originally .PNG files and supports 1-bit and 8-bit alpha channels.  ICNS files are used for displaying the application icon in the Mac OS X Finder and in the OS X dock.", "Windows, Mac, Linux, ", "['Axialis IconWorkshop', 'Inkscape', 'XnViewMP', 'Microsoft Windows Explorer']['Apple Preview', 'Icon Machine', 'Iconographer', 'Folder Icon X', 'Inkscape', 'Snap Converter', 'Adobe Photoshop with IconBuilder for Macintosh plugin', 'XnViewMP']['Inkscape', 'XnViewMP']"], "icml": ["InCopy Document", "Document created by InCopy, a professional writing and editing program; contains document text, graphics, and page layout settings; used to save and load InCopy documents; may also be used to link portions of an Adobe InDesign document (.INDD file) using a network fileserver.", "Windows, Mac, ", "['Adobe InCopy CC 2017', 'Adobe InDesign CC 2017']['Adobe InCopy CC 2017', 'Adobe InDesign CC 2017']"], "icma": ["InCopy Assignment File", "Assignment file used by InCopy, a word processor that integrates with Adobe InDesign; contains links to a subset of an InDesign parent document (.INDD file), as well as editing permissions for a specific user; used to assign a portion of a document to an editor.", "Windows, Mac, ", "['Adobe InCopy CC 2017', 'Adobe InDesign CC 2017']['Adobe InCopy CC 2017', 'Adobe InDesign CC 2017']"], "icm": ["Image Color Matching Profile", "Contains a color settings for a specific software program or device, such as a printer or scanner; saved in a standard format that can be loaded by various programs and hardware devices; allows the same color system to be used by multiple devices and software programs, even across multiple computers.", "Windows, Mac, ", "['Microsoft Color Control Panel', 'Adobe Photoshop CC 2017', 'CorelDRAW Graphics Suite X8', 'Cerious ThumbsPlus']['Adobe Photoshop CC 2017', 'Apple ColorSync Utility']"], "icl": ["Windows Icon Library File", "Contains a collections of icons that can be used to replace existing icons; may be applied to Windows shortcuts (such as .LNK files), but not to actual program files.", "Windows, ", "['Microsoft Windows', 'ACD Systems Canvas X 2017', 'Axialis IconWorkshop', 'Impact Microangelo Toolset', 'Aha-Soft IconUtils']"], "ichat": ["iChat Saved Chat Log", "Save file created by iChat, an online chatting application included with Mac OS X; saves the currently opened chat log and enables the user to review past discussions; created by choosing File → Save a Copy As... in the iChat application menu.", "Mac, ", "['Apple iChat']"], "icg": ["Image Comparer Gallery File", "File created by Image Comparer, a program used for finding duplicate or similar images on the hard drive; contains a list of images which comprise an image gallery; used for grouping images together so they can be compared together or against another gallery to identify similar or duplicate images.", "Windows, ", "['Bolide Image Comparer']"], "icf": ["Zoom Router Configuration File", "File created by Zoom wireless routers and modems; saves a backup of the user-selected configuration options for the home or office network; used for restoring settings; created through the Web interface that the device offers when it is connected and online.", "Windows, Mac, ", "['Microsoft Notepad', 'text editor']['Apple TextEdit', 'text editor']"], "ice": ["ICE File Archive", "Compressed file archive created by ICEOWS (Interface de Compression Ergonomique pour windOWS), a Polish file compression program for Windows; formerly known as ArjFolder.", "Windows, ", "['ESTsoft ALZip']"], "icap": ["InCopy Package File", "Package file used by InCopy, a writing and editing program used with Adobe InDesign; stores an .ICMA file and associated .ICML files in a compressed archive; used to package subsections of InDesign documents for remote editing.", "Windows, Mac, ", "['Adobe InCopy CC 2017', 'Adobe InDesign CC 2017']['Adobe InCopy CC 2017', 'Adobe InDesign CC 2017']"], "icc": ["ICC Profile", "Color profile format standardized by the International Color Consortium (ICC); contains color settings for image-editing programs; relays information between software and peripheral devices, including monitors, printers, and scanners.", "Windows, Mac, ", "['Microsoft Color Control Panel', 'Adobe Photoshop CC 2017', 'CorelDRAW Graphics Suite X8']['Adobe Photoshop CC 2017', 'Apple ColorSync Utility']"], "icbu": ["Calendar Backup File", "Calendar archive created by Calendar, a calendar application included with Mac OS X; contains a backup of one or more calendars; used for restoring calendars in the event data is lost.", "Mac, ", "['Apple Calendar']"], "icb": ["Targa ICB Bitmap Image", "Bitmap image created using the standard Targa format; originally used for generating Targa graphics using the AT&T EPICenter Image Capture Board (ICB) video card, the ICB-PAINT software, or the TARGA-PAINT program.", "Windows, Mac, ", "['Adobe Photoshop CC 2017', 'Adobe Photoshop Elements 15', 'Adobe Illustrator CC 2017', 'ACD Systems Canvas X 2017']['Adobe Photoshop CC 2017', 'Adobe Photoshop Elements 15', 'Adobe Illustrator CC 2017']"], "icaltodo": ["iCal To Do File", "Calendar data file used by Spotlight, a search utility included with Mac OS X; contains cached todo data used for searches; saved to the [user]/Library/Caches/Metadata/iCal/ directory.", "Mac, ", "['Apple Calendar']"], "icd": ["SafeDisc Encrypted Program", "Executable program encrypted with SafeDisc, a disc copy prevention program for Windows games and other applications; typically saved along with an .EXE file which loads the protected ICD file.", "Windows, Windows, Windows, ", "[][]['IronCAD']"], "icalevent": ["iCal Event File", "Data file used by Spotlight, a search program included with Mac OS X; contains cached calendar event data used for searches; typically stored in the [user]/Library/Caches/Metadata/iCal/ directory.", "Mac, ", "['Apple Calendar']"], "icalendar": ["iCalendar File", "Universal calendar format used by calendar programs such as Google Calendar, Apple Calendar, and Microsoft Outlook; saved in a plain text format and contains an event or task; used for sending events or tasks to others, who can import it into their calendars.", "Windows, Mac, Web, ", "['Microsoft Outlook 2016']['Apple Calendar']['Google Calendar']"], "ical": ["iCalendar File", "Calendar file used by products that support the iCalendar file format standard; uses the same format as .ICS files, but uses the \".ical\" extension, which is less common; used for sending online meeting requests and tasks.", "Windows, Mac, Web, ", "['Microsoft Outlook 2016', 'Microsoft Windows Live Mail']['Apple Calendar']['Google Calendar', 'PHP iCalendar']"], "ic3": ["High Resolution Imagic Graphics File", "Imagic Film and Picture graphic used by the older Atari ST systems, which were discontinued in the early 1990s; contains a high resolution color bitmap image, in contrast to the medium (.IC2) and low (.IC1) resolution versions.", "Mac, ", "['Lemkesoft GraphicConverter']"], "ica": ["Citrix ICA File", "An ICA file is an Independent Computing Architecture (ICA) file used by Citrix application servers.  It contains configuration information for connecting to different servers and may link to a published application or to a server desktop environment.  ICA files can be created with the ICA File Creator program or a basic text editor.", "Windows, Mac, Linux, iOS, Android, Windows Phone, Windows, Mac, Linux, ", "['Citrix Receiver', 'Citrix Online Plug-in for Windows', 'Citrix ICA File Creator', 'Citrix XenClient', 'Citrix XenApp', 'text editor']['Citrix Receiver', 'text editor']['Citrix Receiver']['Citrix Receiver']['Citrix Receiver']['Citrix Receiver']['Newera Graphics Converter Pro', 'XnViewMP']['XnViewMP']['XnViewMP']"], "ic3d": ["IC3D Scene File", "3D file created by IronCAD Compose, a 3D design viewer program; contains 3D objects that you can customize and place to create a 3D scene of your composition.", "Windows, ", "['IronCAD Compose']"], "ic2": ["Medium Resolution Imagic Graphics File", "Imagic Film and Picture image used by Atari ST systems, which were discontinued in 1993; contains a medium resolution color bitmap image; can be saved with or without compression.", "Mac, ", "['Lemkesoft GraphicConverter']"], "ic1": ["Low Resolution Imagic Graphics File", "Imagic Film and Picture graphic used by Atari ST systems, which were released in 1985 and discontinued in 1993; stores a low resolution color bitmap image; may be stored in an uncompressed or compressed format.", "Mac, ", "['Lemkesoft GraphicConverter']"], "ib": ["InterBase Database", "Database file created by InterBase, an RDBMS application often used for developing embedded application databases; saves the data in a structured format using tables and records, and the data can be queried from within the target application.", "Windows, ", "['Embarcadero InterBase']"], "ias": ["Intermodulation Analysis System File", "File created by Intermodulation Analysis System (IAS), a program used for setting up and coordinating RF (radio frequency) systems, typically those in live audio production; saves an inventory of analog and digital TV stations, wireless system devices, and other potential conflicting devices; allows the frequency band to be analyzed so that conflicts with a wireless system can be managed.", "Windows, ", "['Professional Wireless Intermodulation Analysis System']"], "iam": ["Inventor Assembly File", "3D CAD assembly created with Autodesk Inventor; used for designing 3D digital prototypes and integrating 2D AutoCAD documents into a 3D environment; contains an assembly of many parts (.IPT) files.", "Windows, ", "['Autodesk Inventor 2017', 'Autodesk Inventor View 2017', 'Autodesk Fusion 360', 'SpaceClaim Engineer']"], "iaf": ["Outlook Internet Account File", "Settings file created by Microsoft Outlook, an email and calendar program; stores Internet Mail Account settings in a proprietary format; used for exporting email settings to another Outlook installation.", "Windows, ", "['Microsoft Outlook 2016']"], "iadplug": ["iAd Producer Plugin", "Plugin used by iAd Producer, an application used to design and assemble rich interactive content for iOS advertisements; contains information used to install additional functionality to iAd Producer.", "Mac, ", "['Apple iAd Producer']"], "iadstyle": ["iAd Producer Plugin Style Template", "Style template referenced by iAd Producer, a program used to create rich interactive content for iOS advertisements; contains a collection of settings for a style, which can be applied to an object in an iAd Producer project.", "Mac, ", "['Apple iAd Producer']"], "iadproj": ["iAd Producer Project", "Project archive format created and used by iAd Producer, an application used to design and assemble rich interactive content for iOS advertisements; contains files that make up an iAd; includes assets, banners, code, pages, styles, user data, layers, and metadata.", "Mac, ", "['Apple iAd Producer']"], "iadpage": ["iAd Producer Plugin Page Template", "Page template used by iAd Producer, an application for designing and assembling rich interactive content for iOS advertisements; contains files that make up a page template, which may include assets, banners, splash pages, styles, layers, user data, and metadata.", "Mac, ", "['Apple iAd Producer']"], "iadcomponent": ["iAd Producer Plugin Component File", "Plugin data file referenced by iAd Producer, an application used to create rich interactive content for iOS advertisements; describes components, such as buttons, sliders, and labels.  ", "Mac, ", "['Apple iAd Producer']"], "iadclass": ["iAd Producer Plugin Class Description File", "Plugin class used by iAd Producer, an application used to design and assemble rich interactive content for iOS advertisements; contains class description information; may include properties, HTML attributes, parameters, and values.", "Mac, ", "['Apple iAd Producer']"], "iadaction": ["iAd Producer Plugin Action Template", "Action template used by iAd Producer, an application that enables users to design and assemble rich interactive content for iOS advertisements; contains code referenced by iAd Producer to perform actions in a page.", "Mac, ", "['Apple iAd Producer']"], "iaa": ["INTUS Audio Archive", "File used by INTUS terminals, which are used for employee timecard management, access control, and data collection; saves an archive of audio files that are used for outputting sounds from the terminal; used for aggregating all audio files together for a terminal.", "Windows, ", "['PCS Systemtechnik INTUS RemoteConf']"], "i3pack": ["Point Blank Game Data File", "Game data file used by Point Blank, a first-person shooter game; includes audio data used for playing sounds and music in the background; can be extracted to the .MP3 format using i3Play.", "Windows, ", "[]"], "i3d": ["Houdini Image 3D File", "Three-dimensional texture file created by Houdini, a professional modeling and rendering program; can store arbitrary volumetric data in 3D space; often used for storing clouds or smoke.", "Windows, Mac, Linux, ", "['Side Effects Houdini', 'GIANTS Editor']['Side Effects Houdini']['Side Effects Houdini']"], "i5z": ["IUCLID 5 Import/Export File", "Scientific data format used for exporting and importing data into IUCLID 5; may include several data files formatted in XML and compressed into a single .ZIP archive; IUCLID is an application for capturing, storing, maintaining and exchanging data about chemical substance properties.", "Windows, ", "[]"], "i02": ["DVD Shrink Part 3 File", "The third file of a group of disk image files saved by DVD Shrink; compresses the data on a DVD-Video disc to fit on a single DVD-R disc; usually saved as part of a sequence of files; for example, .I00 is the first file extension, .I01 is the second file extension, the third file ends in I02, etc; all the files work together to form the complete data on the disc.", "Windows, ", "['Alcohol 120%', 'DT Soft DAEMON Tools']"], "i01": ["DVD Shrink Part 2 File", "The second file of a group of disk image files saved by DVD Shrink, a program that compresses DVD-Video data to fit on a single DVD-R disc; usually saved as part of a sequence of files; for example, the first file has a .I00 extension, the second file ends in I01, the third file has a .I02 extension, etc.", "Windows, ", "['Alcohol 120%', 'DT Soft DAEMON Tools']"], "i00": ["DVD Shrink Part 1 File", "The first file of a group of disk image files saved by DVD Shrink; designed to fit a DVD-Video disc on a single DVD-R disc; usually saved as part of a sequence of files, i.e. \".I00, .I01, .I02, etc.\"", "Windows, ", "['Alcohol 120%', 'DT Soft DAEMON Tools']"]}