{"j": ["Java Source File", "Contains program source code written in the Java programming language; may include the source code for a complete program or may be one of many files referenced by a Java programming project.", "Windows, Mac, Linux, Windows, Windows, Mac, ", "['File Viewer Plus', 'Oracle Java Virtual Machine', 'Eclipse IDE for Java Developers', 'gVim']['Oracle Java Virtual Machine', 'Eclipse IDE for Java Developers']['Oracle Java Virtual Machine', 'Eclipse IDE for Java Developers', 'javac', 'vim'][]['picture viewer', 'Web browser']['picture viewer', 'Web browser']"], "jav": ["Java Source File", "Contains the source code of a program written in the Java programming language; may be one of many Java source files referenced within a programming project or may contain all the source code in one file.", "Windows, Mac, Linux, ", "['File Viewer Plus', 'Oracle Java Virtual Machine', 'Eclipse IDE for Java Developers', 'Microsoft Notepad', 'gVim', 'text editor']['Oracle Java Virtual Machine', 'Eclipse IDE for Java Developers', 'Apple Xcode', 'Bare Bones BBEdit', 'Apple TextEdit', 'text editor']['Oracle Java Virtual Machine', 'Eclipse IDE for Java Developers', 'javac', 'GNU Emacs', 'text editor']"], "jasper": ["JasperReports Data File", "File created by JasperReports, an open source programming library that allows users to create reports programmatically in Java; contains report content in binary format that has been compiled from a .JRXML file.", "Windows, Mac, Linux, ", "['Jaspersoft JasperReports', 'Jaspersoft iReport']['Jaspersoft JasperReports', 'Jaspersoft iReport']['Jaspersoft JasperReports', 'Jaspersoft iReport']"], "jbf": ["Paint Shop Pro Browser Cache File", "Cache file created by the image browser component of Corel Paint Shop Pro (PSP); contains thumbnails for image files that have been viewed; enables the program to quickly display image previews; automatically updated each time users browse images.", "Windows, ", "['Corel PaintShop Pro X9']"], "jbi": ["Motoman Robot Job File", "Job file created by Motoman robot programming software; contains instructions for motion and other actions that control the robot; can be programmed and simulated offline and then uploaded to the robot's job database.", "Windows, ", "[]"], "jbc": ["Jam STAPL Byte-Code File", "File created in the Jam STAPL (Standard Test and Programming Language) Byte-Code format; compiled from a .JAM file into a binary representation; stores the data required for programming devices in a JTAG chain; enables the STAPL format to be compressed into a compact binary format.", "Windows, ", "['Altera Quartus', 'Altera Jam STAPL Byte-Code Player']"], "jbg": ["Joint Bi-level Image Group File", "Image format used to store black and white, grayscale, and color images; uses lossless compression to create smaller image file sizes than other industry standard formats, such as CCITT Group 3 (G3) or CCITT Group 4 (G4) compression.", "Windows, Mac, ", "['Newera Graphics Converter Pro', 'XnViewMP']['Newera Graphics Converter Pro', 'ToyViewer', 'XnViewMP']"], "jb2": ["JBIG2 Image", "Bitonal image created in the Joint Bi-level Image Group 2 (JBIG2) format; stores 1-bit black and white pixels in lossy or lossless format; supports greater compression ratios than the competing CCITT Fax Group 4 compression algorithm.", "Windows, Mac, ", "['Nuance OmniPage Ultimate', 'Newera Graphics Converter Pro', 'XnViewMP']['Newera Graphics Converter Pro', 'XnViewMP']"], "java": ["Java Source Code File", "A JAVA file is a source code file written in the Java programming language, which was originally developed by Sun Microsystems but is now maintained by Oracle.  It uses an object-oriented approach, where structured data types, called classes, are used to instantiate objects at runtime.", "Windows, Mac, Linux, ", "['File Viewer Plus', 'Oracle Java Virtual Machine', 'Eclipse IDE for Java Developers', 'Google Android Studio', 'Oracle NetBeans', 'Xinox JCreator', 'ES-Computing EditPlus', 'Microsoft Notepad', 'gVim', 'text editor']['Oracle Java Virtual Machine', 'Eclipse IDE for Java Developers', 'Google Android Studio', 'Oracle NetBeans', 'Apple Xcode', 'MacroMates TextMate', 'MacVim', 'text editor']['Oracle Java Virtual Machine', 'Eclipse IDE for Java Developers', 'Google Android Studio', 'Oracle NetBeans', 'javac', 'GNU Emacs', 'text editor']"], "jbeam": ["BeamNG Vehicle Definition Format", "Vehicle defintion file saved in the JBeam format and used by games that employ the BeamNG engine; contains information, such as nodes, beams, that define the appearance and behavior of a vehicle or a vehicle part; based on the JSON format.", "Windows, ", "['Bugbear Entertainment Next Car Game: Wreckfest', 'Notepad++']"], "jas": ["Cheetah3D Model File", "3D model file created by Cheetah3D, a 3D modeling, rendering, and animation program for Mac; contains three-dimensional objects, visual effects, and animation properties; often used for digital art.", "Windows, Mac, Linux, Windows, ", "['Unity Technologies Unity']['Cheetah3D', 'Unity Technologies Unity']['Unity Technologies Unity']['Corel PaintShop Pro X9']"], "jarvis": ["Jarvis Subscriber File", "Text file that contains the email address of a subscriber to weekly emails from the Jarvis Acting Company; provided to each subscriber as verification that the email address has been added to the list; typically sent as an attachment with the confirmation email.", "Windows, Mac, Linux, ", "['text editor']['text editor']['text editor']"], "jar": ["Java Archive File", "A JAR file is a Java archive (JAR) file used by the Java Runtime Environment (JRE), a framework used for executing Java programs.  JAR files may serve as program libraries or as standalone programs that run if the JRE is installed on the computer or mobile device.", "Windows, Mac, Linux, Android, ", "['File Viewer Plus', 'Oracle Java Runtime Environment', 'Corel WinZip 21', '7-Zip', 'WinRAR 5', 'Web browser']['Corel WinZip Mac 5', 'Oracle Java Runtime Environment', 'Web browser']['Oracle Java Runtime Environment', 'Web browser']['File Viewer for Android']"], "jap": ["Nonogram Puzzle File", "File used by nonogram puzzle programs, such as QNonograms; contains a nonogram puzzle, which consists of numbers and cells in a grid.", "Windows, Linux, Windows, ", "['QNonograms']['QNonograms']['Project64', 'Daedalus']"], "jwl": ["Roxio Jewel Case File", "Label file created by Easy CD Creator, a program used for creating and printing CDs; contains the locations of all template, theme, picture, and icon resources associated with a jewel case image; used to print a CD label, or jewel case cover.", "Windows, ", "['Roxio Creator NXT Pro 5']"], "jam": ["Line 6 Device Recording", "Audio recording or loop created with a Line 6 product such as the Spider Jam amp or JM4 Looper pedal; may include sounds for guitars, drums, and other instruments; can also include effects and other audio settings; used for saving loop audio on portable storage cards inserted in Line 6 devices.", "Windows, Mac, Windows, Windows, Windows, ", "['Jam2Wav']['Jam2Wav']['Altera Quartus', 'Altera Jam STAPL Player', 'Altera Jam STAPL Byte-Code Compiler', 'text editor']['text editor'][]"], "jxr": ["JPEG XR Image", "Image stored in the JPEG XR format, which was originally developed by Microsoft for Windows Media software; supports deep color images with 48-bit RGB; used for high-resolution professional image editing; also supports lossless and lossy compression.", "Windows, Mac, Linux, ", "['Microsoft Windows Photo Viewer', 'Adobe Photoshop with JPEG XR plugin', 'XnViewMP', 'Axel Rietschin FastPictureViewer']['XnViewMP']['XnViewMP']"], "jws": ["Java Web Services File", "Java file used to implement Web services on a Web server; contains Java code that determines how Web services behave, including references to Java methods and functions used by the Web server.", "Windows, Windows, ", "[][]"], "jvsg": ["Video Surveillance Project", "Project file created by JVSG's CCTV (Closed-Circuit Television) system design programs; stores camera locations, camera view angles, bandwidth and hard disk calculations, and other CCTV design information; can be rendered into 3D views for advanced analysis and documentation.", "Windows, ", "['JVSG IP Video System Design Tool', 'JVSG CCTV Design Tool']"], "jvs": ["JavaScript Proxy Autoconfig File", "JavaScript file that automatically configures a Web browser to use a specific proxy server; more commonly seen with the .PAC extension.", "Windows, Mac, ", "['Web browser']['Web browser']"], "jude": ["JUDE Project File", "Project created with JUDE (Java and UML Development Environment); combines UML software development with Mind Map functionality; can convert a Mind Map to a UseCase or a Class Diagram by dragging and dropping objects.", "Windows, ", "[]"], "jtx": ["ESE Transaction Log", "Log file generated by the Extensible Storage Engine (ESE), a database engine developed by Microsoft as part of the Windows API; stores records of changes to the database over time; used for backup and restore operations.", "Windows, Windows, Windows, Mac, Linux, ", "['Microsoft Exchange Server']['Microsoft XPS Viewer'][][][]"], "jtv": ["JRiver TV File", "Video recording created by JRiver Media Center, a multimedia playback and online streaming application; stores captured video such as Internet television programs; saved in a proprietary format, which can be played back in Media Center.", "Windows, ", "['JRiver Media Center']"], "jts": ["Cyberlink AVCHD Video File", "High-definition video file downloaded from a JVC HD camcorder and edited with Cyberlink video-editing software; contains video data stored in an MPEG-4 AVCHD format; used to preserve high-definition video from the camcorder.", "Windows, ", "['CyberLink PowerProducer 6', 'CyberLink PowerDirector 15 Ultra']"], "jt": ["JT Open CAD File", "Lightweight 3D model format developed by Siemens PLM Software; designed as an open, high-performance, compact, persistent storage format for product data; used for product visualization, collaboration, and CAD data sharing.", "Windows, ", "['Dassault Systemes CATIA', 'Parametric Technology Creo', 'Autodesk Inventor 2017']"], "jtbackup": ["Just Type Backup File", "File created by Just Type, an iOS app used for storing personal notes; saves a backup copy of notes the user has selected and can be restored to put the notes back if they are lost.", "iOS, ", "[]"], "jtp": ["Windows Journal Template", "Template created by Windows Journal, a program used for note-taking on tablet PCs; contains default text, images, and page layout settings; used to create notes pages (.JNT files) with the same look and feel, such as to-do lists or agendas.", "Windows, ", "['Microsoft Windows Journal', 'Microsoft Windows Journal Viewer']"], "jtf": ["JPEG Tagged Interchange Format", "Image file based on the .TIFF format that is compressed using .JPEG compression; may also include JPEG tags, such as EXIF information and other metadata supported by the JPEG format.", "Windows, Mac, ", "['image viewer']['image viewer']"], "jsxinc": ["ExtendScript Included Script File", "Script written in ExtendScript, an extended version of JavaScript used by Adobe Creative Suite (CS) applications; contains variables and functions that are used as libraries for a CS extension; used for storing functions that can be included within other .JSX files using the #include directive.", "Windows, Mac, ", "['Adobe ExtendScript Toolkit']['Adobe ExtendScript Toolkit']"], "jsxbin": ["Binary ExtendScript Script File", "Binary script created by ExtendScript Toolkit (ESTK), a tool used to add extensions to Adobe Creative Suite (CS) applications; contains the binary version of a .JSX file, which is written using ExtendScript, an extended version of JavaScript; used for distributing CS extensions and for protecting scripts by making them non-human readable.", "Windows, Mac, ", "['Adobe ExtendScript Toolkit']['Adobe ExtendScript Toolkit']"], "jsx": ["ExtendScript Script File", "Script written in the ExtendScript language, an extension to the JavaScript language; used for writing plug-ins for Adobe Creative Suite (CS) applications; may be created using the ExtendScript Toolkit included with Adobe Utilities.", "Windows, Mac, ", "['Adobe ExtendScript Toolkit', 'Adobe After Effects CC 2017']['Adobe ExtendScript Toolkit', 'Adobe After Effects CC 2017']"], "jst": ["Jnes Save State", "Save file created and used by Jnes, a Nintendo Entertainment System (NES) emulator for Windows; contains a save state of an NES game.", "Windows, Windows, Mac, ", "['Jnes']['Adobe Dreamweaver CC 2017']['Adobe Dreamweaver CC 2017']"], "jss": ["JACOsub Subtitle File", "File created by JACOsub subtitling software; stores video subtitles in a plain text format and saves timing sequences for when to display text or graphic subtitles; originally used for overlaying English subtitles on Japanese videos, but also adopted for other languages as well.", "Windows, Mac, Linux, Windows, Windows, Mac, Linux, ", "['URUWorks Subtitle Workshop', 'VideoLAN VLC media player', 'MPlayer']['VideoLAN VLC media player', 'MPlayerX', 'MPlayer']['VideoLAN VLC media player', 'MPlayer']['Freedom Scientific JAWS']['JSS']['JSS']['JSS']"], "jspx": ["XML Java Server Page", "XHTML Web page generated from a server using JSP functions; used for providing dynamic content on the Web; similar to a .JSP file, but uses XML syntax; can be edited with Web development program or a basic text editor.", "Windows, Mac, Linux, ", "['SyncRO Soft oXygen XML Editor', 'text editor', 'Web browser', 'Apache Tomcat']['SyncRO Soft oXygen XML Editor', 'text editor', 'Web browser', 'Apache Tomcat']['SyncRO Soft oXygen XML Editor', 'text editor', 'Web browser', 'Apache Tomcat']"], "jspa": ["Java Servlet Alias", "Alias or shortcut to a Java Servlet (.JSP) file; used by the WebWork Web application framework for online forums and related services; may execute one or more JSP pages when called.", "Windows, Mac, ", "['Web browser']['Web browser']"], "jspf": ["Java Server Page Fragment", "Web page source code file written using Java Server Page (.JSP) syntax; contains a fragment of JSP code that does not comprise an entire JSP document; used for abstracting reusable segments of code and statically including them in JSP pages. ", "Windows, Mac, Linux, Windows, Mac, Linux, ", "['Adobe Dreamweaver CC 2017', 'Richardson EditRocket', 'ES-Computing EditPlus', 'Eclipse IDE for Java Developers', 'text editor']['Adobe Dreamweaver CC 2017', 'Richardson EditRocket', 'Eclipse IDE for Java Developers', 'text editor']['Eclipse IDE for Java Developers', 'text editor']['text editor']['text editor']['text editor']"], "jsp": ["Java Server Page", "A JSP file is a server-generated web page.  It is similar to an .ASP or .PHP file, but contains Java code instead of ActiveX or PHP.  The code is parsed by the web server, which generates HTML that is sent to the user's computer.", "Windows, Mac, Linux, ", "['Microsoft Internet Explorer', 'Mozilla Firefox', 'Google Chrome', 'Web browser', 'Adobe Dreamweaver CC 2017', 'ES-Computing EditPlus', 'Progress Stylus Studio', 'Richardson EditRocket', 'Eclipse IDE for Java Developers']['Apple Safari', 'Mozilla Firefox', 'Google Chrome', 'Web browser', 'Adobe Dreamweaver CC 2017', 'MacroMates TextMate', 'Richardson EditRocket', 'Eclipse IDE for Java Developers']['Mozilla Firefox', 'Google Chrome', 'Web browser', 'Eclipse IDE for Java Developers', 'Richardson EditRocket', 'ES-Computing EditPlus']"], "jsonlz4": ["Compressed Firefox Bookmarks Backup File", "Compressed bookmark backup file created and used by Firefox, a web browser; contains data describing all of the bookmarks used by the Firefox user profile; similar to the .JSON file used by Firefox. ", "Windows, Mac, Linux, ", "['Mozilla Firefox']['Mozilla Firefox']['Mozilla Firefox']"], "json": ["JavaScript Object Notation File", "A JSON file is a file that stores simple data structures and objects.  It contains data in a standard data interchange format which is lightweight, text-based, and human-readable.  JSON files were originally based on a subset of JavaScript, but is considered a language-independent format, being supported by many different programming APIs.", "Windows, Mac, Linux, ", "['File Viewer Plus', 'Altova XMLSpy', 'Microsoft Notepad', 'Microsoft WordPad', 'Notepad++', 'text editor', 'Mozilla Firefox']['Apple TextEdit', 'Bare Bones TextWrangler', 'MacVim', 'text editor', 'Mozilla Firefox']['Vim', 'Pico', 'GNU Emacs', 'text editor', 'Mozilla Firefox']"], "jsh": ["JAWS Script Header File", "Script header file written for JAWS; a Windows screen reading application that provides text to speech functionality for Windows text; stores header information for a .JSS source file; used in the process of developing automated JAWS screen reading tasks.", "Windows, Windows, Mac, Linux, ", "['Freedom Scientific JAWS']['Jsh']['Jsh']['Jsh']"], "jsl": ["Corel PaintShop Pro Shape Library", "A JSL file contains a shape library created by version 7 of PaintShop Pro, a program used for editing images and digital photos.  It stores one or more vector preset shapes, such as a circle, square, triangle, chat bubble, or butterfly.", "Windows, ", "['Corel PaintShop Pro X9']"], "jsfl": ["Animate JSFL Script File", "Script written in Flash JavaScript (JSFL), an API that extends regular JavaScript to include the Flash Document Object Model (DOM); contains JFSL program code written in a plain text format.", "Windows, Mac, ", "['Adobe Animate CC 2017']['Adobe Animate CC 2017']"], "jsf": ["Java Script Command File", "File created by Fireworks, a graphics editor application; contains JavaScript code commands that perform certain actions in Fireworks; an example of a contained command is, when selected, converting a shape color to gray. ", "Windows, Mac, Windows, ", "['Adobe Fireworks']['Adobe Fireworks']['Project64']"], "jse": ["JScript Encoded File", "Script written in JScript, a programming language used for Windows and Microsoft Internet Explorer scripting; contains source code in a format similar to JavaScript, but the JScript specification is maintained by Microsoft.", "Windows, ", "['Microsoft WScript', 'Microsoft CScript', 'text editor']"], "jsda": ["Jazer Data File", "File used by Jazer, a program used for personal and professional financial management; stores financial data such as account balances, investments, and loans; used for tracking finances and generating reports in the software.", "Windows, ", "['Jazer']"], "jsd": ["Jazer Data File", "File used by Jazer, a personal and professional financial management program for Windows; saved in a binary format and contains the user's financial data; replaced by the .JSDA format in later Jazer software versions.", "Windows, ", "['Jazer']"], "js": ["JavaScript File", "A JS file is a text file containing JavaScript code that is used to execute JavaScript instructions in web pages.  It may include functions that open and close windows, validate form fields, enable rollover images, or create drop-down menus.", "Windows, Mac, Linux, Windows, ", "['File Viewer Plus', 'Adobe Dreamweaver CC 2017', 'Adobe ColdFusion Builder', 'Microsoft Visual Studio 2017', 'Jetbrains IntelliJ IDEA', 'ES-Computing EditPlus', 'text editor', 'Web browser']['Adobe Dreamweaver CC 2017', 'Adobe ColdFusion Builder', 'Apple Dashcode', 'Bare Bones BBEdit', 'MacroMates TextMate', 'text editor', 'Web browser']['Web browser', 'text editor'][]"], "jrz": ["PSP Game Data File", "Data file used by games for the PlayStation Portable (PSP), such as XSEED Games' Half-Minute Hero game; contains references to .VAG audio files; may also contain other game data; used for storing in-game content.", "Windows, Mac, ", "['Nero 2017', 'ISO Master', 'PowerISO']['Apple Disk Utility']"], "jrtf": ["JAmes OS Rich Text File", "Rich text file used by JAmes OS, an emulated operating system that runs in Windows; may contain bold type, italics, and different fonts as well as simple formatting elements; used for saving text files in JAmes OS.", "Windows, ", "['Microsoft Notepad', 'Microsoft WordPad']"], "jrxml": ["JasperReports Layout File", "File used by JasperReports, a Java library used for creating reports programmatically; contains report design definition in XML format; includes design elements such as report layout, text fields, images, charts, parameters, and variables.", "Windows, Mac, Linux, ", "['Jaspersoft JasperReports', 'Jaspersoft iReport']['Jaspersoft JasperReports', 'Jaspersoft iReport']['Jaspersoft JasperReports', 'Jaspersoft iReport']"], "jrprint": ["JasperReports Print File", "File created by JasperReports, an open source programming library in Java used for creating reports; contains all report content such as headers, footers, page layout, text, and images; used in conjunction with a .JASPER file to \"fill\" a report with data from a data source.", "Windows, Mac, Linux, ", "['Jaspersoft JasperReports', 'Jaspersoft iReport']['Jaspersoft JasperReports', 'Jaspersoft iReport']['Jaspersoft JasperReports', 'Jaspersoft iReport']"], "jrs": ["Exchange Reserve Transaction Log File", "Transaction log file created by Microsoft Exchange, a popular messaging and collaboration program; serves as a placeholder for a transaction and is saved in the Exchange queue database.", "Windows, ", "['Microsoft Exchange Server']"], "jrc": ["PCjr Cartridge ROM File", "File used for emulating games and other software for the older IBM PCjr system, which debuted in 1984; saves a replica of the data on a PCjr cartridge; can be run by DOSBox, but only if configured properly.", "Windows, Mac, Linux, ", "['DOSBox']['DOSBox']['DOSBox']"], "jqz": ["JQuiz File", "Quiz file created by Hot Potatoes, a program used to create online activities; contains a quiz that consists of one or more multiple choice or short answer questions.", "Windows, Mac, Linux, ", "['Half-Baked Hot Potatoes']['Half-Baked Hot Potatoes']['Half-Baked Hot Potatoes']"], "jpx": ["JPEG 2000 Image File", "Formal extension used for JPEG 2000 files; JPEG 2000 is an improvement to the standard .JPEG format that compresses image files using lossy or lossless compression.", "Windows, Mac, Linux, Windows, ", "['File Viewer Plus', 'Apple QuickTime Player', 'CorelDRAW Graphics Suite X8', 'Corel PaintShop Pro X9', 'Adobe Photoshop CC 2017', 'Adobe Photoshop Elements 15', 'Adobe Illustrator CC 2017', 'ACD Systems Canvas X 2017', 'Mozilla Firefox', 'Google Chrome', 'IvanView', 'IrfanView']['Apple Preview', 'Apple Safari', 'ToyViewer', 'Lemkesoft GraphicConverter', 'Adobe Photoshop CC 2017', 'Adobe Photoshop Elements 15', 'Adobe Illustrator CC 2017', 'Mozilla Firefox', 'Google Chrome']['Mozilla Firefox', 'XnViewMP']['Embarcadero JBuilder']"], "jpw": ["World File for JPEG", "JPEG world file used by geographic information system (GIS) applications; stores the location, scale, and rotation of a map that is saved as a JPEG image; used for associating raster map images with world locations, such as for aerial satellite photographs.", "Windows, Linux, ", "['ESRI ArcReader', 'ESRI ArcGIS for Desktop', 'Blue Marble Geographics Global Mapper']['ESRI ArcReader']"], "jps": ["Stereo JPEG Image", "Stereoscopic JPEG image used for creating 3D effects from 2D images; contains two static images, one for the left eye and one for the right eye; encoded as two side-by-side images in a single .JPG file.", "Windows, Mac, Linux, Web, Windows, Mac, Linux, ", "['NVIDIA 3D Vision Photo Viewer', 'StereoPhoto Maker', '3DFantastic 3D Stereo Producer', 'Logipole Konvertor', 'XnViewMP']['XnViewMP']['XnViewMP']['Snapily 3D Camera Prints']['Akeeba eXtract Wizard']['Akeeba eXtract Wizard']['Akeeba eXtract Wizard']"], "jpr": ["JBuilder Project", "Software development project file created by JBuilder, a development IDE for the Java programming language; saves references to source code files as well as project properties; used for saving and loading projects.", "Windows, Windows, ", "['Embarcadero JBuilder']['Fugawi Global Navigator', 'ESRI ArcGIS for Desktop', 'text editor']"], "jpn": ["Windows Japanese Noise-Word List File", "System file used by Index Server, a search indexing service included with the Windows operating system; contains a list of English and Japanese words that are excluded from Windows search; enables Windows to create search information more effectively, since words such as \"of,\" \"the,\" and \"it\" are excluded from the index.", "Windows, ", "['Microsoft Windows', 'Microsoft Notepad', 'text editor']"], "jph": ["JProbe Memory Snapshot", "Snapshot of memory usage generated by JProbe, an enterprise-class Java profiling program; created by JProbe's memory debugger; used for identifying the root cause of a program's performance and stability problems.", "Windows, ", "[]"], "jpg2": ["JPEG 2000 Image", "Compressed bitmap image created using the JPEG 2000 standard, which incorporates a wavelet compression algorithm to compress images better than the standard JPEG format; more commonly seen with the .JP2 and .JPX file extensions.", "Windows, Mac, Linux, ", "['Adobe Photoshop CC 2017', 'CorelDRAW Graphics Suite X8', 'IrfanView', 'XnViewMP']['Adobe Photoshop CC 2017', 'XnViewMP']['XnViewMP']"], "jpgw": ["JPEG World File", "GIS file used by GIS applications for georeferencing raster maps; contains location information for specifying the position of a corresponding .JPG map image in actual world coordinates; enables satellite images to be placed accurately on the globe.", "Windows, ", "['ESRI ArcGIS for Desktop', 'Blue Marble Geographics Global Mapper', 'text editor']"], "jpg": ["JPEG Image", "A JPG file is an image saved in a compressed image format standardized by the Joint Photographic Experts Group (JPEG).   It is commonly used for storing digital photos and used by most digital cameras to save images.  JPG files are among the most common image files along with .PNG, .TIF, and .GIF.", "Windows, Mac, Linux, Web, iOS, Android, ", "['File Viewer Plus', 'Microsoft Windows Photos', 'Microsoft Windows Photo Viewer', 'Microsoft OneDrive', 'Microsoft Paint', 'Adobe Photoshop CC 2017', 'Adobe Photoshop Elements 15', 'CorelDRAW Graphics Suite X8', 'Corel PaintShop Pro X9', 'ACD Systems ACDSee 20', 'picture viewer', 'Web browser']['Apple Preview', 'Apple Photos', 'Adobe Photoshop CC 2017', 'Adobe Photoshop Elements 15', 'ACD Systems ACDSee Mac Pro 3', 'MacPhun ColorStrokes', 'picture viewer', 'Web browser']['GIMP', 'Shotwell', 'Web browser']['Google Drive', 'Microsoft OneDrive']['Google Drive', 'Pixelmator 2', 'Microsoft OneDrive', 'Adobe Photoshop Express']['Apowersoft Phone Manager', 'Google Drive', 'Microsoft OneDrive', 'Adobe Photoshop Express']"], "jpf": ["JPEG 2000 Image", "Successor to the .JPEG image format; may incorporate lossy or lossless compression; supports image transparency, and additional metadata information; can be viewed with QuickTime Player 7 or later and with Photoshop if the JPEG2000.8bi plugin is installed.", "Windows, Mac, ", "['Apple QuickTime Player', 'Adobe Acrobat DC', 'Adobe Photoshop CC 2017', 'Adobe Photoshop Elements 15', 'Adobe Illustrator CC 2017', 'CorelDRAW Graphics Suite X8', 'Corel PaintShop Pro X9', 'XnViewMP']['Apple QuickTime Player', 'Adobe Acrobat DC', 'Adobe Photoshop CC 2017', 'Adobe Photoshop Elements 15', 'Adobe Illustrator CC 2017', 'XnViewMP']"], "jpeg": ["JPEG Image", "A JPEG file is an image saved in a compressed graphic format standardized by the Joint Photographic Experts Group (JPEG).  It  supports up to 24-bit color and is compressed using lossy compression, which may noticeably reduce the image quality if high amounts of compression are used.  JPEG files are commonly used for storing digital photos and web graphics.", "Windows, Mac, Linux, Web, iOS, Android, ", "['File Viewer Plus', 'Microsoft Windows Photos', 'Microsoft Windows Photo Viewer', 'Adobe Photoshop CC 2017', 'Adobe Photoshop Elements 15', 'Adobe Illustrator CC 2017', 'ACD Systems Canvas X 2017', 'ACD Systems ACDSee 20', 'Nuance PaperPort 14', 'Nuance OmniPage Ultimate', 'CorelDRAW Graphics Suite X8', 'Corel PaintShop Pro X9', 'Roxio Creator NXT Pro 5', 'Laughingbird The Logo Creator', 'Web browser', 'picture viewer']['Apple Preview', 'Adobe Photoshop CC 2017', 'Adobe Photoshop Elements 15', 'Adobe Illustrator CC 2017', 'Roxio Toast 15', 'Laughingbird The Logo Creator', 'Apple Safari', 'MacPhun ColorStrokes', 'Web browser', 'picture viewer']['Mozilla Firefox', 'GIMP']['Google Drive']['Google Drive']['Google Drive']"], "jpe": ["JPEG Image", "24-bit compressed JPEG graphic format that is commonly used for Web graphics; best suited for photos or images that contain lots of colors; also used by most digital cameras for saving digital photos.", "Windows, Mac, ", "['Microsoft Windows Photos', 'Microsoft Windows Photo Gallery', 'Adobe Photoshop CC 2017', 'Adobe Photoshop Elements 15', 'Adobe Illustrator CC 2017', 'CorelDRAW Graphics Suite X8', 'ACD Systems Canvas X 2017', 'ACD Systems ACDSee 20', 'Nuance PaperPort 14', 'Nuance OmniPage Ultimate', 'Axel Rietschin FastPictureViewer', 'picture viewer', 'Web browser']['Apple Preview', 'Adobe Photoshop CC 2017', 'Adobe Photoshop Elements 15', 'Adobe Illustrator CC 2017', 'picture viewer', 'Web browser']"], "jpd": ["Java Process Definition", "XML document that defines processes within business process diagrams; based on the BEA WebLogic Integration standard", "Windows, Windows, Mac, ", "['text editor']['Apple QuickTime Player with the PhotoDefiner component']['Apple QuickTime Player with the PhotoDefiner component']"], "jpc": ["JPEG 2000 Code Stream File", "Image format that uses JPEG 2000 advanced wavelet compression; supports color depths of 8, 24, and 32 bits per pixel; also supports grayscale, RGB, YCbCr, XYZ, and Lab color spaces.", "Windows, Mac, Linux, ", "['File Viewer Plus', 'Adobe Photoshop CC 2017', 'Adobe Photoshop Elements 15', 'ACD Systems ACDSee 20', 'Corel PaintShop Pro X9', 'ACD Systems Canvas X 2017', 'Adobe Illustrator CC 2017', 'ImageMagick', 'IvanView']['Adobe Photoshop CC 2017', 'Adobe Photoshop Elements 15', 'Lemkesoft GraphicConverter', 'Adobe Illustrator CC 2017', 'ImageMagick', 'ToyViewer']['ImageMagick']"], "jp1": ["Japanese (Romaji) Text File", "Text document that contains Japanese characters encoded in ASCII text; formatted in Romaji, a Romanized version of the Japanese language; can be viewed in Adobe Acrobat or Reader if Japanese fonts are installed.", "Windows, Mac, ", "['Adobe Reader with Japanese Fonts']['Adobe Reader with Japanese Fonts']"], "jpa": ["Akeeba Backup Archive", "Backup archive format created by Akeeba software, which is used for backing up and securing websites; stores a whole or part of a full backup of a website including the database, files, and the restoration script; similar to the PKZIP format.", "Windows, Mac, Linux, ", "['Akeeba eXtract Wizard']['Akeeba eXtract Wizard']['Akeeba eXtract Wizard']"], "jp2": ["JPEG 2000 Core Image File", "Compressed bitmap image created using JPEG 2000 Core Coding; incorporates a wavelet compression algorithm instead of Digital Cosine Transform (DCT) compression used by standard JPEG images; can be stored using lossy and lossless compression.", "Windows, Mac, Linux, ", "['File Viewer Plus', 'Adobe Photoshop CC 2017', 'Adobe Photoshop Elements 15', 'ACD Systems Canvas X 2017', 'ACD Systems ACDSee 20', 'CorelDRAW Graphics Suite X8', 'Corel PaintShop Pro X9', 'Mozilla Firefox', 'Google Chrome', 'IvanView', 'ERDAS IMAGINE']['Apple Safari', 'Apple Preview', 'Adobe Photoshop CC 2017', 'Adobe Photoshop Elements 15', 'Lemkesoft GraphicConverter', 'Snap Converter', 'Google Chrome', 'Mozilla Firefox', 'MacPhun ColorStrokes']['Mozilla Firefox', 'XnViewMP']"], "joy": ["CryENGINE Facial Editor Joystick File", "Settings file created by Facial Editor, a component of the CryENGINE SDK video game making software; saves a joystick configuration for a joystick that is used to configure facial movements for a game character.", "Windows, ", "['Crytek CryENGINE SDK']"], "joined": ["HJ-Split Data File", "Data file created by HJ-Split, a program that breaks up larger files into several smaller files and then builds them back into the original file; represents the rebuilt copy of the original file but with the added JOINED file extension; can be used to transfer large data files in smaller parts, such as email attachments.", "Windows, Mac, Linux, ", "[][][]"], "jo": ["jo Audio File", "Audio file used by the jo Audio Player, a French audio playback program; stores the audio in a proprietary format whose goal is to keep high quality audio while reducing the file size; more commonly uses the .JO-7Z format, which incorporates file compression.", "Windows, ", "['jo Audio Player']"], "joe": ["JOE Document", "File created by Cyril Hicks; contains simple text; saved in a proprietary format and can only be opened by the .joe Editor; includes multiple features, e.g., it cannot be edited once saved, cannot be exported as a different file type, and cannot be chosen as a valid filetype or as a default type.", "Windows, ", "['.joe Editor']"], "joboptions": ["Adobe Joboptions File", "File used by Adobe Distiller, a program that controls the creation of PDF files; stores properties for generating a PDF, including security settings, color schemes, fonts, and image resolutions; allows generated PDFs to have the same properties.", "Windows, Mac, Linux, ", "['Adobe Acrobat DC', 'Adobe InDesign CC 2017', 'Adobe Illustrator CC 2017']['Adobe Acrobat DC', 'Adobe InDesign CC 2017', 'Adobe Illustrator CC 2017'][]"], "jnx": ["BirdsEye JNX Raster Map", "A JNX file is a raster map used by select Garmin devices, such as Alpha 100 and Montana 650, to assist users with navigating terrain.  It contains a large raster map saved in a tile format that is divided into small rectangular pieces (tiles) for optimizing map rendering.  JNX files also store the encrypted unit ID of the Garmin device it is created for.  ", "Windows, ", "['QMapShack']"], "job": ["MetaCAM Nest Job File", "Nest job file created by MetaCAM, a CAD program used to increase efficiency in industry and manufacturing; contains nest job settings and instructions; used to store information that optimizes the use of materials and space for manufactured products.", "Windows, Windows, ", "[]['Microsoft Windows Task Scheduler']"], "jo-7z": ["jo Audio File", "Audio file compressed with 7-Zip compression (.7Z files); saved in a proprietary format that has the goal of reducing the file size using compression techniques while still retaining high quality audio.", "Windows, ", "['jo Audio Player']"], "jnt": ["Windows Journal File", "Journal created with Windows Journal note-taking software; typically created on a Tablet PC, but may also be created on a standard Windows PC with Windows Journal installed.", "Windows, ", "['Microsoft Windows Journal', 'Microsoft Windows Journal Viewer']"], "jnp": ["Java Web Start File", "Java file that contains instructions for the Java Network Launching Protocol (JNLP); used for launching and managing Java programs or applets from a web browser; can run the associated program if the Java Runtime Environment (JRE) is installed.", "Windows, Mac, Linux, Web, ", "['Oracle Java Web Start', 'text editor']['Oracle Java Web Start', 'text editor']['Oracle Java Web Start', 'text editor']['Oracle Java Web Start']"], "jnilib": ["JNI Library", "Developer library used by JNI (Java Native Interface), a framework that allows Java to integrate with other programming languages; contains functions or methods that provide the invocation interface between the programming languages.", "Windows, Mac, Linux, ", "['Oracle JNI']['Oracle JNI']['Oracle JNI']"], "jnlp": ["Java Web Start File", "A JNLP file is created in the Java Network Launching Protocol (JNLP) format.  It contains information such as the remote address for downloading a Java program (.JAR file) and the initial class to run.  JNLP files are used for launching and managing Java programs over a network or on the web (e.g., an applet in a web browser).  ", "Windows, Mac, Linux, ", "['Oracle Java Web Start', 'text editor']['Oracle Java Web Start', 'text editor']['Oracle Java Web Start', 'text editor']"], "jng": ["JPEG Network Graphic", "Image file format related to the .PNG format, but uses lossy compression like standard .JPG files; developed as a sub-format for .MNG objects, but can also be used as a standalone raster image format.", "Windows, Mac, Android, ", "['File Viewer Plus', 'XnViewMP', 'IrfanView', 'fCoder Group Image Converter Plus']['XnViewMP']['File Viewer for Android']"], "jmx": ["JMix File", "Activity file created by Hot Potatoes, a software suite used to make and share online quizzes; contains a jumbled-sentence exercise; includes hints that the student can use for help in solving the problem.", "Windows, Mac, Linux, ", "['Half-Baked Hot Potatoes']['Half-Baked Hot Potatoes']['Half-Baked Hot Potatoes']"], "jmv": ["Jnes Movie File", "Gameplay recording created by Jnes, an NES emulator for Windows; saves the state of the NES ROM (.NES or .NSF file) as well as user inputs so that the exact gameplay can be replayed in the software; does not contain actual video data (i.e., no .AVI, .MP4, etc. file); can be shared with other Jnes users, who can watch the replay in Jnes.", "Windows, ", "['Jnes']"], "jmt": ["JMatch File", "Exercise file created by Hot Potatoes, a suite of programs used to make and share online quizzes; contains a word matching and ordering exercise.", "Windows, Mac, Linux, ", "['Half-Baked Hot Potatoes']['Half-Baked Hot Potatoes']['Half-Baked Hot Potatoes']"], "jms": ["Masher Project", "Project created by Hot Potatoes, a suite used to create various quizzes, puzzles, and other problems; stores the settings of each tab of your Masher project, which includes exercise files, appearance, buttons, and index information.", "Windows, Mac, Linux, ", "['Half-Baked Hot Potatoes']['Half-Baked Hot Potatoes']['Half-Baked Hot Potatoes']"], "jmp": ["JMP Data File", "Data file created by JMP, a program that allows users to visualize statistics created in SAS software; contains tabular data in the format of fields and records, which represent data types and values; can be created via JMP Scripting Language (JSL) scripts; may be imported and exported within SAS software.", "Windows, Mac, ", "[][]"], "jmf": ["Jackhammer Project", "Native project format created by Jackhammer, a level and map editor for games with quake-style BSP architecture; stores a level and all related information, which includes map sources.", "Windows, Linux, ", "['Chain Studios Jackhammer']['Chain Studios Jackhammer']"], "jmcp": ["JM-Crypt Encrypted File", "File encrypted by the JM-Crypt encryption algorithm, which is used by JM-Crypt software; contains a file protected by a hybrid encryption algorithm and password.", "Windows, ", "[]"], "jmcx": ["JM-Crypt Encrypted File", "Encrypted file created by JM-Crypt software, which utilizes the JM-Crypt encryption algorithm; contains a file secured by a hybrid encryption algorithm and a randomly generated password.", "Windows, ", "[]"], "jmc": ["JM-Crypt Encrypted File", "File encrypted by the JM-Crypt encryption algorithm; stores a file protected by a hybrid encryption algorithm and password.", "Windows, ", "[]"], "jmcr": ["JM-Crypt Encrypted File", "File secured by JM-Crypt software; contains a file encrypted by a hybrid encryption algorithm and password.", "Windows, ", "[]"], "jmck": ["JM-Crypt Key File", "File encrypted by JM-Crypt software; stores a file secured by the JM-Crypt encryption algorithm, which consists of a hybrid encryption algorithm and password.", "Windows, ", "[]"], "jmce": ["JM-Crypt Encrypted File", "File encrypted by the JM-Crypt encryption algorithm; contains a file secured by a hybrid encryption algorithm and password; similar to the .JMCR encrypted file.", "Windows, ", "[]"], "jl": ["Julia Source Code File", "Source code file written in Julia, a programming language used for high performance scientific computations; designed for outperforming other high-performance languages and supports parallel and cloud computing.", "Linux, Web, ", "['Julia']['Julia Interactive Prompt']"], "jks": ["Java Keystore File", "Encrypted security file used to store a set of cryptographic keys or certificates in the binary Java Key Store (JKS) format; requires a password to be opened.", "Windows, Mac, Linux, ", "['Eclipse IDE for Java Developers', 'KeyStore Explorer']['Eclipse IDE for Java Developers', 'KeyStore Explorer']['Eclipse IDE for Java Developers', 'KeyStore Explorer']"], "jkm": ["JAWS Key Map File", "File used by JAWS, a screen reading program that enables text to speech functionality in Windows; saves keystroke assignments that act as hotkeys for interacting with the JAWS software; may be the default key map used by the software or a custom user-defined key map.", "Windows, ", "['Freedom Scientific JAWS']"], "jkb": ["Jedi Knight Bot File", "Bot file used by Star Wars Jedi Knight: Jedi Academy, a Star Wars game that gives the Jedi the choice to follow the light or dark side; contains data for bots' personalities that are controlled by the computer; referenced throughout the game to determine bots' behavior, such as what messages they say to you, their reflexes, their accuracy, and if they can carry a light saber.", "Windows, Mac, ", "['Raven Software Star Wars Jedi Knight: Jedi Academy']['Raven Software Star Wars Jedi Knight: Jedi Academy']"], "jic": ["Java Icon File", "Cross-platform icon format used by Java programs; contains images used for program icons; basically a .ZIP file containing a group of .PNG or .JPG images.", "Windows, Mac, Windows, ", "['Smith Micro StuffIt Deluxe for Windows', 'Corel WinZip 21']['Smith Micro StuffIt Deluxe 16']['Altera Quartus II']"], "jis": ["Japanese Industry Standard Text", "System for encoding Japanese text.", "Windows, ", "['JWPce']"], "jigsaw": ["Jigsaw Explorer Save File", "Save file created by Jigsaw Explorer, a browser-based jigsaw puzzle program; uses XML formatting and saves the current puzzle; enables puzzles to be saved to the desktop even though the program runs in the browser.", "Web, ", "['Carolina Road Jigsaw Explorer']"], "jiff": ["JPEG Image File Format", "Raster graphic compressed using JPEG image compression", "Windows, Mac, ", "['Adobe Photoshop CC 2017', 'image viewer']['Apple Preview', 'Adobe Photoshop CC 2017', 'image viewer']"], "jif": ["JPEG Image File", "Raster graphic compressed using JPEG compression", "Windows, Mac, ", "['Adobe Photoshop CC 2017', 'image viewer']['Apple Preview', 'Adobe Photoshop CC 2017', 'Planamesa NeoOffice', 'image viewer']"], "jia": ["Digital Photo Navigator Album", "Digital photo album created with JVC's Digital Photo Navigator, a photo organization program included with JVC camcorders; stores a group of photos selected by the user and can be exported in a Web page format.", "Windows, Mac, ", "[][]"], "jgcscs": ["EditPad Custom Syntax Coloring Scheme File", "File used by EditPad, a text and source code editor for Windows; saves information that allows the editor to support syntax highlighting for a particular language, such as HTML, PHP, Perl, or SQL; should be copied to the same directory as the EditPadPro.exe file to be installed.", "Windows, ", "['JGsoft EditPad Pro']"], "jgz": ["Gzipped Javascript File", "Javascript (.JS) file zipped using GZip (.GZ) compression; typically used for shrinking the file sizes of large Javascript documents referenced by websites; can be decompressed on the fly by most Web servers using a Gzip utility.", "Windows, Mac, Linux, ", "['Smith Micro StuffIt Deluxe for Windows', 'Corel WinZip 21', 'WinRAR 5', 'Acubix PicoZip', 'E-merge WinAce', '7-Zip']['Smith Micro StuffIt Deluxe 16']['gzip']"], "jgw": ["JPEG World File", "Georeference file used by GIS products such as ESRI ArcGIS Desktop; stored in plain text and contains the coordinates for a corresponding raster .JPG image; used for referencing the location of aerial view maps; can be tiled with other JPEG world images.", "Windows, ", "['ESRI ArcGIS for Desktop', 'Autodesk AutoCAD Map 3D 2017', 'text editor']"], "jet": ["JET Database File", "Database file created by the Microsoft Joint Engine Technology (JET) Engine; contains a database structure, which includes tables and fields, and table row database entries in the JET format.", "Windows, ", "['Microsoft Access 2016']"], "jg4": ["BigJig Jigsaw Puzzle", "Jigsaw puzzle file used by BigJig, a computer-based jigsaw puzzle game; contains a photo or painting that is broken into puzzle pieces; may use eight different shape styles including classic, modern, curl, artistic, bony, scrappy, distorted, and spriggy.", "Windows, ", "[]"], "jhtml": ["Java HTML Web Page", "HTML file that includes Java code; similar to a standard .HTML file, but may include Java functions that are processed on the server before the page is sent to the client's Web browser; can also access information from a database using a JDBC (Java Database Connectivity) connection.", "Windows, Mac, Linux, ", "['Web browser']['Web browser'][]"], "jfif": ["JPEG File Interchange Format", "Bitmap graphic that uses JPEG compression; a variation of the common JPEG format that is designed to use a minimal amount of data and allow JPEG bitstreams to be exchanged between multiple platforms and applications.", "Windows, Mac, ", "['Microsoft Windows Photos', 'Axel Rietschin FastPictureViewer', 'picture viewer', 'Web browser']['Apple Preview', 'picture viewer', 'Web browser']"], "jfi": ["JPEG File Interchange Image", "Compressed bitmap image that uses JPEG compression; may include variations to the standard JPEG format as defined in the JFIF (JPEG File Interchange Format) specification; also seen with the .JFIF extension.", "Windows, Mac, Linux, ", "['Microsoft Windows Photo Gallery', 'Adobe Photoshop CC 2017', 'Adobe Photoshop Elements 15', 'Corel PaintShop Pro X9', 'CorelDRAW Graphics Suite X8', 'Newera Graphics Converter Pro', 'XnViewMP', 'image viewer']['Apple Preview', 'Apple Photos', 'Adobe Photoshop CC 2017', 'Adobe Photoshop Elements 15', 'XnViewMP', 'image viewer']['XnViewMP', 'GIMP']"], "jed": ["Xilinx JEDEC Programming File", "Xilinx JEDEC (Joint Electron Device Engineering Council) project file; used for programming computer hardware devices, such as microprocessors; must be lowercase (.jed, not .JED) in order to be recognized by Xilinx iMPACT.", "Windows, Linux, ", "['Xilinx ISE Design Suite']['Xilinx ISE Design Suite']"], "jdp": ["BlackBerry JDE Application Project", "A JDP file is a project created by BlackBerry Java Development Environment (JDE) and the BlackBerry JDE plug-in for Eclipse, which are used to create and test Java apps for BlackBerry smartphones.  It contains information on how JDE should build the BlackBerry application including the resource files needed for the build.  JDP files also contain project properties, such as the application type.", "Windows, Mac, ", "['BlackBerry JDE', 'BlackBerry Plug-in for Eclipse']['BlackBerry Plug-in for Eclipse']"], "jef": ["Janome Embroidery Format", "Embroidery format used by Janome sewing machines; contains stitching patterns and sewing instructions for creating embroideries; native format used by Janome sewing software, but also recognized by Embrid Suite.", "Windows, ", "['Janome Digitizer', 'BALARAD Embird Studio']"], "jdf": ["Adobe Acrobat Job Definition File", "XML file created by Adobe Acrobat, an application used to create and edit .PDF documents; contains job ticket and workflow instructions for printing; may include ink requirements, page orderings, print quantities, preflight profiles, and other requirements.", "Windows, Mac, ", "['Adobe Acrobat DC']['Adobe Acrobat DC']"], "jdb": ["Symantec Endpoint Protection Update File", "File used by Symantec Endpoint Protection (SEP), a program that protects computers against malware; contains virus and spyware definition updates; used to periodically update malware definitions when new viruses and spyware are discovered.", "Windows, ", "['Symantec EndPoint Protection 12']"], "jcrypt": ["JCRYPT File", "File encrypted with JCRYPT, a Web-based service used for encrypting and decrypting files; used random data manipulation algorithms to secure the contents of the files so that they are not readable unless decrypted.", "Web, ", "['JMasters JCRYPT']"], "jcr": ["Nonogram Puzzle File", "Puzzle file used by nonogram puzzle programs, such as QNonograms; contains a nonogram puzzle in binary format, similar to the more common .JAP file.", "Windows, Linux, ", "['QNonograms']['QNonograms']"], "jcp": ["JCreator Project File", "Java development project created by JCreator, a Java IDE; saves a list of references to source code files for the project, as well as project settings and any other dependencies; can be compiled into a Java program when complete.", "Windows, ", "['Xinox JCreator']"], "jdc": ["JDownloader Links File", "Backup file created by JDownlaoder, a Java-based program used to manage Internet downloads; contains a collection of links that were used for downloading files; used for backing up download locations so they can be transferred to another system or recovered in the case of lost data.", "Windows, Mac, Linux, ", "['JDownloader']['JDownloader']['JDownloader']"], "jcz": ["Liquid Motion Animation", "Web animation, which may contain both text and images; uses a Java engine, compatible with multiple platforms; created by the discontinued Microsoft Liquid Motion program.", "Windows, Mac, ", "['Web browser']['Web browser']"], "jcw": ["JCross File", "Crossword puzzle created by Hot Potatoes, a program used to create online quizzes; contains a crossword puzzle activity and clues to help the user.", "Windows, Mac, Linux, ", "['Half-Baked Hot Potatoes']['Half-Baked Hot Potatoes']['Half-Baked Hot Potatoes']"], "jclic": ["JClic Project File", "File created by JClic, a Java program used for developing small games in educational environments; saves one or more \"activities\" which are puzzles, quizzes, or other small games; saved in an XML format and stores the layout of each activity screen as well as the events that are triggered based on user input.", "Windows, Mac, Linux, ", "['JClic']['JClic']['JClic']"], "jceks": ["JCEKS Keystore File", "Keystore file saved in the Java Cryptography Extension KeyStore (JCEKS) format; used as an alternative keystore to the Java Keystore (JKS) format for the Java platform; stores encoded keys and certificates that are referenced by a Java program.", "Windows, Mac, Linux, ", "['Eclipse IDE for Java Developers']['Eclipse IDE for Java Developers']['Eclipse IDE for Java Developers']"], "jbmp": ["JAmes OS Bitmap Image", "Bitmap image used by JAmes OS, an emulated operating system that runs as a Windows application; stores the image in the standard .BMP format; used for saving and loading images in JAmes OS.", "Windows, ", "['Microsoft Paint', 'Microsoft Windows Photo Viewer', 'GIMP']"], "jcl": ["JCloze File", "Quiz file created by Hot Potatoes, an application that enables users to create online activities; contains a fill-in-the-blanks quiz.", "Windows, Mac, Linux, ", "['Half-Baked Hot Potatoes']['Half-Baked Hot Potatoes']['Half-Baked Hot Potatoes']"], "jc": ["FlashGet Partial Download", "Partial or incomplete file downloaded with FlashGet, a download management program; created when a download is started and saved as the actual file (with the original extension) when the download is complete.", "Windows, ", "['FlashGet']"], "jbk": ["Juno Backup File", "Backup file created by Juno Internet service software; introduced with version 5 of the Juno software and contains backups of program files and user data such as email; saved in a proprietary format and used for restoring data with the Juno software.", "Windows, Mac, Linux, ", "['Juno Software', 'Mozilla Firefox with Juno Software plug-in']['Juno Software', 'Mozilla Firefox with Juno Software plug-in']['Mozilla Firefox with Juno Software plug-in']"], "jag": ["Jagex Data File", "Game data file used by Jagex games such as Runescape, an MMORPG; can save various data, including images, sounds, and other game object data; stored in a proprietary format required by the game in order to load the game data.", "Windows, ", "['Jagex Runescape', \"Tom's Cache Suite\"]"], "jbig": ["Joint Bi-level Image Group File", "Bitonal image created in the JBIG format; stores a black and white (1-bit) raster graphic using lossless compression; compresses at a higher ratio than the CCITT Group 4 algorithm; commonly used for fax transmissions.", "Windows, Mac, ", "['Newera Graphics Converter Pro', 'XnViewMP']['Newera Graphics Converter Pro', 'ToyViewer', 'XnViewMP']"], "jbig2": ["JBIG2", "Bitonal image saved in the Joint Bi-level Image Group 2 (JBIG2) format; store the image using black and white with 1 bit per pixel; may be lossy or lossless; enables greater compression than the CCITT Fax Group 4 algorithm; often used for scanned images and faxes; replaces the previous .JBIG specification.", "Windows, Mac, Linux, ", "['Nuance OmniPage Ultimate', 'Orpalis PaperScan', 'Newera Graphics Converter Pro', 'XnViewMP']['Newera Graphics Converter Pro', 'XnViewMP']['XnViewMP']"], "jad": ["Java Application Descriptor File", "Descriptor file that describes the contents of a MIDlet, a type of Java program developed for the Java ME (Micro Edition) virtual machine; may include DRM protection information; commonly used to package Java games and applications developed for cell phones.", "Windows, ", "['LogoManager MobiMB Mobile Media Browser', 'JADMaker']"], "jdat": ["J&ASoft Data File", "Data file used by J&ASoft Music Player, a free player for Windows; contains application data such as settings, system requirements, build dates and codes, and program version.", "Windows, ", "['Microsoft Notepad']"], "jac": ["JaStaCry Encrypted File", "Encrypted file created by JaStaCry, a file encryption program developed by Kai Kretschmann;  contains files that have been secured by combining different hiding, merging, and crypto stacks.", "Windows, ", "['JaStaCry']"], "ja": ["Jet Archive", "Game file used by N3V Games' (previously Auran) Jet engine; saves a compressed archive of game files and can include 3D game models and other information; enables game resources to be bundled together instead of across multiple files.", "Windows, ", "['N3V Games Trainz Simulator']"], "j6i": ["Ricoh Camera Image File", "A digital image captured by Ricoh digital cameras, such as the RDC-2 and RDC-7 models; based off the JPEG format but is supported by few image editing programs.", "Windows, Mac, Linux, ", "['XnViewMP', 'SageThumbs']['XnViewMP']['XnViewMP']"], "j3o": ["jMonkeyEngine 3D Scene", "3D scene file created by the jMonkeyEngine (JME) SDK, an application suite used for developing 3D games in Java; saves 3D objects, textures, lighting properties, effects, and other 3D scene information; uses a proprietary binary format required to load the scene into the game at runtime.", "Windows, Mac, Linux, ", "['jMonkeyEngine SDK']['jMonkeyEngine SDK']['jMonkeyEngine SDK']"], "j2l": ["Jazz Jackrabbit 2 Level File", "Custom level designed for Jazz Jackrabbit 2, a 2D sidescroller action game, inspired by Sonic the Hedgehog; created with the Jazz Creation Station (JCS) level editor; may be password-protected.", "Windows, Mac, ", "[][]"], "j2k": ["JPEG 2000 Image", "Compressed bitmap image that uses wavelet compression instead of the DCT compression used by standard .JPEG images; supports 16-bit color, alpha transparency, and lossless compression.", "Windows, Mac, ", "['IvanView', 'CorelDRAW Graphics Suite X8', 'Corel PaintShop Pro X9', 'Serif PhotoPlus', 'Adobe Photoshop CC 2017', 'Adobe Photoshop Elements 15', 'Apple QuickTime Player', 'ACD Systems Canvas X 2017', 'BioniX Wallpaper']['ToyViewer', 'Lemkesoft GraphicConverter', 'Adobe Photoshop CC 2017', 'Adobe Photoshop Elements 15', 'Apple QuickTime Player']"], "j2i": ["Jazz 2 Internet Link File", "Text file containing Internet connection settings for a Jazz Jackrabbit 2 multiplayer game; includes the IP address of the server hosting the game; may be downloaded from websites that list active Jazz 2 online games.", "Windows, ", "[]"], "j01": ["Akeeba Multi-part Backup Archive", "Backup archive format created by Akeeba software, which is used for backing up and securing websites; stores a partial backup of a whole website.", "Windows, Mac, Linux, ", "['Akeeba eXtract Wizard']['Akeeba eXtract Wizard']['Akeeba eXtract Wizard']"], "j2c": ["JPEG 2000 Code Stream", "Bitmap image created using JPEG 2000 compression, which is similar to standard .JPG compression but uses a newer encoding standard that allows flexibility at the cost of computational complexity; can be viewed by most applications that support standard .JP2 files.", "Windows, Mac, Linux, ", "['IvanView', 'Corel PaintShop Pro X9', 'ImageMagick', 'ACD Systems Canvas X 2017', 'Adobe Photoshop CC 2017', 'Adobe Photoshop Elements 15', 'Adobe Illustrator CC 2017']['ToyViewer', 'Newera Graphics Converter Pro', 'ImageMagick', 'Adobe Photoshop CC 2017', 'Adobe Photoshop Elements 15', 'Adobe Illustrator CC 2017']['ImageMagick']"], "jc!": ["FlashGet Incomplete Download", "Incomplete file downloaded with FlashGet, a download manager; created when a download begins and serves as a placeholder for the completed file; when the download finished, the file is saved with the original extension.", "Windows, ", "['FlashGet']"], "jbr": ["Paint Shop Pro Brushes File", "Contains brush tips, or styles of brushes, that can be used with the Paint Shop Pro brush tool; used for simulating the texture of various types of brushes.", "Windows, ", "['Corel PaintShop Pro X9', 'ACD Systems ACDSee 20']"]}