{"kct": ["Keyman Developer Customization Source File", "A KCT file is a source file created by Keyman Developer, a program used to create, edit, and distribute digital keyboards for any type of language.  It contains information about the user interface of a custom keyboard, which includes text, configuration windows, and welcome screens.", "Windows, ", "['Tavultesoft Keyman Developer']"], "kbd": ["3ds Max Keyboard Shortcuts File", "File created by 3ds Max, a 3D modeling and animation program; contains hotkeys and other keyboard shortcuts for menus and functions in the application; can be the default configuration installed by the program, or a custom configuration created by the user.", "Windows, Windows, ", "['Autodesk 3ds Max 2017']['IDM UltraEdit', \"Janko's Keyboard Generator\"]"], "kdc": ["Kaspersky Virus Database File", "Update file used by Kaspersky Lab's system security software; contains virus definitions that are used for detecting and quarantining viruses; may also be used  during the system rescue process for removing malicious software; may be downloaded periodically for keeping the software and definitions up-to-date.", "Windows, Mac, Windows, Mac, Android, ", "['Kaspersky Anti-Virus 2017', 'Kaspersky Internet Security 2017']['Kaspersky Internet Security for Mac']['File Viewer Plus', 'Microsoft Windows Photos', 'ACD Systems ACDSee 20', 'Adobe Photoshop Lightroom 6', 'Adobe Photoshop CC 2017', 'Adobe Photoshop Elements 15', 'Corel PaintShop Pro X9', 'ACD Systems Canvas X 2017', 'Google Picasa', 'fCoder Group Image Converter Plus', 'NCH Pixillion']['Adobe Photoshop CC 2017', 'Adobe Photoshop Elements 15', 'Adobe Photoshop Lightroom 6', 'Google Picasa']['File Viewer for Android']"], "kcl": ["Mario Kart Collision File", "Game file used by Mario Kart for the Nintendo DS and Nintendo Wii game consoles; contains collision data that controls how the karts interact with the physical constraints of the course (i.e., walls or track floors).", "Windows, ", "['MKDS Course Modifier']"], "kdb": ["Keypass Database File", "Database of passwords used by KeePass Password Safe, a free, open-source password management program; stores user passwords for a variety of logins, such as network logon, e-mail, FTP, websites, etc; passwords within the database can be sorted into groups for further organization.", "Windows, Mac, Linux, ", "['KeePass Password Safe']['KeePassX']['KeePassX']"], "kdbx": ["KeePass Password Database", "File created by KeePass Password Safe, a free password manager for Windows; stores an encrypted database of passwords that can only be viewed using a master password set by the user; used to securely store personal login credentials for Windows, email accounts, FTP sites, e-commerce sites, and other purposes.", "Windows, Mac, Linux, ", "['KeePass Password Safe']['KeePass Password Safe']['KeePass Password Safe']"], "kbs": ["Keyboard Script File", "Script used by Keyboard Script, a keystroke automation program; saved in a plain text format and contains instructions for keystrokes; used for saving repetitive key sequences; functions similarly to a macro that is triggered by a key combination.", "Windows, ", "['PC Dirck Keyboard Script']"], "kde": ["KryptoStorage Container File", "File created by KryptoStorage and other Kaspersky antivirus and computer protection products; saves an archive of files in a password protected, encrypted format; allows users to securely store and archive sensitive personal data.", "Windows, ", "['Kaspersky PURE 3.0 Total Security']"], "kb2": ["Kleo Backup File", "Backup archive created by Kleo Bare Metal Backup for Servers, a program used to backup and clone computer files; can store the entire computer's file system, including operating system, device driver, and application files; used to clone or backup and restore all files on a hard drive.", "Windows, Mac, Linux, ", "['Carroll-Net Kleo']['Carroll-Net Kleo']['Carroll-Net Kleo']"], "kb": ["C++ Keyboard Script", "Script created with Borland C++ 4.5, a Windows software development program based on the C++ programming language; enables functions to be executed by using keyboard commands (instead of the mouse).", "Windows, ", "['text editor']"], "kar": ["Karaoke MIDI File", "Audio file created by various Karaoke applications such as Band-in-a-Box; contains MIDI data as well as song lyrics stored in text; does not contain actual audio data since the the music is stored using MIDI; used for playing back lyrics with songs.", "Windows, Mac, Linux, Windows, ", "['PG Music Band-in-a-Box', 'Nullsoft Winamp', 'Recisio KaraFun', \"vanBasco's Karaoke Player\"]['PG Music Band-in-a-Box', 'Mireth Technology Music Man']['KMid']['PC-Karel']"], "kap": ["BSB Chart Image File", "File used by programs that read nautical charts; contains cartographic information in text format as well as encoded raster images in binary format; used by GIS programs and organizations such as the National Oceanic and Atmospheric Administration (NOAA).", "Windows, Mac, ", "['Safe Software FME Desktop'][]"], "kag": ["King Arthur's Gold Map File", "Map file used by King Arthur's Gold, a 2D medieval game where players mine resources, build castles, and fight enemies; includes the terrain, items, players units, and other objects; used for map the starting conditions.", "Windows, Mac, Linux, ", "[\"King Arthur's Gold\"][\"King Arthur's Gold\"][\"King Arthur's Gold\"]"], "k3g": ["3GP Mobile Phone Video File", "Video file created in the 3GPP format but uses an extension that is much less common than the .3GP extension; stores video in a compact format that is suitable for Internet transfer and playback on mobile devices.", "Windows, ", "['Microsoft Windows Live Movie Maker', 'Microsoft Windows Media Player', 'GRETECH GOM Player']"], "k2s": ["Kaiser 2 Saved Game", "Saved game created by Kaiser II, a nation building and foreign policy game based on the original Amiga game; saves the player progress including economic activity and international policy decisions.", "Windows, ", "['Mantronic Kaiser 2']"], "kz": ["KuaiZip Compressed File", "Compressed archive created by KuaiZip, a free file compression and decompression utility; uses a proprietary format that can increase the compression ratio five to thirty percent over standard .RAR compression and ten percent over .7Z compression.", "Windows, ", "['KuaiZip']"], "kyr": ["Lotus Domino Key Ring File", "Password-protected binary file that stores secure certificates on a Lotus Domino server; used for authenticating SSL and other secure connections; must be signed by a certifying authority to be valid.", "Windows, ", "['IBM Domino', 'IBM Lotus Notes']"], "kyb": ["Keyboard Layout", "Defines the layout of the keyboard (what input each key produces); often used for typing in different languages or using a keyboard from a foreign country.", "Windows, ", "[]"], "kxx": ["Keyman Developer Encrypted Keyboard File", "A KXX file contains an encrypted keyboard file created by Keyman Developer, an application used to create, edit, and distribute digital keyboards.  It stores an encrypted keyboard for a custom Keyman Engine product.  KXX files cannot be used with any product other than the custom product for which it was created.", "Windows, ", "['Tavultesoft Keyman Developer']"], "kx": ["KiXtart Tokenized Script File", "A KX file is a tokenized version of the .KIX file written in the KiXtart scripting language.  It is a script that is smaller and can be processed faster than KIX scripts.  The file is encrypted and contains a signature for protection from any accidental changes in the script.", "Windows, ", "['File Viewer Plus', 'KiXtart']"], "kwreplay": ["Command & Conquer 3 Replay File", "Recording of a campaign from Command and Conquer 3: Kane's Wrath, a real-time strategy game; saves the entire gameplay from a campaign so that it can be played back at a later time; typically saved as \"filename.KWReplay.\"", "Windows, ", "[]"], "kwm": ["WebMoney Key File", "Private key file created by WebMoney, a desktop program that allows users to access the WebMoney online fund transfer and payments system; saves the user's private keys in a small encrypted file; can be required for certain software functions.", "Windows, ", "['WebMoney Keeper Classic']"], "kv6": ["Ken's Voxlap 6 Model File", "A KV6 file is a Ken Silverman's version 6 model file which is also known as Ken's Voxlap 6 (KV6) and used by games with the Voxlap engine.  It contains model and texture information for game objects, such as weapons and body parts.", "Windows, ", "['Slab6']"], "kwd": ["KWord Document", "Text document created with KWord, a frame-based word-processing and desktop publishing program; includes advanced page formatting options and uses paragraph style sheets to apply styles to text, tables, columns, borders, etc.", "Mac, Linux, ", "[][]"], "kvtml": ["KWordQuiz File", "File used by KWordQuiz, a flash card \"edutainment\" application that is part of The KDE Education Project; stores information about a set of flash cards using XML formatting; includes the text for the front and back of each card; can be used to load data for multiple choice quizzes, or for committing vocabularies to memory.", "Linux, ", "['The KDE Education Project KWordQuiz', 'The KDE Education Project KVocTrain', 'The KDE Education Project Parley']"], "kvk": ["Keyman On-Screen Keyboard File", "A KVK file contains an on-screen keyboard created by Keyman Developer, a program used to create, edit, and distribute digital keyboards.  It stores information about a virtual keyboard, which includes the layout of characters assigned to keys, constraints, and dead keys.", "Windows, ", "['Tavultesoft Keyman Developer']"], "kuip": ["Kingsoft Office Personalization File", "Personalization file used by WPS Office (previously known as Kingsoft Office), an office suite which includes the Writer, Spreadsheets, and Presentation applications; contains information used to configure the application's user interface, which includes the theme, style, and functionality.", "Windows, ", "['Kingsoft WPS Office']"], "k3b": ["K3b Disk Burning Project File", "File created by K3b, a disk burning application for KDE (a Linux desktop GUI); saves a list of files to be burned as well as the target disk format; can be used for data or audio CD projects.", "Linux, ", "['K3b']"], "ktp": ["Kinetic Project Template", "Audio project template used by Kinetic, a program used for creating electronic music; saves instrument patches and audio loops that can be reused when creating new audio projects (.KIN files).", "Windows, ", "['Cakewalk SONAR X3']"], "ktn": ["KTooN Animation Project File", "Project file created by KTooN, a 2D animation program; saves an animation timeline and supports both vector and raster graphics; can be exported to .OGV, .AVI, .MPG, and .SWF formats when complete; sometimes used for distributing free 2D animation content.", "Linux, ", "['KTooN']"], "kth": ["Keynote Theme", "Presentation theme file used by Keynote, an Apple iWork program used to create presentations; contains the default graphics, fonts, and layout settings for a presentation; used for saving presentation templates.", "Mac, ", "['Apple Keynote 7']"], "ktz": ["Kahootz Project File", "Project file created by Kahootz, an educational program that allows students to create and explore 3D worlds; saves a 3D scene and can include animation sequences; often used for creating small puzzles or games.", "Windows, ", "['ACTF Kahootz']"], "kt3": ["Battery 3 Drum Kit File", "File used by Battery 3, a program that uses drum audio samples to create drum rhythms and sounds; contains descriptions and sound samples for different drum kit types, such as a Jazz Kit or Rock Kit; includes kit sound samples for snare drum, bass drum, toms, hi-hats, and cymbals.", "Windows, Mac, ", "[][]"], "kt2": ["Battery 2 Drum Kit File", "File used by Battery, a program that creates drum rhythms and sounds from drum audio samples; contains descriptions and sound samples a particular drum kit type, such as a Rock Kit or Jazz Kit; includes kit sound samples for bass drum, snare drum, hi-hats, percussion, toms, and cymbals.", "Windows, Mac, ", "[][]"], "kt": ["Kotlin Source Code File", "A KT file contains source code written in Kotlin, a statically typed programming language developed by JetBrains.  Kotlin supports both functional and object-oriented styles and is most often used to supplement or replace Java when developing business and end user applications.", "Windows, Mac, Linux, ", "['Google Android Studio', 'Jetbrains IntelliJ IDEA', 'Oracle NetBeans', 'Eclipse']['Google Android Studio', 'Jetbrains IntelliJ IDEA', 'Oracle NetBeans', 'Eclipse']['Google Android Studio', 'Jetbrains IntelliJ IDEA', 'Oracle NetBeans', 'Eclipse']"], "ksm": ["Pfaff Embroidery Design File", "Stitch design file used by some Pfaff embroidery machines; contains a stitch pattern that can be automatically sewn by the machine; can be viewed and edited with the design software bundled with the embroiderer or with Embird Studio.", "Windows, Windows, ", "['BALARAD Embird Studio']['Nullsoft Winamp with IN_KEN plug-in']"], "ksh": ["Unix Korn Shell Script", "Script written for the Unix operating system; contains a list of commands that can be run within a Korn Shell or Bourne-Again Shell; can be viewed and edited with a text editor.", "Linux, ", "['text editor']"], "ksf": ["Korg Trinity/Triton Sample File", "Contains samples (also known as waveforms) that can be played back by the Korg Trinity and Triton synthesizers; often stored on a media card or USB device that is used to transfer the sample data to the synthesizer.", "Windows, Windows, ", "['FMJ-Software Awave Studio']['KMPlayer']"], "kys": ["Adobe Photoshop Keyboard Shortcuts File", "File created by Photoshop, a professional graphics editing program; saves custom key combinations used to trigger menu options and other commands; allows shortcuts to be restored between installations of Photoshop.", "Windows, Mac, ", "['Adobe Photoshop CC 2017', 'Adobe Illustrator CC 2017']['Adobe Photoshop CC 2017', 'Adobe Illustrator CC 2017']"], "kps": ["Keyman Developer Package Source File", "A KPS file contains package information and is created by Keyman Developer, a program used to create, edit, and distribute digital keyboards.  It stores information that specifies which files should be included in the package when compiled into a KMP Keyman package file.", "Windows, ", "['Tavultesoft Keyman Developer']"], "ksc": ["Korg Trinity/Triton Script File", "Contains a list of .KMP files, or \"multisamples,\" which reference audio samples; used by custom instruments created by the user; references audio files, but does not contain actual audio data.", "Windows, ", "['FMJ-Software Awave Studio']"], "ksd": ["Native Instruments Massive Sound File", "Sound file created by Native Instruments Massive, a program (DAW) that enables you to create and edit \"massive\" sounds such as deep, punchy bass lines; contains a preset or user-created sound with different settings for filters, amps, fx, noise, oscillators, and more; replaced by the .NMSV file in Massive version 1.3.", "Windows, Mac, iOS, Android, ", "['Native Instruments Massive']['Native Instruments Massive']['KeepSafe Private Photo Vault']['KeepSafe Vault']"], "ks": ["Kickstart File", "File used for creating images of Linux-based operating systems such as Red Hat, CentOS, and Tizen; contains a series of instructions that are used for automatic, unattended construction of an operating system (OS) image that can be used for running the OS.", "Linux, Windows, Mac, Linux, ", "['MIC2', 'text editor']['Eclipse IDE for Java Developers', 'Unity Technologies Unity', 'KeyStore Explorer']['Eclipse IDE for Java Developers', 'Unity Technologies Unity', 'KeyStore Explorer']['Eclipse IDE for Java Developers', 'KeyStore Explorer']"], "krz": ["Kurzweil K2000 File", "File format used for saving data from a Kurzweil K2600 synthesizer to a floppy disk; may contain MIDI data, samples, and song information.", "Windows, ", "['FMJ-Software Awave Studio']"], "kpz": ["Komodo Template File", "Template for creating a new project in Komodo, a dynamic Web application development program; may be used as a starting point for creating a specific type of application.", "Windows, Mac, Linux, ", "['ActiveState Komodo IDE', 'ActiveState Komodo Edit']['ActiveState Komodo IDE', 'ActiveState Komodo Edit']['ActiveState Komodo IDE', 'ActiveState Komodo Edit']"], "kpx": ["Kid Pix Picture", "Picture or painting created with Kid Pix, an art creation program for kids; may be exported from a scene or painting created with the Kid Pix Paint Zone; saved in a cross-platform format that can be viewed with both the Macintosh and Windows versions of Kid Pix.", "Windows, Mac, ", "[][]"], "kv": ["Kivy Language File", "Kivy language file used by Kivy, an open source Python library used to develop multi-touch enabled, cross-platform applications; may contain rule definitions, a root widget, dynamic class definitions, and templates.", "Windows, Mac, Linux, ", "['Kivy']['Kivy']['Kivy']"], "kpr": ["KPresenter Presentation", "Presentation or slideshow created with KPresenter, a Unix presentation application; may include text, images, and other types of embedded objects; supports the standard OASIS OpenDocument file format.", "Linux, ", "[]"], "kpp": ["Kid Pix Presentation", "Presentation created with Kid Pix, an artistic creation program for kids; contains slides with various pictures and objects that can be played back as a slide show; can be exported from Kid Pix by selecting the \"SlideShow To Go\" option.", "Windows, Mac, ", "[][]"], "kpl": ["Kids Programming Language File", "Source code file written in the Kids Programming Language (KPL); contains program code, including comments, variable declarations, functions, and other programming elements; used by students to store educational programs in learning environments.", "Windows, Windows, ", "[][]"], "kpg": ["Kai's Power Goo Graphic", "Image file edited and saved in Kai's Power Goo, a program that used for warping and distorting images; works best for altering digital photos.", "Windows, Mac, ", "[][]"], "kpf": ["Komodo Project File", "Project file created with Komodo, a Web application development program; supports multiple languages, including PHP, Ruby, Python, Perl, and Tcl; saved in an XML format and contains a list of resources referenced by the project.", "Windows, Mac, Linux, ", "['ActiveState Komodo IDE', 'ActiveState Komodo Edit']['ActiveState Komodo IDE', 'ActiveState Komodo Edit']['ActiveState Komodo IDE', 'ActiveState Komodo Edit']"], "koz": ["Audiokoz Music File", "Audio format developed by Chaoticom and used by Groove Mobile for downloading songs to mobile phones; also used by the Sprint Music store for Sprint/Nextel subscribers.", "Windows, Mac, Windows, Mac, ", "[][][][]"], "kor": ["Windows Korean Noise-Words List File", "System file used by part of the Windows operating system called Index Server, a component used for search indexing; contains a plain text list of noise words that should be excluded from the search index; enables Windows to index Korean search information more effectively, such as file and folder searches.", "Windows, ", "['Microsoft Windows', 'Microsoft Notepad', 'text editor']"], "koob": ["Koob E-Book File", "E-book file created by Koober, an application used to create and read e-books in the Koob format; contains book chapters, page navigation data, book styles, publication data, and other e-book information; can be read with KoobReader, a free e-book reading application included with Koober.", "Windows, ", "['Koober']"], "kon": ["Yahoo! Widget XML File", "Contains code for running a Yahoo! widget using Yahoo! Widgets; previously used by the Konfabulator program, which was bought by Yahoo! in 2005.", "Windows, Mac, ", "['Yahoo! Widgets']['Yahoo! Widgets']"], "kodu": ["Kodu Game File", "Game file created by Kodu Game Lab, an educational game development environment from Microsoft Research; saves a 3D game that was developed using the Kodu Game Lab software.", "Windows, ", "['Microsoft Kodu Game Lab']"], "kodak": ["Kodak Photo CD File", "Proprietary Kodak image format used for Kodak Photo CD files; more commonly seen with the .KDC extension.", "Windows, Mac, ", "[\"Adobe Photoshop with Kodak's File Format Plug-in\"][\"Adobe Photoshop with Kodak's File Format Plug-in\"]"], "ko": ["Linux Kernel Module File", "Module file used by the Linux kernel, the central component of the Linux operating system; contains program code that extends the functionality of the Linux kernel, such as code for a computer device driver; can be loaded without restarting the operating system; may have other required module dependencies that must be loaded first.", "Linux, ", "[]"], "knt": ["KeyNote Note File", "Text file created with KeyNote, a multi-featured notebook program based on Windows standard RichEdit control; allows multiple notes to be saved in a single file; supports advanced text formatting as well as styles, macros, plugins, and templates.", "Windows, ", "[]"], "kno": ["DigIN Serialized Break Model", "Data file created by DigIN, a program used for information management and knowledge discovery; stores a \"break model,\" which classifies the information from a set of digital resources (documents, Web pages, etc.) into a structure that allows patterns, relationships, and origins of data to be discovered; organizes meaning in the data by content, context, and structure, which visually comprise what is called a Borromean ring.", "Windows, Mac, ", "[][]"], "kmz": ["Google Earth Placemark File", "A KMZ file is a file that stores map locations viewable in Google Earth, a global mapping program.  It provides a bird's eye view of locations throughout the U.S. and other areas of the world.  KMZ files store placemarks that may include a custom name and the latitudinal and longitudinal coordinates of the location.", "Windows, Mac, Linux, Web, Android, ", "['Google Earth', 'Trimble SketchUp', 'Blue Marble Geographics Global Mapper', 'ESRI ArcGIS for Desktop', 'Blender with Google Earth Importer plug-in']['Google Earth', 'Trimble SketchUp', 'Blender with Google Earth Importer plug-in']['Google Earth', 'Blender with Google Earth Importer plug-in']['Google Maps']['Google Earth']"], "kmy": ["KMyMoney Data File", "File created by KMyMoney, a personal finance manager for Linux; saves financial data such as bank accounts, transactions, investments, assets, and credit card information; used as the native save and load format for KMyMoney.", "Linux, ", "['KMyMoney']"], "kmv": ["Mobile DJ Video File", "Video file created on a Sansui mobile device, such as the H50T, using the bundled Mobile DJ app; saved in the Matroska video (.MKV) format, but uses an alternate file extension.", "Windows, Mac, ", "['CyberLink PowerDVD 16', 'Nero 2017', 'Nullsoft Winamp', 'VideoLAN VLC media player', 'MPlayer']['Roxio Popcorn', 'Eltima Elmedia Player', 'MPlayer', 'VideoLAN VLC media player']"], "kmcobj": ["Kinemac Sprite Object", "3D object that can be imported into a Kinemac animation; can be dragged onto the Stage window after opening or creating a .KMC file; may contain references to images or video clips that  have been applied to the sprite.", "Mac, ", "[]"], "kms": ["Correlate Solutions File", "A KMS file is a data file created by Correlate Client, a Windows program used to create shortcuts to files and organize them in one document.  It contains a structure of one or more shortcuts to files.  KMS files are commonly used to store links to business, human resource, project, and productivity-related files.", "Windows, ", "['Correlate Client']"], "kmr": ["KnowledgeMill Link File", "File used by KnowledgeMill Filer, a Microsoft Outlook plug-in used for filing email content based on categories and business criticalness; saves a link to an artifact (e.g., a document) filed into a KnowledgeMill server.", "Windows, ", "['Microsoft Outlook with KnowledgeMill Filer plug-in']"], "kmp": ["Korg Trinity/Triton Keymap File", "Contains \"multisample\" data used by Korg Triton and Trinity workstations; does not include actual audio data, but instead references .KSF files that contain sample waveforms.", "Windows, Windows, ", "['FMJ-Software Awave Studio']['KMP Modifier']"], "kmm": ["K-Meleon Macro Module", "Macro created for K-Meleon, a lightweight Web browser based on the Gecko engine; saved in a text format and contains code written in the K-Meleon Macro Language; adds extra features and functionality to K-Meleon once installed.", "Windows, ", "['text editor']"], "kml": ["Keyhole Markup Language File", "A KML file stores geographic modeling information in XML format.  It includes points, lines, polygons, and images.  KML files are used to identify and label locations, create different camera angles, overlay textures, and add HTML content.", "Windows, Mac, Linux, Web, Android, ", "['Google Earth', 'Blue Marble Geographics Global Mapper', 'ESRI ArcGIS for Desktop', 'Merkaartor', 'Blender with Google Earth Importer plug-in']['Google Earth', 'Merkaartor', 'Blender with Google Earth Importer plug-in']['Google Earth', 'Merkaartor', 'Blender with Google Earth Importer plug-in']['Google Maps']['Google Earth']"], "kmc": ["Kinemac Animation File", "3D animation created with Kinemac, a 3D realtime animation and presentation program for Mac OS X; may include textured three-dimensional models, text, and sprites; also contains an animation timeline that defines the motion of each object in the animation.", "Mac, ", "[]"], "kma": ["Correlate Archive File", "A KMA file is an archive created by Correlate Client, a tool used to sort files in Windows by creating shortcuts to documents.  It contains an archive of a structure of one or more shortcuts to a user's files.  KMA files are often used to store links to project, business, human resource, and productivity-related files.", "Windows, ", "['Correlate Client']"], "klq": ["Kaspersky Quarantine File", "Quarantine file created by Kaspersky software products, such as Anti-Virus and Internet Security; contains viruses encrypted and quarantined by Kaspersky products.", "Windows, Mac, ", "['Kaspersky Anti-Virus 2017', 'Kaspersky Internet Security 2017']['Kaspersky Internet Security for Mac']"], "klg": ["Log File", "Text file containing a log of events; saved by Sophos\r\nAnti-Virus and other applications", "Windows, Mac, Linux, ", "['text editor']['text editor']['text editor']"], "kix": ["KiXtart Script File", "Script written in KiXtart, a free-format scripting language; includes built-in functionality for easy scripting and supports Active Directory Services Interface (ADSI), ActiveX Data Objects (ADO), and Windows Management Instrumentation (WMI) functions.", "Windows, ", "['File Viewer Plus', 'KiXtart', 'PSPad', 'text editor']"], "kit": ["CodeKit File", "File created by CodeKit, a HTML based programming language application; contains HTML with special comments to add imports and variables; compiled by CodeKit into a .HTML file.", "Mac, Windows, Windows, Mac, ", "['CodeKit', 'Adobe Edge Code CC'][][][]"], "kismac": ["KisMAC Webservice File", "File created by KisMAC, an open source program used for sniffing and scanning wireless computer networks; contains information acquired from scanning computer networks, such as services and clients; can be used for offline analysis of wireless networks; saved in a compressed format.", "Mac, ", "[]"], "kin": ["Kinetic Music Project", "Audio project file created by Kinetic, an application for creating electronic music; stores audio loops and instrument patches on a multitrack timeline; can be exported to common audio formats (e.g., .WAV or .MP3) and played in a standard audio player.", "Windows, ", "['Cakewalk SONAR X3']"], "kid": ["Kidspiration Document", "Multimedia file created with Kidspiration, a visual learning program for K-5 students; may contain pictures, text, and spoken words that represent thoughts and information; used for helping kids organize thoughts and ideas.", "Windows, Mac, ", "[][]"], "khi": ["Dynamics AX Kernel Help Index File", "Contains an index of help documentation (.KHD) files related the Microsoft Dynamics AX kernel; can be accessed using the Dynamics AX online help system.", "Windows, ", "['Microsoft Dynamics AX']"], "kic": ["Kodak Compressed Image File", "Bitmap image compressed with Kodak Image Compression (KIC); based on the standard .TIFF image format, but uses a proprietary Kodak compression algorithm; also known as a KIFF file (KIFF stands for \"Kodak Image File Format\").", "Windows, Mac, ", "['Kodak EasyShare']['Kodak EasyShare']"], "kgb": ["KGB Archive File", "File archive compressed using KGB Archiver, a data compression/file archiving tool created by Tomasz Pawlak; uses a higher compression rate than most other compression programs and supports AES-256 encryption.", "Windows, ", "['KGB Archiver']"], "khd": ["Dynamics AX Kernel Help Data File", "Stores help documentation for the Microsoft Dynamics AX kernel; contains information that can be accessed using the Dynamics AX online help system.", "Windows, ", "['Microsoft Dynamics AX']"], "kfx": ["Kofax Image File", "Raster image created by Kofax scanning and imaging software products; contains a graphic formatted as a Kofax Group 4 image; contains a 128 byte header, which includes information about the image size, date created, date modified, bit depth, and resolution; also contains a description text field.", "Windows, Mac, ", "['XnViewMP', 'Corel PaintShop Pro X9']['XnViewMP']"], "kfs": ["Max Payne Model File", "Game file used by Max Payne, a violent, third-person shooter noir video game; contains character models, including textures and meshes, that make up Max Payne and other characters in the game.", "Windows, ", "['Rockstar Games Max Payne', 'chUmbaLum sOft MilkShape 3D']"], "kfn": ["KaraFun Karaoke File", "File created by KaraFun, a program for editing and playing back karaoke music; saved in a proprietary format and contains MIDI audio as well as lyrics text and display animation settings; used for playing karaoke songs.", "Windows, ", "['Recisio KaraFun']"], "kfm": ["Gamebryo 3D Model File", "3D model used by some games developed with the Gamebryo engine, including Civilization IV, The Elder Scrolls: Oblivion, and many more; similar to a .NIF file and contains the geometry and motion information for a game model; used for storing characters, monsters, weapons, and other game objects.", "Windows, ", "['Gamebase Gamebryo', 'NifTools']"], "kf2": ["Max Payne Resource File", "Game resource file used by Max Payne, a violent, third-person shooter noir video game; contains weapon models, projectiles, skyboxes and keyframe animations.", "Windows, ", "['Rockstar Games Max Payne', 'chUmbaLum sOft MilkShape 3D']"], "keytab": ["Kerberos Keytab File", "Keytab file created and used by Kerberos, a network authentication protocol; contains pairs of Kerberos principals along with an encrypted copy of that principal's key.", "Windows, Mac, Linux, ", "['Kerberos']['Kerberos']['Kerberos']"], "keychain": ["Mac OS X Keychain File", "A KEYCHAIN file is created by Apple Keychain, a program bundled with Mac OS X that stores authentication information.  It contains an encrypted collection of resource authentication data, such as passwords, certificates, and private keys.", "Mac, ", "['Apple Keychain Access']"], "keystore": ["Java Keystore File", "Security file commonly used by (IDEs), such as Eclipse and Unity, to verify application developers; stores a set of cryptographic keys or certificates in the binary Java Key Store (JKS) format.", "Windows, Mac, Linux, ", "['Eclipse IDE for Java Developers', 'Unity Technologies Unity', 'KeyStore Explorer']['Eclipse IDE for Java Developers', 'Unity Technologies Unity', 'KeyStore Explorer']['Eclipse IDE for Java Developers', 'KeyStore Explorer']"], "key-tef": ["Keynote iCloud Presentation", "Slide show created by Keynote, the presentation software included with Apple's iWork suite; used as the storage format when the user chooses to save the presentation to iCloud; can be opened by both the iOS and Mac OS X versions of Keynote.", "Mac, iOS, ", "['Apple Keynote 7']['Apple Keynote']"], "key": ["Software License Key File", "A KEY file is a generic file extension used by various programs when registering legal copies of the software.  It may be saved in a plain text format but generally contains some form of encrypted key string that authenticates the purchase and registers the software.", "Windows, Windows, Mac, Windows, Mac, iOS, Windows, Mac, Windows, Mac, ", "[]['NewTek LightWave 3D']['NewTek LightWave 3D']['File Viewer Plus']['Apple Keynote 7', 'Apple Preview']['Apple Keynote'][][][][]"], "kext": ["Mac OS X Kernel Extension", "Mac OS X extension that provides additional OS functionality for a device or program; commonly used for peripherial device drivers; typically found in the /System/Library/Extensons/ directory.", "Mac, ", "['Apple OS X']"], "kexic": ["Kexi Database Connection File", "File used by Kexi, a Linux relational database application which is sometimes used as an alternative to MS Access; saves connection data for connecting to a Kexi database (.KEXI file).", "Linux, ", "['Kexi']"], "kexi": ["Kexi Database", "Database file created by Kexi, a database program that can be used as an alternative to Microsoft Access on Linux systems; supports database schemas, data, queries, forms, and other database information.", "Linux, ", "['Kexi']"], "kexis": ["Kexi Database Shortcut File", "Database connection file created by Kexi, a Linux database program; contains parameters used to connect to a specific database (.KEXI file), which may be hosted on a remote server; used for opening a remote connection to the database, which can then be edited in Kexi.", "Linux, ", "['Kexi']"], "keb": ["Kaspersky Virus Bases File", "Data file used by Kaspersky antivirus software; stores information that helps the software detect malware such as viruses and Trojans; can be found in the \\Kaspersky Lab\\AVP12\\Bases\\ installation directory.", "Windows, ", "['Kaspersky Anti-Virus 2017', 'Kaspersky Internet Security 2017']"], "kes": ["Kurzweil 3000 Document", "Document created by Kurzweil 3000, a learning assistance application featuring text to speech for students that struggle with reading comprehension; saves a document that has been scanned into the program using OCR technology.", "Windows, ", "['Kurzweil 3000']"], "kdmp": ["Windows Crash Dump File", "Memory dump saved to a file by Windows; contains a snapshot of the kernel mode portion of a given user mode process; used for debugging applications; may be created on Windows or Windows CE systems.", "Windows, ", "['Microsoft Windbg']"], "kdk": ["Kodak Proprietary Decimated TIFF File", "Variation of the standard .TIFF image  format used by select Kodak cameras; adopted by NASA for retrieving digital photographs from space, which are taken by Kodak cameras, such as the Kodak DCS460.", "Windows, Mac, ", "['Adobe Photoshop CC 2017']['Adobe Photoshop CC 2017']"], "kdi": ["KD Player Skin Image File", "Image file used by KD Player, a free Java ME (Micro Edition) audio player for mobile devices; stores the graphics for the skin in a .JPG, .PNG, or another standard bitmap format; used for styling the music player's buttons, background, and other elements.", "Windows, Mac, ", "['Microsoft Windows Photo Viewer', 'Microsoft Paint', 'Adobe Photoshop CC 2017', 'image viewer']['Apple Preview', 'Adobe Photoshop CC 2017', 'image viewer']"], "kdz": ["Kaspersky Virus Bases File", "File installed with Kaspersky antivirus and Internet security software; contains data that assists the software in the process of detecting and quarantining viruses and other malware; located in the \\Kaspersky Lab\\AVP12\\Bases\\ installation directory.", "Windows, ", "['Kaspersky Anti-Virus 2017', 'Kaspersky Internet Security 2017']"], "kds": ["KD Player Skin File", "Skin file used by KD Player, a music player designed for mobile devices that support Java ME (Micro Edition) technology; saved in plain text and contains layout settings for the visual components; used for styling the player.", "Windows, Mac, ", "['Microsoft Notepad', 'text editor']['Apple TextEdit', 'text editor']"], "kdevprj": ["KDevelop Project File", "Software development project created with KDevelop, a programming package for the KDE Development Environment; saved in an XML format and includes references to files and resources used by the project.", "Linux, ", "[]"], "kdevelop": ["KDevelop Project Data File", "Programming project file created with KDevelop, a KDE software development program; includes project settings and references to files used by the project; saved in a text format that can be edited with a text editor.", "Linux, ", "[]"], "kdevdlg": ["KDevelop Dialog Box File", "Contains text strings used for KDevelop dialog boxes; may be referenced by KDevelop programming projects; can be edited with KDevelop's Dialogeditor or converted to a .UI file using the kdevdlg2ui script.", "Linux, ", "[]"], "kdenlive": ["Kdenlive Project File", "Video editing project created by Kdenlive, an open source video editor for Linux; saved in an XML format and contains references to audio and video files as well as the arrangement of clips on the editing timeline; can be exported to DVD, MPEG2, .MP4, and other formats.", "Linux, ", "['Kdenlive']"], "k26": ["Kurzweil K2600 File", "File format used for saving data from a Kurzweil K2600 synthesizer to a floppy disk; same as the .KRZ format used by the K2000, but saved by the K2600", "Windows, ", "['FMJ-Software Awave Studio']"], "k25": ["Kodak K25 Image", "Digital photo captured by a Kodak DC25 digital camera, an older model from Kodak; can be converted to .JPG or other common formats using a converter such as DC25Convert or ReaConverter.", "Windows, Mac, Linux, Windows, ", "['Microsoft Windows Photos', 'Corel AfterShot Pro 3', 'DC25Convert', 'ReaSoft Development ReaConverter']['Corel AfterShot Pro 3']['Corel AfterShot Pro 3']['FMJ-Software Awave Studio']"]}