{"l": ["Game of Life File", "Contains a pattern of dots that is used as the starting point for \"The Game of Life,\" a mathematical game developed by John Conway; often used for teaching purposes in math and computer science.", "Windows, Mac, Linux, Windows, Mac, Linux, Windows, Mac, ", "[][][]['Microsoft Visual Studio with MKS Lex & Yacc plug-in']['Apple Xcode', 'Apple TextEdit', 'text editor']['Lex', 'Vim', 'GNU Emacs', 'text editor']['music player']['music player']"], "layoutdesigner": ["QuickBooks Layout Designer File", "File created by QuickBooks, a financial management application; contains a customized template of an invoice, sales receipt, estimate, credit memo, statement, or purchase order that can be used with another QuickBooks company file; created by the Layout Designer tool in QuickBooks.", "Mac, ", "['Intuit QuickBooks for Mac 2016']"], "layout": ["Code::Blocks Workspace Layout File", "Application support file created by Code::Blocks, an open source software development IDE for C/C++; saves layout settings for the developer's workspace, such as which files were open and where they were positioned; saved with a .CBP (Code::Blocks project) file and used to restore the workspace layout for the project.", "Windows, Mac, Linux, Windows, Mac, ", "['Code::Blocks']['Code::Blocks']['Code::Blocks']['Trimble LayOut', 'Trimble SketchUp']['Trimble LayOut', 'Trimble SketchUp']"], "lbc": ["Cloaked Affiliate Link Builder Saved Link", "Saved link data file created with Cloaked Affiliate Link Builder, a program for creating cloaked affiliate links; contains link settings such as the link text, the destination URL, the display URL, and the link title; can be used for creating both text and image links.", "Windows, ", "[]"], "lb": ["Lens Blur Project File", "File created by Lens Blur, an application that enables the user to apply Bokeh effects to images; contains a project, which consists of an image, customized effects, and any project settings.", "Mac, ", "['NexusHubs Lens Blur']"], "lbl": ["Now Contact Label Template", "Label template created by Now Contact, a contact information and day-to-day activities organizer; contains a template print layout for a label; pre-loaded options include \"Avery 4010,\"  \"Avery A4 L7160,\" \"CoStar 30251,\" and \"Dymo Shipping 30256.\"", "Windows, Mac, Windows, Windows, ", "['Now Contact']['Now Contact']['Euro Plus NiceLabel']['dBase']"], "lbm": ["Deluxe Paint Bitmap Image", "Interchange File Format-Interleaved Bitmap (IFF-ILBM) file; created by Electronic Arts' Deluxe Paint, a graphics editor developed for Amiga systems and later ported to other platforms.", "Windows, Mac, Linux, ", "['ACD Systems Canvas X 2017', 'Corel PaintShop Pro X9', 'XnViewMP', 'fCoder Group Image Converter Plus']['XnViewMP']['XnViewMP']"], "lbi": ["Dreamweaver Library Item", "Library file used by Adobe programs such as Dreamweaver, Flash, and Fireworks; stores a single asset from a larger library collection; may be a JavaScript function, an image, or other Web page component.", "Windows, Mac, ", "['Adobe Dreamweaver CC 2017', 'Adobe Fireworks', 'Adobe Flash Professional CC']['Adobe Dreamweaver CC 2017', 'Adobe Fireworks', 'Adobe Flash Professional CC']"], "lbf": ["LG Backup File", "An LBF file is a LG backup file created by the LG Backup application preloaded on LG phones running Android.  It contains a backup of data on your smartphone including applications, calendar entries, contacts, settings, and messages.", "Android, ", "['LG Backup']"], "lbr": ["LU Library Archive", "File archive created with LU, an older file archiver for MS-DOS; stored as a library of files and not compressed.", "Windows, Mac, ", "[]['The Unarchiver']"], "lay": ["Tecplot Layout File", "Diagram layout file created by Tecplot, a scientific computation and visualization program; saves the visual layout of a plot (.PLT file) in the workspace; contains instructions for how to display the plot as well as settings that define each frame's appearance.", "Windows, Mac, Linux, Mac, Windows, Windows, ", "['Tecplot 360']['Tecplot 360']['Tecplot 360']['Apple DVD Studio Pro']['McNeel Rhino']['MAME']"], "lav": ["DNA Sequence Alignment File", "A LAV file is a data file created by LASTZ, or its predecessor BLASTZ.  It contains alignment blocks of DNA sequences organized in matrices.  LAV files are used to identify similar structural, evolutionary, and functional relationships between DNA sequences.", "Windows, ", "['LASTZ']"], "lastlogin": ["Minecraft User Credential File", "Encrypted file containing the username and the password credentials of the last user to use the launcher to log into the Minecraft game; found in C/Users/User/AppData/Roaming/minecraft. ", "Windows, Mac, ", "[][]"], "lzx": ["Amiga LZX Compressed File", "Archive format used on Amiga systems in the 1990s; incorporates compression methods now used by Microsoft .CAB and .CHM files.", "Windows, Mac, ", "['cabextract']['The Unarchiver', 'cabextract']"], "latex": ["LaTeX Document", "Document prepared by LaTeX, a high-quality typesetting system; often used for technical and scientific documents, but can be used for many other forms of publishing.", "Windows, Mac, Linux, ", "['MiKTeX', 'TeXworks', 'LaTeX Editor', 'Texmaker', 'proTeXt']['LyX/Mac', 'TeXworks', 'Skim', 'Texmaker']['TeXworks', 'Texmaker']"], "lasso": ["Lasso Database-Driven Web Page", "Dynamic Web page that may include Lasso (LDML) code; can access database information using Lasso commands; may be integrated into websites created with Dreamweaver or GoLive, or built from scratch using Lasso Professional.", "Windows, Mac, ", "['LassoSoft Lasso', 'Web browser']['LassoSoft Lasso', 'Panic Coda 2', 'Web browser']"], "las": ["LIDAR Data Exchange File", "File created in the standard LAS format, which was developed by the American Society for Photogrammetry and Remote Sensing (ASPRS); stores Light Detection and Ranging (LIDAR) data that is collected by optical remote sensors; used to exchange LIDAR data between data providers and data consumers.", "Windows, ", "['LASUtility', 'ESRI ArcGIS for Desktop', 'Safe Software FME Desktop', 'Geosoft Oasis montaj', 'Blue Marble Geographics Global Mapper']"], "lzo": ["LZO Compressed File", "File archive compressed with lzop, a compression utility based on the LZO (Lempel-Ziv-Oberhume) data compression library; similar to the .GZIP format, but allows for greater compression ratios and higher decompression speeds.", "Windows, Linux, ", "['Corel WinZip 21'][]"], "lzp": ["LazPaint Image", "Image file stored in the LazPaint format; created by LazPaint, an image editor; contains a bitmap that uses lossless compression; similar to a .PNG file, but are larger in size.", "Windows, Linux, ", "['LazPaint']['LazPaint']"], "lzm": ["Slax Module", "Compressed module or package file that may contain multiple files; used by Slax, a small and fast Linux operating system; often used for program installation packages.", "Linux, ", "['Slax']"], "lzma": ["LZMA Compressed File", "File or files compressed with LZMA (Lempel-Ziv-Markov chain Algorithm) compression; used by 7-Zip and other file archivers; known for having better compression ratios than bzip2 (.BZ2 files) and faster decompression.", "Windows, Mac, Linux, Android, ", "['File Viewer Plus', 'Smith Micro StuffIt Deluxe for Windows', 'ConeXware PowerArchiver', '7-Zip', 'LZMA SDK']['Smith Micro StuffIt Deluxe 16', 'The Unarchiver', 'Sixty Five 7zX']['Tukaani LZMA Utils', 'File Roller', 'p7zip']['RARLAB RAR']"], "lzh": ["LZH Compressed File", "File archive compressed using Lempel-Ziv and Haruyasu compression algorithm; named after the inventors Lempel-Ziv and Haruyasu; derived from the LZSS compression scheme and performs additional compression using dynamic Huffman coding; most commonly used in Japan.", "Windows, Mac, Linux, ", "['File Viewer Plus', 'Corel WinZip 21', 'Smith Micro StuffIt Deluxe for Windows', 'WinRAR 5', 'ConeXware PowerArchiver', 'Whirling Dervishes Alpha ZIP', 'PeaZip', '7-Zip']['Corel WinZip Mac 5', 'Smith Micro StuffIt Deluxe 16', 'Incredible Bee Archiver', 'MacLHA', 'The Unarchiver'][]"], "lyt": ["Adminsoft Document Layout File", "Document layout exported by Adminsoft, a free \"double entry\" accounting system; used for saving and exchanging financial documents with other users; examples include customer sales invoices, account statements, sales quotes, and purchase orders.", "Windows, Windows, Mac, Windows, Windows, ", "['Adminsoft']['text editor']['text editor'][\"vanBasco's Karaoke Player\"]['Thermo Scientific Xcalibur']"], "lz": ["Lzip Compressed File", "File archive compressed with Lzip, a lossless data compressor based on the LZMA (Lempel-Ziv-Markov chain) algorithm; supports higher compression ratios than bzip2 and includes a 32-bit CRC checksum for checking the integrity of the file.", "Windows, Mac, Linux, ", "['Lzip']['Lzip']['Lzip']"], "lyr": ["ArcView Layer File", "Contains information available in ArcView's layer properties dialog box; may include symbols, display settings, joined table details, definition queries, labeling properties, and annotation display properties.", "Windows, Windows, ", "['ESRI ArcGIS for Desktop']['spgprints bestIMAGE']"], "lyx": ["LyX Document", "Document created with LyX - The Document Processor; designed to encourage writing based on the structure of the document, not its appearance; formatted using the TeX typesetting engine.", "Windows, Mac, Linux, ", "['Lyx']['LyX/Mac']['Lyx']"], "lyc": ["bestIMAGE Compressed Design File", "Compressed CAD design file created by bestIMAGE textile and engraving design software; stores a highly compressed version of a bestIMAGE .LYR design and may be lossless or lossy; used for submitting designs for bulk printing or engraving.", "Windows, ", "[]"], "lxsproj": ["Liquid XML Studio Project File", "Developer project file created by Liquid XML Studio, an XML development environment; saved in an XML format and stores the project name, references to project files, and file groups; used for organizing source code for XML projects.", "Windows, ", "['Liquid Technologies Liquid XML Studio']"], "ly": ["LilyPond File", "Input file for LilyPond, a musical score creation program; contains header information, such as the title and composer, followed by one or more musical scores; each score includes the clef, time, and key, followed by a list of notes and note durations.", "Windows, Mac, Linux, ", "['GNU LilyPond']['GNU LilyPond']['GNU LilyPond']"], "lxsopt": ["Liquid XML Studio Project Options File", "File created by Liquid XML Studio, an XML development environment; saved using XML formatting and contains complementary data for an .LXSPROJ project, such as the list of files that were open the last time the project was opened.", "Windows, ", "['Liquid Technologies Liquid XML Studio']"], "lxo": ["Luxology modo 3D Image", "3D image created by Luxology modo, a 3D modeling, animation, and rendering program; used for storing 3D scenes generated in the software; can be used for rendering high resolution images and animations on a single computer or on a network of computers.", "Windows, Mac, ", "['Foundry Modo', 'Unity Technologies Unity', 'MicroMouse AccuTrans 3D']['Foundry Modo', 'Unity Technologies Unity']"], "lxk": ["Lexicon Link-up File", "An LXK file is a text file used by COREX, a program used to listen to speech files and view annotations of the Dutch language.  It contains a chronological representation of annotations made during the lexicon link-up phase.  LXK files are saved in the XML format.", "Windows, ", "['COREX']"], "lx01": ["EnCase Logical Evidence File", "Logical evidence file created by EnCase forensics software; contains multiple files copied from an EnCase evidence (.EX01) file, preview, or smartphone acquisitions; used to store noteworthy evidence for forensic reasons.", "Windows, ", "['Guidance EnCase Forensic', 'Guidance EnCase Forensic Imager', 'GetData Mount Image Pro']"], "lxa": ["Microsoft Speech Lexicon File", "Contains lexicon data used for speech functions within Microsoft Office; multiple LXA files are installed with Office and have filenames similar to \"lsr1033.lxa;\" they are stored in the \\Program Files\\Common Files\\SpeechEngines\\Microsoft\\Lexicon directory.", "Windows, ", "['Microsoft Office']"], "lxfml": ["LEGO Digital Designer XML File", "XML document that describes the LEGO bricks used in a 3D scene created with LEGO Digital Designer; saved within the compressed .LXF model file; read by LEGO Digital Designer and can be viewed in a text editor.", "Windows, Mac, Linux, ", "['LEGO Digital Designer', 'BricksViewer', 'text editor']['LEGO Digital Designer', 'BricksViewer', 'text editor']['BricksViewer']"], "lxf": ["LEGO Digital Designer Model File", "Three-dimensional model created by LEGO Digital Designer (LDD), a program used for constructing virtual LEGO designs; saved in a compressed .ZIP format and contains two files: IMAGE100.PNG (a .PNG design preview) and IMAGE100.LXFML (the .LXFML design specified in XML).", "Windows, Mac, Linux, Windows, Windows Phone, ", "['LEGO Digital Designer', 'BricksViewer']['LEGO Digital Designer', 'BricksViewer']['BricksViewer']['Splash Meet Manager', '7-Zip', 'Corel WinZip 21'][]"], "lxcp": ["LCARS x32 Color Profile", "File used by LCARS x32, a futuristic Star Trek-looking replacement for the Windows Desktop; uses plain text formatting and saves a list of colors in the hex format (e.g., #ffffff for white); used for styling the buttons and other interface items with custom colors.", "Windows, ", "['LCARS x32']"], "lwx": ["Lightwright Database File", "An LWX file is a database created by Lightwright, a theatrical lighting spreadsheet and database application.  It contains lighting unit data, such as the unit type, purpose, location, color, channel, dimmer, and circuit.", "Windows, Mac, ", "['Lightwright']['Lightwright']"], "lwv": ["Linguistically Enhanced Sound File", "Audio file, similar to a .WAV file, that has been enhanced with the Microsoft Linguistic Information Sound Editing Tool (LISET); typically has modified phonemes that give the voice in the audio file greater articulation.", "Windows, ", "['Microsoft Agent']"], "lwp": ["Lotus Word Pro Document", "Word processing document created by Lotus Word Pro, a business-oriented word processor included with the Lotus Smart Suite; used to create reports, proposals, and other kinds of documents.", "Windows, ", "['IBM Lotus SmartSuite']"], "lwtp": ["LimeWire Theme Pack", "Theme or skin used by LimeWire, a P2P file-sharing program; can be used to customize the look and feel of the program's interface; to apply a LimeWire theme, select View→Apply Skins, and select the theme you want to apply.", "Windows, Mac, ", "[][]"], "lws": ["LightWave 3D Scene File", "Three-dimensional scene created with LightWave 3D, a 3D modeling, animation, and rendering program; includes information about object positions and movements, as well as cameras and their movements.", "Windows, Mac, ", "['NewTek LightWave 3D', 'pmG messiahStudio']['NewTek LightWave 3D', 'pmG messiahStudio']"], "lwo": ["LightWave 3D Object File", "Three-dimensional object created by LightWave 3D, a program used for 3D modeling, animation, and rendering; contains points, polygons, and surfaces that describe the object's shape and appearance; may also contain references to image files used for object textures.", "Windows, Mac, ", "['NewTek LightWave 3D', 'Foundry Modo', 'Smith Micro Poser 11', 'pmG messiahStudio', 'MicroMouse AccuTrans 3D']['NewTek LightWave 3D', 'Foundry Modo', 'Cheetah3D', 'Smith Micro Poser 11', 'pmG messiahStudio']"], "lwfn": ["Adobe Type 1 Mac Font File", "Adobe PostScript font used on the Macintosh platform (Mac OS 9.x and earlier); contains the outline data of the font, similar to a .PFB file in Windows; used in combination with a FOND resource file and bitmap data.", "Mac, ", "['Apple Mac OS Classic']"], "lwd": ["Lightworks Data File", "File used by Lightworks; a video editing application; contains data that is referenced by the application in order to operate; includes codec, video effects, and driver information. ", "Windows, ", "['EditShare Lightworks']"], "lw4": ["Lightwright File", "Document created with Lightwright, a software program for managing theatrical lighting paperwork; saved in a format that is a cross between a spreadsheet and a database; can store 30,000 lights, 32,000 dimmers, 62 DMX universes, and up to six different control systems.", "Windows, Mac, ", "[][]"], "lvw": ["Livewire Document", "Circuit design file created by Livewire, a program used for designing and simulating circuits; contains the electronic parts and connections that comprise a circuit design; also stores the location of all components on the design canvas, the inputs used for simulating the circuit, and saved text comments written by the user.", "Windows, ", "['New Wave Concepts Livewire']"], "lvp": ["Avaya Voice Player Audio File", "Compressed audio format used by the Avaya Voice Player for making voice recordings; often used as a Web browser helper application for playing Avaya Voice files, but can also turn e-mail software into a voicemail system; designed to work with the Intuity Audix Multimedia Messaging System.", "Windows, Mac, Linux, ", "['Avaya Voice Player']['Avaya Voice Player']['Avaya Voice Player']"], "lvm": ["LabVIEW Measurement File", "Measurement file used by LabVIEW, a graphical programming application used to develop test, measurement, and control applications using instrument hardware; contains one-dimensional data designed for small to medium-sized data sets.", "Windows, Mac, Linux, ", "['National Instruments LabVIEW']['National Instruments LabVIEW']['National Instruments LabVIEW']"], "lvlx": ["Extendable Level File", "Level file format used by Platform Game Engine (PGE) Project, an open source game engine; stores one or more level locations, which may include level sections, player start points, NPCs, and doors available on the map.", "Windows, Mac, Linux, ", "['Wohlstand PGE Editor']['Wohlstand PGE Editor']['Wohlstand PGE Editor']"], "lvl": ["Game Level File", "Contains level data for a computer game; may include a level map, characters, objects, and other data that is used to create the level; typically saved in groups.", "Windows, Mac, Android, ", "[][][]"], "lvix": ["Lightworks Video Index File", "File created by Lightworks, a program that enables you to edit video; contains video and audio metadata about .MP4 and .MOV media files used by Lightworks; referenced by Lightworks to refine the editing workflow; similar to the .MXF file.", "Windows, ", "['EditShare Lightworks']"], "lva": ["Logitech Video Effects Avatar File", "Avatar file used by Logitech Webcam Software, a program used for online video chatting; contains graphics, effects, and object recognition properties; replaces a user's face with an alien, shark, or other cartoon avatar during video chat sessions.", "Windows, ", "[]"], "lvivt": ["Lvivtotoro Encrypted Game File", "Encoded game executable created for games developed by Livivtotoro; stores an .EXE file in an encoded format that can be decoded using Lvivtotoro's decompiler.exe program.", "Windows, ", "[]"], "lvf": ["Logitech Video Effects File", "Effects file used by Logitech Webcam Software, a program that allows users to video chat online using Logitech webcams; contains graphics and properties used for object and facial recognition; used to overlay cartoons or other images onto facial features during video chat sessions.", "Windows, ", "['Logitech Webcam Software']"], "luxb": ["Lux Map File", "Map used by Lux, a computer game similar to the board game Risk; may be included with the game or created using the Lux Map Editor.", "Windows, Mac, ", "[][]"], "lutx": ["RadioRA 2 Essentials Project Database", "Project file created by RadioRA 2 Essentials, a program used for configuring wireless total home control systems from Lutron Electronics; saves configuration information for temperature and light control in a building; can be deployed to a RadioRA 2 system when complete.", "Windows, ", "[]"], "lut": ["RadioRA Essentials Project Database", "File created by RadioRA Essentials, a program used to set up wireless total home control systems from Lutron Electronics; contains configuration and control information for the thermostat and lighting components of a house or other building; can be deployed to a RadioRA system when complete.", "Windows, ", "[]"], "luf": ["Lipikar Uniform Format File", "Rich text (.RTF) file saved by Lipikar, a multi-language desktop authoring tool for Windows fonts; created when the contents of the Lipikar text box are saved to a file.", "Windows, Mac, ", "['text editor']['text editor']"], "lud": ["Lingvo User Dictionary File", "User dictionary file created by Lingvo Dictionary software, which is used to look up definitions of words and translate them into different language; contains dictionary entries, which consist of one or more words and their corresponding definitions.", "Windows, Mac, iOS, Android, Windows Phone, ", "['ABBYY Lingvo Dictionary']['ABBYY Lingvo Dictionary']['ABBYY Lingvo Dictionary']['ABBYY Lingvo Dictionaries'][]"], "lue": ["Norton LiveUpdate Log File", "Log file created by Norton LiveUpdate, a program that downloads and installs security updates for Symantec software; keeps track of virus definitions and other updates that have been installed.", "Windows, Mac, ", "['Symantec Norton Security 2017']['Symantec Norton Security 2017']"], "lucidsnippet": ["Lucid Snippet File", "File created by Lucid, a JavaScript web animation building program; contains a default or customized action used by the Lucid program to add functions to the webpage; if deleted, will remove the function and prohibit it from being added.", "Mac, ", "['The Escapers Lucid']"], "lucidcolorset": ["Lucid Color Set File", "File created for Lucid, a JavaScript animation builder program; contains data referenced by the Lucid program to configure colors of objects in the program, for e.g., the Google Map button.", "Mac, ", "['The Escapers Lucid']"], "luc": ["Compiled Lua Source File", "Compiled Source code file used to extend applications such as PC video games; contains a compiled .LUA script.", "Windows, Mac, Linux, ", "['LuaBinaries', 'LuaDec']['LuaBinaries']['LuaBinaries', 'LuaDec']"], "ltz": ["Compressed Poser Light Set File", "Compressed lighting information file used by Poser, a 3D character modeling and animation program; includes light data, such as spotlights and distant lights; Poser 6 and later may also contain point lights and image-based lights.", "Windows, Mac, ", "['Smith Micro Poser 11']['Smith Micro Poser 11']"], "ltr": ["Letter File", "An LTR file is a letter file used by various document authoring programs such as IBM Lotus Forms.  It contains a message or other type of correspondence.  LTR files are stored in plain text, which means they can be opened by any text editor.", "Windows, Mac, ", "['text editor']['text editor']"], "lua": ["Lua Source File", "A LUA file is a source code file written in Lua, a light-weight programming language designed for extending applications.  It can be compiled into a program using an ANSI C compiler.", "Windows, Mac, Linux, ", "['File Viewer Plus', 'Addon Studio for World of Warcraft', 'Blizzard World of Warcraft Interface AddOn Kit', 'Microsoft Notepad', 'Notepad++', 'text editor']['GNU Compiler Collection (GCC)', 'Blizzard World of Warcraft Interface AddOn Kit', 'Rovio Mobile Angry Birds', 'MacroMates TextMate', 'text editor']['GNU Compiler Collection (GCC)', 'GNU Emacs', 'Vim', 'text editor']"], "ltl": ["Luminaire Data File", "Data file used by DIALux, a program that enables you to model and plan lighting for indoor and outdoor environments; contains data about a light fixture's power consumption, luminous flux, light intensity, light radius, and more; referenced by DIALux to model the light fixture's capabilities.", "Windows, ", "['DIAL DIALux']"], "ltx": ["S.T.A.L.K.E.R. Properties File", "Settings file used by S.T.A.L.K.E.R., a first-person shooter game; contains parameters for game engine properties such as the physics model settings, graphics, and weapon characteristics; stored in a plain text format and sometimes \"modded\" to customize gameplay.", "Windows, Windows, Mac, Linux, ", "['GSC Game World S.T.A.L.K.E.R.: Call of Pripyat', 'GSC Game World S.T.A.L.K.E.R.: Clear Sky', 'GSC Game World S.T.A.L.K.E.R.: Shadow of Chernobyl']['MiKTeX', 'TeXworks', 'Texmaker', 'TeXnicCenter', 'LaTeX Editor', 'proTeXt']['LyX/Mac', 'TeXworks', 'Texmaker', 'TeXShop']['TeXworks', 'Texmaker']"], "ltg": ["LaserTank Graphics File", "Graphics file used by LaserTank, a 2D puzzle game; saves a sprite sheet that can be used for \"skinning\" the game with a different appearance; contains images for the tank, level objects, and sprite animations.", "Windows, ", "['JEK Software LaserTank']"], "ltf": ["Laser App Temp Form File", "File created by Laser App, a program that allows financial advisors to create and fill forms; saves the form layout as well as fields that can be auto-filled or manually filled by the financial professional; can save an empty or partially filled form.", "Windows, Windows, Mac, Linux, ", "['Laser App'][][][]"], "ltb": ["LithTech Binary File", "File created for LithTech Jupiter, a graphical video game engine; contains graphic models such as weapons, characters, maps, and textures referenced for developing games like \"F.E.A.R.\" and \"Combat Arms.\" ", "Windows, ", "['LithTech Jupiter']"], "lt2": ["Poser Light Set File", "Contains lighting information used by Poser, a 3D character modeling and animation program; may include lights, such as spotlights and distant lights; light set files created with Poser 6 and later may also contain point lights and image-based lights.", "Windows, Mac, ", "['Smith Micro Poser 11']['Smith Micro Poser 11']"], "lsw": ["RPG Maker Saved Game File", "Game file saved with RPG_RT, a game testing program for RPG games created with RPG Maker; used for testing games in a real-time environment; game progress is saved in the LSW file.", "Windows, ", "[]"], "lsx": ["Streaming Media Shortcut", "Shortcut to a streaming audio or video file on the Internet; similar to an .ASX file, but not as commonly used; requires Internet access to load and stream the file.", "Windows, ", "['Microsoft Windows Media Player']"], "lsproj": ["Visual Studio LightSwitch Project", "Developer project created by Microsoft Visual Studio development software; used for saving LightSwitch projects, which are used for creating business applications without having to write much source code.", "Windows, ", "['Microsoft Visual Studio 2017']"], "lsr": ["LANsurveyor Report", "Custom report generated by LANsurveyor; contains information about network devices in spreadsheet format", "Windows, ", "[]"], "lst": ["Data List", "An LST file is a data list used by many kinds of programs, including Microsoft Visual Studio and text editors.   It contains a listing of various types of information such as a list of files to be installed by a software installer or a spredasheet or database exported from another program.", "Windows, Mac, Linux, Windows, Windows, Mac, Linux, Windows, ", "['Microsoft Visual Studio 2017', 'Microsoft Notepad', 'Microsoft WordPad', 'Notepad++', 'text editor']['Apple TextEdit', 'Bare Bones TextWrangler', 'text editor']['gedit', 'Beaver', 'Leafpad', 'GNU Nano', 'text editor']['Microsoft Visual FoxPro']['Now Contact']['Now Contact']['GNU GRUB', 'gedit', 'Leafpad', 'GNU Nano', 'text editor'][]"], "lsu": ["LANsurveyor Map", "Network map file created by LANsurveyor; visually represents devices connected to a network monitored by LANsurveyor.", "Windows, ", "[]"], "lsp": ["Lisp Program Source Code File", "Source code file written in Lisp, a programming language that includes variations such as Common Lisp and Scheme; stores plain text program code that can be executed with a Lisp interpreter; may be a application component or an entire program.", "Windows, Mac, Linux, Windows, ", "['Clozure CL', 'LispWorks', 'Ufasoft Lisp Studio', 'Autodesk AutoCAD 2017']['Clozure CL', 'LispWorks', 'CMUCL', 'MacroMates TextMate']['LispWorks', 'GNU CLISP', 'Clozure CL', 'CMUCL'][]"], "lsl": ["LightScribe Label", "Disc label design created with LightScribe Template Labeler, a disc label design program developed by Hewlett-Packard; contains text and/or images that can be burned into the top of a CD or DVD using a LightScribe disc burner.", "Windows, ", "[]"], "lso": ["Logic Audio Project", "Song or other audio project created with Apple Logic audio production software; contains track settings, software instruments, audio effects, MIDI data, and references to audio files used by the project.", "Mac, ", "['Apple Logic Pro X']"], "lsn": ["Finale Lesson File", "Music lesson file created by Finale music notation and playback software; stores sheet music and other information that can be used for practicing piano or other instruments.", "Windows, Mac, ", "['MakeMusic Finale']['MakeMusic Finale']"], "lsd": ["Lingvo Dictionary File", "Dictionary file created by Lingvo Dictionary software, which is used to translate words into different languages and look up definitions; contains dictionary entries compiled from .DSL dictionary files; consists of the headword of the card (defined word) and the body of the card (definition); cannot be edited.", "Windows, Mac, iOS, Android, Windows Phone, Windows, ", "['ABBYY Lingvo Dictionary', 'GoldenDict']['ABBYY Lingvo Dictionary']['ABBYY Lingvo Dictionary']['ABBYY Lingvo Dictionaries'][][]"], "lsc": ["Logo! Soft Comfort File", "File created by Logo! Soft Comfort, an automation application that enables you to create and test control program schemes; contains a \"Function block diagram (FBD)\" that outlines the different parts of the program; includes rich text, inputs, outputs, timers, and other functions. ", "Windows, Mac, Linux, ", "['Siemens Logo! Soft Comfort 7']['Siemens Logo! Soft Comfort 7']['Siemens Logo! Soft Comfort 7']"], "lsa": ["Domino Designer Agent File", "An LSA file is a script created by IBM Lotus Domino Designer.  It contains an agent, which is a program that performs a specific task in one or more databases.  LSA files include information about the type of agent, where it will run, how it is invoked, what it will act upon, under whose ID it will run, and if it will perform unrestricted or restricted operations.", "Windows, Mac, Linux, ", "['IBM Lotus Domino Designer']['IBM Lotus Domino Designer']['IBM Lotus Domino Designer']"], "ls3": ["Band-in-a-Box Third-Party Styles File", "Musical style file used by Band-in-a-Box (BiaB), a program used for creating musical accompaniments; saved in a plain text format and contains a musical style generated by the user or by a third-party seller; used for creating music for a certain genre, such as Rock, Country, Jazz, or Hip-Hop.", "Windows, Mac, ", "['PG Music Band-in-a-Box']['PG Music Band-in-a-Box']"], "ls": ["LightWave LScript File", "Script authored in the LScript language, which is used to automate actions in NewTek's LightWave 3D rendering software; can be used for automatically drawing points and polygons, creating object motion, or for a variety of other actions; enables users to add new features to the software and to automate repetitive tasks.", "Windows, Mac, ", "['NewTek LightWave 3D']['NewTek LightWave 3D']"], "lrx": ["Sony Portable Reader File", "File used by the Sony Portable Reader, a mobile device that allows users to read eBooks; contains data for a Sony \"BroadBand eBook\" (BBeB), such as the images, text, and pagination data; saved in an encrypted binary file that includes a header, a specified number of objects, and an object index.", "Windows, Mac, ", "[][]"], "lrwebengine": ["Photoshop Lightroom Web Gallery File", "Photo gallery archive created by Photoshop Lightroom, a digital photo editing application; saves a collection Web files that define how photos are displayed; acts as a plug-in for Lightroom and enables a collection of photos to be viewed.", "Windows, Mac, ", "['Adobe Photoshop Lightroom 6']['Adobe Photoshop Lightroom 6']"], "lrv": ["Low Resolution Video File", "Low Resolution Video file created in the MPEG-4 video format; produced by a number of GoPro cameras including the GoPro HERO2 and HERO3, with proper software updates required on the older cameras; created in parallel with a high definition (HD) file of the video.", "Windows, Mac, Linux, ", "['Apple QuickTime Player', 'Microsoft Windows Media Player', 'Media Player Classic', 'RealNetworks RealPlayer Cloud', 'VideoLAN VLC media player', 'video player']['Apple QuickTime Player', 'Apple iMovie 10', 'RealNetworks RealPlayer Cloud', 'VideoLAN VLC media player', 'video player']['VideoLAN VLC media player', 'RealNetworks RealPlayer Cloud', 'video player']"], "lrtoolkit": ["Adobe Photoshop Lightroom Toolkit", "File used by Adobe Photoshop Lightroom, a digital photo organizing and editing application; stores data for tools, such as the camera raw toolkit, in the application's interface.", "Windows, Mac, ", "['Adobe Photoshop Lightroom 6']['Adobe Photoshop Lightroom 6']"], "lrtemplate": ["Adobe Photoshop Lightroom Template", "Settings file used by Adobe Photoshop Lightroom, a digital photo editing and organizing application; saved in plain text and contains presets used for viewing and altering digital photos; includes settings for color, white balance, tone, and effects, as well as other editing properties.", "Windows, Mac, ", "['Adobe Photoshop Lightroom 6']['Adobe Photoshop Lightroom 6']"], "lrsmcol": ["Photoshop Lightroom Smart Collection Settings File", "Settings file created by Photoshop Lightroom, a photo editing program; stores settings for a Smart Collection, which categorizes digital photos based on user-specified criteria; helps organize large amounts of photos into manageable groups.", "Windows, Mac, ", "['Adobe Photoshop Lightroom 6']['Adobe Photoshop Lightroom 6']"], "lrs": ["Librie Reader Source File", "File used to generate an eBook for the Sony Portable Reader, an eBook reading device; contains source data used to create a Sony \"BroadBand eBook\" (BBeB); saved in an XML format that describes eBook properties and contents.", "Windows, Mac, Linux, Windows, ", "['Calibre', 'BookDesigner']['Calibre']['Calibre']['Check Point Full Disk Encryption']"], "lrpreview": ["Adobe Photoshop Lightroom Preview File", "File used by Adobe Photoshop Lightroom, an application used for managing and editing digital photos; stores a preview version of an image in Lightroom; can be extracted as a .JPG from a catalog's image cache using the \"Extract Cached Images\" plugin to replace original master images that have been lost.", "Windows, Mac, ", "['Adobe Photoshop Lightroom with the Extract Cached Image Previews plugin', 'LRViewer']['Adobe Photoshop Lightroom with the Extract Cached Image Previews plugin', 'LRViewer']"], "lrplugin": ["Photoshop Lightroom Plug-in", "Plug-in used by Photoshop Lightroom, a professional digital photo editing application; adds new functionality to the software, such as a hook-in to Facebook, Flickr, or another online service for sharing photos; can be created by third-party developers for adding a variety of other software functions.", "Windows, Mac, ", "['Adobe Photoshop Lightroom 6']['Adobe Photoshop Lightroom 6']"], "lrm": ["Encarta Class Server Learning Resource File", "An LRM file contains one or more learning resources used by Microsoft Encarta Class Server.  It stores student and teacher resources such as activity books and counting games intended to help facilitate learning.  LRM files are no longer used because Microsoft Encarta Class Server has been discontinued.", "Windows, ", "[]"], "lrf": ["League of Legends Replay File", "Game replay created by LOLReplay, a game replay recorder and manager for League of Legends (LoL); used for re-watching gameplay and sharing the replay with others online; can only be opened by LOLReplay (not by the League of Legends game), but still requires that League of Legends be installed on the computer.", "Windows, Windows, Mac, Linux, Windows, ", "['LOLReplay']['Sony Reader', 'Calibre', 'BookDesigner']['Sony Reader', 'Calibre']['Calibre'][]"], "lrmodule": ["Photoshop Lightroom Module", "Module used by Photoshop Lightroom, a professional digital photo editing and organizing application; provides different functionality, similar to plugin files, to Photoshop Lightroom; modules include Slideshow, Print, Web, Develop, Map, Export, and Email.", "Windows, Mac, ", "['Adobe Photoshop Lightroom 6']['Adobe Photoshop Lightroom 6']"], "lrec": ["Inter-Tel Web Conference Recording", "Video file created by Inter-Tel Web Conference software; contains a screen recording video and may include voice audio; also can capture the keyboard chat log, attendees, and the document manager window during the conference.", "Windows, ", "[]"], "lrdb": ["Photoshop Lightroom Database", "Data file created by Adobe Lightroom version 1, the first installment of the photo management application; stores information about a collection of images that have been imported into the software; enables storage of organized photo data.", "Windows, Mac, ", "['Adobe Photoshop Lightroom 6']['Adobe Photoshop Lightroom 6']"], "lrdata": ["Adobe Photoshop Lightroom Data File", "Data file used by Adobe Photoshop Lightroom, a program used to organize and edit digital photos; contains image preview data supporting a Lightroom digital photo catalog (.LRCAT file); includes image metadata which enables users to browse through digital photo information.", "Windows, Mac, ", "['Adobe Photoshop Lightroom 6']['Adobe Photoshop Lightroom 6']"], "lqm": ["LG QuickMemo Note", "An LQM file is a note created by QuickMemo, an app included on select LG smartphones such as G3 and G4.  It contains a note exported from the app, which includes one or more images and annotations applied to the image.  LQM files are compressed with Zip compression.", "Android, ", "[]"], "lrcat": ["Adobe Photoshop Lightroom Catalog File", "File used by Adobe Photoshop Lightroom, a digital photo management and editing application; stores a catalog of information about a collection of images; used for storing organized information about digital photos.", "Windows, Mac, ", "['Adobe Photoshop Lightroom 6']['Adobe Photoshop Lightroom 6']"], "lqt": ["Liquid Audio File", "Music file saved in the proprietary copy-protected Liquid Audio format; can only be opened and played with Liquid Audio Player and RealPlayer on authorized computers.", "Windows, Mac, ", "['RealNetworks RealPlayer Cloud']['RealNetworks RealPlayer Cloud']"], "lqr": ["SQ Compressed LBR Archive", "Library of files archived with the LU program in the .LBR format and compressed with the SQ compression tool.", "Windows, ", "[]"], "lsf": ["Logos Library System File", "Data file used by Libronix Digital Library System (DLS), a program used by other applications for digital book management; saved alongside a .LIX file, both of which must be present to read the book.", "Windows, Mac, Windows, ", "['Logos Bible Software', 'Libronix Digital Library System']['Logos Bible Software', 'Libronix Digital Library System']['Microsoft Windows Media Player']"], "lproj": ["Localized Project Folder", "Folder containing text files and other resources for individual languages supported by a Mac OS X program; may include .STRINGS and .NIB files; stored within the Contents→Resources folder of an application package", "Mac, ", "[]"], "lps": ["Bryce Leaf Shape File", "3D model file used by Bryce, a 3D modeling program; contains a preset shape for a leaf that can be added to 3D scenes; can be used for enhancing trees, which are stored using the .BTO extension.", "Windows, Mac, ", "['DAZ 3D Bryce 7 Pro']['DAZ 3D Bryce 7 Pro']"], "lpp": ["LabelPrint Project File", "CD/DVD label design created by CyberLink LabelPrint, a program used for designing disc labels and jewel-case inlays; can be a design for a disc, mini disc, front cover, back cover, or disc inlay; often contains disc art, a song list, and artist information.", "Windows, ", "['CyberLink LabelPrint 2.5']"], "lpmd": ["LPMD Molecular Data File", "File created in the Las Palmeras Molecular Dynamics (LPMD) format, a file format used for storing molecular data; contains information about one or more atomic configurations; used by the LPMD software for analyzing, converting, and visualizing molecular dynamics data.", "Linux, ", "['LPMD']"], "lpdf": ["Localized PDF File", "Multilingual .PDF file, often named About Stacks.lpdf and About Downloads.lpdf, and found on Mac OS X systems; and saved in the Mac OS X package format and stores both the .PDF file as well as data that localizes the document for multiple languages.", "Mac, ", "['Apple Preview']"], "lpk": ["ArcGIS Layer Package", "GIS data file used by ArcGIS Desktop, a mapping and visualization software package; contains a map layer and its data that can be imported into another map or globe; used for sharing self-contained map layers with others; can be uploaded to the ArcGIS Online service for sharing over the Internet.", "Windows, Windows, Mac, Linux, ", "['ESRI ArcGIS for Desktop']['Tecplot 360']['Tecplot 360']['Tecplot 360']"], "lpdb": ["Librarian Pro Database File", "Data file created by Librarian Pro, a program used for organizing personal libraries of books, software, music, and movies; contains descriptive information about each item, such as the title, genre, author or artist, and a personal rating; used for storing and updating a user's personal database.", "Windows, Mac, ", "['Koingo Librarian Pro']['Koingo Librarian Pro']"], "lpd": ["Lookout Protocol Driver File", "Configuration file used by LabVIEW, an engineering software used for interfacing measurement and control hardware devices with software; saves an OPC (OLE for Process Control) server configuration and provides the setup data for interfacing with a PLC, RTU, or a HMI/SCADA application.", "Windows, Mac, Linux, Linux, ", "['National Instruments LabVIEW']['National Instruments LabVIEW']['National Instruments LabVIEW']['Vim', 'GNU Emacs', 'text editor']"], "lpb": ["LaserTank Replay File", "Game file created by LaserTank, a puzzle game involving tanks; saves a replay of a level played by the user; can be sent in with the LaserTank.hs (.HS) high scores file to be published on the LaserTank high scores webpage.", "Windows, ", "['JEK Software LaserTank']"], "lp7": ["LP7 Digitally Signed File", "Digital evidence format used for authenticating documents; supports both the CAdES and XAdES digital signature standards; developed by Lex Persona, based in Paris, France.", "Windows, ", "[]"], "lp2": ["iLEAP Word Processing Document", "Text document created by the iLEAP word processor; part of LEAP Office, an office productivity suite written in the Indian language; includes a multilingual spellchecker and the ability to e-mail documents directly from the program.", "Windows, ", "[]"], "lp": ["Lightscape Preparation File", "Project file created by Lightscape, a program used for creating lighting for 3D models; stores the 3D scene elements as well as radiosity and ray tracing information that help give a model a realistic lighting appearance.", "Windows, ", "['Autodesk Lightscape', 'MicroMouse AccuTrans 3D']"], "love": ["LÖVE Game File", "Game package created by LÖVE, a free framework used for developing 2D games with the Lua programming language; contains the assets for the game and is run by the Love engine when opened; saved in a compressed .ZIP format and contains the main.lua script and other assets (e.g., scripts, graphics, sounds, fonts, etc.).", "Windows, Mac, Linux, ", "['LOVE']['LOVE']['LOVE']"], "lop": ["MasterCook Layout File", "Stores the layout information for a Mastercook cookbook; created when a custom cookbook layout is saved.", "Windows, Mac, ", "['ValuSoft MasterCook']['ValuSoft MasterCook']"], "loov": ["Smadav Virus Definitions File", "Database of virus definitions used by Smadav (also \"SmadAV\"), an Indonesian antivirus program; contains a list of virus types and is referenced when scanning files for possible viruses.", "Windows, ", "['Smadsoft Smadav']"], "looklibrary": ["Painter Looks Library", "Library used by Corel Painter, a digital drawing application; contains a collection of media looks, which are a collection of images, such as neon streaks, vines, flowers, and branches, that can be added to the canvas; similar to .ABR Photoshop brushes.", "Windows, Mac, ", "['Corel Painter 2017']['Corel Painter 2017']"], "look": ["SpeedGrade Look File", "Color corrections data file exported by SpeedGrade, a color grading program used in video production; contains a 3D lookup table (LUT) that contains all color corrections made to a video; can be applied non-destructively to video data during the editing process.", "Windows, Mac, ", "['Adobe SpeedGrade CC 2017']['Adobe SpeedGrade CC 2017']"], "lol": ["LOLCODE Source Code FIle", "Source code file written in LOLCODE, a programming language inspired by \"lolcats\" images; contains source code that uses slang syntax and keywords such as HAI (for \"Hi\" or \"Hello\") which denotes the beginning of the program, and KTHXBYE (for \"OK thanks, bye\"), which signals the end of the program.", "Windows, Mac, Linux, ", "['LOLPython', 'lolcode-dot-net', 'text editor']['LOLPython', 'text editor']['LOLPython', 'mailchimp-lolcode-interpreter', 'text editor']"], "lrc": ["Lyrics File", "Text file used by audio playback and karaoke applications; stores song lyrics and timing information for displaying the lyrics while a song is playing; includes \"Line Item Tags\" that provide cue points to indicate when the lyrics should be displayed while the song is playing.", "Windows, Mac, Linux, ", "['StepMania', 'Recisio KaraFun', 'Apple iTunes with MiniLyrics plugin', 'Nullsoft Winamp with MiniLyrics plugin', 'Microsoft Windows Media Player with VividLyrics Karaoke Plugin']['StepMania', 'Apple iTunes with MiniLyrics plugin']['StepMania']"], "logonxp": ["LogonStudio Windows XP Logon Screen", "Custom logon screen format used by LogonStudio, a program for customizing the Windows logon screen; may include a background image, as well as custom lettering and buttons that can be applied to the Windows XP logon screen.", "Windows, ", "['Stardock LogonStudio']"], "logic": ["Logic Pro Project File", "Audio project created by Logic Pro digital audio workstation (DAW) software; stores multiple audio tracks on a timeline and can include recorded sounds, imported audio data, and loops; may also include transitions, effects, and other audio edits; doesn't contain the actual audio data, but rather stores references to audio files.", "Mac, ", "['Apple Logic Pro X']"], "logicx": ["Logic Pro Project", "Audio project package created by Logic Pro digital audio workstation (DAW) software; contains audio tracks on a timeline, which includes imported audio data, recorded sounds, and loops; also stores audio edits such as transitions and effects.", "Mac, ", "['Apple Logic Pro X']"], "logicly": ["Logicly Circuit File", "A LOGICLY file is a circuit created by Logicly, a program that allows you to design circuits and learn logic gates.  It contains a circuit layout, which includes gates, flip-flops, input and output controls, and other circuit components.  LOGICLY files are similar to project files because they allow you to close the file then reopen for editing at a later time.", "Windows, Mac, ", "['Bowler Hat Logicly']['Bowler Hat Logicly']"], "logonvista": ["LogonStudio Windows Vista Logon Screen", "Custom logon screen that can be loaded by LogonStudio, a program for customizing the Windows logon screen; may be used to change the way the Windows Vista logon screen looks.", "Windows, ", "['Stardock LogonStudio']"], "log2": ["Windows Registry Hive Log 2 File", "Log file created by the Windows registry during setup; stores trace information created during setup that is not modified again; commonly found under a user's directory or under %SystemRoot%\\System32\\config\\; saved as a hidden file in Windows.", "Windows, ", "['Microsoft Windows Registry']"], "log1": ["Windows Registry Hive Log File", "Log file used by the Windows registry; contains a trace of changes that have been made to the user's registry over time; typically found in the user's directory or under the %SystemRoot%\\System32\\config directory in Windows; saved in a binary format and as a hidden file in Windows.", "Windows, ", "['Microsoft Windows Registry']"], "log": ["Log File", "A LOG file is a log used by various operating systems and programs.  It typically contains a plain text log of certain events with their timestamps.  LOG files may be created by the operating system to keep track of system events or by a software installation program to list location and names of installed files.", "Windows, Mac, Windows, ", "['File Viewer Plus', 'Microsoft Notepad', 'text editor']['Apple TextEdit', 'text editor']['Avira Antivirus Pro 2016']"], "lof": ["Audacity File List", "File used by Audacity, a free audio editing and recording program; contains a list of files that are used for importing into an Audacity project; saves the filename, offset, and duration for each audio file to be imported; used for batch audio imports.", "Windows, Mac, Linux, ", "['Audacity']['Audacity']['Audacity']"], "lod": ["Heroes of Might and Magic 3 Graphics File", "Game data file used by Heroes of Might and Magic III (HOMM3), a turn-based strategy game; stores 2D bitmap images for army units, terrain, buildings, and other objects; used for displaying game graphics and animating sprite graphics.", "Windows, Mac, Linux, ", "['Ubisoft Heroes of Might and Magic 3']['Ubisoft Heroes of Might and Magic 3']['Loki Heroes of Might and Magic 3']"], "locky": ["Locky Ransomware Encrypted File", "A LOCKY file is a file encrypted by the Locky Virus, a trojan horse utilized by cybercriminals.  It contains a user's file, such as a .JPG or .DOCX file, encrypted with the RSA algorithm and AES-128 ciphers.  LOCKY files became prevalent in 2016 and are similar to .ODIN files.", "Windows, ", "[]"], "lockfile": ["Mac OS X PLIST Lock File", "Lock file used by the application preferences component of Mac OS X 10.7 Lion; saved as an empty file alongside a corresponding .PLIST file (e.g., the lock file for com.myapp.plist is com.myapp.plist.lockfile; used for marking access to a program's PLIST file when an application is open.", "Mac, ", "['Apple OS X']"], "locked": ["Ransomware Encrypted File", "A LOCKED file is a file encrypted by the Locked virus, a trojan horse utilized by cybercriminals. It contains a user's file, such as a .PDF or .XLSX file, encrypted with AES-256 encryption. LOCKED files became prevalent in 2016 along with .LOCKY files that are encrypted by the Locky virus.", "Windows, ", "[]"], "loc": ["GPS Location File", "Standard GPS location format that includes waypoints and related data; may be used to store saved locations and places of interests (POIs); supported by DeLorme Topo and other GPS/mapping programs.", "Windows, Windows, ", "['TopoGrafix EasyGPS']['Ubisoft Trackmania', 'Ubisoft TrackMania 2: Canyon']"], "localstorage": ["WebKit Local Storage Data File", "Application support file created by the Web browsers that use WebKit, which include Google Chrome, Apple Safari, and others; may store browser settings or local data for a browser extension (plug-in); enables extensions to store a local cache of user data; saved in an SQLite database format and can be opened by SQLite programs.", "Windows, Mac, Linux, iOS, ", "['Google Chrome', 'Apple Safari']['Google Chrome', 'Apple Safari']['Google Chrome']['Apple Safari']"], "lock": ["Lock File", "File used by various operating systems and programs to lock a resource, such as a file or a device; typically contains no data and only exists as an empty marker file, but may also contain properties and settings for the lock.", "Windows, Mac, Linux, Windows, Mac, Linux, ", "['Mozilla Firefox', 'Microsoft OneDrive']['Microsoft OneDrive']['Mozilla Firefox', 'Apache Web Server']['Mojang Minecraft']['Mojang Minecraft']['Mojang Minecraft']"], "loaders": ["GTK+ Loaders File", "Program support file used by applications that use GTK+ (the GIMP Toolkit), a framework used for creating multiplatform GUIs; contains data used in the process of loading and updating GTK+ components.", "Linux, ", "['GTK+']"], "lo": ["Interleaf Compiled Lisp File", "Compiled Lisp (.LSP) file saved by Interleaf technical publishing software; contains compiled code that can be run within the program; often used for performing common or repetitive commands.", "Windows, Linux, ", "['BroadVision QuickSilver']['BroadVision QuickSilver']"], "lnx": ["Commodore 64 Lynx Archive", "Commodore 64 game or program archived with the Lynx compression program; usually expands to a .D64 or .X64 file", "Windows, Mac, Windows, Mac, ", "['WinVICE']['VICE'][][]"], "lnt": ["PC-lint/FlexeLint Configuration File", "Text file that contains PC-lint or FlexeLint options and names of C/C++ source files to be linted (or analyzed); used for defining the programming environment and compiler settings.", "Windows, Windows, Windows, ", "['Gimpel Software PC-lint', 'Gimpel Software FlexeLint', 'text editor'][][]"], "lnst": ["Adobe InDesign Line Presets File", "Settings file used by InDesign, a page layout program; contains line style presets, such as thickness, dashed, dotted, and other styles; loaded by the application when showing line types within the user interface.", "Windows, Mac, ", "['Adobe InDesign CC 2017']['Adobe InDesign CC 2017']"], "lng": ["Winamp Language File", "An LNG file is a language pack file used by Winamp, a music player for Windows and OS X.  It contains the text in a specific language for a part of the Winamp interface.  LNG files are used for customizing Winamp for different languages and are commonly found within .WLZ language pack plugin files.", "Windows, Windows, Windows, Mac, Windows, Mac, Windows, ", "['Nullsoft Winamp']['Audiograbber', 'Adobe Acrobat DC', 'Nullsoft Winamp', 'Microsoft Notepad']['MAME', 'ExtraMAME']['MacMAME', 'MAME OS X']['Adobe Acrobat DC']['Adobe Acrobat DC']['AVG AntiVirus FREE']"], "lnk": ["Windows File Shortcut", "An LNK file is a shortcut or \"link\" used by Windows as a reference to an original file, similar to an alias on the Macintosh platform.  It contains the shortcut target type, location, and filename as well as the program that opens the target file and an optional shortcut key.  The file can be created in Windows by right-clicking a file and then selecting \"Create Shortcut.\"", "Windows, Mac, Linux, ", "['Microsoft Windows', 'Flint LinkInfo']['Parallels Desktop for Mac with Windows installed', 'CodeWeavers CrossOver']['CodeWeavers CrossOver']"], "lnd": ["3D Landscape File", "Three-dimensional landscape created with 3D Landscape for Everyone, a landscape design program; may include trees, plants, houses, and other objects; also supports hundreds of different textures, which can be applied to 3D objects", "Windows, ", "['Upperspace 3D Landscape for Everyone']"], "lmx": ["Landmark Exchange File", "Data file that contains descriptive information about landmarks; contains the name, description, coordinates, address, and category of each landmark; saved in a standard XML format.", "Windows, Mac, ", "['Nokia PC Suite', 'Nokia Suite']['Nokia Multimedia Transfer']"], "lmu": ["RPG Maker Map File", "Map for a role-playing game (RPG) created with RPG Maker 2000, 2003, or XP; includes map layout, different types of terrain, and objects such as trees, plants, and rocks; usually based of a theme such as a forest, mountain, cave, etc.", "Windows, ", "[]"], "lms": ["LenMus Score File", "Musical score created with LenMus, a free program for learning music; focuses on specific skills and exercises, including both music theory and aural training; scores can be edited and printed with the LenMus program.", "Windows, ", "[]"], "lmp": ["Quake Engine Lump File", "Resource file used by games developed with one of the Quake game engines; may contain graphics, music, sounds, sprites, demos, textures, or level maps referenced by the game; includes gameplay graphics such as crosshairs, that can be modified; often located with other graphics files, such as .TGA, .PCX, and .XCF, that are referenced by the game.", "Windows, Mac, Linux, ", "['id Software Quake', 'id Software Quake 2', 'id Software Quake 3', 'id Software Doom', 'id Software Doom 2', 'Nazi Zombies Portable']['id Software Quake', 'id Software Quake 2', 'id Software Quake 3', 'Nazi Zombies Portable']['Nazi Zombies Portable']"], "lmk": ["Sothink Logo Maker Image", "Logo image created by Sothink Logo Maker design software; often created from a template included with the software but can also be designed from scratch using the various shapes, patterns, and graphics included with the software.", "Windows, ", "['SourceTec Sothink Logo Maker']"], "lma": ["Logo! UDF File", "File created by Logo! Soft Comfort, an automation application used for creating circuit programs; contains a \"User-defined Function block diagram (UDF),\" which holds all of the circuit program parts; includes timers, rich text, counters, triggers, and other functions. ", "Windows, Mac, Linux, ", "['Siemens Logo! Soft Comfort 7']['Siemens Logo! Soft Comfort 7']['Siemens Logo! Soft Comfort 7']"], "lld": ["Logo! Soft Comfort LAD File", "File created by Logo! Soft Comfort, an automation application used for creating circuit programs; contains a \"Ladder diagram (LAD)\" that displays the different parts of the circuit program; includes inputs, rich text, outputs, timers, counters, and other functions. ", "Windows, Mac, Linux, ", "['Siemens Logo! Soft Comfort 7']['Siemens Logo! Soft Comfort 7']['Siemens Logo! Soft Comfort 7']"], "lmf": ["Quartus II Library Mapping File", "An LMF file is a mapping data file used by Quartus II, a program that allows developers to analyze and optimize hardware description language (HDL) designs.  It contains the names and I/O ports of Quartus II logic functions and the corresponding cells, components, and modules stored in other Quartus II files that the functions replace when a file is opened or compiled.  LMF files enable family-specific macrofunctions in Quartus II.", "Windows, Linux, ", "['Altera Quartus II']['Altera Quartus II']"], "lmc": ["Mobility Client Configuration File", "An LMC file contains configuration settings used by Mobility Client, a component of IBM Mobile Connect used to establish virtual private network connections (VPNs).  It stores a configuration that controls how a Mobility Client connects to a network.  LMC files may consist of platform-independent settings or a complete configuration.", "Windows, ", "['IBM Mobile Connect']"], "llm": ["Linden Lab Mesh File", "Linden Lab Mesh (LLM) file used by Second Life, a network-based virtual reality world; contains a 3D \"mesh\" definition as a collection of polygons that form the surface of an avatar; used to render a 3D avatar and create texture wrappings.", "Windows, Mac, Linux, ", "[][][]"], "llx": ["LabVIEW VI Library Backup File", "Backup of a LabVIEW VI library (.LLB) file; used for scientific testing, measurement, and control applications; created automatically by the VI Library Manager when an LLB file is built.", "Windows, Mac, Linux, ", "['National Instruments LabVIEW']['National Instruments LabVIEW']['National Instruments LabVIEW']"], "llb": ["LabVIEW Library File", "Program library created by LabVIEW, a software program used for scalable test, measurement, and control applications; records data from various types of measurement and control hardware, then analyzes it on the computer.", "Windows, Mac, Linux, ", "['National Instruments LabVIEW']['National Instruments LabVIEW']['National Instruments LabVIEW']"], "ll": ["List & Label Preview File", "Preview image generated by Combit List & Label software, a program for creating reports, tables, lists, crosstabs, charts, forms, and labels; contains preview and metadata for a List & Label project.", "Windows, ", "[]"], "ljp": ["Lossless JPEG Image", "JPEG image used by Nero MediaHub, a multimedia file browsing and organizing program that is part of the Nero Multimedia Suite; stores a .JPG image in a lossless format, which is uncommon for JPEG images, but nonetheless is supported by the JPEG standard.", "Windows, ", "['Nero 2017']"], "lix": ["Logos Library System File", "Data file used by the Libronix Digital Library System (DLS), a software package used for digital book management; contains data for an unlocked book; saved with an .LSF file which also must be present for the book to load correctly.", "Windows, Mac, Windows, Mac, ", "['Libronix Digital Library System', 'Logos Bible Software']['Libronix Digital Library System', 'Logos Bible Software'][][]"], "litemod": ["Minecraft LiteLoader Mod File", "File used by Minecraft, a sandbox game that lets users build a world by creating and destroying resources; contains modifications to aspects of Minecraft, such as mini maps and in-game chat functionality.", "Windows, Mac, Linux, ", "['Mojang Minecraft with LiteLoader installed']['Mojang Minecraft with LiteLoader installed']['Mojang Minecraft with LiteLoader installed']"], "livereg": ["Symantec Antivirus Session File", "File used by Symantec products to register Symantec products online; contains a record of an online registration session; can be found in the \"Application Data\\Symantec\\Shared\\Sessions\" user directory.", "Windows, ", "['Symantec LiveReg']"], "lizd": ["Live Interior 3D Compressed Document", "Compressed interior design project file created by Live Interior 3D home and interior design software; saves the compressed version of a .LI3D document; used for reducing the storage size of projects for emailing and archiving.", "Windows, Mac, ", "['BeLight Live Interior 3D']['BeLight Live Home 3D']"], "liveupdate": ["Symantec LiveUpdate File", "File used by LiveUpdate, a program used to update Symantec antivirus programs; contains data for updating antivirus software and virus definitions; facilitates remote software updates by providing local computer and software information.", "Windows, Mac, ", "['Symantec Backup Exec 15', 'Symantec LiveUpdate']['Symantec LiveUpdate']"], "lit": ["eBook File", "Electronic version of a book or other publication saved in the Microsoft LIT format; includes digital rights management (DRM) information, which protects copyrights by limiting the systems each book can be read on.", "Windows, Mac, Linux, Windows, Mac, Linux, Windows, Mac, Linux, ", "['Calibre', 'Microsoft Reader', 'Convert LIT', 'ConvertLIT GUI', 'BookDesigner']['Calibre', 'Convert LIT Mac']['Calibre', 'Convert LIT']['Helium', 'WinHugs', 'text editor']['Helium', 'Hugs', 'text editor']['Hugs', 'text editor']['Lit Python Compiler']['Lit Python Compiler']['Lit Python Compiler']"], "livecode": ["LiveCode Stack File", "Stack file created by LiveCode, a multi-platform application builder; contains a Stack which holds one or more Cards; a Card controls the appearance of the application, which includes a variety of buttons, menus, boxes, scrollbars, tables, and more.", "Windows, Mac, Linux, ", "['RunRev LiveCode']['RunRev LiveCode']['RunRev LiveCode']"], "list": ["APT List File", "FIle created by APT, an Advanced Package Tool used to manage applications; holds a list of package sources that software can be downloaded from; contains information detailing the archive type indicating whether it contains binary or source packages.", "Linux, Windows, Mac, Linux, ", "['APT']['Microsoft Notepad', 'text editor', 'Oracle Java Virtual Machine']['Apple TextEdit', 'text editor', 'Oracle Java Virtual Machine']['Vim', 'text editor', 'Oracle Java Virtual Machine']"], "lisp": ["Lisp Source Code File", "Source code file written in Lisp, a programming language that has several different dialects including Common Lisp and Scheme; contains plain text program code that is run with a Lisp interpreter; may be an entire program or a part of a larger Lisp application.", "Windows, Mac, Linux, ", "['Clozure CL', 'LispWorks', 'Ufasoft Lisp Studio']['Clozure CL', 'LispWorks', 'CMUCL', 'MacroMates TextMate']['Clozure CL', 'LispWorks', 'GNU CLISP', 'CMUCL']"], "lis": ["SQR Output File", "Report or output file generated by a Structured Query Reporting (SQR) program; uses SQL statements to run queries on databases and create reports.", "Windows, Mac, Linux, Windows, ", "['Oracle Hyperion SQR Production Reporting', 'text editor']['text editor']['Oracle Hyperion SQR Production Reporting', 'text editor'][]"], "lip": ["Clip Studio Paint File", "A LIP file is an image file created by Clip Studio Paint, an application used to draw manga (Japanese-style comic books and graphic novels), illustrations, and animations.  It contains a composition which consists of one or more layers (raster or vector) and may include pencil, pen, or brush strokes, shapes, text, and images.  ", "Windows, Mac, Windows, Windows, ", "['CELSYS Clip Studio Paint Pro']['CELSYS Clip Studio Paint Pro']['Bethesda Softworks TES Construction Set', 'Bethesda Softworks GECK']['Bohemia Interactive WaveToLip']"], "linx": ["iPod Links Folder", "Contains links to files or notes within text documents on an iPod; similar to a directory index on a website; used by various iPod programs", "Windows, Mac, ", "[][]"], "link": ["iPod Link File", "Contains a link to specific file or song on an iPod; redirects to the file when selected; similar to a link on a website; used by various iPod programs", "Windows, Mac, ", "[][]"], "lin": ["AutoCAD Linetype File", "Line type definition (also called a \"linetype\" or \"line style\") that defines the paths of a vector-based object used by AutoCAD; stores shapes information in a text-based format.", "Windows, Windows, Mac, Linux, ", "['Autodesk AutoCAD 2017', 'text editor']['X-Plane']['X-Plane']['X-Plane']"], "lily": ["PCSX2 LilyPad Configuration File", "Controller configuration file used by LilyPad, a plugin for the PCSX2 PlayStation 2 emulator; contains key bindings and other button mappings for a game controller; used for storing customized settings for different kinds of game controllers.", "Windows, Linux, ", "['PCSX2 with LilyPad plug-in']['PCSX2 with LilyPad plug-in']"], "lightinglibrary": ["Painter Lighting Presets Library", "Lighting presets library created and used by Corel Painter, a drawing program used to create digital artwork; stores a collection of presets, such as Gradual, Track Lighting, Warm Globe, Plain Light, and Center Spot.", "Windows, Mac, ", "['Corel Painter 2017']['Corel Painter 2017']"], "life": ["Light Notebook File", "File created by Light Notebook, an application that helps users record, organize and share their lives; saves all notes and files in a user's Light Notebook account; used as a digital time capsule.", "Mac, iOS, Android, ", "['Light Notebook']['Light Notebook']['Light Notebook']"], "lid": ["Kodak EasyShare Album File", "Stores album information for photos and videos captured with a Kodak EasyShare camera; defines what album each photo or video is stored in; used to organize and keep track of different sets of photos and videos.", "Windows, Mac, Linux, ", "['Kodak EasyShare']['Kodak EasyShare'][]"], "licx": ["Visual Studio License File", "Text file that identifies the licensed classes used in a Visual Studio.NET project; links the license files to the corresponding resources listed in the licenses.licx file.", "Windows, ", "['Microsoft Visual Studio 2017']"], "lif": ["LEGO Digital Designer Assets File", "Container format used by LEGO Digital Designer (LDD), a program used for constructing 3D models with digital LEGO parts; saved in the program installation directory and contains program assets such as bricks and other 3D model parts; uses a proprietary binary format.", "Windows, Mac, Windows, Mac, Windows, Mac, Linux, ", "['LEGO Digital Designer', 'LIF Extractor']['LEGO Digital Designer']['Intuit TurboTax Deluxe']['Intuit TurboTax Deluxe']['Leica Application Suite', 'OMERO', 'ImageJ', 'Bitplane Scientific Imaris']['OMERO', 'ImageJ', 'Bitplane Scientific Imaris']['OMERO', 'ImageJ']"], "licensekey": ["iPartition License Key File", "Software license file used by iPartition, a program that allows users to partition hard drives on Mac computers; stores information that is used to register a purchased, legal copy of the software on the computer.", "Mac, ", "['Coriolis Systems iPartition']"], "lic": ["Software License File", "A LIC file is a license file commonly used with shareware programs, commercial applications, and networks.  It contains registration information for various software applications as well as server configuration information for networks ", "Windows, Mac, ", "[][]"], "libzip": ["Camtasia Studio Zipped Library File", "Zipped library used by Camtasia Studio, a screen recording and video editing program; contains media assets such as intro titles and themes.", "Windows, ", "['TechSmith Camtasia Studio']"], "library-ms": ["Windows Library Description File", "Operating system file introduced with Microsoft Windows 7; appears as a subfolder within the Libraries folder in the left side panel of the Windows Explorer; includes references to one or more folders that can be browsed when the library is opened.", "Windows, ", "['Microsoft Windows']"], "lib4d": ["Cinema 4D Preset Library", "Library created by Cinema 4D, a professional application that enables you to create 3D models and animations; contains one or more presets that can be inserted into a scene by the user; includes pre-defined or custom made objects such as images, pencil marks, skies, brick shaders, body paint gradients, and 3D balloons.", "Windows, Mac, ", "['MAXON Cinema 4D']['MAXON Cinema 4D']"], "lib": ["Generic Data Library", "Library of information used by a specific program; often contains functions and constants referenced by a program; may also contain actual objects, such as text clippings, images, or other media; typically referenced by applications and should not be opened manually.", "Windows, Mac, Windows, Mac, ", "[][]['MakeMusic Finale']['MakeMusic Finale']"], "li3d": ["Live Interior 3D Document", "Interior design project created by Live Interior 3D, a 3D home and interior design program for Mac; saves floor plans, lighting designs, furniture, and other home design information; can be rendered to high-quality and panoramic images.", "Mac, ", "['BeLight Live Home 3D']"], "lhr": ["Quicken Financial Life for Mac File", "Data file created by Quicken Financial Life for Mac, a personal money management program that never reached a version beyond beta; stored financial data for the user but was not compatible with the Quicken Windows software or other versions of the Quicken software.", "Mac, ", "['Intuit Quicken']"], "lhzd": ["Live Home 3D Compressed Project", "An LHZD file is a compressed project created by Live Home 3D, a macOS (OS X) app used to design and visualize the interior and exterior of a home.  It contains a project, which includes floor plans, building materials, lighting fixtures, appliances, and furniture.  LHZD files are similar to .LH3D files but are compressed to make it more convenient to share and store.", "Mac, ", "['BeLight Live Home 3D']"], "lhs": ["Literate Haskell Script", "Source code of a program written in Haskell, a functional programming language, with literate formatting; similar to a standard Haskell Script (.HS file), but includes commentary, where only lines starting with \">\" are considered to be program code.", "Windows, Mac, Linux, ", "['File Viewer Plus', 'The Haskell Platform', 'Leksah Project Leksah', 'EclipseFP', 'Helium', 'WinHugs', 'gVim']['The Haskell Platform', 'Leksah Project Leksah', 'MacroMates TextMate', 'EclipseFP', 'MacVim', 'Helium', 'Hugs']['The Haskell Platform', 'Leksah Project Leksah', 'EclipseFP', 'Hugs', 'GNU Emacs']"], "lha": ["LHARC Compressed Archive", "File or group of files compressed with LHARC compression; popular compression format on Amiga computers and used by id Software to compress installation files for early games, such as Doom; LHA has been mostly replaced by the .LZH compression format, but is still widely used in Japan.", "Windows, Mac, Linux, ", "['File Viewer Plus', 'Corel WinZip 21', 'Smith Micro StuffIt Deluxe for Windows', 'E-merge WinAce', '7-Zip', 'Zipeg']['Corel WinZip Mac 5', 'Smith Micro StuffIt Deluxe 16', 'Incredible Bee Archiver', 'The Unarchiver', 'Audio Overload', 'Zipeg']['LHa for UNIX', '7-Zip']"], "lgp": ["Final Fantasy Media Archive", "Media archive that contains graphics, sounds, and other media used by the Final Fantasy VII and Final Fantasy VIII video games; developed by Squaresoft as a container format (similar to .PAK file) to store character data and other information.", "Windows, ", "[]"], "lgt": ["Let's Go! Theme File", "Settings file used by Let's Go!, an arcade-style game where players dodge oncoming blocks; contains graphics that are overlaid on the game interface; used for customizing the look and feel of the game.", "Windows, ", "[]"], "lgl": ["LeechGet Download List", "List of files downloaded by LeechGet, a Windows download manager; serves as a reference and a queue that also stores current and future downloads selected by the user; referenced by LeechGet and should not be opened manually.", "Windows, Linux, ", "['LeechGet']['Large Graph Layout']"], "lgi": ["Multimedia Logic File", "Logic diagram created with Multimedia Logic, a logic design and simulation program; contains operators and logic gates that can be connected in custom configurations; used to simulate events and predict probabilities of different outcomes.", "Windows, ", "[]"], "lgh": ["HMI Historical Log File", "Daily log file created by InTouch Human-Machine Interface (HMI) software or ReportBuilder with ODBC Connector pack for InTouch; logs data from InTouch SCADA HMI database systems; used for running reports from collected data", "Windows, ", "[]"], "lgf": ["PMSCAN Log File", "Data file generated by PMSCAN, an OBD-II scanner used for analyzing vehicle performance and diagnosing problems; supports over 220 generic OBD-II parameters and diagnostic trouble codes (DTCs); test results can be viewed in a a graph or table format within PMSCAN.", "Windows, ", "[]"], "lgc": ["SimpleK Database File", "Database format used by SimpleK, a master key system and key issuance software program; used by locksmiths as well as security and facility managers.", "Windows, Windows, ", "[]['Corel WordPerfect X8']"], "lfo": ["Alchemy Low Frequency Oscillator Presets File", "Settings file created by Alchemy, an audio sampling and authoring program; saves presets for the Low frequency oscillator module included with the software, including delay, attack, phase, and rate settings; used for saving and loading presets.", "Windows, ", "['Apple Logic Pro X']"], "licenses": ["Visual Studio Licensed Classes File", "Binary file that contains runtime keys for licensed classes used in a Visual Studio.NET development project; referenced during the assembly process and embedded into the program with the Assembly Linker (AL.exe).", "Windows, ", "['Microsoft Visual Studio 2017']"], "lfs": ["Samsung Phone params.lfs File", "Low-level system file used by Android-based Samsung mobile phones such as the Samsung Galaxy; is part of the firmware and contains .JPG images used for displaying the startup and error condition graphics on the phone; sometimes modified by homebrew users.", "Android, ", "['Google Android']"], "lfp": ["IPRO LFP File", "File used by IPRO Tech's litigation applications, which are used to generate and review legal documents; saved in a plain text format and contains commands used for loading images from a litigation database; helps construct digital views of images in legal proceedings.", "Windows, ", "['IPRO Tech iConvert']"], "lex": ["Adobe Linguistic Library Data File", "Lexicon data file created by Linguistic Library, an Adobe development kit used to add linguistic services, such as spelling and grammar checkers, to Adobe products; contains the shared lexicons, or words and their syntax, for a language; used to store language-specific data for document validation in Adobe products.", "Windows, Mac, ", "['Adobe Acrobat DC', 'Adobe Photoshop CC 2017', 'Adobe Illustrator CC 2017', 'Adobe InDesign CC 2017']['Adobe Acrobat DC', 'Adobe Photoshop CC 2017', 'Adobe Illustrator CC 2017', 'Adobe InDesign CC 2017']"], "less": ["LESS Style Sheet", "Webpage style sheet used by LESS, a dynamic style sheet language that extends standard CSS with features such as variables, mixins, operations, and functions; requires the LESS JavaScript library (less.js) to be included in the head section of the HTML page in order for styles in referenced LESS files to be processed.", "Windows, Mac, Linux, ", "['LESS', 'Adobe Dreamweaver CC 2017']['LESS', 'CodeKit', 'Adobe Dreamweaver CC 2017']['LESS']"], "legal": ["DaveTech Legal Document", "File created by DaveTech programs such as DaveTech OS; saved in a plain text format and may contain license information, terms of service, or other legal information; used for storing official documents for DaveTech software and services.", "Windows, ", "['Microsoft Notepad', 'text editor']"], "lef": ["LEN Exchange Format File", "File created in the LEN Exchange Format (LEN), a format used for exchanging swimming data (also referred to as the \"Lenex\" format); contains information about swimming events that allows record keeping and communication between race organizers, swimming clubs, and associations; most often used for exchanging data for European swimming competitions.", "Windows, Windows Phone, ", "['Splash Meet Manager', 'text editor'][]"], "ldw": ["Virtual Villagers Saved Game File", "Saved game created by Virtual Villagers, a  game where players manage a community of villagers; stores a saved state of the villagers and village resources; created using the naming convention IsolaX.ldw, where \"X\" is a single or double digit number.", "Windows, Mac, ", "['LDW Virtual Villagers']['LDW Virtual Villagers']"], "ldt": ["Eulumdat Formatted Luminaire Data File", "Light fixture, or luminaire, data file used by DIALux, a professional light planning software for indoor and outdoor lighting; stores lighting parameters for a luminaire, which include the number of lamps, the light intensity, the light distribution curve, and the size of the luminaire.", "Windows, ", "['DIAL DIALux', 'DIAL LDT Editor', 'ReluxSuite']"], "lh3d": ["Live Home 3D Project", "An LH3D file is a project created by Live Home 3D, an app used to design and visualize the interior and exterior of a home.  It contains a project, which includes floor plans, building materials, lighting designs, fixtures, and furniture.  LH3D files allow users to close a design and reopen it for further editing at a later time.", "Mac, ", "['BeLight Live Home 3D']"], "lds": ["Binutils LD Linker Script", "Script written for ld, a Linux command line utility used for structuring the format of Linux executables (also known as \"object\" files) based on input files; specifies a list of sections of the output file and includes the size and memory location of each section; written in the \"linker command language.\"", "Linux, ", "['GNU Binutils', 'text editor']"], "ldr": ["LDraw Model File", "File created by LDraw, a suite of CAD tools used to build digital 3D LEGO models; contains the dimensions of LEGO bricks and their placements within a 3D coordinate system; used for saving LEGO designs.", "Windows, ", "['LDraw', 'MLCAD', 'LDview', 'SR 3D Builder']"], "lgo": ["Logo Instructions File", "Saved program code written for Logo, an application that uses programmed instructions to draw pictures; contains code that defines where the \"turtle\" should draw each line; can be used for drawing basic or elaborate designs; often used for educational purposes.", "Windows, ", "[]"], "ldm": ["VolumeViz Multi-Resolution Volume File", "File created by VolumeViz Large Data Management (LDM), a program used to visualize complex volume data sets; contains visualization data amounting up to hundreds of gigabytes in size; used to store large data sets and efficiently render them for real-time display and 3D image generation.", "Windows, Linux, ", "[][]"], "ldif": ["LDAP Data Interchange Format File", "Text-based data interchange file used by LDAP directories; describes a directory, the entries contained in the directory, and changes made to the entries.", "Windows, Mac, Linux, ", "['Microsoft Active Directory Explorer', 'Mozilla Thunderbird']['Apple Contacts', 'Mozilla Thunderbird']['Mozilla Thunderbird']"], "ldf": ["SQL Server Transaction Log File", "Log file created by SQL Server, a relational database management system (RDBMS) developed by Microsoft; contains a log of recent actions executed by the database; used to track events so that the database can recover from hardware failures or other unexpected shutdowns.", "Windows, Windows, ", "['Microsoft SQL Server 2016']['Microsoft Notepad', 'gVim', 'text editor']"], "ldb": ["Microsoft Access Lock File", "Prevents an Access database from being changed by more than one user at a time; helps ensure updates will not be unexpectedly overwritten; created and deleted automatically by Access when a database is opened and closed.", "Windows, Windows, Mac, ", "['Microsoft Access 2016'][]['Rockstar Games Max Payne']"], "ld2": ["Lingoes Dictionary File", "File used by Lingoes, a dictionary and text translation application; contains a compiled source dictionary file and includes terms and their definitions; saved in a proprietary binary format, but can be used for storing custom dictionaries.", "Windows, ", "['Lingoes']"], "lcm": ["Lipikar Custom Map File", "Data file used to load or save Custom FontMaps in Lipikar, a multi-language desktop authoring tool; contains FontMap matrix coordinates for the 255 characters of any windows bitmap font; has a fixed file size of 1.82 KB (1872 bytes).", "Windows, ", "[]"], "lck": ["Program Lock File", "Access control file used to \"lock\" a database or other file from being opened or changed by more than one user at a time; typically is open with the file is not in use and is locked when a user is working on the file; prevents accidentally overwriting changes and possible data corruption.", "Windows, ", "[]"], "lemon": ["LemonShare.net Download", "File downloaded from LemonShare.net, a RapidShare download website; may be one of several different file types, including games, audio applications, e-books, movies, songs, or other types of data; often protected with a password.", "Windows, ", "['WinRAR 5']"], "lcf": ["ArchiCAD Library Container File", "Stores a complete hierarchy of libraries used by ArchiCAD, an architectural design program; may include individual objects, folder structures, .PLA files, and other LCF files.", "Windows, Mac, ", "['Graphisoft ArchiCAD']['Graphisoft ArchiCAD']"], "lcd": ["ABBYY Language File", "Language file used by ABBYY FormReader and FineReader OCR software; includes language information used for translating scanned text into actual characters and words.", "Windows, Mac, Windows, ", "['ABBYY FineReader 12']['ABBYY FineReader 14']['Space International CDSpace', 'EZB Systems UltraISO', 'PowerISO', 'ESTsoft AlZip']"], "lcc": ["Capture One Lens Cast Correction File", "File used by Capture One, a photo editing application used with Phase One digital cameras; used for correcting and enhancing images for higher image quality; includes settings such as exposure, contrast, brightness, saturation, color cast, light falloff, and chromatic aberration.", "Windows, Mac, ", "['Phase One Capture One']['Phase One Capture One']"], "letter": ["Undeliverable Mail File", "File named dead.letter that is sometimes created on Unix-based systems when email cannot be sent; may be created because the destination address is wrong or because the recipient refuses to accept the email.", "Windows, Mac, Linux, ", "['Sendmail']['Sendmail']['Sendmail']"], "lcb": ["Living Cookbook Backup File", "Backup file created by Living Cookbook, a program used for managing cookbook recipes and planning meals; contains cookbook recipes, grocery lists, meal calendars, and kitchen inventories; used to backup and restore all cookbook data.", "Windows, ", "[]"], "lbx": ["FoxPro Label File", "Table of definitions that defines the format of labels printed in FoxPro, a database development system; also specifies what database records are to be printed as labels.", "Windows, ", "['Microsoft Visual FoxPro']"], "lbs": ["Omnis Library", "Contains proprietary code used by Omnis Studio, a Rapid Application Development (RAD) tool from Raining Data Corporation; can be used to create multi-tier and Web applications for Windows, Linux, and Mac OS X.", "Windows, Mac, Linux, ", "[][][]"], "lang": ["Minecraft Language File", "A LANG file is a game resource file used by Minecraft, an open-ended game that allows players to create and explore 3D worlds.  It saves a list of key-value string pairs that map game menus, achievements, and other game objects to names in a given language; used for localization.", "Windows, Mac, Linux, Windows, ", "['Mojang Minecraft', 'text editor']['Mojang Minecraft', 'text editor']['Mojang Minecraft', 'text editor']['Skype']"], "lbu": ["Cloaked Affiliate Link Builder Settings File", "Settings file for a website created with Cloaked Affiliate Link Builder, a program for creating cloaked affiliate links; stores configuration information for a website that contains cloaked affiliate links.", "Windows, ", "[]"], "lan": ["ERDAS LAN File", "GIS file used as the standard format for older versions of ERDAS geospatial processing software, as well as other GIS applications; contains a raster image, often of a satellite image; replaced by the ERDAS IMAGINE (.IMG) format.", "Windows, ", "['ERDAS IMAGINE', 'Clark Labs IDRISI Selva', 'PCI Geomatics Geomatica', 'ESRI ArcGIS for Desktop']"], "laccdb": ["Microsoft Access Lock File", "Lock file created by Access 2007, a program that allows users to create relational databases, front-end interfaces, and reports; contains database locks to prevent unexpected overwrites or deletions with multiple concurrent users.", "Windows, ", "['Microsoft Access 2016']"], "laby": ["Laby Level File", "File used by Laby, a game where students learn simple programming techniques by guiding ants through labyrinths to safety; contains a plain text representation of a 2D map; uses special characters for ants, walls, spider webs, and escape routes.", "Linux, ", "['Laby']"], "lcn": ["License File", "Data file created by ActiveMARK, a digital distribution service; used for secure online distribution of games to protect from illegal sharing; only located on PCs that contain a game using ActiveMARK secure technology.", "Windows, ", "['Microsoft Windows']"], "label": ["DYMO Label File", "A LABEL file is a file used by DYMO printers, which specialize in printing labels.  It contains information about the design and layout of a label for printing purposes.  LABEL files include paper orientation, paper name, drawing coordinates, text object placement, font size, and object information.", "Windows, Mac, ", "['DYMO Label']['DYMO Label']"], "lab": ["WordPerfect Label Definition File", "Contains information used for displaying and printing labels with Corel WordPerfect; may be an Avery label template or other custom labels file; contains page layout information that defines the size and position of labels on the page.", "Windows, ", "['Corel WordPerfect X8']"], "la": ["Lossless Audio File", "Audio file compressed by La, a lossless audio compression program; compresses an audio file's size without affecting the quality; has a longer encoding time than most other lossless compressors, but results in greater compression.", "Windows, Linux, Linux, ", "['Nullsoft Winamp with La plugin', 'foobar2000 with La plugin']['XMMS with La plugin']['Libtool']"], "l4d": ["Cinema 4D Layout File", "Settings file created by Cinema 4D, a 3D modeling application; saves a workspace layout and includes the positions of toolbars, palettes, and the editing canvas; can be used for setting up single or dual monitor configurations.", "Windows, Mac, ", "['MAXON Cinema 4D']['MAXON Cinema 4D']"], "l6t": ["Line 6 Tone File", "Guitar tone format developed by Line 6 that stores custom guitar amp and cabinet models; can be opened and edited on a computer using Line 6 software and transferred to a PODxt or POD X3 effect box via USB. ", "Windows, Mac, ", "['Line 6 Gearbox', 'Line 6 POD Farm 2', 'Line 6 Edit', 'Line 6 GuitarPort']['Line 6 Gearbox', 'Line 6 POD Farm 2', 'Line 6 Edit', 'Line 6 GuitarPort']"], "l3d": ["Black & White Graphics File", "Graphics file used by Black & White, a game where players try to control villages acting as gods; may contain models, textures, and other images; used to store game icons, creature model meshes, weather system models, and other game graphics.", "Windows, Mac, ", "['Lionhead Studios Black and White']['Lionhead Studios Black and White']"], "l3b": ["LEGO 3D Model File", "An L3B file is a 3D LEGO file created by SR 3D Builder, a program used to build digital 3D LEGO models.  It contains the dimensions of a 3D LEGO model which include their placements within a 3D coordinate system.  L3B files can be used to store a variety of LEGO models such as dune buggies, trucks, and front end loaders.", "Windows, ", "['LDview', 'SR 3D Builder']"], "l2r": ["Lineage II Replay File", "An L2R file is a replay file created by Lineage II, a fantasy massively multiplayer online role-playing game (MMORPG) for Windows.  It contains a replay of Lineage II gameplay, such as a fortress siege or open field battle.  L2R files do not store actual video, instead, they store a set of instructions read by the game to replay the action. ", "Windows, ", "['NCSOFT Lineage II']"], "l01": ["EnCase Logical Evidence File", "File created by EnCase forensics software; stores a collection of individual files that have been selectively copied from an EnCase evidence (.E01) file; allows smaller collections of digital evidence to be grouped without having to load the entire E01 evidence file to view them; used for storing noteworthy evidence.", "Windows, ", "['Guidance EnCase Forensic']"], "lbt": ["FoxPro Label Memo", "Contains textual notes about a label definition (.LBX file) used by FoxPro", "Windows, ", "['Microsoft Visual FoxPro']"]}