{"m": ["MATLAB Source Code File", "Text file used by MATLAB, an application used for mathematical computations; can store a script, class, or an individual function in the MATLAB language; used for executing algorithms, plotting graphs, and performing other mathematical operations.", "Windows, Mac, Linux, Windows, Mac, Linux, Windows, Mac, Linux, Windows, Linux, Windows, ", "['The MathWorks MATLAB', 'Notepad++']['The MathWorks MATLAB']['The MathWorks MATLAB']['Richardson EditRocket', 'jEdit', 'gVim']['Apple Xcode', 'Bare Bones BBEdit', 'MacroMates TextMate', 'Richardson EditRocket', 'jEdit', 'MacVim', 'GNU Compiler Collection (GCC)']['Richardson EditRocket', 'jEdit', 'Vim', 'GNU Compiler Collection (GCC)']['Wolfram Research Mathematica', 'Microsoft Notepad', 'Notepad++', 'text editor']['Wolfram Research Mathematica', 'Apple TextEdit', 'text editor']['Wolfram Research Mathematica', 'gedit', 'Leafpad', 'text editor']['winmercury', 'gVim', 'Microsoft Notepad', 'text editor']['Mercury Compiler', 'GNU Emacs', 'Beaver', 'Vim', 'text editor']['FMPMD2000']"], "macbin": ["Macbinary Encoded File", "Compressed file encoded in a binary or MacBinary format; contains a finder header, data fork, and resource fork; saved in one of the MacBinary, MacBinary II, or MacBinary III formats; often used to send Macintosh files over the Internet.", "Windows, Mac, ", "['Smith Micro StuffIt Deluxe for Windows']['Apple Archive Utility', 'Smith Micro StuffIt Deluxe 16']"], "mab": ["Mozilla Address Book", "Address book format used by Thunderbird and SeaMonkey, as well as the older Netscape and Mozilla mail programs; contains contact information, such as names, email addresses, and phone numbers; used for managing personal and business contacts.", "Windows, Mac, Linux, ", "['Mozilla Thunderbird', 'Mozilla SeaMonkey', 'LibreOffice', 'Apache OpenOffice']['Mozilla Thunderbird', 'Mozilla SeaMonkey', 'LibreOffice', 'Apache OpenOffice']['Mozilla Thunderbird', 'Mozilla SeaMonkey', 'LibreOffice', 'Apache OpenOffice']"], "magik": ["Magik Source Code File", "Programming file that contains source code written in the Magic programming language; developed by GE Energy (a division of General Electric) as part of the Smallworld technology platform.", "Windows, ", "[]"], "mailhost": ["MSN Mailhost Settings File", "Stores preferences for the e-mail server used by MSN; installed with MSN software and required for MSN to check and send e-mail; typically named \"MSN#.mailhost.\"", "Windows, ", "[]"], "mahjongtitanssave-ms": ["Mahjong Titans Saved Game", "Saved game file created by Mahjong Titans, a mahjong solitaire game included with Windows Vista and Windows 7; saves the current state of the game so it can be continued at a later time.", "Windows, ", "['Microsoft Mahjong']"], "maf": ["Mutation Annotation Format File", "Text file created in the Mutation Annotation Format (MAF), a file format used to capture mutations in cells; saves cell and genome information using tab-delimited text; used in cancer studies for capturing somatic mutations and single-nucleotide polymorphism (SNPs).", "Windows, Windows, ", "['Microsoft Notepad', 'Microsoft WordPad', 'text editor']['Microsoft Access 2016']"], "mai": ["Microsoft Mail File", "Single mail file processed by Microsoft Mail, Microsoft's mail server program; contains actual message data and may be referenced by one or more mailbag record (.MBG) files.", "Windows, ", "[]"], "ma1": ["Monarch Audio File", "Sound file encoded by Monarch Video Vision audio and video recording software, such as FireX and Digimix; used for mixing audio tracks in video production applications.", "Windows, ", "[]"], "mae": ["My Avatar Editor Character File", "Nintendo Wii character file created by My Avatar Editor, a Flash-based application that allows users to create custom Wii avatars; includes the character's name, gender, body type, and skin color, as well as eye and hair styles.", "Windows, Mac, ", "['My Avatar Editor']['My Avatar Editor']"], "maff": ["Mozilla Archive Format File", "Compressed Web archive created by Mozilla's Firefox and SeaMonkey applications; saved in a compressed .ZIP format and contains one or more Web pages, including the metadata required to reproduce the pages offline; also contains downloadable content, such as audio or video.", "Windows, Mac, Linux, ", "['Mozilla Firefox with MAF plug-in', 'Mozilla SeaMonkey with MAF plug-in']['Mozilla Firefox with MAF plug-in', 'Mozilla SeaMonkey with MAF plug-in']['Mozilla Firefox with MAF plug-in', 'Mozilla SeaMonkey with MAF plug-in']"], "ma": ["Maya Project File", "A MA file is a project created with Maya, a 3D modeling and animation program.  It contains information that defines the geometry, lighting, animation, and rendering properties of a 3D scene.  MA files are saved in an ASCII text format, while binary Maya project files use the .MB extension.", "Windows, Mac, Linux, ", "['Autodesk Maya 2017']['Autodesk Maya 2017']['Autodesk Maya 2017']"], "m5p": ["MachFive Preset File", "An M5P file is a preset used by MachFive, a sampler for music production.  It contains a preset, which is an instrument or effect used by MachFive as the main unit for creating compositions.", "Windows, Mac, ", "['MOTU MachFive']['MOTU MachFive']"], "m4v": ["iTunes Video File", "An M4V file is an MPEG-4 file used to store video downloaded from the Apple iTunes store, such as TV episodes, music videos, and full-length movies.  It is similar to the .MP4 file, but may be copy-protected using Apple's FairPlay DRM copyright protection. ", "Windows, Mac, Linux, Web, iOS, ", "['File Viewer Plus', 'Microsoft Windows Media Player', 'Apple iTunes', 'Nullsoft Winamp', 'Corel VideoStudio Pro X10 Ultimate', 'Media Player Classic', 'VideoLAN VLC media player', 'PCF Miro']['Apple iTunes', 'Apple QuickTime Player', 'Eltima Elmedia Player', 'ShedWorx Smart Converter', 'VideoLAN VLC media player', 'PCF Miro']['VideoLAN VLC media player', 'PCF Miro']['Google Drive']['Apple Music', 'VideoLAN VLC for iOS 2', 'PentaLoop PlayerXtreme Media Player']"], "m4r": ["iPhone Ringtone File", "Custom iPhone ringtone created with iTunes; can only be created from songs purchased from the iTunes music store that allow ringtone creation; automatically transferred to the iPhone when the phone is synced with the computer using Apple iTunes.", "Windows, Mac, ", "['File Viewer Plus', 'Apple iTunes']['Apple iTunes']"], "m4p": ["iTunes Music Store Audio File", "Protected .AAC audio file downloaded from the iTunes Music Store; incorporates Apple Computer's \"Fairplay\" DRM copy protection, which limits the number of computers the file can be played on.", "Windows, Mac, ", "['Apple iTunes', 'Apple QuickTime Player']['Apple iTunes', 'Apple QuickTime Player']"], "mzp": ["MAXScript Zip Package", "3ds Max MAXScript (.MS) file and related components saved in a compressed archive format; may contain scripts, buttons, and other data; typically used for distributing scripts and related files in a single file.", "Windows, Windows, Windows, ", "['Autodesk 3ds Max 2017']['WinArchiver', 'WinArchiver Virtual Drive'][]"], "myr": ["Myriad Music File", "An MYR file is music file used by Myriad music applications such as Melody Assistant, Harmony Assistant, and Melody Player.  It contains sheet music and instrumentation for a musical composition.  MYR files can be played back in the software and exported to various audio formats, including .WAV, .MP3, and .MID.", "Windows, Mac, Linux, ", "['Myriad Melody Assistant', 'Myriad Harmony Assistant', 'Myriad Melody Player']['Myriad Melody Assistant', 'Myriad Harmony Assistant', 'Myriad Melody Player']['Myriad Melody Assistant', 'Myriad Harmony Assistant']"], "myo": ["AccountEdge Company File", "Data file created by AccountEdge Pro, a business accounting application; contains accounting information for a company; includes data describing accounts, sales, banking, purchases, time billing, inventory, payroll, and personalized cards.", "Windows, Mac, ", "['Acclivity AccountEdge Pro']['Acclivity AccountEdge Pro']"], "myl": ["MyLogo Maker Image", "Image file created by MyLogo Maker, a program used for making Web, software, and business logos; often contains a modified logo template from the library that is bundled with the software; can include effects, shapes, freehand drawings, and other graphics.", "Windows, ", "['Avanquest MyLogo Maker']"], "myi": ["MySQL MyISAM Index File", "Index of a MyISAM table created within a MySQL database; defines the structure of the table and includes a counter in the header that shows whether or not the table has been closed properly.", "Windows, Mac, Linux, ", "['MySQL']['MySQL']['MySQL']"], "myd": ["MySQL Database Data File", "Database file created with MySQL, a popular open source database management system; contains the actual data stored within the rows of the database.", "Windows, Mac, Linux, ", "['MySQL']['MySQL']['MySQL']"], "mydocs": ["Send To My Documents", "Enables the \"Send To→My Documents\" option when right-clicking a file or folder in Windows; transfers the selected file to your \"My Documents\" folder", "Windows, ", "['Microsoft Windows']"], "mycolors": ["Stardock MyColors Theme File", "Desktop theme file used by Stardock MyColors, a Windows desktop theme manager; contains colors, display style settings, icons, and graphics; used for changing the look and feel of the desktop environment.", "Windows, ", "['Stardock MyColors']"], "myapp": ["Visual Studio Application XML File", "Contains information about an application created with Microsoft Visual Studio; saved in an XML format and referenced by the main project file; typically uses the default name \"Application.myapp.\"", "Windows, ", "['Microsoft Visual Studio 2017']"], "mxv": ["MAGIX Video File", "Proprietary video format used by MAGIX video editing products such as MAGIX Movie Edit Pro (also called MAGIX Video Deluxe) and MAGIX Digital Foto Maker (now called MAGIX Photo Manager); saves video for a video project; can be converted to other more common formats, such as .MP4, using the export functions in the software.", "Windows, ", "['MAGIX Movie Edit Pro 2016', 'MAGIX Photo Manager 16']"], "mxt": ["ArcGIS Map Template", "Geographical map template created by ArcMap, a GIS mapping application included with ESRI ArcGIS Desktop; stores the base properties of a map as well as the layout positions and visibility of application toolbars; enables users to create multiple maps from the same starting point. ", "Windows, ", "['ESRI ArcGIS for Desktop']"], "mxskin": ["Maxthon Skin File", "Theme or skin file used by the Maxthon Web browser and introduced with Maxthon version 3 (Maxthon 2 uses .M2S files for skins); contains images and layout settings that customize the appearance of the Web browser.", "Windows, ", "['Maxthon']"], "mxs": ["Maxwell Studio Scene File", "Three-dimensional scene file created by Maxwell Render photorealistic rendering software, or by another 3D modeling program with the Maxwell Render plug-in; stores a 3D scene description that can be rendered with physically-accurate light properties in the software.", "Windows, Mac, Linux, Windows, Mac, ", "['Next Limit Maxwell Render']['Next Limit Maxwell Render']['Next Limit Maxwell Render']['Corel Painter 2017']['Corel Painter 2017']"], "mxp": ["Adobe Extension Package", "Add-on used by Adobe Creative Suite applications such as Flash, Dreamweaver, Photoshop, and Premiere Pro; adds additional functionality to the software, such as new menus or toolbars.", "Windows, Mac, ", "['Adobe Extension Manager CC']['Adobe Extension Manager CC']"], "mxn": ["Miinoto Exchangeable Note File", "Note file created by miinoto, an iOS application used for creating notes and to-do lists; supports rich content including text, images, maps, audio, and embedded files such as PDFs; used for transmitting notes to other miinoto users for viewing on their mobile devices.", "iOS, ", "['Mobiiko miinoto']"], "mxml": ["Flex MXML Component", "Component used by a Adobe Flex application; written in the MXML markup language, which is similar to XML, but was developed by Macromedia; used for laying out user interface components in the application.", "Windows, Mac, ", "['Adobe Flash Builder 4.7 Premium', 'FlashDevelop', 'Microsoft Notepad', 'Notepad++', 'gVim', 'text editor']['Adobe Flash Builder 4.7 Premium', 'Apple TextEdit', 'text editor']"], "mxmf": ["Mobile XMF Ringtone File", "Audio file created in the Mobile XMF (Extensible Music Format) format, an open standard audio format used for storing mobile phone ringtones; may contain both MIDI data as well as Mobile DLS (Downloadable Sounds) wavetable synthesized audio.", "Windows, ", "['Nokia Audio Suite']"], "mxm": ["Maxwell Material File", "Material description used by Maxwell Render, a photorealistic rendering application; describes a material based on the physics of the surface in the real world; used for setting the surface appearance of 3D objects in a Maxwell scene (.MXS file).", "Windows, Mac, Linux, ", "['Next Limit Maxwell Render']['Next Limit Maxwell Render']['Next Limit Maxwell Render']"], "mxl": ["Compressed MusicXML File", "Compressed music score created with MuseScore, a program for music composition and notation; contains a compressed file that was saved in the MusicXML format, which is the standard XML format used by more than one hundred score writing programs.", "Windows, Mac, Linux, ", "['MuseScore', 'Myriad Melody Assistant', 'MakeMusic Finale']['MuseScore', 'Myriad Melody Assistant', 'MakeMusic Finale']['MuseScore', 'Myriad Melody Assistant']"], "mxi": ["Adobe Extension Information File", "File used by Adobe Extension Manager, a program used to organize Adobe Creative Suite application extensions; describes an .MXP extension package and includes the extension's name, version number, and type; also includes information about each file included with the extension.", "Windows, Mac, Windows, Mac, Linux, ", "['Adobe Extension Manager CC', 'Adobe InCopy CC 2017']['Adobe Extension Manager CC', 'Adobe InCopy CC 2017']['Next Limit Maxwell Render']['Next Limit Maxwell Render']['Next Limit Maxwell Render']"], "mxf": ["Material Exchange Format File", "Multimedia format used by digital audio and video programs; contains captured audio and video data as well as metadata that describes the media stored in the file; designed by Society of Motion Picture and Television Engineers (SMPTE) as a standard container for audio and video data; can be converted into other formats, such as .AVI or .MOV.", "Windows, Mac, Linux, iOS, Windows, ", "['File Viewer Plus', 'Adobe Premiere Pro CC 2017', 'Avid Media Composer', 'MAGIX Vegas Pro 14', 'Grass Valley EDIUS', 'Avid Pro Tools', 'OpenCube XFReader', 'OpenCube XFConverter', 'VideoLAN VLC media player', 'Aiseesoft MXF Converter']['Apple QuickTime Player', 'Adobe Premiere Pro CC 2017', 'Avid Media Composer', 'Avid Pro Tools', 'VideoLAN VLC media player', 'Aiseesoft MXF Converter for Mac']['VideoLAN VLC media player']['PentaLoop PlayerXtreme Media Player']['Electronic Arts SimCity 4']"], "mxe": ["Macro Express Playable Macro", "Macro or automated script created with Macro Express, a macro editing tool for Windows; can be executed with Macro Express by double-clicking the file or by pressing an assigned keyboard shortcut.", "Windows, ", "[]"], "mxd": ["ArcGIS Map Document", "Map file format used by ESRI mapping software, such as ArcMap; saved in a compound format that includes the map description, layout, and embedded objects saved in the map; organized into units called storages and streams.", "Windows, ", "['ESRI ArcGIS for Desktop']"], "mxc2": ["MAGIX Cache File", "Cache file created by MAGIX software; contains metadata used to speed up the process of generating previews of media files within folders and subfolders; commonly seen with the name mxfilerelatedcache.mxc2.", "Windows, ", "['MAGIX Movie Edit Pro 2016', 'MAGIX Music Maker 2016']"], "mxaddon": ["Maxthon Add-On File", "Plugin file used by Maxthon, a customizable Web browser; introduced with version 3 of the browser (version 2 uses .M2P files); stores a small program that extends the browser functionality; often used for adding small games or news and weather reporters to the browser.", "Windows, ", "['Maxthon']"], "mxad": ["Mandelbrot Explorer All Data File", "File created by Mandelbrot Explorer, a program used to visualize Mandelbrot Set and Julia Set fractal images; stores both the fractal parameters (fractal type, x and y coordinates, and image resolution) and the overlaid color scheme; supports monochrome, grayscale, and color visualizations; saved in an XML format.", "Windows, ", "['Mandelbrot Explorer']"], "mx5": ["Mixcraft 5 Audio Project", "Audio project file created by Mixcraft 5, a multi-track software recording studio; can contain loops, imported audio, sound effects, and virtual instruments, as well as scored and edited video; used for creating musical compositions.", "Windows, ", "['Acoustica Mixcraft']"], "mx": ["Mathematica Serialized Package File", "Binary package created by Mathematica, a desktop application used for computation and visualization; stores Mathematica expressions in a proprietary serialized format, which is optimized for fast loading; used for distributing Mathematica packages.", "Windows, Mac, ", "['Wolfram Research Mathematica']['Wolfram Research Mathematica']"], "mwx": ["MapGuide Author Map Window XML File", "File created by MapGuide Author, a program used to integrate CAD and GIS data and design maps; contains a description of the data covered in a map, including name, layer settings, styles, colors, and a contacting server address; used for saving map configurations and contacting Autodesk MapGuide servers to display spatial data.", "Windows, Windows, Mac, ", "['Autodesk Infrastructure Map Server 2017'][][]"], "mws": ["Maple Classic Worksheet", "Worksheet created with Maple 8.x or earlier, a mathematics and modeling program; may include text, math equations, graphs, charts, and other data; saved in an interactive format that can be opened and edited with Maple.", "Windows, Mac, Linux, Windows, Mac, ", "['Maplesoft Maple']['Maplesoft Maple']['Maplesoft Maple']['text editor']['text editor']"], "mwp": ["Lotus Word Pro SmartMaster File", "Template for creating a new Lotus Word Pro (.LWP) document; saves formatting options and custom settings for the Lotus word processing program; preinstalled SmartMaster files are typically saved in the C:\\Lotus\\SMasters\\ directory.", "Windows, ", "[]"], "mwl": ["Super Mario World Level", "Super Mario World level format used by Lunar Magic, a level editor for the Super Nintendo Entertainment System (SNES) Super Mario World game; contains one or more custom saved Super Mario World levels.", "Windows, ", "['Lunar Magic']"], "mwf": ["MapGuide Author Map Window File", "File created by MapGuide Author, a program used to design maps using CAD and GIS data; contains map descriptions, such as name, styles, colors, layer settings, and a source data server address; used for storing map configurations and for contacting Autodesk MapGuide servers to download and display map data.", "Windows, Windows, ", "['Autodesk Infrastructure Map Server 2017'][]"], "mw": ["MacWrite Text Document", "Text document created by MacWrite, the first word processing program available for the Macintosh; contains text, font styles, and basic page formatting information.", "Mac, Windows, Mac, Linux, ", "['Apple AppleWorks']['Maplesoft Maple']['Maplesoft Maple']['Maplesoft Maple']"], "mwd": ["MarinerWrite Document", "Document created with Mariner Write, a streamlined word processor for Mac OS X designed to be flexible and efficient; may contain formatted text, graphics, headers, footers, and other data.", "Mac, ", "['Mariner Write']"], "mwb": ["MySQL Workbench Document", "Database document created by MySQL Workbench, a graphical interface used for creating and administering MySQL databases; saves a database design, called an EER (Enhanced Entity-Relationship) model; defines tables, views, routines, privileges, and other constructs for a database.", "Windows, Mac, Linux, ", "['MySQL Workbench']['MySQL Workbench']['MySQL Workbench']"], "mvy": ["Video easy Project File", "Video project created by Video easy, a video production and disc burning application; includes references to multimedia files as well as movie edits, such as transitions and video effects; used for saving movie compilations and burning them to CDs and DVDs.", "Windows, ", "['MAGIX Video easy']"], "mvm": ["Photostory Deluxe Slideshow", "Slideshow created by Photostory Deluxe, an application used to create presentations; contains the editing steps and links to the original files that appear in the slideshow.", "Windows, ", "['MAGIX Photostory 2016 Deluxe']"], "mvp": ["MAGIX Video Project File", "An MVP file is a video project created by Movie Edit Pro (MEP) and Video Pro X, movie editing applications.  It stores references to one or more .MVD movies, edits, effects, titles, and other project settings.  MVP files are different from MVD files since MVD files only store single movies.", "Windows, Android, Windows, ", "['MAGIX Movie Edit Pro 2016', 'MAGIX Video Pro X8']['MAGIX Movie Edit Touch']['Serif MoviePlus']"], "mvi": ["AutoCAD Movie Command File", "Contains instructions and commands for a movie or animation created with AutoCAD, a 3D-modeling program; generated by AutoFlix, an animation add-on for early versions of AutoCAD.", "Windows, ", "['Autodesk AutoCAD with AutoFlix add-on']"], "mvg": ["Magick Vector Graphics File", "Graphic file used by ImageMagick, a program used to view, edit, and convert images; contains modularized language that describes 2D vector and mixed vector/raster graphics; includes fill-opacity, stroke-opacity, stroke-dash, clip-rule, and stroke-miterlimit settings.", "Windows, Mac, Linux, ", "['File Viewer Plus', 'ImageMagick']['ImageMagick']['ImageMagick']"], "mve": ["Infinity Engine Movie File", "Video file used by the Infinity Engine, a role-playing gaming engine developed by BioWare; contains a movie, such as the game introduction video or an action sequence video between levels; used to encode videos for playback during gameplay.", "Windows, ", "[]"], "mvdx": ["MindView Windows Document", "Document created and used by MindView, a mind mapping program used to visually brainstorm and organize ideas; contains one or more ideas made up of text, shapes, images, branches, sub-branches, and other mind map elements. ", "Windows, Mac, ", "['MatchWare MindView']['MatchWare MindView']"], "mvd": ["Movie Edit Pro Movie File", "Movie project created with MAGIX Movie Edit Pro or the earlier Video Deluxe application; contains references to video and audio files, as well as movie edit points and detected scenes; may also include a variety of custom effects.", "Windows, Windows, Mac, ", "['MAGIX Movie Edit Pro 2016', 'MAGIX Video Pro X8']['MatchWare MindView']['MatchWare MindView']"], "mvc": ["MivaScript Compiled File", "An MVC file is a compiled script used by Miva Merchant Empresa, a web server application used to run Miva-based web programs.  It contains a module or web application that has been compiled from an .MV file. MVC files are often used for deploying e-commerce programs on the web.", "Windows, Linux, Windows, Mac, ", "['Miva Merchant Empresa']['Miva Merchant Empresa'][][]"], "mv": ["MivaScript File", "Script used by MivaScript, a Web-based programming language used for developing e-commerce websites; contains MivaScript source code, which defines a Web page with display information and and methods to accept and retrieve stored data.", "Windows, Linux, ", "['Miva Merchant Script Compiler']['Miva Merchant Script Compiler']"], "mux": ["Trackmania Music File", "Audio file used by Trackmania, a car racing game featuring the ability to create custom user-generated tracks; saves the background music for a racing track; similar to the .OGG format but is encrypted.", "Windows, Windows, Mac, Linux, ", "['Ubisoft Trackmania', 'Ubisoft TrackMania 2: Canyon']['Myriad Harmony Assistant', 'Myriad Melody Assistant']['Myriad Harmony Assistant', 'Myriad Melody Assistant']['Myriad Harmony Assistant', 'Myriad Melody Assistant']"], "musx": ["Finale Notation File", "A MUSX file is a notation file saved in MIDI format and created by Finale, a music notation program.  It contains music notation data and additional information that can only be read by MakeMusic software.  MUSX files replaced .MUS files.", "Windows, Mac, ", "['MakeMusic Finale', 'MakeMusic SmartMusic']['MakeMusic Finale', 'MakeMusic SmartMusic']"], "muse": ["Adobe Muse Website Project", "Website project file created by Adobe Muse, an easy-to-use Web development software that doesn't require knowledge of source code; stores a collection of pages ordered visually as a sitemap in the software; supports standard HTML elements as well as master page templates, freeform design elements, and many types of rich interactive content.", "Windows, Mac, ", "['Adobe Muse CC']['Adobe Muse CC']"], "mus": ["Finale Notation File", "Music notation format used by Finale and other MakeMusic notation programs; saves data in MIDI format, similar to a .MID file; also contains additional information that can only be read by MakeMusic software.", "Windows, Mac, Windows, Mac, Linux, Windows, Windows, ", "['MakeMusic Finale', 'MakeMusic SmartMusic']['MakeMusic Finale', 'MakeMusic SmartMusic']['Mojang Minecraft', 'musdecode']['Mojang Minecraft', 'musdecode']['Mojang Minecraft', 'musdecode']['MFAudio', 'EA Need for Speed: Most Wanted']['id Software Doom', 'Slade', 'ZDoom', 'GZDoom', 'Nullsoft Winamp with MIDI plug-in', 'XMPlay']"], "mul": ["Ultima Online Multi File", "Game file used by Ultima Online, one of the earlier massively multiplayer online (MMO) games; may save various kinds of data, including graphics, animation data, maps, and game items; also used for applying game patch updates.", "Windows, Windows, ", "['MULTool', 'Multi Operations Utility', 'MulPatcher', 'UOSir'][\"Gibbed's Deus Ex HR tools\", 'Eidos Interactive Deus Ex: Human Revolution']"], "mup": ["Music Publisher Score", "File created by Music Publisher, a music notation application; contains the sheet music for a musical composition; specifies instruments, time signatures, notes, dynamics, and other musical score information such as the composer and title; may be played back in the software, which helps to conceptualize the music.", "Windows, ", "['Lauriso Music Publisher']"], "mum": ["Windows Vista Update Package", "Package containing a software update or \"hotfix\" for Windows Vista; installed by Windows using the built-in software update program.", "Windows, Windows, ", "['Microsoft Windows Update']['AmsterCHEM MATLAB CAPE-OPEN Unit Operation']"], "mui": ["Myriad User Instrument File", "An MUI file is a user instrument file used by Myriad musical notation software products such as Harmony Assistant.  It stores sounds for a variety of instruments such as piano, strings, woodwinds, brass.  MUI files are used for generating realistic sounds.", "Windows, Mac, Linux, Windows, ", "['Myriad Harmony Assistant']['Myriad Harmony Assistant']['Myriad Harmony Assistant']['Microsoft Windows Multilingual User Interface']"], "mud": ["Mudbox 3D Scene File", "3D image created by Mudbox, a 3D digital sculpting and painting application; saves a 3D model with textures and lighting information; can include multiple sculpt and paint layers; can also incorporate models (.OBJ, and .FBX) created in other 3D software tools such as Maya.", "Windows, Mac, Linux, Windows, ", "['Autodesk Mudbox 2017']['Autodesk Mudbox 2017']['Autodesk Mudbox 2017']['Lightbox Education Textease Studio CT']"], "mtxt": ["MOPEKS Text File", "Text file created by MOPEKS, a program that generates multiple programs run by its script to use each other to solve problems; contains trial problem data; when it's clicked, the application references the data to run a trial to solve the problem;", "Windows, ", "['MOPEKS']"], "mtz": ["MIUI Theme", "Android phone theme used by MIUI (pronounced \"Me UI\"), a program used for modifying the firmware, or \"ROM,\" of Android devices; saves a theme that customizes the look of the Android interface.", "Android, Windows, Mac, ", "['MIUI ROM'][][]"], "mtx": ["MadTracker 2 Extension", "Adds extra features or additional format support to the MadTracker audio tracker.", "Windows, Windows, Mac, ", "[]['IMSI TurboCAD Pro 2017']['IMSI TurboCAD Deluxe v10']"], "mtw": ["Minitab Worksheet File", "Data file created by Minitab, a statistical software package used in supply-chain and quality management; contains a worksheet of data arranged as a grid of rows and columns; used to store business data and to provide input into Minitab for statistical analysis and creating graphs.", "Windows, ", "[]"], "mtv": ["MTV Video Format File", "Video format used by various Chinese MP4 portable video players; contains a 512-byte file header and a series of images that are displayed during MP3 playback; similar to a .AMV file, but uses  slightly different formatting.", "Windows, Mac, ", "[]['MPlayerX', 'ShedWorx Smart Converter']"], "mts": ["AVCHD Video File", "An MTS file is a video file saved in the high-definition (HD) MPEG Transport Stream video format, commonly called \"AVCHD.\"  It contains HD video compatible with Blu-ray disc format and is based on the MPEG-2 transport stream and supports 720p and 1080i HD video formats.  MTS files are often used by Sony, Panasonic, and other HD camcorders. ", "Windows, Mac, Linux, Web, Windows, Mac, Windows, ", "['File Viewer Plus', 'Microsoft Windows Media Player', 'GRETECH GOM Player', 'Roxio Creator NXT Pro 5', 'CyberLink PowerDirector 15 Ultra', 'MAGIX Vegas Pro 14', 'Corel VideoStudio Pro X10 Ultimate', 'MAGIX Movie Edit Pro 2016', 'Grass Valley EDIUS', 'VideoLAN VLC media player', 'Blender']['Roxio Toast 15', 'Roxio Popcorn', 'Apple Final Cut Pro X', 'VideoLAN VLC media player', 'Blender', 'Eltima Elmedia Player']['OpenShot', 'VideoLAN VLC media player', 'Blender']['Google Drive']['MEGA']['MEGA']['MadTracker']"], "mtp": ["MadTracker 2 Pattern", "An MTP file is a pattern created by MadTracker 2, an audio tracking program.  It contains a song pattern that can be applied to a track in the .MT2 module.  MTP files can be opened through the Pattern menu in the MadTracker interface.", "Windows, ", "['MadTracker']"], "mtl": ["OBJ Material File", "Material settings file used by 3D object editing applications; stored with an .OBJ file and describes how textures are applied to the object; includes the name of texture bitmap files as well as the 3D positioning of the textures.", "Windows, Mac, Linux, ", "['Adobe Photoshop CC 2017', 'Autodesk Maya 2017', 'MeshLab']['Adobe Photoshop CC 2017', 'Autodesk Maya 2017', 'IMSI TurboCAD Deluxe v10', 'Cheetah3D', 'MeshLab']['Adobe Photoshop CC 2017', 'Autodesk Maya 2017', 'MeshLab']"], "mtm": ["MultiTracker Module", "Universal audio tracker module format that is similar to a .MOD file; contains sound samples and a musical score for playback; supports up to 32 channels, which allows many samples to be played back at once.", "Windows, Mac, Linux, Windows, Mac, Linux, ", "['Nullsoft Winamp', 'jetAudio', 'MODPlug Player', 'VUPlayer', 'XMPlay', 'VideoLAN VLC media player with VLC Codec Pack']['CocoModX', 'XimpleMOD', 'VideoLAN VLC media player with VLC Codec Pack']['VideoLAN VLC media player with VLC Codec Pack']['Macrofocus TreeMap']['Macrofocus TreeMap']['Macrofocus TreeMap']"], "mti": ["MadTracker Instrument", "Instrument format used by the MadTracker tracking program; played back within the tracker using MIDI data.", "Windows, ", "['MadTracker', 'FMJ-Software Awave Studio']"], "mthd": ["MOPEKS Method File", "File created by MOPEKS, a freeware program that generates multiple programs run by its script to use each other to solve problems; contains a method, which is played when clicked.", "Windows, ", "['MOPEKS']"], "mth": ["Derive Math File", "Includes functions and values that can be loaded by Derive, \"the mathematical assistant for your PC\"", "Windows, ", "[]"], "mtff": ["MadgeTech Data Logger Report", "Data logger report created by MadgeTech, an application used to download and review data collected by MadgeTech data logger devices; contains datasets, such as temperature, water level, and pressure readings, downloaded from the data logger.", "Windows, ", "['MadgeTech']"], "mtf": ["Motorola Theme File", "Theme file used by Motorola mobile phones; stores ringtone, wallpaper, and screensaver settings and can be used for customizing the look and feel of the phone; can be created using Motorola Media Manager.", "Windows, Mac, Windows, Windows, Windows, Windows, ", "['Motorola MOTOCAST USB']['Motorola MOTOCAST USB']['Song Galaxy Multi Tracker']['Microsoft Excel 2016']['ValuSoft MasterCook'][]"], "mte": ["MadTracker 2 Envelope", "Audio envelope used to modify a waveform in order to alter its sound; proprietary format used by MadTracker 2", "Windows, ", "['MadTracker']"], "mtd": ["Musicnotes Digital Sheet Music File", "An MTD file is a sheet music file used by Musicnotes Viewer, a web browser plug-in used for viewing, purchasing, printing, and listening to digital sheet music.  It contains voice, guitar, and piano tablature as well as lyrics.  MTD files are used to download and share online tablature.", "Windows, Mac, ", "['Musicnotes Player', 'Musicnotes Viewer', 'Musicnotes Guitar Guru']['Musicnotes Viewer', 'Musicnotes Guitar Guru']"], "mtc": ["Make the Cut! Project", "Project created by Make the Cut!, a program that enables users to create shapes that can be cut out with a personal cutting machine; contains a page layout with any shapes, text, and lines added by the user.", "Windows, Mac, ", "['Make the Cut!']['Make the Cut!']"], "mta": ["Samsung AllShare Metadata File", "File created by Samsung AllShare, a program used for sharing multimedia files between PCs, TVs, mobile phones, and other network ready DLNA devices; referred to as a \"chapter\" file since it contains indexing information for navigating through the multimedia files.", "Windows, ", "['Samsung AllShare Play']"], "mswmm": ["Windows Movie Maker Project", "Movie created with Windows Movie Maker; contains the movie timeline, transitions, and references to video clips, audio files, and still images used by the movie.", "Windows, ", "['Microsoft Windows Live Movie Maker', 'Microsoft Windows Movie Maker']"], "msu": ["Windows Vista Update Package", "Update file used by Windows Update, an application included with Windows Vista, Windows 7, and Windows Server; contains updates for applications and files; installed by the Windows Update Stand-alone Installer (Wusa.exe), which is run by Windows Update automatically (the user generally does not need to manually install MSU files).", "Windows, ", "['Microsoft Windows Update']"], "mst": ["Windows Installer Setup Transform File", "Settings file used by the Microsoft Windows Installer (msiexec.exe), a component of the Windows operating system that enables software installations; contains software configuration options; allows custom parameters to be used for the installation; used in software development and testing for configuring test versions of software.", "Windows, Windows, ", "['Microsoft Windows Installer', 'Microsoft Windows SDK']['Corel Presentations X8']"], "msw": ["Painter Color Mixer Swatches File", "Colors file created by Corel Painter, an application used for painting digital art; stores the paint color selections that are available from the Mixer panel; allows the artist to remember specific color sets.", "Windows, Mac, ", "['Corel Painter 2017']['Corel Painter 2017']"], "msrcincident": ["Windows Remote Assistance Invitation File", "XML file used by Windows Remote Assistance, a program that allows remote users to control your computer; contains connection information and login privileges; used for inviting experts to help troubleshoot computer problems.", "Windows, ", "['Microsoft Windows Remote Assistance']"], "msstyles": ["Windows XP Style", "Theme file for Windows XP that contains colors and images used by windows, buttons, and other elements within the Windows GUI; two popular MSSTYLES from Microsoft include the Luna and Zune themes; the Royale theme is used by Windows XP Media Center Edition.", "Windows, Mac, ", "[]['Parallels Desktop for Mac with Windows installed']"], "mss": ["Microprocessor Software Specification File", "File used by Xilinx Platform Studio (XPS), a program used to design software for microprocessors; specifies the input/output devices, interrupt handler routines, and other software features for a microprocessor.", "Windows, Windows, ", "['Xilinx Platform Studio']['MSB MyScreenSaver Builder']"], "mspx": ["Microsoft ASP.NET Web Page", "Web page developed using Microsoft's presentation framework for ASP.NET; processed by a Microsoft Internet Information Services (IIS) Web server; dynamically generates content that is passed to the client's Web browser.", "Windows, Mac, ", "['Web browser']['Web browser']"], "msp": ["Microsoft Paint Bitmap Image", "Monochromatic (black and white) image file created by Microsoft Paint, one of the first painting programs released by Microsoft; also used for storing older clip art images.", "Windows, Windows, Windows, Mac, ", "['Microsoft Paint', 'Corel PaintShop Pro X9', 'Serif PhotoPlus']['Microsoft Windows Installer'][]['Apple AppleWorks']"], "msm": ["Windows Installer Merge Module", "Database of a \"merge module\" that contains installation settings and properties for a specific software installer; includes files, resources, registry entries, and setup information; often contained within an .MSI file.", "Windows, Windows, ", "['Microsoft Visual Studio 2017', 'Microsoft Windows Installer']['National Instruments Multisim']"], "mso": ["Microsoft Office Macro Reference File", "An MSO file is a macro reference file created when saving a Microsoft Office document as a webpage.  It contains information about macros and OLE (Object Linking and Embedding) objects included in the original file and may be referenced by the created webpage as a style sheet.  MSO files may be viewed with a text editor, but will be unreadable since the contents are encoded. ", "Windows, Mac, Windows, Mac, ", "[][]['Microsoft Outlook 2016']['Microsoft Outlook 2016']"], "msn": ["Host Blocking File", "Contains a list of blocked Internet hosts, often identified by IP addresses; prevents certain websites and other Internet locations from being accessed.", "Windows, ", "[]"], "msl": ["Mapping Specification Language File", "Developer file used by some programs developed with Microsoft's Entity Framework, which is part of the .NET development tool suite; describes a mapping between a conceptual data model and the underlying storage model; provides a layer of abstraction for increased flexibility between the application and the underlying storage technology.", "Windows, Windows, Mac, Linux, ", "['Microsoft Visual Studio 2017', 'text editor']['ImageMagick']['ImageMagick']['ImageMagick']"], "mskn": ["MediaMonkey Skin File", "Theme, or skin, that defines the look and feel of MediaMonkey, a program for organizing and playing music files; contains interface settings for the title bar, status bar, buttons, tabs, and checkboxes.", "Windows, ", "['Ventis Media MediaMonkey 4']"], "msim": ["mSecure Password Manager Backup File", "Backup file created and used by mSecure Password Manager, a digital wallet and password manager; stores an encrypted backup of a user's mSecure data, which includes passwords and other private information such as usernames and account numbers.", "iOS, Android, ", "['mSeven mSecure Password Manager']['mSeven mSecure Password Manager']"], "msi": ["Windows Installer Package", "An MSI file is a package that contains installation information for a particular installer, such as files to be installed and installation locations.  It may be used for Windows updates as well as third-party software installers.", "Windows, ", "['Microsoft Windows Installer', '7-Zip']"], "mshi": ["Microsoft Help Index File", "Help documentation file created in the MS Help Viewer 1.x index format; saves a topical index that is used for browsing and searching the help documentation; used by software developers when authoring the help topics for their software titles.", "Windows, ", "['The Helpware Group FAR', 'Microsoft Visual Studio 2017']"], "msf": ["Mail Summary File", "Index of mail messages stored in various e-mail programs' mailboxes; contains mail headers and summaries but not complete messages.", "Windows, Mac, Linux, Windows, Windows, ", "['Mozilla SeaMonkey', 'Mozilla Thunderbird']['Mozilla SeaMonkey', 'Mozilla Thunderbird']['Mozilla SeaMonkey', 'Mozilla Thunderbird'][]['Scout Management Blue Card Manager']"], "msha": ["Microsoft Help Asset File", "File used by MS Help Viewer 1.x, a Visual Studio component that helps developers author help documentation for software applications; saves the help manifest, which defines the help \"Books\" (help documents), which contain \"Packages\" (.MSHC help content files) to be installed.", "Windows, ", "['Microsoft Visual Studio 2017', 'The Helpware Group FAR', 'Microsoft Notepad', 'text editor']"], "msg": ["Outlook Mail Message", "An MSG file is an email message, contact, appointment, or task created or saved within Microsoft Outlook.  It may contain one or more email fields, which includes the date, sender, recipient, subject, and message body, or contact information, appointment details, and one or more task descriptions.   MSG files are also compatible with other programs that use Microsoft's Messaging Applications Programming Interface (MAPI).", "Windows, Mac, Linux, iOS, Android, Windows, ", "['File Viewer Plus', 'Microsoft Outlook 2016', 'Encryptomatic MsgViewer Pro', 'BitDaddys Email Open View Pro', 'EZ Freeware Free Opener', 'Mozilla SeaMonkey']['Kupon.BG Klammer', '45RPM MailRaider', 'Mozilla SeaMonkey']['Mozilla SeaMonkey']['Kupon.BG Klammer 3']['File Viewer for Android']['Bethesda Softworks Fallout 1', 'Bethesda Softworks Fallout 2', 'Microsoft Notepad', 'Microsoft WordPad']"], "mshc": ["Microsoft Help Container File", "Help package created in the MS Help Viewer 1.x format, which replaces the MS Help 2.x (.HXS) and MS Help 1.x (.CHM) formats; stores help content such as .HTML files, images, and written text; saved in a compressed .ZIP format.", "Windows, ", "['The Helpware Group FAR', 'Microsoft Windows zip utility']"], "mse": ["MediaShow Slideshow Project File", "Slideshow project created by MediaShow, a program used for creating home-made videos and slideshows; saves a list of images with transition effects, text, and background music; can be exported to .WMV or .MPG (MPEG2) formats and then shared with friends and family members.", "Windows, Windows, Web, ", "['CyberLink MediaShow 6']['Autodesk 3ds Max 2017']['msedecrypt']"], "mscz": ["MuseScore Compressed Score File", "Music score saved by MuseScore, a free program used for music composition and notation; contains a composition, including instruments, time and key signatures, and music notes; also contains score metadata such as composer, title, and copyright information.", "Windows, Mac, Linux, ", "['MuseScore']['MuseScore']['MuseScore']"], "msd": ["Map Service Definition File", "Published map file created by ArcGIS Desktop, a software suite used to create maps and process geospatial data; contains a map that has been published from an .MXD map document; created for ArcGIS Server, which hosts the map for real-time viewing over a network.", "Windows, ", "['ESRI ArcGIS Server', 'ESRI ArcGIS for Desktop']"], "msct": ["MOPEKS Script File", "File created by MOPEKS, a program that generates multiple programs run by its script to use each other to solve problems; contains script data, which is accessed when the file is clicked to conduct MOPEKS to run the appropriate actions.", "Windows, ", "['MOPEKS']"], "msc": ["Microsoft Management Console Snap-in Control File", "File added to the Microsoft Management Console (MMC), a program used to configure and monitor Windows computer systems; contains a \"snap-in,\" which is a module that provides additional administration capabilities; saved in an XML format that can be viewed and edited with basic a text editor.", "Windows, Windows, Mac, Linux, ", "['Microsoft Management Console', 'Microsoft Notepad']['MuseScore']['MuseScore']['MuseScore']"], "msb": ["Oracle Binary Message File", "File used by Oracle relational database management software; saves application messages, typically errors, generated by the software; saved in a binary format, which allows quicker message lookup; acts as a readable log file for program alerts.", "Windows, Linux, ", "['Oracle Database', 'Oracle .msb files unpacker']['Oracle Database']"], "ms3d": ["MilkShape 3D Model", "Three-dimensional model created with MilkShape 3D, a low-polygon 3D modeler; contains a 3D model that includes skeleton, surface, and texture data; may also include 3D animation data; can be exported to several different 3D formats.", "Windows, ", "['Chumbalum Soft MilkShape 3D']"], "ms14": ["Multisim 14 Circuit Design File", "An MS14 file is a CAD file created with version 14 of Multisim, a program used to design, prototype, and test printed circuits.  It contains a circuit schematic design, which may include diodes, components connectors, indicators, and peripherals.", "Windows, ", "['National Instruments Multisim']"], "ms13": ["Multisim 13 Circuit Design File", "An MS13 file is a CAD file created with version 13 of Multisim, a program used to simulate, design, and analyze printed circuit boards (PCB).  It contains a circuit schematic design, which includes components and interconnections.", "Windows, ", "['National Instruments Multisim']"], "ms11": ["Multisim 11 Circuit Design File", "CAD file created with Multisim, a program used for printed circuit board (PCB) design, simulation, and analysis; stores a circuit schematic designed by the user; can be simulated in the software to analyze the circuit.", "Windows, ", "['National Instruments Multisim']"], "ms1": ["VirtualBus Map File", "Game file used by VirtualBus (vBus), a free bus driving simulation game; contains a map that specifies roads, vehicles, traffic signs, buildings, and landscape objects such as trees and bushes; represents the 3D world that the player drives the bus in.", "Windows, ", "['VirtualBus']"], "mrs": ["GunZ Game Data File", "Stores game data used by GunZ (a.k.a. \"GunZ the Duel\"), an online multiplayer action game; stores information such as weapons, clothing, spawn points, number of players per room, and other data; may be decompiled and edited with a program called Mrs Decompiler.", "Windows, ", "['MRS Decompiler']"], "mrxs": ["MIRAX Virtual Slide File", "Image file created by MIRAX-compatible microscope digital slide scanners such as the Carl Zeiss MIRAX series or the 3DHISTECH Pannoramic series; stores images of multiple specimen samples from glass slides on a single digitized virtual slide; used for archiving and analyzing microscope images.", "Windows, Mac, Linux, ", "['3DHISTECH Pannoramic Viewer', 'Aperio Technologies ImageScope', 'OpenSlide']['OpenSlide']['OpenSlide']"], "mrw": ["Minolta Raw Image File", "Raw image format used by Minolta Dimage digital cameras; stores data in an uncompressed format exactly as it was captured by the camera's sensor; settings like color temperature and exposure can be edited with software after the image is saved on a computer.", "Windows, Mac, iOS, Android, ", "['File Viewer Plus', 'Adobe Photoshop CC 2017', 'Adobe Photoshop Elements 15', 'Corel PaintShop Pro X9', 'CorelDRAW Graphics Suite X8', 'Pholix PhotoPhilia', 'ACD Systems Canvas X 2017', 'ACD Systems ACDSee 20', 'Google Picasa', 'Microsoft Windows Photos', 'Microsoft Windows Live Photo Gallery']['Apple Photos', 'Google Picasa', 'Adobe Photoshop CC 2017', 'Adobe Photoshop Elements 15', 'MacPhun ColorStrokes']['Adobe Photoshop Express']['File Viewer for Android', 'Adobe Photoshop Express']"], "ms": ["Maxwell Script", "Script created using Maxwell Render, a program used for photorealistic image generation; contains JavaScript code and can use both the .JS and \".ms\" file extensions; used for automating multi-step or logic-driven rendering jobs.", "Windows, Mac, Linux, Windows, ", "['Next Limit Maxwell Render']['Next Limit Maxwell Render']['Next Limit Maxwell Render']['Autodesk 3ds Max 2017']"], "mrimg": ["Macrium Reflect Disk Image", "Disk image created by Macrium Reflect, a program used to create Windows hard drive images; contains all files and folders from a disk in a single file; used for disk duplication or to create backups for performing system restores.", "Windows, ", "[]"], "mrk": ["DPOF Auto Print Order File", "Text file saved on digital cameras along with the digital images; describes the order the pictures should be printed in when printing pictures directly from the camera; used by digital photo printing services that support the Digital Print Order Format (DPOF).", "Windows, Mac, ", "['text editor']['text editor']"], "mrml": ["3D Slicer Scene Description File", "3D scene file created by 3D Slicer (or \"Slicer\"), a free 3D modeling and visualization program used to create medical images; saved using the Slicer MRML XML format; includes references to 3D datasets and scene properties, which are used to construct the 3D scene.", "Windows, Mac, Linux, ", "['BWH 3D Slicer']['BWH 3D Slicer']['BWH 3D Slicer']"], "mrp": ["Mobile Application File", "Application program run by mobile phones, such as China Mobile and Cherry Mobile; contains an application (commonly games) and all of its resources; similar to a .VXP file.", "Windows, ", "[]"], "mrg": ["Now Contact Merge Template", "Merge template created by Now Contact, an application that organizes contact information and day-to-day activities; contains a print layout template for your letter document; pre-loaded options include \"Fancy Letter,\"  \"Flower Letter,\" \"Swoosh Letter,\" and \"Ship Letter.\"", "Windows, Mac, Windows, Mac, Linux, ", "['Now Contact']['Now Contact']['MySQL']['MySQL']['MySQL']"], "msdvd": ["Windows DVD Maker Project File", "DVD project created with Windows DVD Maker; formatted in XML and contains tags that define the media content, DVD title, menu style, button names, and other information; may also be generated by third-party applications that access DVD Maker's encoding capabilities.", "Windows, ", "['Microsoft Windows DVD Maker']"], "mrc": ["mIRC Script File", "Script for mIRC, an Internet relay chat program; can be created using the mIRC Scripts Editor; used for automating functions within mIRC, such as creating dialog windows and protecting users and channels against spam and flooding.", "Windows, ", "['mIRC', 'text editor']"], "mqv": ["Sony Movie Format File", "Proprietary movie format used by Sony devices, such as the the Clie PDA; similar to a .MP4 video file, but uses a different encoding method; playable with Apple QuickTime Player 6 or later.", "Windows, Mac, ", "['Apple QuickTime Player', 'GRETECH GOM Player']['Apple QuickTime Player', 'MPlayer']"], "mqo": ["Metasequoia Document", "3D image created by Metasequoia, a 3D modeling program; saves the 3D geometry and pose information for a character or other object; also stores applied textures; uses plain text formatting and can be exported to common 3D formats, including .DXF, .LWO, .3DS, and .OBJ.", "Windows, ", "['Metasequoia']"], "mq5": ["MQL5 Source Code File", "An MQ5 file is a program written for MetaTrader, an online trading platform.  It contains source code written in MetaQuotes Language 5 (MQL5), which includes classes, variables, functions, and comments that can be compiled into an .EX5 file.  MQ5 files replaced .MQ4 files with the release of MetaTrader 5.", "Windows, Mac, Linux, iOS, Android, ", "['MetaQuotes MetaTrader']['MetaQuotes MetaTrader']['MetaQuotes MetaTrader']['MetaQuotes MetaTrader']['MetaQuotes MetaTrader']"], "mpz": ["Miradi Project File", "Project file created with Miradi, an environmental conservation program; includes environmental threats, targets, viability analysis, and planning information; can be viewed visually within Miradi.", "Windows, Mac, Linux, Windows, Mac, Linux, ", "['Benetech Miradi']['Benetech Miradi']['Benetech Miradi'][][][]"], "mpws": ["MathPiper Worksheet", "An MPWS file is a worksheet created by MathPiperIDE, an IDE that includes text editing, graphing, and charting capabilities.  It contains code folds, which are sections of source code, such as MathPiper, that can be executed to calculate equations.", "Windows, Mac, ", "['MathPiperIDE']['MathPiperIDE']"], "mpv": ["MPEG Elementary Stream Video File", "Video file containing an \"elementary stream,\" or raw video data; typically contains video data stored with MPEG-2 compression; used for raw output from a video recorder or for raw input to a video authoring program; does not contain audio data.", "Windows, Mac, iOS, ", "['Microsoft Windows Media Player', 'VideoLAN VLC media player', 'CyberLink PowerDVD 16']['Eltima Elmedia Player', 'VideoLAN VLC media player']['PentaLoop PlayerXtreme Media Player']"], "mpx": ["FoxPro Compiled Menu Program", "FoxPro menu program compiled from a .MPR file", "Windows, Windows, Mac, Linux, ", "['Microsoft Visual FoxPro']['File Viewer Plus', 'Microsoft Project 2016', 'Seavus Project Viewer', 'Stand By Soft RationalPlan', 'KaDonk LiveProject Viewer', 'MPXJ']['ProjectWizards Merlin', 'Stand By Soft RationalPlan', 'MPXJ']['Stand By Soft RationalPlan', 'MPXJ']"], "mpsub": ["MPlayer Subtitles File", "Movie subtitles file created by MPlayer, a multimedia playback application; contains a dump of movie subtitles converted from another subtitle file, such as an .SSA file; used for storing subtitles in a format that can be manipulated by MPlayer.", "Windows, Mac, Linux, ", "['MPlayer', 'VideoLAN VLC media player']['MPlayer', 'VideoLAN VLC media player']['MPlayer', 'VideoLAN VLC media player']"], "mps": ["Mathematical Programming System File", "An MPS file is a data file created in the Mathematical Programming System (MPS) format, which is used for linear programming (LP) problems.  It is saved as ASCII text and contains parameters in a column-based format. \r\n MPS files are used for LP optimization problems.", "Windows, Mac, Linux, Windows, Windows, Mac, ", "['Gnumeric', 'Microsoft Notepad', 'text editor']['Apple TextEdit', 'text editor']['Gnumeric', 'Vim', 'GNU Emacs', 'text editor']['Microsoft MapPoint']['Rockstar Games Max Payne'][]"], "mpt": ["Microsoft Project Template", "Template for creating a new file in Microsoft Project, a project management program; contains a pre-defined structure that can be used as a starting point for new projects (which use the .MPP file extension).", "Windows, Mac, Linux, ", "['File Viewer Plus', 'Microsoft Project 2016', 'Housatonic Project Viewer', 'MOOS Project Viewer', 'MPXJ']['MOOS Project Viewer', 'MPXJ']['MOOS Project Viewer', 'MPXJ']"], "mproj": ["Mine-imator Project", "Project file created by Mine-imator, a Minecraft animation creation program; contains items, mobs (players), and terrain for the scene; includes an animation timeline, project description, and screen resolution; can be exported to an .AVI video when complete.", "Windows, ", "['Mine-imator']"], "ms10": ["Multisim 10 Circuit Design File", "Circuit design created with Multisim, a printed circuit board (PCB) design, simulation, and analysis program; contains a schematic capture of a circuit board that can be used to run simulations within Multisim.", "Windows, ", "['National Instruments Multisim']"], "mpr": ["FoxPro Generated Menu Program", "Source code of a menu program generated by FoxPro", "Windows, Windows, Mac, Mac, ", "['Microsoft Visual FoxPro']['FileMaker Pro']['FileMaker Pro']['e3 Software Direct Mail']"], "mrt": ["Stimulsoft Report File", "Report file created by Stimulsoft Reports, a Windows report generator; contains the page layout information, data fields, and visual elements for the report; can be saved in many different formats, including Adobe .PDF, Microsoft Office (.DOCX, .XLSX, .PPTX), .HTML, and several raster and vector image formats.", "Windows, ", "['Stimulsoft Reports', 'Microsoft Visual Studio with Stimulsoft Reports plugin', 'Itelio Docusnap']"], "mpq": ["Blizzard Mo'PaQ File", "Game data format used by Blizzard Entertainment video games; contains level data, graphics, videos, and audio for a specific Blizzard game; can be compressed, encrypted, or segmented into multiple files.", "Windows, Mac, Linux, ", "['MPQ Editor', 'StormLib Library', 'SCMDraft', 'Addon Studio for World of Warcraft']['MPQ Extractor', 'StormLib Library', 'MPQKit']['StormLib Library', 'mpq-tools']"], "mpo": ["Multi Picture Object File", "Stereoscopic image captured by digital cameras such as the Fujifilm FinePix Real 3D series; contains two .JPG images side-by-side, which were captured by the two lenses on the digital camera; allows the two 2D images to be viewed as if they were a single 3D image when displayed on a supporting 3D device such as a 3D TV; can also be converted to an anaglyph image with a stereoscopic image processing program and then viewed with red/green 3D glasses.", "Windows, Mac, Web, ", "['StereoPhoto Maker', 'Stereomerger', 'STOIK Imaging Imagic', 'Adobe Photoshop CC 2017', 'S3D-Viewer', 'MPO Explorer', 'CyberLink PowerDVD 16', 'Microsoft Windows Photos']['Stereomerger', 'Adobe Photoshop CC 2017', 'MPO QuickLook Plugin', 'Stereo Master', 'XstereO Player']['Snapily 3D Camera Prints']"], "mppz": ["MagicPlot Project File", "Project file created by MagicPlot, an application used for scientific plotting and data processing; supports cross-platform use and contains data tables, plots, and formulas used for calculations; used for generating plots that are included in publications, presentations, and other papers.", "Windows, Mac, Linux, ", "['MagicPlot']['MagicPlot']['MagicPlot']"], "mpp": ["Microsoft Project File", "File created by Microsoft Project, a program for organizing, tracking, and maintaining projects; controls workloads, schedules, finances, etc; contains a timeline, a list of tasks, and other project information.", "Windows, Mac, Linux, Web, iOS, Android, Windows Phone, Windows, ", "['File Viewer Plus', 'Microsoft Project 2016', 'Seavus Project Viewer', 'Housatonic Project Viewer', 'KaDonk LiveProject Viewer', 'Stand By Soft RationalPlan', 'MOOS Project Viewer', 'OpenProj', 'Steelray Project Viewer']['Stand By Soft RationalPlan', 'MOOS Project Viewer', 'MPXJ', 'OpenProj', 'Steelray Project Viewer', 'Seavus Project Viewer', 'Housatonic Project Viewer 365']['Stand By Soft RationalPlan', 'MOOS Project Viewer', 'MPXJ', 'OpenProj', 'Steelray Project Viewer']['ProjectManager.com', 'AmiProject.com', 'Seavus Project Viewer', 'Housatonic Project Viewer 365']['Housatonic Project Viewer 365', 'Seavus SPViewer']['Housatonic Project Viewer 365']['Housatonic Project Viewer 365']['MobileFrame Desktop']"], "mpkt": ["MOPEKS Trial File", "File created by MOPEKS, a program that generates multiple programs run by its script to use each other to solve problems; contains trial data, which is referenced when the file is clicked and used to play trials; data examples include X and Y axis, angle, length, height, and speed coordinates.", "Windows, ", "['MOPEKS']"], "mpm": ["Max Payne Modfication File", "Compressed Max Payne game modification file created using the Remedy Archive System (RAS); used for modifying existing Max Payne levels or creating new custom levels; can be applied to the Max Payne application using the RASMaker program.", "Windows, ", "['Rockstar Games Max Payne']"], "mpkg": ["Meta Package File", "Macintosh installer package that contains all the necessary installation files in a single Mac OS X package.", "Mac, ", "[]"], "mpls": ["Blu-ray Movie Playlist File", "File stored on Blu-ray discs that contains a playlist for the movie; stored with the file name \"xxxxx.mpls,\" where \"xxxxx\" is a five-digit code corresponding to the playlist; located within the BDMV/PLAYLIST directory on a Blu-ray disc.", "Windows, Mac, Linux, ", "['Roxio Creator NXT Pro 5', 'CyberLink PowerDVD 16', 'VideoLAN VLC media player', 'JRiver Media Center']['Roxio Toast 15', 'VideoLAN VLC media player']['VideoLAN VLC media player']"], "mpl": ["AVCHD Playlist File", "Playlist created by AVCHD digital camcorders; contains an ordered list of references to recorded .MTS video files; used for video file navigation and playback; saved in the AVCHD\\BDMV\\PLAYLIST directory of the recording media.", "Windows, Mac, Windows, Mac, Linux, Android, ", "['Roxio Creator NXT Pro 5', 'CyberLink PowerDVD 16', 'CyberLink PowerDirector 15 Ultra', 'CyberLink PowerProducer 6']['Roxio Toast 15', 'Roxio Popcorn']['VideoLAN VLC media player', 'Media Player Classic', 'To SRT Converter', 'BS.Player', 'text editor']['VideoLAN VLC media player', 'text editor']['VideoLAN VLC media player', 'text editor']['J2 Interactive MX Player']"], "mpk": ["Project64 Memory Pack File", "Controller pak (MemPak) file for a Nintendo 64 emulator; stores data that can be loaded into the Project64 emulator, such as saved games or user settings; functions the same as a controller pak for the actual N64 console.", "Windows, Windows, ", "['Project64']['ESRI ArcGIS for Desktop']"], "mpga": ["MPEG-1 Layer 3 Audio File", "Compressed audio file encoded with MPEG-1 Layer 3 compression; compresses the audio using lossy compression that maintains most of the original sound quality.", "Windows, Mac, Linux, ", "['Apple iTunes', 'Microsoft Windows Media Player', 'RealNetworks RealPlayer Cloud', 'audio player']['Apple iTunes', 'RealNetworks RealPlayer Cloud', 'audio player']['audio player']"], "mpgindex": ["Adobe MPEG Index File", "Video cache created by several Adobe products, including Premiere Pro; stores MPEG video data that has been imported into the program; uses a proprietary format that helps the software generate previews more quickly.", "Windows, Mac, ", "['Adobe Premiere Pro CC 2017', 'Adobe After Effects CC 2017', 'Adobe Encore CS6']['Adobe Premiere Pro CC 2017', 'Adobe After Effects CC 2017', 'Adobe Encore CS6']"], "mph": ["Photostory Deluxe Project", "Project created by Photostory Deluxe, an application used to create presentations; contains one or more editable slideshows that consists of images, video, audio, transitions, effects, and titles.", "Windows, ", "['MAGIX Photostory 2016 Deluxe']"], "mpj": ["Minitab Project File", "Project file used by Minitab, a statistical analysis program used for business processes and quality management; contains all user work, including the data (.MTW files), session history, graphs, and reports; used to compile multiple analysis resources together into single a project.", "Windows, Windows, Mac, Windows, Mac, ", "[]['Adobe RoboHelp']['Adobe RoboHelp']['pmG messiahStudio']['pmG messiahStudio']"], "mpeg": ["MPEG Movie", "Popular video format standardized by the Moving Picture Experts Group (MPEG); compressed using MPEG-1 or MPEG-2 compression; often used for creating movies that are distributed over the Internet.", "Windows, Mac, iOS, Android, ", "['File Viewer Plus', 'Microsoft Windows Media Player', 'Apple QuickTime Player', 'Apple iTunes', 'Nullsoft Winamp', 'Roxio Creator NXT Pro 5', 'CyberLink PowerDirector 15 Ultra', 'CyberLink PowerDVD 16', 'Xilisoft Video Converter Ultimate', 'movie player']['Apple QuickTime Player', 'Apple iTunes', 'Roxio Toast 15', 'Roxio Popcorn', 'Eltima Elmedia Player', 'movie player']['PentaLoop PlayerXtreme Media Player']['antvplayer Media Converter']"], "mpg": ["MPEG Video File", "An MPG file is a common video file that uses a digital video format standardized by the Moving Picture Experts Group (MPEG).  MPG files are often used for creating movies that are distributed on the Internet and typically incorporates MPEG-1 or MPEG-2 audio and video compression.", "Windows, Mac, iOS, ", "['File Viewer Plus', 'Microsoft Windows Media Player', 'Apple iTunes', 'Nullsoft Winamp', 'CyberLink PowerDirector 15 Ultra', 'CyberLink PowerDVD 16', 'CyberLink PowerProducer 6', 'Xilisoft Video Converter Ultimate', 'movie player']['Apple QuickTime Player', 'Eltima Elmedia Player', 'Adobe Flash Professional CC', 'movie player']['olimsoft OPlayer']"], "mpdp": ["MixPad Project File", "Audio project created by MixPad, a multi-track music mixing application; saves multiple tracks, each of which that can have its own waveforms, edits, and effects; can be exported to .MP3, .WAV, .M4A, or various other audio formats when mixing is complete.", "Windows, ", "['NCH MixPad']"], "mpd": ["Microsoft Project Database", "Database file created by Microsoft Project, a program used for project management; contains project data stored in a Microsoft Access-compliant format; used to save and load an entire project in a relational records-based database format.", "Windows, Windows, ", "['Microsoft Project 2016'][]"], "mp7": ["Multisim 7 Project File", "Circuit design project created by Multisim version 7, a circuit design and analysis application; stores references to one or more PCB circuit designs, which are saved in .MS7 files; can also include simulation data, documents, and reports.", "Windows, ", "['National Instruments Multisim']"], "mpcpl": ["Media Player Classic Playlist", "Playlist of media files created with Media Player Classic (MPC), a popular media player for Windows; contains a list of media files that can be played back in sequence or in a random order; may include both video and audio files.", "Windows, ", "['Media Player Classic']"], "mpc": ["Musepack Compressed Audio File", "Audio file compressed with Musepack audio compression; based on MPEG-1 Layer-2 (.MP2) algorithms, but with several improvements; not as popular as .MP3 compression, but recognized as having higher-quality sound.", "Windows, Mac, Linux, ", "['File Viewer Plus', 'VideoLAN VLC media player', 'DeliPlayer', 'jetAudio', 'JRiver Media Center', 'Nullsoft Winamp with Musepack plug-in', 'Music Player Daemon']['VideoLAN VLC media player', 'Aqualung', 'Music Player Daemon']['Aqualung', 'Audacious', 'MPlayer', 'XMMS', 'VideoLAN VLC media player', 'Music Player Daemon']"], "mp4": ["MPEG-4 Video File", "An MP4 file is a multimedia file commonly used to store a movie or video clip, but may also contain subtitles or images.  MP4 is short for MPEG-4 Part 14, which is a container format based on the QuickTime File Format (QTFF) used by .MOV and .QT files.", "Windows, Mac, Linux, iOS, Android, ", "['File Viewer Plus', 'Microsoft Windows Video', 'Microsoft Windows Media Player', 'Nullsoft Winamp', 'Roxio Creator NXT Pro 5', 'Corel VideoStudio Pro X10 Ultimate', 'CyberLink PowerDVD 16', 'VideoLAN VLC media player', 'Wondershare Filmora 6', 'MPlayer', 'movie player']['Apple QuickTime Player', 'Apple iTunes', 'Roxio Toast 15', 'Eltima Elmedia Player', 'VideoLAN VLC media player', 'Wondershare Filmora 6', 'MPlayer', 'movie player']['VideoLAN VLC media player', 'MPlayer']['Apple Music', 'olimsoft OPlayer', 'PentaLoop PlayerXtreme Media Player', 'Google Drive']['BooKPia MP4 Video Player for Android', 'BIT LABS Simple MP4 Video Player', 'Google Drive', 'Videolabs VLC for Android']"], "mpa": ["MPEG-2 Audio File", "An MPA file is an audio file compressed with MPEG Layer II compression, which reduces the file size while minimally affecting the overall sound quality.  It is based on the MPEG-1 audio-coding standard and was later updated for the MPEG-2 specification.\r\n", "Windows, Mac, Linux, iOS, ", "['File Viewer Plus', 'Microsoft Windows Media Player', 'Apple QuickTime Player', 'Apple iTunes', 'RealNetworks RealPlayer Cloud', 'VideoLAN VLC media player']['Apple QuickTime Player', 'Apple iTunes', 'RealNetworks RealPlayer Cloud', 'VideoLAN VLC media player']['RealNetworks RealPlayer Cloud', 'VideoLAN VLC media player']['VideoLAN VLC for iOS 2']"], "mp3": ["MP3 Audio File", "An MP3 file is an audio file that uses a compressed audio format developed by the Moving Picture Experts Group that uses \"Layer 3\" audio compression.  It is commonly used to store music files and audiobooks on a hard drive and may provide near-CD quality sound (stereo, 16-bit) in a file roughly 1/10 the size of a .WAV or .AIF file.", "Windows, Mac, Linux, Web, iOS, Android, ", "['File Viewer Plus', 'Microsoft Windows Music', 'Microsoft Groove Music', 'Microsoft Windows Media Player', 'Apple iTunes', 'Nullsoft Winamp', 'Xilisoft Video Converter Ultimate', 'VideoLAN VLC media player', 'Roxio Creator NXT Pro 5', 'DVDVideoSoft Free Audio Converter', 'Adobe Audition CC 2017', 'music player']['Apple iTunes', 'VideoLAN VLC media player', 'Roxio Toast 15', 'Adobe Audition CC 2017', 'Eltima Elmedia Player', 'music player']['VideoLAN VLC media player', 'XMMS', 'Amarok']['Google Drive']['Apple Music', 'Microsoft Groove', 'olimsoft OPlayer', 'VideoLAN VLC for iOS 2']['File Viewer for Android', 'Microsoft Groove', 'antvplayer Media Converter']"], "mp2s": ["Max Payne 2 Saved Game", "Game saved in Max Payne 2, a first-person cinematic shooter; saves game progress so that the player can resume gameplay from the point in which the game was saved; typically named \"savegame000.mp2s,\" \"savegame001.mp2s,\" \"savegame002.mp2s,\" etc.", "Windows, ", "['Rockstar Games Max Payne 2']"], "mp2m": ["Max Payne 2 Mod File", "Game modification file for Max Payne 2, a third-person shooter; used for creating custom levels or modifying existing levels; can be extracted and imported into the Max Payne 2 video game using RASMaker 2.", "Windows, ", "['Rockstar Games Max Payne 2']"], "mp21": ["MPEG-21 Multimedia File", "Media storage format developed by the Moving Picture Experts Group (MPEG); based on a \"meta-box\" format that contains audio or video data referred to as the \"Digital Item;\" also includes metadata that describes the media.", "Windows, Mac, Windows, ", "['Apple QuickTime Player']['Apple QuickTime Player'][]"], "mp2": ["Heroes of Might and Magic II Map File", "Game map file used by Heroes of Might and Magic II (HOMM2), a turn-based strategy war game; stores map data used to create the gameplay environment; includes appearance information for grass, swamps, trees, ice, mountains, etc.", "Windows, Windows, Mac, Linux, ", "['Ubisoft Heroes of Might and Magic II']['File Viewer Plus', 'Apple iTunes', 'RealNetworks RealPlayer Cloud', 'Microsoft Windows Media Player', 'Nullsoft Winamp', 'VideoLAN VLC media player', 'Adobe Audition CC 2017']['Apple iTunes', 'RealNetworks RealPlayer Cloud', 'VideoLAN VLC media player', 'Adobe Audition CC 2017']['RealNetworks RealPlayer Cloud', 'VideoLAN VLC media player']"], "mp14": ["Multisim 14 Project", "An MP14 file is a project created by version 14 of Multisim, a program used to analyze, design, and simulate circuits.  It contains simulation results, reports, documents, and references to one or more circuit designs stored in .MS14 files.  MP14 files are used to organize MS14 designs in one project.  ", "Windows, ", "['National Instruments Multisim']"], "mp13": ["Multisim 13 Project", "An MP13 file is a project created by version 13 of Multisim, a program used to analyze, design, and simulate printed circuit board (PCB).  It contains references to one or more circuit designs stored in .MS13 files.  MP13 files also store simulation results, reports, and documents.  ", "Windows, ", "['National Instruments Multisim']"], "mp11": ["Multisim 11 Project File", "CAD project file created by Multisim, a circuit design, analysis, and simulation program; contains references to one or more circuit designs, which are stored in .MS11 files; may also contain simulation results, documents, and reports; used for organizing and managing multiple designs in a project.", "Windows, ", "['National Instruments Multisim']"], "mp": ["LaTeX MetaPost File", "File used by MetaPost, a graphics-drawing language used for creating pictures in Encapsulated PostScript (.EPS) files and LaTeX documents (.TEX and .LTX files); may contain basic drawing statements or more advanced instructions for algorithmic drawing.", "Windows, Mac, Linux, Windows, Mac, ", "['Texmaker', 'MetaPost Editor and Previewer', 'MetaGraf']['Texmaker', 'MetaPost Editor and Previewer']['Texmaker', 'MetaPost Editor and Previewer', 'MetaGraf'][][]"], "mox": ["ExtendSim Simulation Software Model", "Simulation model created with ExtendSim, a software program used to simulate real-life processes in a wide variety of fields; contains one or more simulations created by the user.", "Windows, Mac, Windows, ", "[][]['STAP studio Montax imposer']"], "mosaic": ["MacOSaiX Mosaic File", "Mosaic created with MacOSaiX, a program that generates mosaics in Mac OS X; contains the original image and images used for each mosaic tile; may be created from local images or images from the Web.", "Mac, ", "[]"], "mov": ["Apple QuickTime Movie", "A MOV file is a common multimedia container file format developed by Apple and compatible with both Macintosh and Windows platforms.  It may contain multiple tracks that store different types of media data and is often used for saving movies and other video files.  MOV files commonly use the MPEG-4 codec for compression.", "Windows, Mac, Linux, Web, iOS, Android, ", "['File Viewer Plus', 'Microsoft Windows Media Player', 'Roxio Creator NXT Pro 5', 'CyberLink PowerDVD 16', 'Xilisoft Video Converter Ultimate', 'VideoLAN VLC media player']['Apple QuickTime Player', 'Eltima Elmedia Player', 'Roxio Toast 15', 'Roxio Popcorn', 'VideoLAN VLC media player']['VideoLAN VLC media player']['Google Drive']['olimsoft OPlayer', 'VideoLAN VLC for iOS 2', 'Google Drive']['Google Drive', 'J2 Interactive MX Player']"], "mpf": ["Microsoft Media Package FIle", "Media file used by Microsoft Clip Organizer, a program that manages clip art images for Microsoft Office applications; contains .WMF files, clip art images, and keywords in a compressed package.", "Windows, Windows, Linux, ", "[][][]"], "mot": ["LightWave Motion File", "3D motion file created by LightWave, a professional graphics application used for rendering animated and still 3D images; saved in a plain text format and contains movement keyframes for an object or camera; used for saving animation coordinates.", "Windows, Mac, ", "['NewTek LightWave 3D']['NewTek LightWave 3D']"], "mos": ["Leaf Camera RAW File", "RAW image captured by several different types of digital cameras, such as the Leaf Aptus series and Mamiya cameras; stores a digital image in an uncompressed format; can be opened and edited using some image-editing applications.", "Windows, Mac, iOS, Android, ", "['File Viewer Plus', 'Adobe Photoshop CC 2017', 'Corel PaintShop Pro X9', 'Microsoft Windows Photos', 'ACD Systems ACDSee 20', 'Phase One Capture One', 'Adobe DNG Converter', 'Helicon Filter']['Adobe Photoshop CC 2017', 'Phase One Capture One', 'MacPhun ColorStrokes']['Adobe Photoshop Express']['File Viewer for Android', 'Adobe Photoshop Express']"], "montage": ["Montage Screenplay File", "Screenplay script created by Montage, a screenwriting application for Mac; contains the movie script as well as information for scenes, characters, and locations; also stores information for the screenplay publishing process, such as research, tasks, contacts, and queries.", "Mac, ", "['Mariner Montage']"], "money": ["Money Data File", "Data file created by Money, a personal finance tracking application; stores financial information for bank accounts, investments, credit cards, and other accounts; can include transactions manually entered by the user or downloaded from a financial institution.", "Mac, ", "['Jumsoft Money']"], "mom": ["Managed Object Model", "Data model created with Apple's Xcode development software; stores a Core Data model that is generated from a program's code; saved in an archived version of the NSManagedObjectModel format.", "Mac, ", "['Apple Xcode']"], "mol": ["MDL Molfile", "Molecular data file created in the MDL Molfile format, a chemical file format; contains plain text information and stores information about atoms and bonds; often used as a standard exchange format for molecular information.", "Windows, Mac, Linux, ", "['Avogadro']['Avogadro']['Avogadro']"], "moi": ["MOI Video File", "File created by digital camcorders to store information about a .MOD MPEG-2 video recording; contains data such as version, date, duration, codec, and bitrate; used by a range of video recorders, including the JVC Everio series, the Canon FS100, and some Panasonic camcorders.", "Windows, Mac, ", "['Pixela Capty MPEG Edit EX for Everio', 'iOrgsoft MOD Converter']['Pixela Capty MPEG Edit EX for Everio', 'iOrgsoft MOD Converter for Mac']"], "model": ["CATIA 3D Model FIle", "3D modeling format used by CATIA (Computer Aided Three Dimensional Interactive Application), a 3D CAD/CAM program; used for building molds, dies, composites, and other types of models.", "Windows, Linux, ", "['Dassault Systemes CATIA']['Dassault Systemes CATIA']"], "moho": ["Anime Studio Animation Project", "Animation project created by early versions of Anime Studio, a animation program used designed for creating anime movies; includes layers, objects, and a timeline; may also include styles and effects that can be applied to objects used in the video.", "Windows, Mac, ", "['Smith Micro Anime Studio Debut 11', 'Smith Micro Anime Studio Pro 11', 'Lost Marble Moho']['Smith Micro Anime Studio Debut 11', 'Smith Micro Anime Studio Pro 11']"], "module": ["Drupal Module File", "Module file used by Drupal, a content management system (CMS) for websites; contains source code written in PHP; used for adding functionality to the base Drupal installation, such as new page layouts, calendar popups, login forms, and developer tools.", "Windows, Mac, Linux, ", "['Drupal', 'text editor']['Drupal', 'text editor']['Drupal', 'text editor']"], "mof": ["Managed Object Format File", "File created in the Managed Object Format (MOF) that describes Common Information Model (CIM) classes; defines textual descriptions of classes that are used by a provider to return data; commonly used to change Windows Management Instrumentation (WMI) settings and to transfer them between computers.", "Windows, ", "['Microsoft Notepad', 'text editor']"], "modfem": ["Femap Model", "3D model file saved in the FEMAP format; used by Femap, a CAD engineering analysis program; stores geometry, materials, mesh, element properties, loads, and other model data. ", "Windows, ", "['Siemens PLM Software Femap']"], "mode": ["Coda Syntax Mode File", "Plugin file used by Coda, a Web development application for Mac; used by the Coda text editor and enables syntax highlighting and intelligent suggestions to be made while typing source code; allows third parties to enable new language support in Coda.", "Mac, ", "['Panic Coda 2']"], "mod": ["Amiga Music Module File", "Standard music module format recognized by most audio tracking programs; may be created by FastTracker, StarTrekker, Noise Tracker, or another MOD creation program.", "Windows, Mac, Linux, Windows, Mac, Linux, Windows, Mac, Linux, Linux, Windows, Mac, Linux, Windows, Mac, Windows, Mac, Linux, Windows, ", "['File Viewer Plus', 'Nullsoft Winamp', 'VideoLAN VLC media player', 'MODPlug Player', 'Impulse Tracker', 'MOD4Win', 'XMPlay', 'DeliPlayer', 'KMPlayer', 'Schism Tracker', 'MikMod']['CocoModX', 'PlayerPro', 'XimpleMOD', 'VideoLAN VLC media player', 'Schism Tracker', 'MikMod']['UModPlayer', 'Extended Module Player', 'VideoLAN VLC media player', 'Totem', 'uFMOD', 'XMMS', 'gxine', 'Schism Tracker', 'MikMod']['File Viewer Plus', 'Roxio Creator NXT Pro 5', 'CyberLink PowerDirector 15 Ultra', 'CyberLink PowerProducer 6', 'Nero 2017', 'Serif MoviePlus', 'iOrgsoft MOD Converter']['Pixela CAPTY MPEG EditEX']['Totem']['Absoft Pro Fortran']['Absoft Pro Fortran']['Absoft Pro Fortran']['GNU GRUB']['AMPL']['AMPL']['AMPL']['Graphisoft ArchiCAD']['Graphisoft ArchiCAD']['BioWare Neverwinter Nights']['BioWare Neverwinter Nights']['BioWare Neverwinter Nights']['Siemens PLM Software Femap']"], "mobileprovision": ["Xcode Mobile Provisioning Profile", "File used by Apple Xcode, a software development IDE often used for creating iPhone apps; contains a provisioning profile, which allows an app to be uploaded to a limited number of iPhones or iPads while it is still in development.", "Mac, ", "['Apple Xcode']"], "mobileconfig": ["Apple Mobile Configuration File", "Configuration file created for iPhone and iPod touch devices; contains device setup information, such as password policies, access permissions, and proxy connection information, as well as VPN, email, and calendar settings; commonly used for deploying and registering Apple device configurations within enterprise networks.", "Mac, ", "['Apple Configurator 2']"], "mobi": ["Mobipocket eBook", "A MOBI file is an eBook saved in the MOBI format, a format originally used by the Mobipocket Reader but now supported by several different readers.  It contains an eBook and may incorporate DRM copyright protection to prevent copying or unauthorized viewing.  MOBI files are supported by various eReaders, tablets, PDAs, and desktop computer applications.", "Windows, Mac, Linux, Android, ", "['Amazon Kindle for PC', 'Amazon Kindle Previewer', 'Calibre', 'Geometer Plus FBReader', 'BookDesigner', 'Cool Reader', 'MBP reader', 'Icecream Ebook Reader']['Amazon Kindle for Mac', 'Amazon Kindle Previewer', 'Calibre', 'Geometer Plus FBReader']['Calibre', 'Geometer Plus FBReader', 'Cool Reader', 'MBP reader']['Cool Reader']"], "mo3": ["MO3 Audio File", "Modular audio file format that is similar to other MOD formats, such as .MOD, .XM, and .S3M; however, MO3 files contain samples compressed with .MP3 or .OGG audio compression and also use a compressed file structure; allows higher-quality samples to be used while significantly reducing the file size.", "Windows, Mac, Linux, ", "['Media Player Classic']['XimpleMOD']['XMMS with BASSMOD plugin']"], "mo": ["Machine Object File", "Binary data file that contains object data referenced by a program; typically used to translate program code; may be loaded or imported into the GNU gettext program.", "Windows, Mac, Linux, ", "[][][]"], "mny": ["Microsoft Money File", "Financial data file created by Microsoft Money, a program for managing personal or business finances; may include multiple accounts, such as savings, checking, and investment accounts.", "Windows, Mac, ", "['Microsoft Money']['Intuit Quicken']"], "mnx": ["FoxPro Menu", "Custom FoxPro menu system created using the FoxPro Menu Designer", "Windows, ", "['Microsoft Visual FoxPro']"], "mnv": ["PlayStation Movie File", "Proprietary movie format used by the Sony PlayStation 3 (PS3) and the PlayStation Portable (PSP); may include copy protection that limits the systems the file can be played on may also include a start and expiration date that limits length of time in which the movie can be played (for online movie rentals).", "Windows, ", "[]"], "mnt": ["FoxPro Menu Memo", "Contains textual notes about a FoxPro menu (.MNX file)", "Windows, ", "['Microsoft Visual FoxPro']"], "mnr": ["AutoCAD Menu Resource File", "Image archive used by AutoCAD, a 2D and 3D design application; contains bitmap images that are displayed by user interface elements in AutoCAD; used for storing custom graphics that can be displayed in the AutoCAD workspace.", "Windows, ", "['Autodesk AutoCAD 2017']"], "mnu": ["AutoCAD Interface Layout File", "Interface layout definition file used by AutoCAD 2D and 3D CAD software as well as 3ds Max 3D modeling software; contains ASCII text definitions that specify the display properties of user interface elements; used for customizing the layout of the user workspace.", "Windows, Windows, Mac, Windows, Mac, ", "['Autodesk AutoCAD 2017', 'Autodesk 3ds Max 2017', 'Microsoft Notepad', 'Microsoft WordPad', 'text editor']['Adobe Photoshop CC 2017']['Adobe Photoshop CC 2017']['Microsoft Notepad', 'Microsoft WordPad', 'text editor']['Apple TextEdit', 'text editor']"], "mns": ["AutoCAD Interface Settings File", "User interface settings file used by AutoCAD, a 2D and 3D design and documentation tool; stores ASCII text properties that define how user interface elements are displayed; can be used for customizing the AutoCAD workspace layout.", "Windows, ", "['Autodesk AutoCAD 2017']"], "mno": ["Macromedia Design Note", "Text file that contains information about a Web document; saved in an XML format and has a main  tag that contains descriptive items within  tags; may be created by either Adobe Dreamweaver or Contribute.", "Windows, Mac, ", "['Adobe Dreamweaver CC 2017', 'Adobe Contribute 6.5']['Adobe Dreamweaver CC 2017', 'Adobe Contribute 6.5']"], "mnl": ["AutoCAD Menu LISP File", "User interface file used by AutoCAD, an engineering and architecting design program; contains expressions that manipulate the user interface elements; written in Autodesk's proprietary AutoLISP language, which is based on LISP.", "Windows, ", "['Autodesk AutoCAD 2017']"], "mng": ["Multiple Network Graphic", "An extension of the .PNG image format that uses indexed colors and supports image animations; similar to an animated .GIF file, but uses higher compression and features full alpha support (multi-level transparency).", "Windows, Mac, Linux, Android, Windows, Mac, ", "['ImageMagick', 'IrfanView', 'Mozilla Firefox', 'mngplay']['ImageMagick', 'Mozilla Firefox', 'mngplay']['ImageMagick', 'KSquirrel']['File Viewer for Android'][][]"], "mnk": ["My Notes Keeper Notebook", "Data file saved by My Notes Keeper, a Personal Information Management (PIM) program; stores notes, images, contact information, e-mail messages, URLs, and other information; includes a word processor with comprehensive text-formatting options.", "Windows, ", "[]"], "mnc": ["My Notes Center Notebook", "Notebook file used by My Notes Center, a personal information manager with advanced encryption options; stores notes and other information created with My Notes Center in a proprietary binary format.", "Windows, Windows, ", "[]['Autodesk AutoCAD 2017']"], "mmu": ["myPM Merge Data File", "File created by myPM Merge, an application used to generate Microsoft Word and Excel merged documents; contains a merge definition, which specifies an input file, merge settings, and an output file; used for storing reusable merge settings.", "Windows, ", "[]"], "mmw": ["Microsoft Clip Organizer Media Catalog File", "Clip art database used by Microsoft Clip Organizer, the clip art program included with Microsoft Office; used for loading clip art image that can be inserted into Office presentations and documents.", "Windows, Windows, ", "['Microsoft Office 2016']['MechCAD AceMoney']"], "mmo": ["Memory Map Overlay File", "Map overlay created with Memory-Map software; used for creating routes, marking GPS points, and plotting real-time location information on a map; can be placed on top of an actual map or chart and navigated using GPS technology.", "Windows, ", "[]"], "mmp": ["MixMeister Playlist", "Playlist of songs for MixMeister DJ mixing software; contains references to the songs, but not the actual songs themselves", "Windows, Windows, Windows, Windows, Mac, Windows, Mac, Linux, ", "[][][]['Mindjet']['Mindjet']['LMMS']['LMMS']['LMMS']"], "mmm": ["Music Maker Arrangement File", "File created by Music Maker, a music composition program; contains a multitrack arrangement comprised of music clips, transitions, and effects; can combine multiple imported audio formats into a single music composition.", "Windows, Windows, Windows, Windows, ", "['MAGIX Music Maker 2016']['Microsoft Windows Font Viewer']['Moneysoft Money Manager']['MiraMon', 'MiraMon Universal Map Reader']"], "mmpz": ["LMMS Project File", "Project created by LMMS (Linux MultiMedia Studio), an application that enables you to create and mix audio; contains LMMS project data such as sound effects, instrument settings, tempo, pitch, added .XPF preset files, volume, and controllers; exported as .WAV and .OGG audio files.", "Windows, Mac, Linux, ", "['LMMS']['LMMS']['LMMS']"], "mmlp": ["Music Macro Language Project", "Project created and used by Macrotune, a Music Macro Language (MML) editor; saves all of the data and settings associated with a project, which includes the author, copyright, notes, and song title; can be exported as a .WAV file.", "Windows, Mac, ", "['PoseMotion Macrotune']['PoseMotion Macrotune']"], "mml": ["FrameMaker Maker Markup Language File", "File created using the Adobe Maker Markup Language (MML); used by Adobe FrameMaker, a program used to produce and publish large structured documents; contains formatting instructions for page layout, graphics, text, and other page properties.", "Windows, Mac, Windows, Windows, ", "['Adobe FrameMaker']['Adobe FrameMaker']['Microsoft Office 2016']['Avanquest MyMailList & AddressBook']"], "mmip": ["MediaMonkey Installation Package", "Add-on used by MediaMonkey, a program used for organizing and playing music; saved in a compressed .ZIP format; adds new functionality to the software and can be installed by double-clicking the file; often used for skins.", "Windows, ", "['Ventis Media MediaMonkey 4']"], "mmf": ["Meal-Master Recipe File", "Recipe saved in the Meal-Master format, a standard recipe format supported by several different recipe programs; stores recipe ingredients and related information in a plain text format.", "Windows, Mac, Windows, Windows, Mac, ", "['Cookbook Wizard']['Mariner MacGourmet Deluxe']['Microsoft Exchange Server', 'Microsoft Outlook 2016']['Yamaha MidRadio Player']['Yamaha MidRadio Player']"], "mme": ["Multi-Purpose Internet Mail", "Message or file encoded so it can safely be sent over the Internet; commonly used for e-mail attachments so that the attached file does not get corrupted during the transfer.", "Windows, Mac, ", "['Smith Micro StuffIt Deluxe for Windows', 'Corel WinZip 21']['Microsoft Outlook 2016', 'Smith Micro StuffIt Deluxe 16']"], "mmc": ["Microsoft Media Catalog", "Contains a collection of images (such as a clipart gallery) or other media in an organized format; typically saved in the \\Application Data\\Microsoft\\Media Catalog directory.", "Windows, ", "[]"], "mmat": ["MindManager Map Template", "Diagram template created by Mindjet MindManager, a mind mapping application; contains a template of a \"mind map,\" which can be used as the basis for creating multiple .MMAP files; may be included with the software or created by the user.", "Windows, Mac, ", "['Mindjet']['Mindjet']"], "mmap": ["MindManager Map File", "Diagram created by Mindjet MindManager, a visual diagramming application; contains a \"mind map,\" which is comprised of objects, connecting lines, text, and other symbols; used for storing captured ideas during the brainstorming and planning processes.", "Windows, Mac, Linux, iOS, ", "['Mindjet', 'Seavus iMindQ', 'CS Odessa ConceptDraw MINDMAP', 'XMind', 'MatchWare MindView']['Mindjet', 'Seavus iMindQ', 'CS Odessa ConceptDraw MINDMAP', 'XMind']['XMind']['MindJet Tasks', 'Seavus iMindQ']"], "mm": ["FreeMind Mind Map", "An MM file is a visual diagram created by FreeMind, a mind-mapping application written in Java.  It contains a diagram which consists of text, nodes, branches, shapes, and icons that represent ideas.  MM files may be used for brainstorming, researching topics, tracking projects, note-taking, etc.", "Windows, Mac, Linux, Web, iOS, Android, Windows, Mac, Linux, Web, Mac, ", "['FreeMind', 'Seavus iMindQ', 'MindGenius', 'XMind']['FreeMind', 'Seavus iMindQ', 'XMind']['FreeMind', 'XMind']['Seavus iMindQ']['Seavus iMindQ']['Seavus iMindQ']['Technology Management Assoicates NeXtMidas']['Technology Management Assoicates NeXtMidas']['Technology Management Assoicates NeXtMidas']['Technology Management Assoicates NeXtMidas']['Apple Xcode']"], "mls": ["Milestones Simplicity File", "Schedule created with Milestones Simplicity, a software program that creates presentation-ready schedules; used for planning projects and managing deadlines; contains custom-designed calendars that may include text, icons, and other images.", "Windows, Windows, ", "[][]"], "mlc": ["Microsoft Language Interface Pack", "Language interface pack (LIP) file used by the Windows operating system; contains translation information that allows a user interface to be presented in a particular language; used for localizing Windows operating system installations.", "Windows, Windows, ", "['Microsoft Windows']['Mobatek MobaLiveCD']"], "mlm": ["MolMeccano File", "Molecular model format used by Abalone and Ascalaph, molecular modeling programs; stores a molecular model along with fragments used for chain molecule construction and torsion angles used for conformational prototypes; may also contain comments and a description of the format if the \"With comments\" option is checked when saving the file.", "Windows, ", "['Agile Molecule Abalone', 'Agile Molecule Ascalaph']"], "mk3d": ["Matroska 3D Video File", "Stereoscopic 3D video file created in the Matroska 3D (MK3D) format, which is used for storing 3D content; uses the standard .MKV container but includes a StereoMode field for the specific format of the enclosed 3D video (e.g., side by side (left eye is first), top-bottom (right eye is first), etc.).", "Windows, ", "['CyberLink PowerDVD 16']"], "mlk": ["MasterCook Look File", "Stores the recipe View settings for a Mastercook cookbook; will be automatically generated by the program if removed or deleted; often saved in combination with a .LOP file, which stores the cookbook layout settings.", "Windows, Mac, ", "['ValuSoft MasterCook']['ValuSoft MasterCook']"], "mlb": ["MyLabel Designer Deluxe Project File", "Label design project file created by MyLabel Designer Deluxe, a program used for design label page layouts and printing them; can include graphics, text, and template fields that are filled by a corresponding data table, which is in spreadsheet format.", "Windows, Mac, ", "['Avanquest MyLabel Designer Deluxe'][]"], "mka": ["Matroska Audio File", "Audio container format that supports several types of audio compression algorithms; related to the .MKV video format, but only contains audio data.", "Windows, Mac, Linux, Android, ", "['File Viewer Plus', 'MPlayer', 'Media Player Classic', 'Arpa Kolla Player', 'DVDVideoSoft Free Audio Converter', 'BS.Player', 'VideoLAN VLC media player']['MPlayer', 'VideoLAN VLC media player']['MPlayer', 'VideoLAN VLC media player']['File Viewer for Android']"], "ml": ["ML Source Code File", "Text file written in ML, a functional programming language; may be written using Standard ML (SML) or one of several varieties in the ML family, including as Caml, Objective Caml (OCaml), JoCaml, Extended ML, and MacroML; often used in language design for developing compilers or other source code interpreters; also used in academic environments for proving theories.", "Windows, Mac, Linux, ", "['File Viewer Plus', 'Caml', 'OCaml', 'Microsoft Visual Studio 2017', 'Notepad++', 'gVim']['Caml', 'OCaml', 'MacroMates TextMate']['Caml', 'OCaml', 'GNU Emacs', 'Vim']"], "mkv": ["Matroska Video File", "An MKV file is a video container format similar to the .AVI, .ASF, and .MOV formats.  It supports several types of audio and video codecs and may include .SRT, .SSA, or .USF (Universal Subtitle Format) subtitles.  MKV files also support VobSub subtitles from DVDs.", "Windows, Mac, Linux, iOS, Android, ", "['File Viewer Plus', 'CyberLink PowerDVD 16', 'Nero 2017', 'DivX 7 for Windows', 'Media Player Classic', 'VideoLAN VLC media player', 'BS.Player', 'KMPlayer', 'MPlayer', 'Wondershare Video Converter Pro 8']['Roxio Popcorn', 'Eltima Elmedia Player', 'ShedWorx Smart Converter', 'DivX 7 for Mac', 'MPlayer', 'VideoLAN VLC media player']['VideoLAN VLC media player', 'MPlayer']['olimsoft OPlayer', 'VideoLAN VLC for iOS 2', 'Pentaloop PlayerXtreme Media Player']['BIT LABS Simple MP4 Video Player', 'Videolabs VLC for Android']"], "mjk": ["Question File", "File created by Nosza légy má Te is MILIJOMOS, a Hungarian program based on the \"Who Wants to be a Millionaire?\" game show; contains questions asked during the game; organized by level of difficulty, based on how much money is at stake, and picked randomly by the program; its text format enables easy editing and addition of other questions using the \"NLMTIM Editor.\"", "Windows, ", "['KónyiSoft Nosza légy má Te is MILIJOMOS', 'KónyiSoft NLMTIM Editor']"], "mjp": ["MJPEG Video File", "Motion JPEG video format that stores video frames using .JPG compression; used by LG cell phones to capture and store video; saved in a proprietary format that is not supported my most video playback programs.", "Windows, Mac, ", "[]['MPlayerX', 'Apple QuickTime Player with the Motion JPEG Codec']"], "mjdoc": ["MacJournal Document", "Document created by MacJournal, a program used for journaling and blogging; stores a collection of journal entries, including each entry's title, date, and written text; may also include images and audio and video content, as well as each entry's rating, status, and priority.", "Mac, ", "['Mariner MacJournal']"], "mjd": ["Adobe Acrobat MIME Encoded Job Definition File", "Package file created by Adobe Acrobat, a PDF editing and publishing program; contains a MIME-encoded archive of PDF documents and a .JDF job ticket file; used for transferring document publishing workflow packages over FTP and email.", "Windows, Mac, ", "['Adobe Acrobat DC']['Adobe Acrobat DC']"], "mk": ["Makefile", "Makefile used by software compilers and linkers for building program executable from source files; may be a full Makefile or may contain additional rules referenced by a Makefile.", "Windows, Mac, Linux, ", "['Microsoft Visual Studio 2017', 'GNU Make']['GNU Make']['GNU Make']"], "mj2": ["Motion JPEG 2000 Video Clip", "Video format defined as Motion JPEG 2000 (Part 3); contains a motion sequence of JPEG 2000 images; does not involve inter-frame coding, but instead encodes each frame independently using JPEG 2000 compression.", "Windows, Mac, Linux, ", "['Adobe Premiere Pro with Main Concept plugin']['Adobe Premiere Pro with Main Concept plugin'][]"], "mix": ["Command & Conquer Data File", "Game data file used by the Command & Conquer (C&C) real-time strategy games; may contain game scenarios, movies, music, and sounds; examples of MIX files installed with C&C games include \"conquer.mix,\" \"local.mix,\" \"movies.mix,\" and \"music.mix.\"", "Windows, Windows, Windows, Windows, ", "[]['Autodesk 3ds Max 2017']['Milestone MotoGP']['Microsoft Picture It!']"], "mission": ["Vega Strike Mission File", "File used by Vega Strike, a free space simulator game where players trade, battle, and explore in outer space; contains a mission, which may include the starting position, objectives, and references to resource files, such as game scripts.", "Windows, Mac, Linux, Windows, ", "['Microsoft Notepad', 'gVim', 'text editor']['Apple TextEdit', 'text editor']['Vim']['Immersive Education Mission Maker']"], "mis": ["Marble Blast Gold Mission File", "Contains level data for a Marble Blast Gold mission; may be included with the game or a custom level created by a user; saved in a text format that can be opened and edited with a text editor.", "Windows, Mac, Linux, Windows, Mac, ", "[][][][][]"], "mio": ["MioEngine Application File", "Application file built by MioFactory, software package used to develop applications for the free MioEngine platform; stores all application files in a single archive that can run independently in MioEngine; commonly used to build widgets, screen savers, and other Windows applications.", "Windows, ", "[]"], "minigsf": ["Game Boy Advance Song File", "Audio file from a Game Boy Advance (GBA) game; often loaded along with a corresponding .GSFLIB file, which contains a list of songs from the corresponding GBA game; formatted similarly to a .MIDI file. ", "Windows, Mac, ", "['Nullsoft Winamp with Highly Advanced plugin']['Audio Overload']"], "miniusf": ["Nintendo 64 Song File", "Music file from a Nintendo 64 game; formatted similarly to a .MIDI file; often loaded along with a corresponding .USFLIB file, which contains a list of songs from a specific N64 game; can be ripped from a N64 ROM and played back on a computer using a supporting audio player.", "Windows, ", "['Nullsoft Winamp with 64th Note plugin']"], "mint": ["Linux Mint Installer File", "Installation package for Linux Mint, a Linux distribution with an elegant, modern, and easy-to-use interface; contains compressed files that are extracted and installed by the mintInstall installer program.", "Linux, ", "[]"], "miniso": ["Mini Image Destination File", "Image file format used by DVDFab Blu-ray Copy, a program that enables users to copy Blu-ray content to a Blu-ray, DVD, and AVCHD disc; similar to an .ISO file but much smaller in size.", "Windows, Mac, ", "['DVDFab Blu-ray Copy', 'Lightning UK! ImgBurn']['DVDFab Blu-ray Copy']"], "mindnode": ["MindNode Document", "Mind map document created by MindNode, a conceptual diagramming application; saves a network of nodes represented using a hierarchy of parent, child, and sibling relationships; enables users to conceptualize ideas on an open-ended canvas.", "Mac, ", "['MindNode Pro']"], "minesweepersave-ms": ["Minesweeper Saved Game", "Saved game file created by Minesweeper, a classic puzzle game included with Microsoft Windows; stores the state of the minesweeper map, including revealed blocks, flagged blocks, and the elapsed time; used for restoring the last opened game state when the program was closed.", "Windows, ", "['Microsoft Minesweeper']"], "mime": ["Multi-Purpose Internet Mail Extension", "Encoded file used by email programs; contains 8-bit encoded data, including characters other than the US ASCII character set; used to support file attachments and a richer character set instead of standard 7-bit messages that are normally sent over email.", "Windows, Mac, Linux, ", "['Smith Micro StuffIt Deluxe for Windows', 'Corel WinZip 21', 'Microsoft Outlook 2016', 'Microsoft Outlook Express', 'Mozilla Thunderbird']['Smith Micro StuffIt Deluxe 16', 'Microsoft Outlook 2016', 'Apple Mail', 'Mozilla Thunderbird']['KMail']"], "mim": ["Multi-Purpose Internet Mail Message File", "An MIM file is an encoded file used by email programs that contains 8-bit data or other characters besides the US ASCII character set.  It is used to support 8-bit content, such as file attachments, instead of standard 7-bit messages that are normally sent over email.  MIM files typically includes the MIME version, the content type, and the encoding method.", "Windows, Mac, Linux, ", "['Smith Micro StuffIt Deluxe for Windows', 'Corel WinZip 21', 'Microsoft Outlook 2016', 'Microsoft Outlook Express', 'Mozilla Thunderbird']['Smith Micro StuffIt Deluxe 16', 'Microsoft Outlook 2016', 'Apple Mail', 'Mozilla Thunderbird']['KMail']"], "mid": ["MIDI File", "A MID file is a standard MIDI (Musical Instrument Digital Interface) file used by music authoring and mixing programs as well as MIDI hardware devices.  It contains music data, such as what notes are played, when they are played, how long each note is held, and how loud each note is played.", "Windows, Mac, Linux, Android, Windows, Linux, ", "['Microsoft Windows Media Player', 'Nullsoft Winamp', 'NoteWorthy Composer', 'TiMidity++', 'MakeMusic Finale']['Apple QuickTime Player', 'Apple Logic Pro X', 'TiMidity++', 'MakeMusic Finale']['TiMidity++', 'KMid']['File Viewer for Android']['Pitney Bowes MapInfo', 'GDAL']['GDAL']"], "midi": ["MIDI File", "Standard MIDI (Musical Instrument Digital Interface) file used by MIDI hardware devices as well as music authoring and playback programs; contains music data, such as what notes are played, when they are played, how long each note is held, and the velocity of each note.", "Windows, Mac, Linux, Android, ", "['Apple QuickTime Player', 'Microsoft Windows Media Player', 'Nullsoft Winamp', 'NoteWorthy Composer', 'Synthesia', 'TiMidity++', 'WildMidi', 'Amarok']['Apple QuickTime Player', 'Apple Logic Pro X', 'Synthesia', 'TiMidity++']['TiMidity++', 'WildMidi', 'Amarok']['File Viewer for Android']"], "miff": ["Magick Image File", "Image format used by ImageMagick, a program used to view, edit, and convert image formats; stores one or more bitmap images, along with any metadata, such as the author, copyright, image color profiles, and comments.", "Windows, Mac, Linux, ", "['File Viewer Plus', 'ImageMagick']['ImageMagick']['ImageMagick']"], "mii": ["Wii Virtual Avatar File", "Virtual avatar used by the Nintendo Wii gaming console system; stores properties for the avatar, such as the gender, hair color, skin color, facial features, and eye type; used to store customized characters that are controlled and animated during Wii gameplay.", "Windows, Mac, Linux, ", "['My Avatar Editor', 'Wii M!! Editor']['My Avatar Editor']['My Avatar Editor']"], "mif": ["MapInfo Interchange Format File", "File format used by MapInfo mapping and geographic analysis software; saves a map visualization in a format that can be recognized by third party applications; used as an exchange format between GIS applications.", "Windows, Linux, Windows, Windows, ", "['Pitney Bowes MapInfo', 'Golden Software Surfer', 'Golden Software Didger', 'GDAL']['GDAL']['Microsoft System Center Configuration Manager']['Adobe FrameMaker']"], "milk": ["MilkDrop Winamp Plugin Preset", "Stores presets for the MilkDrop visualization plugin for Winamp; uses the computer's graphics card to create 3D visualizations while music is playing; animations are based on the beats and frequencies of the sound.", "Windows, ", "['Nullsoft Winamp with the MilkDrop plugin']"], "mi4": ["Audio Player Firmware File", "Firmware file used by various audio players that have the PortalPlayer chipset, including SanDisk, Philips, Samsung, and older iPod players; contains low-level software functions and themes that are used to run the audio player.", "Windows, Mac, Linux, ", "['Rockbox Utility']['Rockbox Utility']['Rockbox Utility']"], "mgx": ["Rise of Nations Saved Game", "Game saved in Rise of Nations, a real-time strategy game developed by Big Huge Games and published by Microsoft; saves game progress and can be opened within the program.", "Windows, Mac, Windows, ", "[][][]"], "mgs": ["MGCSoft Vector Shapes File", "Vector graphics file created by MGCSoft Equation Illustrator, a program used to create technical drawings and format mathematical equations; contains vector-based shapes that can be added to a drawing; used for storing reusable graphics.", "Windows, ", "['MGCSoft Equation Illustrator']"], "mhtml": ["MIME HTML File", "Web page archive format saved from a .HTML file and encoded with .MIME encoding; includes resources linked from the Web page, such as images, Flash animations, Java applets, audio files, etc; can be opened and viewed without being online.", "Windows, Mac, Linux, iOS, Android, Windows Phone, ", "['Microsoft Internet Explorer', 'Mozilla Firefox with the Mozilla Archive Format extension', 'Microsoft Word 2016', 'Kingsoft Writer', 'WizBrother WizHtmlEditor', 'Terra Informatics BlockNote.Net', 'Opera', 'Google Chrome']['Mozilla Firefox with the Mozilla Archive Format extension', 'Microsoft Word 2016', 'Opera', 'Google Chrome']['Opera', 'Google Chrome']['Opera', 'UCWeb UC Browser']['Opera', 'UCWeb UC Browser']['UCWeb UC Browser']"], "mht": ["MHTML Web Archive", "Web page archive saved with Internet Explorer; formatted using MIME HTML or \"MHTML,\" which saves HTML, images and other media files into a single file; encoded with .MIME encoding.", "Windows, Mac, Linux, ", "['Microsoft Internet Explorer', 'Google Chrome', 'Mozilla Firefox with the Mozilla Archive Format extension', 'Microsoft Word 2016', 'Kingsoft Writer', 'WizBrother WizHtmlEditor', 'Terra Informatics BlockNote.Net', 'Opera']['Google Chrome', 'Microsoft Word 2016', 'Opera']['Google Chrome', 'Opera']"], "mgt": ["Musicnotes Guitar Guru Song File", "Song file used by Guitar Guru, an application used to teach users how to play the guitar; contains a guitar tablature, song audio data, and fingerboard information; used for displaying a simulation of the guitar performance; also used for storing downloaded songs from Musicnotes.com.", "Windows, Mac, ", "['Musicnotes Guitar Guru']['Musicnotes Guitar Guru']"], "mhs": ["Xilinx XPS Hardware Specification File", "Microprocessor Hardware Specification (MHS) file used by Xilinx Platform Studio (XPS), an application used for designing embedded processor systems; describes the hardware component and includes information such as the bus architecture and processor type.", "Windows, ", "['Xilinx Platform Studio']"], "mgv": ["Yamaha MegaVoice File", "Voice or instrument used by the Yamaha Tyros and high-end PSR keyboards; saved in the \"MegaVoice\" format, which captures the subtle nuances of an instrument to creates realistic and expressive sounds.", "Windows, Mac, Windows, ", "[][][]"], "mgourmet4": ["MacGourmet Deluxe 4 Document", "Document created by MacGourmet Deluxe, a recipe and cookbook organizing program; similar to the .MGOURMET3 file; contains a recipe, cooking note, shopping list, wine note, beer note, cheese note, or reference.", "Mac, ", "['Mariner MacGourmet Deluxe']"], "mgmf": ["MindGenius Map File", "Mind map file created by versions 2-3 of MindGenius, a conceptual diagramming application; saves a diagram such as a flowchart, brainstorming map, or a strategy plan; used for business documentation and presentation materials.", "Windows, ", "['MindGenius']"], "mgourmet": ["MacGourmet Deluxe Document", "File created by MacGourmet Deluxe, a recipe and cookbook management program; contains a collection of recipes exported by the user; allows cookbooks to be saved and shared with other users.", "Mac, ", "['Mariner MacGourmet Deluxe']"], "mgo": ["MacGourmet Recipe File", "Recipe file created by MacGourmet, a program used to organize personal cookbook recipes; stores recipe information in an XML format, such as ingredients, cooking instructions, and an image of the finished recipe; used for exporting individual recipes from a cookbook and sharing with others.", "Mac, ", "['Mariner MacGourmet Deluxe']"], "mgmx": ["MindGenius XML Map File", "Mind map created by MindGenius business diagramming software; saves a diagram such as a brainstorming chart, project plan, or a flowchart; used for storing presentation materials as well as for creating business documentation; can be exported to a variety of document formats, including PowerPoint (.PPTX), Visio (.VSD), and .PDF formats.", "Windows, ", "['MindGenius']"], "mgl": ["Age of Empires 2 Replay File", "Recording of a game from Age of Empires II: The Age of Kings, a real-time strategy game developed by Microsoft; saves a complete recording of a campaign played by the user; can be played back in the Age of Empires II program.", "Windows, ", "[]"], "mgk": ["ImageMagick Configuration File", "Configuration file used by ImageMagick, a free library used for creating and editing bitmap images; saved in an XML format and specifies settings for image formats, colors, modules, logging, and other components used by the software.", "Windows, Mac, Linux, ", "['ImageMagick']['ImageMagick']['ImageMagick']"], "mgdatabase": ["MacGourmet Deluxe Database File", "Cookbook database file created by MacGourmet Deluxe, a program used to store and organize cooking recipes; contains a recipe collection, including each recipe's ingredients, cooking or baking instructions, food category, and information source; may also store an image of the completed recipe.", "Mac, ", "['Mariner MacGourmet Deluxe']"], "mgcb": ["Equation Illustrator Project File", "Technical illustration created by Equation Illustrator, a program used to draw equations and diagrams; contains text, symbols, and vector graphics; commonly used for mathematical formulas or equations, as well as some technical diagrams.", "Windows, ", "['MGCSoft Equation Illustrator']"], "mfw": ["Mamiya Camera Raw File", "Raw image format used by Mamiya digital cameras; similar to the .MEF file extension; contains image data in an uncompressed format that appears the same way as it was captured by the camera's sensor; photo settings such as brightness and exposure can be altered by editing software after the image is imported into the computer.", "Windows, Mac, Windows, ", "['Adobe Photoshop CC 2017']['Adobe Photoshop CC 2017']['MobileFrame Desktop']"], "mfv": ["MobileFrame Device Pack File", "File used by MobileFrame Desktop, an administration tool for the MobileFrame mobile application environment; contains additional drivers used for integrating the MobileFrame system with specific hardware components provided by a hardware vendor.", "Windows, ", "['MobileFrame Desktop']"], "mga": ["Manga Document", "Document used by Manga Reader, a program used to read Manga comic books and print cartoons; stores a compressed archive of the document pages, including pagination data, text, and graphics; used for distributing manga electronically.", "Windows, ", "['Manga Reader', 'Manga Creator']"], "mfx": ["Multimedia Fusion Extension", "Extension for Multimedia Fusion 2 (MMF2), a visual game development program from Clickteam; adds extra features, objects, characters, or other resources to the program.", "Windows, ", "['Clickteam Multimedia Fusion', 'Clickteam The Games Factory']"], "mfu": ["MobileFrame Update File", "File used by MobileFrame Desktop, an administration application for MobileFrame mobile application deployments; contains the information required to update all components of the MobileFrame system to a newer version of the software.", "Windows, ", "['MobileFrame Desktop']"], "mfp": ["MediaFACE Project File", "Custom disc or case label created with with MediaFACE label design software; typically created from a template (.MFT) file and formatted for a a specific label printing sheet; may include both images and text.", "Windows, Windows, Windows, ", "['NEATO MediaFACE']['MobileFrame Desktop']['Macromedia FlashPaper']"], "mft": ["Kaspersky File Table", "XML data file used by Kaspersky Anti-Virus and Internet Security computer protection applications; contains references to files used for scanning and detecting viruses; often contains references to .KDC and .STT files.", "Windows, Mac, Windows, ", "['Kaspersky Internet Security 2017', 'Kaspersky Anti-Virus 2017']['Kaspersky Internet Security for Mac']['NEATO MediaFACE']"], "mfo": ["Perl ModInfo Descriptor File", "XML file containing metadata about one or more objects within a Perl module; created by running a Perl module through the modinfo2xml.pl processor; used by ModInfo, a Perl interface definition system.", "Windows, Mac, Linux, Windows, Mac, Windows, ", "['Perl']['Perl']['Perl'][][]['MobileFrame Desktop']"], "mfe": ["MobileFrame Enterprise Data File", "File used by MobileFrame Desktop, a administration tool for the MobileFrame mobile application environment; contains all data and dependencies for a single record in the MobileFrame system; used for packaging records into standalone packages.", "Windows, ", "['MobileFrame Desktop']"], "mfl": ["Mozilla FastLoad File", "Data file created by Mozilla products such as Thunderbird and Firefox; contains cached data for the XUL (XML User Interface Language) interface elements or the XPC components of the software; enables the program to load user interface components more quickly.", "Windows, Mac, Linux, Windows, Mac, ", "['Mozilla Firefox', 'Mozilla Thunderbird']['Mozilla Firefox', 'Mozilla Thunderbird']['Mozilla Firefox', 'Mozilla Thunderbird']['Verity Software House ModFit LT']['Verity Software House ModFit LT']"], "mfil": ["Blizzard Software Update File", "File used by Blizzard games such as World of Warcraft and Diablo III; saved in a plain text format and contains information used for updating and patching the game software; references URLs for downloads and game updates.", "Windows, ", "['Blizzard World of Warcraft', 'Blizzard Diablo 3']"], "mfa": ["Multimedia Fusion Development File", "Development file used by Multimedia Fusion and The Games Factory; contains source code generated by the development software; used for creating games and multimedia applications.", "Windows, Windows, ", "['Clickteam Multimedia Fusion', 'Clickteam The Games Factory']['MobileFrame Desktop']"], "mf": ["Gameplay Multifile", "Multi-packaged file used by Panda3D programs, Panda3D is a free 3D game engine used to render and develop games; MF files contain gameplay data such as sound effects, texture, and models.", "Windows, Mac, Linux, Windows, Mac, Linux, Windows, Mac, ", "['Panda3D']['Panda3D']['Panda3D']['text editor']['text editor']['text editor']['MikTeX', 'TeXworks']['TeXworks']"], "mex": ["Macro Express File", "Macro created with Macro Express, a macro creation tool for Windows; includes scripts and commands that can be used to automate common tasks within the Windows operating system and various programs.", "Windows, ", "[]"], "met": ["eMule Resource File", "File used by eMule, a peer-to-peer online file sharing program; contains links to download resources and their servers; may store ed2k (eDonkey Network) server addresses, filenames, file sizes, hash sets, and statistics.", "Windows, Mac, Linux, Windows, Mac, Linux, ", "['eMule', 'eMule Xtreme', 'aMule']['aMule']['aMule']['CorelDRAW Graphics Suite X8', 'ACD Systems Canvas X 2017', 'Apache OpenOffice']['Apache OpenOffice', 'Planamesa NeoOffice']['Apache OpenOffice']"], "merlin2": ["Merlin Project File", "Project schedule created by Merlin, a project management application for Mac OS X; saves project resource, task, and schedule data; used for saving and loading project schedules; can be shared over a network natively in the software.", "Mac, ", "['ProjectWizards Merlin']"], "menu": ["Quake 3 Engine Menu File", "Menu file used by id Tech 3 (Quake III engine) games; specifies the layout and properties for the game menus and the HUD (Head-Up Display) interface; saved in a plain-text format; commonly stored within .PK3 game packages.", "Windows, Mac, Linux, ", "['id Software Quake 3', 'Microsoft Notepad', 'Microsoft WordPad', 'text editor']['id Software Quake 3', 'Apple TextEdit', 'text editor']['id Software Quake 3', 'GNU Emacs', 'text editor']"], "mer": ["RSView Development Runtime File", "Runtime file created from an RSView development (.MED) file; contains program data that has been compiled and saved in an executable format; used for HMI (Human Machine Interface) applications.", "Windows, ", "[]"], "meo": ["MEO Encrypted Archive", "Encrypted archive created by MEO, a program used for protecting sensitive data before transmitting it; uses encryption, password protection, and may contain both files and folders; may only be extracted using MEO.", "Windows, Mac, ", "['NCH MEO']['NCH MEO']"], "menc": ["Windows Mobile Encrypted File", "Encrypted file created by Windows mobile devices; typically found on removable media cards; contains an encrypted version of the original file and additional header information; enables secure file storage on external storage cards.", "Windows, ", "['Microsoft Windows Mobile Device Center', 'Microsoft ActiveSync']"], "mell": ["Mellel Word Processing File", "Word processing document created with Mellel, a shareware word processor for Mac OS X; includes special features for educational use and creative and technical writing; also supports multilingual languages.", "Mac, ", "[]"], "mellel": ["Mellel Word Processing Document", "Text document created with Mellel, an advanced word processor for Mac OS X; supports tables, lists, columns, word count, spell check, multiple languages, and OS X services.", "Mac, ", "[]"], "mem": ["FoxPro Variable File", "Stores variables and arrays used in a FoxPro project; often used for backup purposes; can be restored using the RESTORE FROM command.", "Windows, Windows, Mac, Linux, Mac, Windows, Mac, Windows, Windows, Mac, Linux, ", "['Microsoft Visual FoxPro']['GreekToMe']['GreekToMe']['GreekToMe']['Parallels Desktop 12 for Mac'][][]['Corel WordPerfect X8'][][][]"], "mel": ["Maya Embedded Language File", "Script file containing code written in the Maya Embedded Language (MEL); developed for Maya 3D modeling and animation software; can be used to create macros and custom actions that speed up repetitive tasks.", "Windows, Mac, Linux, ", "['Autodesk Maya 2017']['Autodesk Maya 2017']['Autodesk Maya 2017']"], "mega": ["Megacubo XML Metafile", "TV channel data file used by Megacubo, a program used for streaming IPTV (Internet Protocol TV) stations; saves information about the stream, such as the channel name, a description, and the connection URL; allows TV station presets to be saved.", "Windows, ", "['Megacubo']"], "meg": ["MEGA Data File", "Genetic data file used by MEGA, an application used for testing evolutionary hypotheses; saved in a plain text format and contains various kinds of genetic data and sequences, such as DNA codes or genetic distance data based on populations.", "Windows, Mac, ", "['MEGA']['MEGA']"], "mef": ["Mamiya RAW Image", "Camera RAW image captured by a Mamiya digital camera; stores the image as it was captured by the camera's CCD; usually stored on a memory card and then transferred to the computer for editing and publishing.", "Windows, Mac, ", "['Corel PaintShop Pro X9', 'Microsoft Windows Photos', 'Adobe Photoshop Elements 15', 'ACD Systems ACDSee 20', 'Adobe DNG Converter', 'ACD Systems Canvas X 2017', 'Helicon Filter', 'Picmeta Systems Picture Information Extractor']['Adobe Photoshop Elements 15', 'Adobe DNG Converter']"], "med": ["Amiga MED Sound File", "Audio file created by OctaMED, a sound tracker program originally created for Amiga computer systems but later migrated to Windows systems with the name MED Soundstudio; stores a module which contains notes, pitches, and effects that are used to create music tracks and sequences of sounds.", "Windows, Mac, Windows, ", "['ModPlug Player']['CocoModX']['Rockwell Automation RSView']"], "meb": ["PRO100 3D Interior Catalog Element", "Catalog item used by the PRO100 interior and furniture design program; can be imported into a PRO100 design project (.STO file).", "Windows, ", "[]"], "mdzip": ["MagicDraw Project Archive", "File created by MagicDraw, a program used for modeling software architectures and business processes; saves an archive of project files in a compressed .ZIP format; used for saving, backing up, and transferring UML projects as a single file.", "Windows, Mac, ", "['No Magic MagicDraw']['No Magic MagicDraw']"], "mdx": ["Warcraft 3 Model File", "Model file used by Warcraft III, a real-time strategy game where players build bases and control units in the fictional world of Azeroth; stores a 3D game model and includes meshes and textures for units or buildings; used for storing pre-fabricated 3D models or for customizing 3D models using editors.", "Windows, Mac, Windows, Windows, iOS, Windows Phone, Windows, Windows, ", "['Blizzard Warcraft 3', 'Blizzard Warcraft 3 Art Tools', 'chUmbaLum sOft MilkShape 3D', 'Warcraft 3 MDX to OBJ File Converter', 'MDX Squisher', 'Biturn', 'MdxLib']['Blizzard Warcraft 3']['DT Soft DAEMON Tools', 'Astroburn']['Octopus Studio MDict']['Octopus Studio MDict']['Octopus Studio MDict'][]['dBase', 'Embarcadero InterBase']"], "mdw": ["Access Workgroup File", "Stores usernames and passwords of users allowed to open a specific Access database; must be linked to an Access database to be effective.", "Windows, ", "['Microsoft Access 2016']"], "mdsx": ["MEGA Saved Session", "Session file created and used by MEGA, an application used for testing evolutionary hypotheses; stores a session, which is the status of MEGA at a certain time; can be saved and opened at a later time.", "Windows, Mac, ", "['MEGA']['MEGA']"], "mds": ["TestComplete Project File", "Settings file created and used by TestComplete, an application that allows users to test web, desktop, and mobile programs; stores project settings that are common for testers, such as the names of project items and the scripting language.", "Windows, Windows, ", "['SmartBear TestComplete']['Alcohol 120%', 'CyberLink PowerDVD 16', 'Smart Projects IsoBuster', 'WinMount International WinMount', 'Lightning UK! ImgBurn', 'EZB Systems UltraISO', 'DT Soft DAEMON Tools', 'MagicISO']"], "mdmp": ["Windows Minidump", "Compressed file created by Windows after a program error or crash; contains data \"dumped\" from the program's memory space; saves information about the error, which can be used for debugging; commonly created along with an uncompressed .HDMP file and can be sent to Microsoft as part of a bug reporting process.", "Windows, ", "['Microsoft Windows SDK', 'Microsoft Visual Studio 2017']"], "mdr": ["ModPlug Compressed Module", "Compressed music module file created by ModPlug Player, an application used to play module music files; stores a module such as an .MTM, .MT2, or .IT file that is compressed with RAR compression.", "Windows, ", "['ModPlug Player']"], "mdm": ["HLM Multivariate Data Matrix File", "Data file used by the Hierarchical Linear and Nonlinear Modeling (HLM) program for statistical analysis of scientific data; contains textual data recorded from a scientific observation; used as an input format for the HLM program to create summary-level and in-depth statistics.", "Windows, Windows, ", "[][]"], "mdj": ["StarUML Model File", "Model file created and used by StarUML, a software modeling application; contains project information, which includes the project type and classes added to the project diagram; stored in JSON format. ", "Windows, Mac, Linux, ", "['MKLab StarUML']['MKLab StarUML']['MKLab StarUML']"], "mdl": ["MathWorks Simulink Model", "Simulation model created with Simulink, a simulation and model-based design application; contains the block diagram and block properties of the simulation.", "Windows, Mac, Linux, Windows, Mac, Windows, Linux, Windows, Mac, Linux, Windows, Windows, Mac, Windows, Windows, ", "['MathWorks Simulink']['MathWorks Simulink']['MathWorks Simulink']['MDLX Converter', 'Blizzard Warcraft 3 Art Tools', 'Microsoft Notepad', 'Notepad++', 'text editor']['Apple TextEdit', 'Bare Bones TextWrangler', 'text editor']['IBM Rational Rose']['IBM Rational Rose']['chUmbaLum sOft Half-Life Model Viewer', 'chUmbaLum sOft MilkShape 3D', 'MDLDecompiler', 'Valve Half-Life', 'Valve Half-Life 2', 'Valve Source']['Valve Half-Life 2']['chUmbaLum sOft Half-Life Model Viewer']['Microsoft Flight Simulator X Gold Edition']['MODPlug Player']['CocoModX']['Lectra Modaris', 'PAD Pattern Design']['mdl2obj']"], "mdinfo": ["iPhone Backup Information File", "iPhone backup file created by iTunes, a digital media player; stores metadata about the data saved in a corresponding .MDDATA file; may include information about SMS messages, contacts, and notes; used for restoring iPhone backups in iTunes.", "Windows, Mac, ", "['Apple iTunes', 'Microsoft Notepad', 'Notepad++', 'text editor']['Apple iTunes', 'Apple TextEdit', 'text editor']"], "mddata": ["iPhone Backup File", "iPhone backup file created by iTunes, a digital media player; may store data such as contacts, SMS messages, applications, and notes; used for restoring iPhone states through iTunes.", "Windows, Mac, Linux, ", "['Apple iTunes', 'PalmDatabase.db3 / IPhone .mddata Viewer', 'Mozilla Firefox with SQLite Manager plug-in']['Apple iTunes', 'Mozilla Firefox with SQLite Manager plug-in']['Mozilla Firefox with SQLite Manager plug-in']"], "mdi": ["Microsoft Document Imaging File", "High-resolution, tag-based graphics format developed from the TIFF format; used by Microsoft Office for saving scanned documents; may be turned into a Word (.DOC) document using OCR (optical character recognition) software.", "Windows, ", "['Microsoft Office 2016', 'Bugysoft MDI2PDF Converter']"], "mdf": ["SQL Server Database File", "Primary database file format used by Microsoft SQL Server, an enterprise-level database program; used for database files installed with SQL Server and related add-ons; custom MDF files may also be created by the user.", "Windows, Windows, Windows, Windows, ", "['Microsoft SQL Server 2016', 'Microsoft Visual Studio 2017']['Alcohol 120%', 'CyberLink PowerDVD 16', 'MagicISO', 'Smart Projects IsoBuster', 'WinMount International WinMount', 'DT Soft DAEMON Tools', 'H+H Software Virtual CD', 'PowerISO']['Vector CANape', 'Vector CANgraph', 'Vector MDF Validator', 'National Instruments DIAdem'][]"], "mde": ["Compiled Access Add-in File", "Add-in file used by Microsoft Access, a program used for managing relational databases; stores the compiled version of an .MDA file, which contains Visual Basic for Applications (VBA) source code; protects the contents of the add-in by storing it in a compiled, binary format.", "Windows, Windows, Mac, ", "['Microsoft Access 2016']['Graphisoft ArchiCAD']['Graphisoft ArchiCAD']"], "mdd": ["Point Oven Deformation Data File", "Model data file used by Point Oven, a commercial suite of plugins used for transferring vertex and fcurve data between modeling programs; saves \"baked\" vertex data for every animation frame of a specified mesh; allows actual vertex mesh positions, or deformations, to be exchanged between other programs that have Point Oven MDD support.", "Windows, Mac, Linux, Windows, iOS, Windows Phone, ", "['Autodesk Maya with Point Oven plugin', 'Autodesk 3ds Max with Point Oven plugin', 'NewTek LightWave 3D with Point Oven plugin', 'Autodesk Softimage 2015', 'pmG messiahStudio with Point Oven plugin']['Autodesk Maya with Point Oven plugin', 'NewTek LightWave 3D with Point Oven plugin', 'pmG messiahStudio with Point Oven plugin']['Autodesk Softimage 2015']['Octopus Studio MDict']['Octopus Studio MDict']['Octopus Studio MDict']"], "mdc": ["Multi Dimension Cube File", "Stores multi-dimensional \"cube data\" used by Cognos business analytics software; organizes information into various dimensions, which allows data to be retrieved and processed quickly and efficiently; also referred to as a PowerPlay cube.", "Windows, Linux, Windows, Mac, Linux, Mac, ", "[][]['Merkaartor']['Merkaartor']['Merkaartor']['GGS MidiCo']"], "mdbackup": ["iPhone Data Backup File", "iPhone or iPod touch backup file created by iTunes, a digital media player; contains backup data for the device, which may include notes, SMS messages, pictures, contacts, and other data; used by iTunes for restoring device states.", "Windows, Mac, ", "['Apple iTunes', 'Microsoft Notepad', 'text editor']['Apple iTunes', 'Echo One File Juicer', 'Apple TextEdit', 'text editor']"], "mdb": ["Microsoft Access Database", "An MDB file is a database file created by Microsoft Access, a widely-used desktop relational database program.  It contains the database structure (tables and fields) and database entries (table rows).  MDB files may also store data entry forms, queries, stored procedures, reports, and database security settings.", "Windows, Mac, Linux, Web, Windows, Mac, ", "['Microsoft Access 2016', 'SAS Institute SAS', 'Wolfram Research Mathematica', 'Freewind MDB Converter', 'Microsoft Visual Studio 2017', 'MDB Viewer Plus']['MDB Viewer', 'Wolfram Research Mathematica']['Kexi', 'SAS Institute SAS', 'mdb-export']['MDBopener.com']['Avid Media Composer']['Avid Media Composer']"], "mda": ["Access Add-in", "Add-in file used by Microsoft Access, a desktop Relational Database Management System (RDBMS) application; contains source code written in the Visual Basic for Applications (VBA) language; used for adding functionality, such as automated functions and queries, to the software.", "Windows, ", "['Microsoft Access 2016']"], "md5mesh": ["id Tech 4 3D Mesh File", "3D mesh file used by id Tech 4, a game engine used for Doom 3 and Quake 4; contains the polygonal mesh data for a model; used for storing skeletal meshes of characters, weapons, creatures, and other game objects; may be animated using a .MD5ANIM file and texturized with raster graphics stored in .TGA files.", "Windows, Mac, Linux, ", "['Blender with md5importer plug-in', 'Autodesk 3ds Max with md5importer plug-in', 'Autodesk Softimage 2015', 'NewTek LightWave 3D with doom3MD5 plug-in', 'md5import', 'QuArK']['Blender with md5importer plug-in', 'NewTek Lightwave 3D with doom3MD5 plug-in']['Blender with md5importer plug-in']"], "md8": ["Mediator Project File", "File created by Mediator, a multimedia authoring application; saves the objects, page list, and events for the multimedia application; used for creating CD-ROM presentations, HTML webpages, and Flash applications.", "Windows, Mac, ", "['MatchWare Mediator']['GarageCUBE Modul8']"], "md5anim": ["id Tech 4 Model Animation File", "3D animation file used by id Tech 4, the game engine used for Doom 3 and Quake 4; contains animation sequence data for a 3D mesh stored in a corresponding .MD5MESH file; saved in a plain text format; used for creating motions for game characters, weapons, creatures, and other game objects.", "Windows, Mac, Linux, ", "['Blender with md5importer plug-in', 'Autodesk 3ds Max with md5importer plug-in', 'Autodesk Softimage 2015', 'NewTek LightWave 3D with doom3MD5 plug-in', 'md5import', 'QuArK']['Blender with md5importer plug-in', 'NewTek Lightwave 3D with doom3MD5 plug-in']['Blender with md5importer plug-in']"], "md5camera": ["id Tech 4 Model Camera File", "3D camera file used by id Tech 4, a game engine developed by id Software for Doom 3 and Quake 4; contains 3D camera paths, including the position, rotation, and field of view for each path; used for controlling cameras during cinematic sequences and cut scenes in id Tech 4 games.", "Windows, Mac, Linux, ", "['Blender with md5importer plug-in', 'Autodesk 3ds Max with md5importer plug-in']['Blender with md5importer plug-in']['Blender with md5importer plug-in']"], "md5": ["MD5 Checksum File", "Contains a checksum used to verify the integrity of a disc, disk image, or a downloaded file; the checksum is a value created from an algorithm based on the number of bits in the file; sometimes generated when a disk image is created.", "Windows, Mac, ", "['Md5Checker', 'MD5summer', 'FlashPlayerPro.com MD5 Checksum Verifier', 'SlavaSoft FSUM', 'Smart Projects IsoBuster']['checkSum+']"], "md3": ["Quake 3 3D Model", "Three-dimensional model format used by Quake III Arena, a first-person shooter game; used primarily for player and character models; includes frame, vertex, surface, and shading data; also contains animation data that defines the possible movements of the model.", "Windows, Mac, Linux, ", "['id Software Quake 3', 'chUmbaLum sOft MilkShape 3D', 'Cube 2: Sauerbraten', 'QuArK']['id Software Quake 3', 'Cube 2: Sauerbraten']['id Software Quake 3', 'Cube 2: Sauerbraten']"], "md2": ["Alcohol Disk Image Segment 2", "The third segment of a CD or DVD disc image copied by Alcohol 120% software; part of a sequence of disc image segments (each part ends in .MD0, .MD1, then MD2, etc.); must be joined with the other segments to retrieve the complete disc image.", "Windows, Mac, Windows, Mac, ", "['Alcohol 120%'][]['id Software Quake 2', 'chUmbaLum sOft MilkShape 3D', 'QuArK']['id Software Quake 2']"], "md1": ["GEAR CD/DVD Disc Image", "Copy of a CD or DVD created by GEAR disc burning software", "Windows, Windows, Mac, ", "['EZB Systems UltraISO']['Alcohol 120%'][]"], "md0": ["Alcohol Disk Image Segment 1", "Contains an exact copy of a disc (such as a CD or DVD), copied by Alcohol 120% software; may be part of a sequence of disc image segments (such as MD0, .MD1, .MD2, etc.) or may be the only file.", "Windows, Mac, Windows, Mac, ", "['Alcohol 120%'][]['Adobe Photoshop CC 2017']['Adobe Photoshop CC 2017']"], "md": ["Markdown Documentation File", "An MD file is a text file created using one of several possible dialects of the Markdown language.  It is saved in plain text format but includes inline text symbols that define how to format the text (e.g., bold, indentations, headers, table formatting).  MD files are designed for authoring plain text documentation that can be easily converted to HTML.", "Windows, Mac, Linux, Web, Windows, Windows, Mac, Linux, Windows, Windows, Mac, Linux, Windows, ", "['Microsoft Notepad', 'Microsoft WordPad', 'gVim', 'text editor', 'Daring Fireball Markdown']['MacroMates TextMate', 'Apple TextEdit', 'MacVim', 'text editor', 'Daring Fireball Markdown']['Vim', 'GNU Emacs', 'text editor', 'Daring Fireball Markdown']['GitHub']['SBWin']['Reilly Technologies Moneydance']['Reilly Technologies Moneydance']['Reilly Technologies Moneydance'][]['gVim', 'Microsoft Notepad', 'text editor']['GNU Compiler Collection (GCC)', 'MacroMates TextMate', 'text editor']['GNU Compiler Collection (GCC)', 'GNU Emacs', 'text editor']['PS2 Save Builder']"], "mcz": ["Compressed Poser Material File", "Compressed material information file used by Poser's rendering engine; contains textures that can be applied to 3D models created with Poser; accessible only from the Library within the Material Room.", "Windows, Mac, ", "['Smith Micro Poser 11']['Smith Micro Poser 11']"], "mcx": ["MICRO CADAM-X/6000 Model Data File", "3D model format used by Mastercam X and X2 CAD/CAM software; used for developing 3D models of parts, molds, and fixtures; may contain solids, surfaces, and wireframe data; commonly referred to the MC-X format.", "Windows, ", "[]"], "mcsp": ["My Craft Studio Project File", "Card design project file created by My Craft Studio, a program used for creating paper and card designs; stores text, graphics, effects, and page layout information; used for printing greeting cards, stationery, and other cards for various occasions.", "Windows, ", "['Crafting.co.uk My Craft Studio']"], "mcw": ["Monitor Calibration Wizard File", "Settings file created by Monitor Calibration Wizard, a program used to adjust monitor display settings; stores a monitor adjustment profile, which includes settings for brightness and color.", "Windows, Mac, ", "['Hex2Bit Monitor Calibration Wizard']['Apple AppleWorks']"], "mcserver": ["Minecraft Server File", "Server package created and used by MCServer, an application that enables you to build and customize your own Minecraft server; contains several files, including .JAR, .COMMAND, .TXT, and .YML files, used to configure the server.", "Mac, ", "['MacMan MCServer']"], "mcr": ["Minecraft Region File", "Game file used by Minecraft, a sandbox block construction game; contains a 32x32 region of a Minecraft world; named as r.x.z.mcr, where \"x\" and \"z\" specify the region's coordinates; used for saving \"chunks\" of the world.", "Windows, Mac, Linux, Windows, Mac, Linux, Windows, Windows, Linux, ", "['Mojang Minecraft', 'NBTExplorer']['Mojang Minecraft', 'NBTExplorer']['Mojang Minecraft', 'NBTExplorer']['Tecplot 360']['Tecplot 360']['Tecplot 360']['Autodesk 3ds Max 2017']['ePSXe', 'PCSX']['ePSXe']"], "mcp": ["CodeWarrior Project", "Development project created by CodeWarrior, a C and C++ development IDE; saves references to project source code and resource files, as well as project specific preferences; originally used by Metrowerks CodeWarrior (MCP), which is now Freescale CodeWarrior.", "Windows, Windows, ", "['Freescale CodeWarrior']['Megacubo']"], "mcfunction": ["Minecraft Commands Function File", "An MCFUNCTION file contains commands used in Minecraft, an open-ended block construction game.  It stores a list of one or more commands that can be executed in the game to perform actions, such as teleporting a player or moving blocks.  ", "Windows, Mac, Linux, ", "['Mojang Minecraft', 'text editor']['Mojang Minecraft', 'text editor']['Mojang Minecraft', 'text editor']"], "mco": ["Live Messenger Winks File", "Contains Flash-based animations, called Winks, that can be sent using Windows Live Messenger (formerly MSN Messenger); similar to sending an emoticon, but can be a much larger animation.", "Windows, ", "['Microsoft Windows Live Messenger']"], "mcmac": ["MasterCook Mac Document", "File created to export MasterCook recipe files to MacGourmet Deluxe, an application used for organizing personal recipes and cookbooks; contains an exported MasterCook (another recipe organizer program) file in Mac format.", "Mac, ", "['Mariner MacGourmet Deluxe']"], "mcdx": ["Mathcad Prime Document", "Document created by Mathcad Prime, a program used for engineering calculations; can contain algorithms, functions, macros, symbols, plots, annotations, and other mathematical constructs; also supports free-form text as well as headers and footers for multi-page information; often used for storing complex engineering calculations.", "Windows, ", "['PTC Mathcad Prime 3.0']"], "mcl": ["Windows Media Center Link File", "Link file used by Windows Media Center (WMC), a program used as an entertainment hub for large home screens; contains settings for the application name, location, and startup options; serves as a shortcut to launch a specified application within WMC.", "Windows, ", "['Microsoft Windows Media Center']"], "mcd": ["MiniCAD Design File", "Design created by Vectorworks CAD applications, which were previously developed under the MiniCAD brand; contains a design draft such as a technical drawing or a 2D or 3D model; used for storing drafted plans before construction or manufacturing.", "Windows, Mac, Windows, ", "['Nemetschek Vectorworks', 'Nemetschek VectorWorks Viewer']['Nemetschek Vectorworks', 'Nemetschek VectorWorks Viewer']['PTC Mathcad Prime 3.0']"], "mca": ["Minecraft \"Anvil\" Map File", "World format used by Minecraft, a game that allows open-ended construction of worlds; replaces the older .MCR (Minecraft Region) format and includes enhancements such as an increased build height (256 up from 128), support for more block types, and more efficient file compression; also enables greater modding capabilities for the game community.", "Windows, Mac, Linux, ", "['Mojang Minecraft', 'NBTExplorer']['Mojang Minecraft', 'NBTExplorer']['Mojang Minecraft', 'NBTExplorer']"], "mc9": ["Mastercam 9 Geometry File", "Data format used by Mastercam 9 CAM (Computer Aided Manufacturing) software; may contain 2D and 3D geometry and toolpath data that defines areas to be cut by a machine; used as templates for mills, lathes, wire cutters, and routers.", "Windows, ", "[]"], "mc6": ["Poser Material Collection File", "File used by Poser Pro, a program used for modeling and animating characters; stores a collection of materials, which are the the graphics that can be used to texturize a model's skeleton with a real-world appearance; may also use the .MCZ extension.", "Windows, Mac, ", "['Smith Micro Poser 11']['Smith Micro Poser 11']"], "mc2": ["MasterCook 5 Cookbook File", "File created by MasterCook version 5 and 6, a program used for creating and organizing recipes; contains cookbook data, such as recipes, ingredients, and food preparation information; used to save the current state of a cookbook.", "Windows, ", "['ValuSoft MasterCook']"], "mbs": ["Opera Mailbox File", "Mailbox file created by Opera Mail, an email client built into the Opera Web browser; contains email messages for a specific mail folder, such as the inbox, drafts, or sent messages folders; stored in similar file format to the Mozilla Thunderbird mail folders.", "Windows, Mac, Linux, ", "['Opera']['Opera']['Opera']"], "mbr": ["Master Boot Record File", "System file used by Linux operating systems; contains the master boot record, which is used to startup, or bootstrap, the operating system; used for saving or distributing the MBR data.", "Linux, Windows, ", "['Canonical Wubi', 'GNU GRUB']['Microsoft Zune']"], "mc5": ["Poser 5 Material File", "Contains material or texture information used by Poser's rendering engine; can be applied to 3D models and offers a greater scale of effects than Poser MAT pose (.PZ2) files; only accessible from the Library within the Material Room.", "Windows, Mac, ", "['Smith Micro Poser 11']['Smith Micro Poser 11']"], "mc1": ["MedCalc Data File", "Data format used by MedCalc, a statistical software program designed for biomedical researchers; saved as an OLE compound file in a binary format; contains data values that can be viewed and analyzed using MedCalc software.", "Windows, ", "['MedCalc']"], "mbx": ["Outlook Express Mailbox", "Mailbox (or mail folder) that contains Outlook Express e-mail messages; contains actual message data; may be backed up by copying the mailbox files to a different folder.", "Windows, ", "['Microsoft Outlook Express']"], "mbox": ["E-mail Mailbox File", "An MBOX file is a mailbox file saved in an email storage format used for organizing email messages in a single text file.  It saves messages in a concatenated format where each message is stored after another, starting with the \"From\" header.  MBOX files were originally used by Unix hosts but are now supported by other email applications, including Apple Mail and Mozilla Thunderbird.", "Windows, Mac, Linux, ", "['Mozilla Thunderbird', 'CoolUtils Total Thunderbird Converter', 'Kernel MBOX Viewer']['Apple Mail', 'Microsoft Outlook 2016', 'Mozilla Thunderbird']['Mozilla Thunderbird']"], "mbp": ["Mobipocket Notes File", "Contains eBook notes such as annotations, corrections, drawings, and other marks made by the user within an eBook; typically saved with the associated eBook file, such as a .PRC file; stores data in a binary format that can be extracted by an MBP file utility such as MBP reader.", "Windows, Linux, Windows, ", "['MBP reader']['MBP reader']['CyberLink MediaShow 6']"], "mbm": ["Kerbal Space Program Texture File", "3D model texture used by Kerbal Space Program (KSP), a space program building game; saves textures referenced by the .MU mesh file; used for providing the surface appearance of space shuttles and other space objects.", "Windows, Mac, Windows, Mac, ", "['Squad Kerbal Space Program']['Squad Kerbal Space Program']['XnViewMP']['Lemkesoft GraphicConverter', 'XnViewMP']"], "mbi": ["Multi-Bootable Information File", "Contains information that enables a disc to include multiple boot options; can be created with MagicISO by opening the Multi-Boot Image Editor and adding boot items (.BIF files); often used for creating CDs or DVDs with multiple operating system installation options.", "Windows, ", "['MagicISO']"], "mbg": ["Microsoft Mailbag", "File used by Microsoft Mail, a mail server program, for organizing mail messages; contains mail headers that point to the actual mail (.MAI) files; often compressed using the Compress Mailbag utility included with Microsoft Mail.", "Windows, Windows, ", "[][]"], "mbf": ["Microsoft Money Backup File", "Backup file created by Microsoft Money, a program used to track personal and business-related finances; contains a backup of an .MNY file in either compressed or uncompressed format; used for compressing and backing up large MNY files into an archive; can be converted to .QIF files with the Microsoft Money software.", "Windows, ", "['Microsoft Money']"], "mbd": ["Multimedia Builder Project File", "File created by Multimedia Builder (MMB), a program used to create front-ends for application and game CDs; stores the user interface design as well as the program functions; used for autorun CD interfaces as well as for small games and multimedia playback applications.", "Windows, ", "['MediaChance Multimedia Builder']"], "mb": ["Maya Binary Project File", "Project file created with Maya, a 3D modeling and animation program; contains three-dimensional models, textures, lighting properties, and animation data; saved in a binary format instead of the ASCII text format used by Maya .MA files.", "Windows, Mac, Linux, Windows, Mac, ", "['Autodesk Maya 2017']['Autodesk Maya 2017']['Autodesk Maya 2017']['Kodak EasyShare']['Kodak EasyShare']"], "maxc": ["3ds Max Container File", "File created by 3ds Max, a software package used for 3D modeling and animation; stores a collection of 3D objects, including their properties; allows modelers to organize scene objects into groups; also allows object groups to be shared.", "Windows, ", "['Autodesk 3ds Max 2017']"], "max": ["3ds Max Scene File", "A MAX file is a three-dimensional scene file created by 3ds Max, a 3D modeling, animation, and rendering application.  It may contain multiple models that include wireframes, textures, lighting effects, shading, animation, and other 3D design elements.  ", "Windows, Windows, Windows, Linux, Windows, Mac, Linux, ", "['Autodesk 3ds Max 2017']['PS2 Save Builder', 'PS2 Save Converter']['Nuance PaperPort 14', 'Nuance OmniPage Ultimate']['Maxview']['Nuance OmniPage Ultimate', 'Nuance PaperPort 14']['Nuance OmniPage Pro X']['Maxview']"], "mav": ["Access View File", "Shortcut file created by Microsoft Access, a relational database desktop program for Windows; stores a query that returns the results as a virtual table; used for saving a view shortcut; can be opened by double-clicking the file.", "Windows, ", "['Microsoft Access 2016']"], "mat": ["MATLAB MAT-File", "Binary data container format used by MATLAB; may include arrays, variables, functions, and other types of data; can be saved in different formats by choosing a version within the MATLAB Preferences (select General → MAT-Files).", "Windows, Mac, Windows, Windows, Windows, Mac, Windows, Mac, ", "['The MathWorks MATLAB']['The MathWorks MATLAB']['Microsoft Access 2016']['Autodesk 3ds Max 2017']['E-on Vue']['E-on Vue']['Autodesk 3ds Max with Chaos Group V-Ray plugin', 'Autodesk Maya with Chaos Group V-Ray plugin', 'MAXON CINEMA 4D with Chaos Group V-Ray plugin']['MAXON CINEMA 4D with Chaos Group V-Ray plugin', 'Autodesk Maya with Chaos Group V-Ray plugin']"], "masseffectsave": ["Mass Effect Saved Game", "Saved game file created by Mass Effect, a sci-fi role-playing game (RPG) where players complete missions as a starship captain; contains a saved game state stored as a Zip package; used to save and load in-game progress; saved to the BioWare\\Mass Effect\\Save directory of a Mass Effect installation.", "Windows, ", "['Electronic Arts Mass Effect', 'Electronic Arts Mass Effect 2', \"Gibbed's Mass Effect 2 Save Editor\"]"], "mask": ["SpeedGrade Color Mask File", "Color grading mask used by SpeedGrade, a program used for making color adjustments during video production; saves a shape that can be used to mask color adjustments inside or outside the shape region; allows color grades to be applied selectively to a scene or clip.", "Windows, Mac, ", "['Adobe SpeedGrade CC 2017']['Adobe SpeedGrade CC 2017']"], "masseffectprofile": ["Mass Effect Player Profile", "File created by Mass Effect, a first person role-playing game where players complete missions in outer space; contains achievements for a player profile, including weapon skills (pistol, shotgun, assault rifle, etc.) and achievements; used to record player skills and progress.", "Windows, ", "['Electronic Arts Mass Effect', 'Critical Mass']"], "mas": ["rFactor Track File", "Game file used by rFactor, a racing simulation game; stores the asset files for a racing track map and includes files for both the structure and the appearance of the track; can be modded to create custom tracks, but modding is only for advanced users.", "Windows, Windows, Mac, Windows, ", "['Image Space rFactor', 'gMotor MAS File Utility']['MEGA']['MEGA']['Microsoft Access 2016']"], "mart": ["MartView eBook File", "E-publication file used by MartView, a free program used for reading eMagazines and eBooks; includes book or magazine pages and pagination information; used for downloading and reading e-publications in the MartView reader.", "Windows, ", "['MartView']"], "marshal": ["Marshal Data Migration Model File", "Data model file created by Marshal Editor, a tool used for migrating, integrating, and archiving data; contains an XML specification for data sets that have been imported or exported; used for storing data migration settings between multiple databases; also used for executing scheduled jobs with the Marshal Archiver tool.", "Windows, ", "['RISE to Bloome Marshal Editor', 'RISE to Bloome Marshal SQLUtility', 'RISE to Bloome Marshal Archiver']"], "markdown": ["Markdown Documentation File", "Text file created using one of several possible dialects of the Markdown language; uses plain text formatting but contains inline text symbols that specify how to format the text (e.g., *bold* for bold text, or other markups for italics, indentation, headers, etc.); designed for writing documentation in plain text that can be easily converted to HTML.", "Windows, Mac, Linux, Web, ", "['Microsoft Notepad', 'Notepad++', 'gVim', 'text editor', 'Daring Fireball Markdown']['MacroMates TextMate', 'Apple TextEdit', 'Bare Bones TextWrangler', 'text editor', 'Daring Fireball Markdown']['Vim', 'GNU Emacs', 'text editor', 'Daring Fireball Markdown']['GitHub']"], "mar": ["Mozilla Archive", "Application update file used by Mozilla programs such as Firefox, Thunderbird, and SeaMonkey; contains files that update the program to a new version; run by the Mozilla update program (update.exe in Windows), which is included with Mozilla software installations; stored in a custom file format, but Mozilla has made the specification publically available.", "Windows, Mac, Linux, Windows, Mac, ", "['Mozilla Firefox', 'Mozilla Thunderbird', 'Mozilla SeaMonkey']['Mozilla Firefox', 'Mozilla Thunderbird', 'Mozilla SeaMonkey']['Mozilla Firefox', 'Mozilla Thunderbird', 'Mozilla SeaMonkey']['Microsoft Access 2016']['Mariner Calc XLS']"], "maq": ["Microsoft Access Query", "Shortcut file created by Microsoft Access, a desktop relational database program; contains a shortcut to an SQL query created in the software; can be double-clicked to open Access and run the query; often saved to the desktop.", "Windows, ", "['Microsoft Access 2016']"], "maplet": ["Maplet World File", "World map created by Maplet, a free program used to create 3D worlds; stores the layout of the world as well as textures and lighting information; can be exported to a .B3D file, which can be used to load the world in Blitz3D game making software.", "Windows, ", "['Blitz Research Maplet']"], "mapimail": ["Send To Mail Recipient", "Enables the \"Send To→Mail Recipient\" option when right-clicking a file or folder in Windows; opens the default mail program and attaches the file to a new message.", "Windows, ", "['Microsoft Windows']"], "mapx": ["Mapjects Client Webparts File", "File used by Mapjects GRYD, an operations visualization software package used for security management, energy management, and logistics; stores a client configuration of \"Webparts,\" which are widgets that can be mashed together to display integrated visualizations; used for configuring rich client Web interfaces.", "Windows, Linux, ", "[][]"], "map": ["Quake Engine Map File", "A MAP file is a game map created for games developed with one of the Quake engines.  It is saved in a human-readable text-based format.  MAP files are uncompiled but can be compiled into a .BSP binary map file for use in games such as Half-Life, Quake, Quake 2, and Quake 3.", "Windows, Windows, Mac, Windows, Windows, Mac, Windows, Windows, Mac, Linux, Windows, Mac, Linux, Windows, Mac, Windows, Windows, Windows, Linux, ", "['Valve Hammer Editor', 'Torque Constructor', 'id Software GtkRadiant', 'QuArK', 'MAP3BSPC', 'Q3Map2', 'Microsoft Notepad', 'text editor']['Bungie Halo: Combat Evolved', 'Halo Map Tools']['Bungie Halo: Combat Evolved']['Furcadia']['Web browser', 'text editor']['Web browser', 'text editor']['Bethesda Softworks Fallout 1', 'Bethesda Softworks Fallout 2']['Leges Motus']['Leges Motus']['Leges Motus']['TECkit', 'pyTecKit']['TECkit', 'pyTecKit']['TECkit', 'pyTecKit']['Rigs of Rods']['Rigs of Rods'][][][][]"], "manifest": ["Windows Application Manifest File", "XML document that describes the manifest, or package contents, of a Windows software application; used by various Windows technologies for configuring and deploying software, including ClickOnce and the Common Language Runtime (CLR); often seen with the compound \".exe.manifest\" file extension.", "Windows, Windows, Mac, ", "['Microsoft Visual Studio 2017', 'Microsoft ClickOnce', 'Heaventools Application Manifest Wizard', 'Microsoft Notepad', 'text editor']['Valve Steam']['Valve Steam']"], "mani": ["Mine-imator Project File", "File created by Mine-imator, a program used for making Minecraft animations; used as a project file and contains the animation timeline as well as the mobs, items, and terrain for the scene; can be exported to an .AVI video when complete.", "Windows, ", "['Mine-imator']"], "mam": ["Microsoft Access Macro", "Macro that can execute one or more commands in Microsoft Access.", "Windows, ", "['Microsoft Access 2016']"], "makerbot": ["MakerBot Print File", "3D printer file format used by MakerBot Replicator, a desktop 3D printer; contains 3D model printing instructions for a MakerBot desktop 3D printer.", "Windows, ", "['MakerBot Replicator']"], "mak": ["Makefile", "Developer file used by compilers and software development IDEs; stores instructions that specify how source files are compiled and linked.", "Windows, Mac, ", "['Microsoft Visual Studio 2017']['Apple Xcode']"], "mailstationery": ["Apple Mail Stationery File", "Email stationery file created and used by Mail, an email application bundled with OS X; contains files that make up a stationery design, such as .JPG, .PNG, and .HTML files, along with .STRINGS files and a .PLIST file that describe the design.", "Mac, ", "['Apple Mail']"], "mailtoloc": ["Mail Internet Location File", "Email shortcut file created by dragging an email address or a \"mailto\" link to the Mac OS X desktop; saved in the Mac OS X .PLIST XML format and stores the email address and other optional email fields; used as a fast email shortcut for common recipients.", "Mac, ", "['Apple Mail', 'Mozilla Thunderbird', 'uncomplex Mailplane', 'text editor']"], "m4b": ["MPEG-4 Audio Book File", "Audiobook file based on the MPEG-4 container format; typically compressed with .AAC encoding; nearly identical to an .M4A file, but denoted as an audiobook and can be \"bookmarked\" by supporting audio players.", "Windows, Mac, Linux, ", "['File Viewer Plus', 'Apple iTunes', 'Microsoft Windows Media Player', 'Nullsoft Winamp', 'VideoLAN VLC media player', 'Ventis Media MediaMonkey 4', 'Roxio Creator NXT Pro 5']['Apple iTunes', 'VideoLAN VLC media player']['VideoLAN VLC media player']"], "m4a": ["MPEG-4 Audio File", "An M4A file is an audio file created in the MPEG-4 format, a multimedia container format used to store compressed audio and video data.  It contains audio encoded with either the Advanced Audio Coding (AAC) codec or the Apple Lossless Audio Codec (ALAC).", "Windows, Mac, Linux, iOS, Android, ", "['File Viewer Plus', 'Microsoft Groove Music', 'Apple iTunes', 'Microsoft Windows Media Player', 'Nullsoft Winamp', 'Media Player Classic', 'VideoLAN VLC media player']['Apple iTunes', 'Apple QuickTime Player', 'VideoLAN VLC media player', 'Eltima Elmedia Player']['VideoLAN VLC media player']['VideoLAN VLC for iOS 2']['File Viewer for Android']"], "m4": ["Macro Processor Library", "File written for m4, a Unix macro processor that is included with many Unix and Linux distributions; contains macros in addition to other text, but the macros are expanded when processed by m4; often used for setting up configuration files.", "Windows, Mac, Linux, ", "['text editor']['MacroMates TextMate', 'text editor']['text editor']"], "m3u8": ["UTF-8 M3U Playlist File", "Playlist file used by various audio and video playback programs; uses the same formatting as an .M3U file, except the text stored in the file uses UTF-8 character encoding; often used for storing playlists that have song names in different languages.", "Windows, Mac, Linux, ", "['Nullsoft Winamp', 'Roxio Creator NXT Pro 5', 'Apple iTunes', 'RealNetworks RealPlayer Cloud', 'Microsoft Windows Media Player', 'VideoLAN VLC media player', 'Foobar2000', 'Songbird']['Apple iTunes', 'RealNetworks RealPlayer Cloud', 'VideoLAN VLC media player', 'CocoModX', 'Songbird']['XMMS', 'VideoLAN VLC media player']"], "m3": ["Blizzard MDX3 Model File", "3D model used by StarCraft II: Wings of Liberty, a sci-fi real-time strategy game; created in Blizzard's MDX3 format, which is the successor to the .MDX file format used in Warcraft 3 and the .M2 format used in World of Warcraft; used for storing models for game units and structures for the Protoss, Terran, and Zerg races; also used for other game objects.", "Windows, Mac, ", "['Blizzard StarCraft 2', 'Autodesk 3ds Max with M3 Import plugin', 'm3_Viewer']['Blizzard StarCraft 2']"], "m3u": ["Media Playlist File", "An M3U file is a media playlist file supported by several media players such as Winamp and iTunes.  It contains a playlist of MP3s and other audio or video files and lists the locations of media files in a plain text format.", "Windows, Mac, Linux, ", "['Microsoft Windows Media Player', 'VideoLAN VLC media player', 'Nullsoft Winamp', 'Apple iTunes', 'Media Player Classic', 'foobar2000', 'Clementine']['Apple iTunes', 'RealNetworks RealPlayer Cloud', 'VideoLAN VLC media player', 'Songbird', 'Clementine']['XMMS', 'VideoLAN VLC media player', 'Clementine']"], "m2v": ["MPEG-2 Video", "Video only (without audio) encoded using MPEG-2 compression", "Windows, Mac, Linux, ", "['File Viewer Plus', 'RealNetworks RealPlayer Cloud', 'Microsoft Windows Media Player', 'Nullsoft Winamp', 'Roxio Creator NXT Pro 5', 'CyberLink PowerDVD 16', 'CyberLink PowerDirector 15 Ultra', 'VideoLAN VLC media player']['RealNetworks RealPlayer Cloud', 'VideoLAN VLC media player']['VideoLAN VLC media player']"], "m2ts": ["Blu-ray BDAV Video File", "Video file saved in the high-definition Blu-ray BDAV format; used for saving video data on Blu-ray discs; based on the MPEG-2 transport stream and supports 720p and 1080i formats.", "Windows, Mac, Linux, ", "['File Viewer Plus', 'Microsoft Windows Media Player', 'Adobe Flash Professional CC', 'Roxio Creator NXT Pro 5', 'CyberLink PowerDVD 16', 'CyberLink PowerDirector 15 Ultra', 'CyberLink PowerProducer 6', 'Sony Picture Motion Browser', 'MAGIX Vegas Pro 14', 'Audials One 2017', 'VideoLAN VLC media player', 'Mirillis Splash']['Adobe Flash Professional CC', 'Roxio Toast 15', 'VideoLAN VLC media player']['VideoLAN VLC media player']"], "m2s": ["Maxthon 2 Browser Skin File", "Theme or skin for the Maxthon 2 Web browser; used to customize the look and feel of the Maxthon browser interface; includes the default settings for the skin and references to images used by the skin.", "Windows, ", "['Maxthon']"], "m2t": ["HDV Video File", "High-definition video recording format used by many HD camcorders; commonly referred to as \"HDV;\" uses MPEG-2 compression to store HD video data on DV or MiniDV tapes; supports resolutions of 720p and 1080i.", "Windows, Mac, ", "['File Viewer Plus', 'Microsoft Windows Media Player', 'Adobe Flash Professional CC', 'Adobe Premiere Pro CC 2017', 'Roxio Creator NXT Pro 5', 'Corel VideoStudio Pro X10 Ultimate', 'CyberLink PowerDVD 16', 'CyberLink PowerDirector 15 Ultra', 'CyberLink PowerProducer 6', 'MPlayer', 'MAGIX Vegas Pro 14', 'Squared 5 MPEG Streamclip']['Apple iMovie 10', 'Adobe Flash Professional CC', 'Adobe Premiere Pro CC 2017', 'Roxio Toast 15', 'MPlayer', 'Squared 5 MPEG Streamclip']"], "m2p": ["MPEG-2 Program Stream File", "Video container format that supports MPEG-2 audio and video compression; similar to an MPEG-1 file, but also supports interlaced video and more audio channels; commonly used for streaming digital video.", "Windows, Mac, iOS, Windows, ", "['Roxio Creator NXT Pro 5', 'Microsoft Windows Media Player', 'Media Player Classic', 'VideoLAN VLC media player', 'Elecard MPEG Player']['Apple QuickTime Player', 'Roxio Toast 15', 'Squared 5 MPEG Streamclip']['PentaLoop PlayerXtreme Media Player']['Maxthon']"], "m21": ["AXMEDIS MPEG-21 File", "Media file created with the AXMEDIS Editor; saved in a packaged content distribution format and may contain multiple types of media; may also include descriptive metadata, and DRM copy-protection information.", "Windows, Windows, Mac, ", "[]['Apple QuickTime Player']['Apple QuickTime Player']"], "m1pg": ["iFinish Video Clip", "Video file created with Media 100 iFinish, a professional video cutting and editing program; saved in a proprietary format that can only be opened by Media 100 software.", "Windows, Mac, ", "[][]"], "m2": ["World or Warcraft Model Object", "3D model format used by World of Warcraft, an online multiplayer adventure game; describes the vertices, faces, textures, materials, and animation capabilities of a single model; used for players, creatures,  and doodads (decoration objects) within the game.", "Windows, Mac, Windows, ", "['Blizzard World of Warcraft']['Blizzard World of Warcraft']['FMPMD2000']"]}