{"n": ["Neko Bytecode File", "File compiled by Neko, a compiler for the .NEKO programming language; used to store Neko programs and saves them in a bytecode format that can be run by the Neko virtual machine (VM), which is supported on Mac, Windows, and Linux platforms.", "Windows, Mac, Linux, ", "['Neko']['Neko']['Neko']"], "nb0": ["Device Boot Loader Image", "System file used to \"flash\" a boot loader image onto a mobile device; contains a raw binary image that can be loaded directly into the target device's RAM; allows the device to boot and then load a separate formatted image; can be used to alter system data such as the default operating system and applications.", "Windows, ", "['Microsoft Windows CE Device Emulator']"], "nb": ["Mathematica Notebook", "An NB file is a structured document created by Mathematica, an application used for mathematical and scientific computation.  It contains text, images, audio, functions, and interactive user interface elements.  NB files allow mathematical results to be viewed in an interactive document.", "Windows, Mac, Linux, Windows, ", "['Wolfram Research Mathematica', 'Wolfram Research CDF Player', 'text editor']['Wolfram Research Mathematica', 'Wolfram Research CDF Player', 'text editor']['Wolfram Research Mathematica', 'Wolfram Research CDF Player', 'text editor']['Nota Bene']"], "nb7": ["NovaBACKUP Output File", "Backup file created by versions 7 and 8 of NovaBACKUP, a backup application for Windows; saves all the backed up user and system files; has a file size limit that is set by the \"Data Chunking\" size selected within the application's Global Settings → Devices preference window.", "Windows, ", "['NovaStor NovaBACKUP Professional 17']"], "nbd": ["NovaBACKUP File", "Backup file format introduced with version 10 of NovaBACKUP, a backup and restore utility for Windows; saves the backup data for the backup job, which can include user and system files; saved in a compressed format and can only be opened by NovaBACKUP.", "Windows, Windows, ", "['NovaStor NovaBACKUP Professional 17'][]"], "nba": ["Nero BackItUp Archive", "Archive created by BackItUp (formerly BackItUp & Burn), a file compression and backup utility; contains a collection of compressed files in a proprietary format; typically stored to a CD, DVD, or other backup media.", "Windows, ", "['Nero BackItUp 2017']"], "nbe": ["Nessus Report File", "Report file generated by older versions of Nessus, a network security program used to scan for network vulnerabilities; saves the results of the network scan and used for security audits; replaced by the .NESSUS format in newer versions of Nessus.", "Windows, Mac, Linux, ", "['Tenable Network Security Nessus']['Tenable Network Security Nessus']['Tenable Network Security Nessus']"], "nbc": ["Next Byte Codes Source Code File", "File written in Next Byte Codes (NBC), a programming language used to program LEGO NXT programmable bricks; contains source code with an assembly language-like syntax and can specify instructions for brick motion; used for programming movements for LEGO robot parts.", "Windows, Mac, Linux, ", "['Bricx Command Center', 'NBC']['NBC']['NBC']"], "nbf": ["Backup Now Archive", "Archive of files backed up with NTI Backup Now; contains copies of folders and files that can be restored if the original files are damaged or deleted; typically named \"backup_001.nbf,\" \"backup_002.nbf,\" etc.", "Windows, Windows, ", "['NTI Backup Now']['Nokia PC Suite']"], "nbak": ["Neat Backup File", "Backup file created by Neat 5, a digital filing system application; contains a backup of your scanned documents, including receipts and contacts; similar to the .NRBAK and .NWBAK files.", "Windows, ", "['Neat 5']"], "naz": ["Total Overdose Game Data File", "Game data file used by Total Overdose, an open world third-person shooter game that takes place in Mexico; contains various data, such as sounds, graphics, and game properties; can be used for adding support for multiple languages.", "Windows, ", "['Deadline Games Total Overdose']"], "nav2": ["WinAVI Temporary Navigation File", "Temporary file created by WinAVI during the .AVI to DVD conversion process, such as \"vob.nav2;\" may store DVD menu navigation information; deleted by WinAVI when the DVD creation process is completed.", "Windows, ", "[]"], "nav": ["Id Tech 3 Bot Navigation File", "Navigation mesh used by games developed with the id Tech 3 game engine or a derivative of the id Tech 3 engine such as Valve's Source Engine; saves a mesh of walkable areas within a .BSP map file; allows artificial intelligence (AI) bots to know how to move around the map.", "Windows, Mac, Windows, ", "['Valve Counter-Strike: Source', 'id Software Quake 3']['Valve Counter-Strike: Source', 'id Software Quake 3'][]"], "nas": ["Nastran Input File", "Input file used by MSC Nastran, a structural analysis program; contains input bulk data definitions referenced by MSC Nastran to analyze the stress and strain of component and system level models of structures; data appears in the FORTRAN programming language, which was originally developed by IBM, and stands for Formula Translating System; includes information such as the name of the bulk data, the number of grids, and the node locations of the elements that make up the models.", "Windows, Linux, ", "['MSC Nastran']['MSC Nastran']"], "narrative": ["Narrator Document", "Document created by Narrator, an audio narration production program; contains chapter(s) of edited dialogue with different, customizable actor voices assigned to selected parts of the text.", "Mac, ", "['Mariner Software Narrator']"], "narc": ["Nintendo DS Archive File", "Archive file used by games for the Nintendo DS portable gaming system; may contain various game data, including graphics, text, and level information; typically contained within a Nintendo DS ROM file; can be unpacked with some editing tools.", "Windows, ", "['NDS Editor', 'Tahaxan', 'NARC Explorer', 'Puyo Tools', 'NSMB Editor', 'MKDS Course Modifier']"], "nzb": ["NewzBin Usenet Index File", "File used by Newzbin, a service that indexes Usenet contents; contains short summary information about a Usenet posting, such as a unique ID, poster name, posting groups, file names, and file segments; used as an index to gather newsfeed content from a Usenet posting.", "Windows, Mac, Linux, ", "['NewsLeecher', 'DJI Interprises NewsBin Pro', 'Newsman Pro', 'Usenet Explorer', 'TechSono SuperNZB', 'S&H Computer Systems News Rover', 'rsbr-Software News File Grabber', 'Ilan Shemes GrabIt', 'NZBGet']['Panic Unison 2', 'Asar NZB Drop', 'TechSono SuperNZB']['NZBGet', 'KLibido', 'nget', 'nzbperl', 'hellanzb']"], "nz": ["NanoZip Compressed File", "Compressed archive format created by NanoZip, an experimental file archiver for Windows and Linux; provides lossless compression.", "Windows, Linux, ", "['NanoZip', 'BulkZip']['NanoZip']"], "nyf": ["myBase Database File", "Data file saved by myBase, a free-form database system; can store unstructured text, formatted documents, images, Web pages, e-mails, and other files.", "Windows, ", "[]"], "ny": ["Audacity Nyquist Plug-in", "Plugin file created for Audacity, an audio editing application; saves source code written in Nyquist, a LISP-based programming language for sound synthesis and music composition; stores audio effects such as fades, delays, and choruses.", "Windows, Mac, Linux, ", "['Audacity', 'NyquistIDE']['Audacity', 'NyquistIDE']['NyquistIDE']"], "nxl": ["Nextlabs Encrypted Data File", "An NXL file is an encrypted data file created by SkyDRM, a program for protecting sensitive information from unauthorized access.  It contains a file, such as a .PDF, .JPEG, or .MP4 file, that is secured with SkyDRM encryption.  NXL files can be configured to be accessed, edited, read, shared, and printed by specific people.", "Web, iOS, ", "['NextLabs SkyDRM']['NextLabs SkyDRM']"], "nwo": ["NWChem Output File", "Chemical file created by NWChem, a computational chemistry software package; contains output data from a NWChem simulation, such as the electric density of orbitals in a molecule.", "Windows, Mac, Linux, ", "['NWChem', 'Avogadro']['NWChem', 'Avogadro']['NWChem', 'Avogadro']"], "nxg": ["eSite Builder NXG Web Page", "Web page created with eSite Builder NXG, an online Web development environment that provides a WYSIWYG (\"What You See Is What You Get\") interface for creating and updating Web pages; typically built from an eSite Builder NXG template.", "Windows, Mac, ", "['Web browser']['Web browser']"], "nxc": ["Not eXactly C Source Code File", "Source code file written in the Not eXactly C (NXC) programming language; may be used to program a LEGO Mindstorms NXT brick; can be opened with Bricx Command Center (BricxCC) to view the code with syntax highlighting; can also be viewed with a basic text editor.", "Windows, Mac, Linux, ", "['Bricx Command Center', 'NBC', 'text editor']['NBC', 'text editor']['NBC', 'text editor']"], "nwv": ["Dragon NaturallySpeaking User Archive", "File generated by Dragon Naturally Speaking (DNS), a speech recognition and dictation program; contains modifications saved by the program's Acoustic Optimizer; includes corrections that improve speech recognition accuracy for a specific user.", "Windows, ", "['Nuance Dragon NaturallySpeaking Home 13']"], "nws": ["Windows Live Mail Newsgroup File", "File created by Windows Live Mail (and Outlook Express), an email and news client for Windows; stores newsgroup posts and is usually saved alongside .EML files; used for storing local cached copies of posts for newsgroup subscriptions.", "Windows, ", "['Microsoft Windows Live Mail', 'Microsoft Outlook Express']"], "nwp": ["Magentic Wallpaper File", "Wallpaper or desktop background used by Magentic, a free screensaver and desktop background program; wallpaper images are included with the program and may also be downloaded from the Internet.", "Windows, Windows, Mac, Windows, ", "['Perion IncrediMail Magentic']['Now Contact']['Now Contact']['Autodesk Navisworks 2017']"], "nwm": ["Sony NWM Display Screen File", "Static or animated image that can be displayed on Sony's Network Walkman, including the NW-E405, NW-E407, NW-E503, NW-E505, NW-E507, NW-A605, NW-A607, and NW-A608.", "Windows, Mac, ", "[]['Nisus Writer Pro']"], "nwf": ["Navisworks File Set", "CAD project file created by Navisworks, a software package used for engineering design review; saves references to project asset CAD files (such as .DWG files) which make up the file set; used for storing collections of working files together.", "Windows, ", "['Autodesk Navisworks 2017']"], "nwelicense": ["Nisus License", "License referenced by Nisus Writer Pro, a rich text word processing program; contains the license verified by Nisus Writer Pro in order to use the application beyond the trial period; includes the owner name, type of use, and expiration date of the license.", "Mac, ", "['Nisus Writer Pro']"], "nwdb": ["Neat Database File", "An NWDB file is a database file created by Neat 5, a digital document organizer.  It contains one or more images of scanned documents, contacts, or receipts.  NWDB files are automatically created when you scan a document.", "Windows, Mac, ", "['Neat 5']['Neat 4']"], "nwd": ["Navisworks Document", "CAD file created by Navisworks, a program used for reviewing and simulating architectural designs; contains CAD models, camera viewpoints, animations, and user comments; used for presentations and for showing clashes between CAD designs.", "Windows, ", "['Autodesk Navisworks 2017']"], "nwctxt": ["NoteWorthy Composer Text File", "Text file created for NoteWorthy Composer 2, a music composition program; contains code that can be used to generate a NoteWorthy Composer song (.NWC) file; includes page and staff formatting information as well as instruments, lyrics, and notes.", "Windows, ", "[]"], "nwcab": ["Neat Cabinet File", "An NWCAB file is a cabinet file created by Neat 5, a digital document organizer.  It contains a cabinet, which includes information about all the scanned documents, contacts, and receipts in a cabinet.  NWCAB files are automatically created when you start using Neat.", "Windows, Mac, ", "['Neat 5']['Neat 4']"], "nwc": ["NoteWorthy Composer File", "Music composition created with NoteWorthy Composer, a notation authoring tool for Windows; can create, record, edit, print and play back musical scores in pure music notation.", "Windows, Windows, ", "[]['Autodesk Navisworks 2017']"], "nwcp": ["Nisus Clipboard Document", "Document used by Nisus Writer Pro, a rich text word processor; temporarily contains text and images that you add via \"Copy\" or \"Cut;\" referenced when you select \"Paste.\" ", "Mac, ", "['Nisus Writer Pro']"], "nwbak": ["NeatWorks Backup File", "Backup file created by NeatWorks, which is an older version of the digital filing system software, Neat 5; similar to the .NBAK and .NRBAK files; contains a backup of your scanned documents, including contacts and receipts.", "Windows, ", "['Neat 5']"], "nw": ["Node-Webkit App Package", "Package created for node-webkit, an app runtime based on node.js and Chromium and used for running apps written in HTML and JavaScript; contains a compressed app package, which includes app files such as the \"package.json\" file that describes the package and any library files (.DLL files for Windows).", "Windows, Mac, Linux, ", "['node-webkit']['node-webkit']['node-webkit']"], "nvv": ["NVIDIA Vertex Shader File", "File created by NVIDIA Graphics SDK, a graphics development program; contains special effects attributed to objects in a 3D graphics scene such as color, texture, and lighting characteristics; also contains data variables that determine each vertex, which is associated with x, y, and z coordinates that define their location.", "Windows, ", "['NVIDIA Graphics SDK']"], "nvp": ["NVivo for Windows Project", "An NVP file is a project created by the Windows version of NVivo, a qualitative data analysis application used by researchers.  It contains source materials and the user's analysis of the source materials.  NVP files also include project properties such as the project title, description, when the project was created, who can view the project, and the paragraph styles.", "Windows, Mac, ", "['QSR International NVivo for Windows']['QSR International NVivo for Mac']"], "nvl": ["UniChem Results File", "File output by UniChem chemistry analysis software when a job has been completed.", "Linux, ", "[]"], "nvram": ["VMware NVRAM File", "Virtual machine (VM) data file used by VMware virtualization software; stores the state of the VM's BIOS; saved as part of the overall set of files that comprise the VM; should not be manually opened or edited, since the data is handled by the software.", "Windows, Linux, ", "['VMware Workstation 12.5 Pro']['VMware Workstation 12.5 Pro']"], "nvi": ["NVIDIA Driver File", "File used by NVIDIA video card driver update software; saved in an XML format and specifies dependencies and other settings that are required to install and update the driver; included as part of the NVIDIA Graphics Driver software.", "Windows, ", "['NVIDIA Graphics Driver']"], "nvm": ["PlayStation 2 BIOS Configuration File", "Configuration file created for PlayStation 2 BIOS used in game emulation; contains data, such as language and time zone, used to configure a PlayStation 2; automatically created when first running BIOS; should remain in the BIOS folder.", "Windows, Linux, ", "['PCSX2']['PCSX2']"], "nvf": ["Creative Labs NVF Audio File", "Voice audio file recorded using some of Creative Labs' MP3 players; stores audio in Creative's proprietary NOMAD II Voice Format (NVF), which uses G.721 mono Adaptive Differential Pulse-Code Modulation (ADPCM); used for storing voice recordings, such as personal memos, on Creative devices.", "Windows, Mac, Linux, ", "['Apple iTunes']['Apple iTunes']['NVFTools']"], "nvdl": ["NVDL Script", "XML file created in the Namespace-based Validation Dispatching Language (NVDL) format, which is used for validating XML documents that use multiple namespaces; stores a list of actions to take for validation; allows the structure of XML documents to be tested.", "Windows, ", "['SyncRO Soft oXygen XML Editor', 'text editor']"], "nvc": ["NeroVision Express Project File", "Video project saved by NeroVision Express (NVE) video-editing software; may also be a slideshow created by NeroVision Express that can be exported as video file; can be burned to a DVD when completed.", "Windows, Windows, Mac, ", "['Nero Video 2017'][][]"], "nv2": ["NewViews 2 Database File", "Database file created by NewViews 2 (also referred to as NV2), a Windows program used for business accounting; stores company financial information such as payroll, expenses, revenue, and transactions; used for storing and tracking company accounting data.", "Windows, Windows, ", "['Q.W. Page NewViews 2']['Navionics PC App']"], "nva": ["NVA Document", "Document used by NVA Reader, an application used to read select eBook files; contains a book in the NVA format, which is similar to the PDF format with some alterations.", "Windows, Mac, iOS, Android, ", "['NVA Reader']['NVA Reader']['NVA Reader']['NVA Reader']"], "nuv": ["NuppelVideo File", "Video file created in the NuppelVideo format, which is commonly used by the MythTV free home entertainment software; often contains a video recorded from a video stream.", "Windows, Mac, Linux, ", "['File Viewer Plus', 'MPlayer', 'VideoLAN VLC media player']['MythTV', 'MPlayer', 'ShedWorx Smart Converter', 'VideoLAN VLC media player']['MythTV', 'MPlayer', 'mythnuv2mkv', 'VideoLAN VLC media player']"], "nut": ["NUT Video File", "Video file saved in the NUT Open Container Format, a container format similar to .AVI, .ASF, and .MKV; supports several different audio and video codecs as well as subtitle information.", "Windows, Mac, Linux, iOS, Windows, Mac, Linux, ", "['MPlayer', 'FFmpeg']['MPlayer', 'FFmpeg', 'Eltima Elmedia Player']['MPlayer', 'FFmpeg']['iFunia VideoConvert for iPad']['Squirrel']['Squirrel']['Squirrel']"], "nuspec": ["NuGet Specification File", "File used by NuGet, a Microsoft Visual Studio extension used for managing third-party libraries for .NET projects; saved in an XML format and contains information that is used to build a NuGet package (.NUPKG file), which subsequently can be added as a Visual Studio project library.", "Windows, ", "['NuGet']"], "nv": ["NewViews Database File", "Database file created by NewViews for DOS (also referred to as NV1), a DOS program used for business accounting; can include payroll, tax, expense, income, and other accounting information; used for storing and tracking company finances.", "Windows, Windows, Mac, ", "['Q.W. Page NewViews for DOS']['MAME', 'ExtraMAME']['MacMAME', 'MAME OS X']"], "nuproj": ["NuGet Build Project", "A NUPROJ file is a project created by Visual Studio with the NuBuild Project System extension installed.  It contains a project, which includes build configuration properties.  NUPROJ files are used to build .NUPKG NuGet packages from .NUSPEC files and manage them.", "Windows, ", "['Microsoft Visual Studio with NuBuild Project System']"], "nus3bank": ["Super Smash Bros. Audio Bank File", "An NUS3BANK file is an audio bank used by Super Smash Bros., a Nintendo game for 3DS and Wii U that features popular video game characters.  It contains a collection of audio files referenced during gameplay such as songs or character voices.", "Windows, ", "['Sm4shExplorer']"], "nupkg": ["NuGet Package", "File used by NuGet, an extension for Microsoft Visual Studio that provides an interface for managing third-party libraries for .NET projects; contains packaged source code that can be used for developing program components.", "Windows, Mac, ", "['Microsoft Visual Studio with NuGet extension']['Intego NetUpdate']"], "nud": ["Now Up-To-Date Calendar File", "Calendar created by Now Up-To-Date, an application that organizes calendar activities; contains events separated into day, week, month, and year views; includes event information such as the title, date, time, priority, and type.", "Windows, Mac, ", "['Now Up-To-Date']['Now Up-To-Date']"], "nts": ["Lotus Notes Traveler Server Config File", "Configuration file used by Lotus Notes Traveler, a program that syncs Lotus Notes data with desktop and mobile devices; contains information required to connect to the Lotus Notes Traveler server; saved in an XML format and includes the user ID, host name, port numbers, servlet path, and other data.", "Windows, ", "[]"], "ntx": ["theWord Encrypted New Testament Text Module", "File used by theWord Bible software; contains a copy of the New Testament and incorporates encryption, unlike the plain text formatting used by theWord's .NT format; helps distribution by protecting digital copies of the New Testament.", "Windows, Windows, ", "['theWord']['dBase']"], "nup": ["Smart Security Update File", "A NUP file is an update file used for updating ESET Smart Security, a personal firewall, antispam, antivirus, and antispyware program.  It contains the update name, software version and build, category, date, file size, and the update module data.  NUP files are also used by other ESET products, including Cybersecurity for Mac.", "Windows, Mac, ", "['ESET Internet Security']['ESET Cybersecurity for Mac']"], "numbers-tef": ["Numbers iCloud Document", "Spreadsheet file created by Numbers, Apple's spreadsheet program included in the iWork suite; used as the save format when the user chooses to save the spreadsheet to iCloud.", "Mac, iOS, ", "['Apple Numbers 4']['Apple Numbers']"], "numbers": ["Numbers Spreadsheet File", "A NUMBERS file is a spreadsheet created by Apple Numbers, a spreadsheet program bundled with macOS.  It contains a spreadsheet with data organized into rows and columns.  It may also include tables, graphs, images, formulas, and other types of data.  NUMBERS files can be created from scratch or from a template.", "Mac, Web, iOS, ", "['Apple Numbers 4']['Apple Numbers 4']['Apple Numbers']"], "ntrk": ["Pacific FIghters Online Track File", "File created by Pacific Fighters, a flight simulator game; contains an \"online\" flight mission recording; created using the \"Quick Record\" feature or by clicking the Start Recording button on the game menu during a mission.", "Windows, ", "[]"], "ntp": ["Natron Project File", "Project created by Natron, a node-based compositor used to create visual effects for film and television; contains project data, which includes nodes, output format, number of views, frame rate, and other project settings.", "Windows, Mac, Linux, ", "['Natron']['Natron']['Natron']"], "ntn": ["NOTION Song File", "Musical score composed with NOTION; saves music notation in MIDI format, which can be played back in NOTION using instrument samples from the London Symphony Orchestra.", "Windows, Mac, ", "[][]"], "nth": ["Nokia Series 40 Theme File", "Theme use for customizing the look and feel of a Nokia Series 40 mobile phone; includes background images, icons, ringtones, and other custom options; created using the Nokia Series 40 Theme Studio application.", "Windows, ", "[]"], "ntfs": ["NTFS Partition File", "Disk partition file that represents data stored as an NTFS file system; contains files and folders as they would be stored by an NTFS disk image or operating system; can be opened by 7-Zip.", "Windows, ", "['7-Zip']"], "ntf": ["Lotus Note Template", "File used by Lotus Notes, a business collaboration software program often used by large enterprises; created by Lotus Notes developers and used for storing custom Lotus Notes modules that can integrate into the larger Lotus Notes infrastructure.", "Windows, Windows, ", "['IBM Lotus Notes']['NEATO MediaFACE']"], "ntc": ["Camera Control Pro Custom Curves File", "Curves file used by Nikon Camera Control Pro, a program used to touch-up pictures taken by Nikon digital cameras; contains color modifications that can be applied to photos and other images; often used to store predefined adjustments that correct common shooting errors, such as overexposed or underexposed pictures.", "Windows, Mac, ", "['Nikon Camera Control Pro']['Nikon Camera Control Pro']"], "nt": ["Windows NT Startup File", "System file used by Microsoft Windows NT and later for the system boot process; contains settings and scripts that load resources for the operating system; must not be modified, moved, or deleted or the computer may not be able to start up.", "Windows, Windows, ", "['Microsoft Windows']['theWord']"], "nsx": ["AppStudio Project", "Project created and used by AppStudio, an IDE used to create desktop, Android, and iOS applications; stores project data, such as project language, properties, and functions.", "Windows, Mac, ", "['NS BASIC AppStudio']['NS BASIC AppStudio']"], "nsv": ["Nullsoft Streaming Video File", "Streaming video container format developed by Nullsoft; used for streaming video clips over the Internet, such as video feeds for Winamp TV; supports multiple types of compression and can include multiple audio tracks, subtitles, and other data.", "Windows, Mac, Linux, ", "['File Viewer Plus', 'Nullsoft Winamp', 'VideoLAN VLC media player']['VideoLAN VLC media player']['VideoLAN VLC media player']"], "nst": ["Outlook Connector for Notes File", "An NST file is a storage file created by Outlook Connector for IBM Lotus Domino, an add-in for Microsoft Outlook that allows users to access Lotus Notes through Outlook.  It contains Notes messages and other data for access offline that is stored locally on your computer.  NST files are similar to Outlook offline .OST files.", "Windows, Windows, ", "['Microsoft Outlook 2016']['Nullsoft Winamp']"], "nss": ["Magentic Screensaver File", "Screensaver file used by Magentic, a free desktop background and screensaver program; includes images and animations that run when the computer has been idle for a set amount of time; may be included with the Magentic software or downloaded from the Internet.", "Windows, ", "['Perion IncrediMail Magentic']"], "nsq": ["NScheduler Data File", "Data file used by NPrinting, an application used to create, generate, and distribute reports from data in the QlikView Business Intelligence application; contains data that enables NPrinting to execute Schedules, Jobs and Tasks; also stores recipient and filter data so that NPrinting can distribute the output to the appropriate users.", "Windows, ", "['QlikView NPrinting']"], "nsl": ["nsL Script", "An NSL file is a text file written in nsLanguage (nsL), a high-level language used to write Nullsoft Scriptable Install System (NSIS) installation wizards.  It contains nsL code used to write and build NSIS installers. ", "Windows, ", "['File Viewer Plus', 'nsL Assembler for NSIS']"], "nsi": ["NSIS Script", "Text file written using NSIS (Nullsoft Scriptable Install System) script, a language used for declaring the logic and tasks for software installers; often references files and folders to install as well as Windows registry actions.", "Windows, ", "['File Viewer Plus', 'Nullsoft NSIS', 'Eclipse with EclipseNSIS plug-in', 'spaceblue Venis IX', 'HM NIS EDIT']"], "nsh": ["NSIS Header File", "Installer file used by NSIS (Nullsoft Scriptable Install System), a program used for creating Windows installers; saves header information that can be included across all .NSI installer scripts; helps setup common environment conditions for an installation.", "Windows, ", "['File Viewer Plus', 'Nullsoft NSIS', 'Eclipse with EclipseNSIS plug-in', 'spaceblue Venis IX', 'HM NIS EDIT', 'text editor']"], "nsf": ["NES Sound Format File", "Music file from an original Nintendo (NES/Famicom) game; allows music from Nintendo games to be played without loading the actual game; can be opened by a variety of NSF players.", "Windows, Mac, Linux, Windows, ", "['DeliPlayer', 'VirtuaNES', 'Audio Overload', 'Nullsoft Winamp']['Audio Overload', 'Nestopia']['Audio Overload', 'XMMS with nsf-xmms plugin', 'FCEUX', 'Audacious']['IBM Lotus Notes', 'IBM Domino', 'Stellar Phoenix NSF to PST Converter', 'Stellar Phoenix Lotus Notes Recovery']"], "nsbca": ["Nintendo DS Model Animation File", "Contains animation instructions for a Nintendo DS model (.NSBMD file); provides three-dimensional movement for the model, allowing it to be viewed at different angles; typically has the same filename as the corresponding \".nsbmd\" file.", "Windows, ", "['MKDS Course Modifier']"], "nscr": ["Nintendo DS Title Screen File", "File used by Nintendo DS games such as Mario Kart DS; specifies how image tiles stored in an .NCGR file are arranged to makeup the title screen graphic for the game; stores location and rotation data for each tile.", "Windows, ", "['MKDS Course Modifier', 'Crystal Tile 2']"], "nsbva": ["Nintendo DS Visibility Animation File", "Animation file used by Nintendo DS games, such as New Super Mario Bros.; contains node visibility data that determines what parts of the .NSBMD model appear.", "Windows, ", "['MKDS Course Modifier']"], "nsbtx": ["Nintendo DS Model Texture File", "Texture file that can be applied to a Nintendo DS model (.NSBMD file); contains textures saved in a bitmap image format; can be mapped onto a 3D model to alter the appearance of the model's surface.", "Windows, ", "['MKDS Course Modifier']"], "nsbta": ["Nintendo DS Texture Animation File", "File used by Nintendo DS video games; contains data that specifies texture animation, such as a boost pad animation on a Super Mario Kart race track; enables the texture appearance to change without affecting the 3D geometry of the base model.", "Windows, ", "['MKDS Course Modifier']"], "nsbmd": ["Nintendo DS Model File", "3D model used by a Nintendo DS program; may contain a model block (defined by \"MDL0\") and a texture block (defined by \"TEX0\"); may also reference a .NSBTX file that contains textures used by the model.", "Windows, ", "['MKDS Course Modifier']"], "nsa": ["Nullsoft Streaming Audio File", "Streaming audio container format developed by Nullsoft; used for streaming audio clips, such as song demos over the Internet; can be played with Winamp.", "Windows, ", "['Nullsoft Winamp']"], "ns4": ["Lotus Notes 4 Database", "Database file created by Lotus Notes 4.x; contain a list of contacts, text notes, e-mail messages, calendars, and other information; stores structured data for personal and business organizational management.", "Windows, Mac, ", "[][]"], "ns2": ["Lotus Notes 2 Database", "Data file created by Lotus Notes 2.x; contains contact list, notebook, calendar, and other information; used to store contact information and to collaborate with other Lotus Notes users.", "Windows, Mac, ", "[][]"], "ns3": ["Lotus Notes 3 Database", "Database file created by Lotus Notes 3.x; contains contact information, a text notes, and calendar as well as other information; used to store structured information for collaboration with other users and for exchanging data back and forth; can be stored on a central server, which keeps users' Notes databases up to date.", "Windows, Mac, ", "[][]"], "ns1": ["Nestopia Save State", "Save state created and used by Nestopia, a Nintendo Entertainment System (NES) emulator; stores a saved game state that allows you to resume your game from the save point point at a later time.", "Windows, ", "['Nestopia']"], "nrx": ["Neat Receipt Folder File", "Receipt folder file created by NeatWorks, a digital document organizing application; contains an exported copy of a Neat receipt folder of scanned receipts that can be shared between Neat users; replaced by Neat 5's .NDX extension.", "Windows, Mac, ", "['Neat 5']['Neat 4']"], "nrw": ["Nikon Raw Image File", "An NRW file is a raw image file produced by high-end Nikon COOLPIX and digital SLR cameras.  It saves image data in an uncompressed format that can be processed on the camera or on a computer after the image is captured. NRF files are similar to .NEF files, but are designed to support Windows Imaging Component (WIC) functions.", "Windows, Mac, iOS, Android, ", "['File Viewer Plus', 'Adobe Photoshop Elements 15', 'Nikon ViewNX', 'Corel PaintShop Pro X9', 'Google Picasa', 'Microsoft Windows Photo Gallery', 'Adobe Photoshop CC 2017']['Adobe Photoshop Elements 15', 'Nikon ViewNX', 'Google Picasa', 'MacPhun ColorStrokes', 'Adobe Photoshop CC 2017']['Adobe Photoshop Express']['File Viewer for Android', 'Adobe Photoshop Express']"], "nru": ["Nero UDF CD-ROM Compilation", "File used by Nero Burning ROM, a disc burning program included with Nero Multimedia Suite; contains a CD burning project and the data required to burn the disc in the Universal Disk Format (UDF); used for authoring CDs and DVDs.", "Windows, ", "['Nero 2017']"], "nrt": ["Nokia Ringtone", "Ringtone format used by Nokia cell phones; saves melodies as MIDI data, similar to a .MID file; can be converted to other more common formats using the Nokia Sound Converter included with Nokia PC Suite.", "Windows, Windows, Mac, ", "[]['Neat 5']['Neat 4']"], "nrmlib": ["Neat Cabinet File", "Cabinet file created by Neat 5, a digital filing system; contains a library of your scanned documents; used only by the Mac version of Neat and not the Windows version of the software.", "Mac, ", "['Neat 4']"], "nrs": ["NovaBACKUP Restore Script", "Script used by NovaBACKUP, a backup and restore application for Windows; saves a list of instructions that restore files created in a previous backup. ", "Windows, ", "['NovaStor NovaBACKUP Professional 17']"], "nsr": ["Nessus Security Report File", "Text report file generated by Nessus, a security application used for conducting network vulnerability scans; saves summary information for a security scan and contains less verbose information than an .NBE report file; used for network security audits.", "Windows, Mac, Linux, ", "['Tenable Network Security Nessus']['Tenable Network Security Nessus']['Tenable Network Security Nessus']"], "nrm": ["Nero Mixed Mode CD Compilation", "File created by Nero Burning ROM, a program included with the Nero Multimedia Suite; contains the data required to burn a CD that can store both application data as well as music that can be played on a CD player; allows users to create dual-purpose CDs.", "Windows, ", "['Nero 2017']"], "nrl": ["Autonomy Interwoven Link File", "File used by Interwoven content management system (CMS) solutions, which organize company-wide digital resources and help to manage work flow; contains a link reference to a resource within the CMS; saved in text format with a library name, document, and version number.", "Windows, ", "[]"], "nri": ["Nero ISO CD Compilation File", "Compilation of files selected to be burned on a CD-ROM; contains a list of references to files and their locations on the hard disk; does not contain the actual files themselves; used by Nero when burning a CD.", "Windows, Linux, ", "['Nero Burning ROM 2017']['Nero Linux']"], "nrg": ["Nero CD/DVD Image File", "CD or DVD disc image created with Nero disc authoring software; may be an exact copy of a CD/DVD or may contain a collection of files that can mounted as a disk; can be used to make copies or backups of discs or important data.", "Windows, Mac, Linux, ", "['Nero 2017', 'H+H Software Virtual CD', 'EZB Systems UltraISO', 'Smart Projects IsoBuster', 'WinMount International WinMount', 'Lightning UK! ImgBurn', 'PowerISO', 'DT Soft DAEMON Tools', 'Nrg2Iso']['Roxio Toast 15', 'Roxio Popcorn']['Nero Linux', 'Nrg2Iso', 'nrg4iso']"], "nrf": ["Neat Document Folder File", "Document folder file created by NeatWorks, a digital document organizing application; contains an exported copy of a Neat document folder that can be shared between Neat users; replaced by the .NDX extension when Neat 5 was released.", "Windows, Mac, ", "['Neat 5']['Neat 4']"], "nrd": ["Nero DVD-Video Compilation File", "File created by Nero Multimedia Suite, a multimedia software package used for video editing, burning, and backup; includes data required to burn a DVD, including audio and video data; used for saving DVD compilations.", "Windows, ", "['Nero 2017']"], "npy": ["Python NumPy Array File", "An NPY file is a NumPy array file created by the Python software package with the NumPy library installed.  It contains an array saved in the NumPy (NPY) file format.  NPY files store all the information required to reconstruct an array on any computer, which includes dtype and shape information.", "Windows, Mac, Linux, ", "['Python Software Foundation Python']['Python Software Foundation Python']['Python Software Foundation Python']"], "nrc": ["Nero Disc Compilation File", "Disc file created by Nero Burning ROM, a disc authoring utility included with the Nero Multimedia Suite; contains references to files selected to burn to the disc; commonly used for burning DVD movie discs.", "Windows, ", "['Nero Burning ROM 2017']"], "nrbak": ["NeatReceipts Backup File", "Backup file created by NeatReceipts, a tool in NeatWorks, which is an older version of the digital filing system software, Neat 5; contains a backup of your scanned documents, including receipts and business cards; similar to the .NBAK and .NWBAK files.", "Windows, ", "['Neat 5']"], "nrb": ["Nero CD-ROM Boot Compilation", "CD-ROM disc compilation used by Nero Burning ROM, a program included with the Nero Multimedia Suite; stores the data required to create a bootable CD-ROM; used for burning startup discs that run before the operating system is loaded.", "Windows, ", "['Nero 2017']"], "nra": ["Nero Audio Compilation", "List of audio files compiled with Nero disc burning software; contains a playlist of tracks that can be burned to an audio CD; includes references to audio files, but does not contain actual audio data.", "Windows, Linux, ", "['Nero 2017']['Nero Linux']"], "nqc": ["Not Quite C Source Code File", "Source code file written in the Not Quite C (NQC), a programming language used to program LEGO MINDSTORMS products such as the RCX, CyberMaster, and Scout; contains instructions that control the motion and other actions of a robot's bricks.", "Windows, Mac, Linux, ", "['Bricx Command Center', 'NQC']['NQC']['NQC']"], "npr": ["Nuendo Project File", "Project file created by Nuendo, a program used to record, edit, and mix audio projects; stores project data, including audio track information, loops, effects, and postproduction settings.", "Windows, Mac, ", "['Steinberg Nuendo']['Steinberg Nuendo']"], "nps": ["Natron Node Presets File", "Presets file created and used by Natron, a node-based compositor that allows users to create visual effects for film and television; stores parameters for a node used in the project.", "Windows, Mac, Linux, Windows, ", "['Natron']['Natron']['Natron']['NTI Backup Now']"], "npp": ["Art Explosion Publisher Pro Document", "File created by Art Explosion Publisher Pro, a program used to create publications, such as flyers, greeting cards, newsletters, and brochures; contains formatted text, graphics, and page layout settings.", "Windows, ", "[]"], "npl": ["Nokia Playlist File", "Playlist of media files created with Nokia Multimedia Player, a media playback program included in the Nokia PC Suite; may include references to audio and video files, as well as multimedia message files, but does not contain the actual referenced files themselves.", "Windows, Windows, Windows, Mac, ", "[]['Xilinx ISE Design Suite']['Steinberg Cubase', 'Steinberg Nuendo']['Steinberg Cubase', 'Steinberg Nuendo']"], "npf": ["NTI Partition File", "Backup file created by NTI Backup Now, NTI Backup NOW!, and NTI DriveBackup!; contains a backup of a full hard drive or a hard drive partition; can be used for creating backup discs; enables users to restore drive backups in the event of data loss.", "Windows, ", "['NTI Backup Now', 'NTI DriveBackup!']"], "npa": ["Steins;Gate Archive", "Archive format used by Steins;Gate, a visual Japanese novel video game; contains game resources, such as .JPG and .PNG image files that make up the background or audio files referenced for character voices or the game's soundtrack.", "Windows, ", "['5pb. and Nitroplus Steins;Gate']"], "npfx": ["Norton Internet Security Firewall Settings File", "Settings file created by the firewall program included with Symantec Norton Internet Security for Mac; stores firewall connection blocking settings such as IP, port, service, and application filters; used for migrating firewall settings from one computer to another.", "Mac, ", "['Symantec Norton Internet Security 5']"], "np": ["Portfolio NetPublish File", "Project created with Portfolio NetPublish; contains a catalog of images that can be published to the Web; includes references to the images, executable files, compiled libraries, and JavaScript files which are all used to create the interface for searching and browsing the catalog of images on the Web.", "Windows, Mac, ", "[][]"], "nozzlelibrary": ["Painter Nozzle Library", "Collection of nozzles created and used by Corel Painter, a drawing application used to create digital artwork; includes Gravel, Dirt, Kaleidoscope, and Tree effects.", "Windows, Mac, ", "['Corel Painter 2017']['Corel Painter 2017']"], "now": ["Readme File", "Text document with important information about a program or software update; may include installation instructions or a list of new features in the update; often named \"readme.now.\"", "Windows, Mac, ", "['text editor']['text editor']"], "notes": ["Memento Notes File", "Text file that stores electronic post-it notes created with Memento; used for creating simple reminders, such as dates and times of events; appears on the computer's desktop as a visual reminder.", "Windows, ", "[]"], "notebook": ["SMART Notebook File", "A NOTEBOOK file is a notebook created by SMART Notebook software, which allows teachers to create dynamic classroom lecture materials.  It may contain notes, diagrams, images, audio, and video.  NOTEBOOK files are used for storing and sharing digital lesson notes with teachers and students.", "Windows, Mac, Linux, ", "['SMART Technologies Notebook', 'SMART Technologies Notebook Express', 'MimioStudio']['SMART Technologies Notebook', 'SMART Technologies Notebook Express', 'MimioStudio']['SMART Technologies Notebook', 'SMART Technologies Notebook Express', 'MimioStudio']"], "note": ["Notessimo Composition", "Song file created by Notessimo, a Web browser-based Flash application that allows users to create a play musical compositions; can be saved from the browser to the user's desktop and then loaded back through the File → Load menu option in the game; supports multiple tracks and instruments.", "Web, ", "['Failsafe Games Notessimo']"], "not": ["Notation File", "Musical score that contains MIDI performance data and notation data; saved in a proprietary format that may be opened with Notation Software programs, including Musician and Composer; can be exported to a more standard format such as .MID or .KAR after being opened.", "Windows, Windows, Mac, ", "['Notation Musician', 'Notation Composer']['MakeMusic Finale']['MakeMusic Finale']"], "nomedia": ["Android No Media File", "A NOMEDIA file is a file stored on an Android mobile device, or on an external storage card connected to an Android device.  It marks its enclosing folder as having no multimedia data so that the folder will not be scanned and indexed by multimedia players.  NOMEDIA files have no filename prefix and is named .nomedia.", "Android, ", "['StudioKUMA .nomedia Manager', 'Droida Nomedia']"], "nol": ["Nokia Operator Logo File", "Mobile phone operator image format used by Nokia phone models such as Nokia s40 and s60; contains a raster image used for the background logo of the phone screen. ", "Windows, ", "['XnView']"], "nod": ["NetObjects Fusion File", " Web page created by NetObjects Fusion, a web development program; contains text, images, tables, and other content to be displayed as a webpage; user can customize webpage to create their own unique website.", "Windows, ", "['NetObjects Fusion']"], "nnt": ["Eudora Address Book File", "Address book created and used by Eudora, an email client; stores contacts, such as names, nicknames, and email addresses.", "Windows, Mac, ", "['QUALCOMM Eudora']['QUALCOMM Eudora']"], "npt": ["Portfolio NetPublish Template", "Precursor template for creating a Portfolio NetPublish project; includes a pre-designed Web interface and executable scripts that can be published to the Web; contains customizable sections, usually denoted by [[...]], for inserting custom code and image references.", "Windows, Mac, ", "[][]"], "nnp": ["ANNI Neural Network Portfolio File", "File created by Advanced Neural Network Investing (ANNI), a financial investing software used to track and analyze investments; contains data for an entire portfolio of investment files; used to monitor comprehensive personal investments, such as stocks, mutual funds, futures, and others.", "Windows, ", "[]"], "nni": ["ANNI Neural Network Investing File", "File created by ANNI (Advanced Neural Network Investing), a financial analysis tool used to track investments; contains data for a static neural network; may also include investment history, such as transactions and stock prices over time; used for tracking stocks, indexes, mutual funds, futures, and other individual investments.", "Windows, ", "['Oolution Technologies ANNI']"], "nn": ["Nero CD File List", "List of files to be burned on a CD using the Nero disc authoring program; can be used to burn multiple discs with the same data; contains references to the files, but not the actual files themselves.", "Windows, ", "['Nero 2017']"], "nmsv": ["Native Instruments Massive Sound File", "Sound file created by Native Instruments Massive, a synthesizer application (DAW) that enables you to create and edit \"massive\" sounds such as deep, punchy bass lines; contains a pre-recorded or user-created sound with different custom settings for features such as filters, amps, fx, noise, and oscillators.", "Windows, Mac, ", "['Native Instruments Massive']['Native Instruments Massive']"], "nmp": ["NewsMaker Project File", "File created by NewsMaker, a program used by students to create news stories; saved in a plain text XML format and contains a listing of news stories files (.STY extension) and video clips, which store the student's story recorded using a webcam in the software.", "Windows, Mac, ", "[][]"], "nmc": ["ArcGIS Explorer Map Content File", "Packaged map content file created by ArcGIS Explorer, a free GIS application developed by ESRI; may contain various elements of a map, including notes, folders, views, links, image overlays, GIS service layers, KML layers, raster layers, feature layers, and layer packages; used for exporting map content and adding it to another map that is open in ArcGIS Explorer.", "Windows, ", "['ESRI ArcGIS Explorer']"], "nml": ["Traktor Collection File", "File used by Traktor, a DJ mixing application used for creating audio mixes; saves the user's playlist in an XML format; includes the list of artists, releases, labels, genres, tracks, samples, and remix sets; does not include any actual audio sample file, but instead includes references to them.", "Windows, Mac, Windows, ", "['Native Instruments Traktor']['Native Instruments Traktor']['NSMBe']"], "nmind": ["NovaMind Mind Map File", "Visual diagram created with NovaMind mind mapping software; can be used for brainstorming, creating presentations, building site maps, or for educational purposes; allows diagrams and flowcharts to be created using artistic graphics and custom layouts.", "Windows, Mac, ", "[][]"], "nmf": ["ArcGIS Explorer Map File", "Map file created by ArcGIS Explorer, a free mapping program developed by ESRI; may store terrain, coordinates, points of interest, drawn shapes, 3D environment effects, and other map objects; can also store directions, routes, and measurements; used for saving and loading custom maps as well as sharing maps online.", "Windows, Mac, ", "['ESRI ArcGIS Explorer', 'ESRI ArcGIS for Desktop', 'Microsoft Internet Explorer with ArcGIS Explorer plug-in', 'Mozilla Firefox with ArcGIS Explorer plug-in']['Mozilla Firefox with ArcGIS Explorer plug-in']"], "nmea": ["NMEA Data File", "GPS file that contains data in the NMEA (National Marine Electronics Association) format; stores sentences in ASCII text that consist of latitude, longitude, and time values.", "Web, ", "['NMEA to KML converter']"], "nmbtemplate": ["Numbers Spreadsheet Template", "Spreadsheet template created by Numbers, an Apple iWork spreadsheet application; saves the layout and cell formatting of the one or more sheets in the workbook; often used to pre-populate the styles and equations required for logging work hours, tracking tasks, and preparing budgets.", "Mac, ", "['Apple Numbers 4']"], "nmap": ["NaviComputer Map File", "Map format used by NaviComputer, a map program for the Windows Mobile operating system; can be created with NaviMapper, a Windows program included with the NaviComputer download.", "Windows, Mac, Linux, ", "['NaviComputer', 'Mobile Atlas Creator']['Mobile Atlas Creator']['Mobile Atlas Creator']"], "nma": ["NMEA Data File", "An NMA file is a data file saved in the NMEA (National Marine Electronics Association) format.  It contains sentences in ASCII text that consist of latitude, longitude, and time values.  NMA files are more commonly saved as .NMEA files.", "Windows, Mac, Linux, Web, ", "['GPSBabel']['GPSBabel']['GPSBabel']['NMEA to KML converter']"], "nm3": ["Navitel 5 Map File", "Map file used by Navitel navigation software 5.0 or later; replaces the .NM2 file used by previous versions of Navitel Navigator; contains map data such as roads, landmarks, GPS coordinates, natural geography, and other map features.", "iOS, Android, Windows Phone, ", "['Navitel Navigator']['Navitel Navigator']['Navitel Navigator']"], "nm2": ["Navitel Map File", "Map file used by Navitel navigation software; contains a map of a specific area, including roads, landmarks, GPS coordinates, and other map data.", "iOS, Android, Windows Phone, ", "['Navitel Navigator']['Navitel Navigator']['Navitel Navigator']"], "nm": ["Space Engine Nebula Model File", "File used by Space Engine, a 3D space simulation engine; saves a model of a nebula, which is a gas cloud in space; used for rendering the nebula during a space simulation; located in the /cache/models/nebulae/ directory of the Space Engine installation.", "Windows, ", "['Space Engine']"], "nlvm": ["NoLimits Virtual Machine File", "Virtual Machine file used by NoLimits 2 Roller Coaster Simulation (NL2), a game that enables users to experience virtual roller coasters; contains a scripting language class or other resources referenced by an NL2 script, which can be run by the NoLimits Virtual Machine (NLVM) script engine for NL2.", "Windows, ", "['Mad Data NoLimits Rollercoaster Simulation 2']"], "nltrack": ["NoLimits Roller Coaster Track File", "Stores the track data for a roller coaster created with NoLimits, a roller coaster simulation program; includes 3D track models, track and coaster materials, and physics data, such as friction, acceleration, and deceleration information.", "Windows, ", "['Mad Data NoLimits Rollercoaster Simulation 2']"], "nls": ["NetLogo Source File", "Source code file written for NetLogo, a program used for creating agent-based models that simulate complex natural and social phenomena; stores source code that drives the model when run; written in the NetLogo language.", "Windows, Mac, Linux, Windows, ", "['NetLogo', 'text editor']['NetLogo', 'text editor']['text editor']['Microsoft Windows']"], "nlpx": ["NoLimits Package", "Game data file used by NoLimits, a rollercoaster simulation game; saved within the /data/ directory of the game installation and uses the filename convention data####.nlpx, where #### is a number.", "Windows, Mac, ", "['Mad Data NoLimits Rollercoaster Simulation 2']['Mad Data NoLimits Rollercoaster Simulation 2']"], "nlogo3d": ["NetLogo 3D Model File", "3D model created by NetLogo, a program used for modeling natural and social phenomena, often in academic and research environments; saves the starting parameters of the simulation as well as interactive buttons and source code used to set up and run the model in the 3D space.", "Windows, Mac, Linux, ", "['NetLogo']['NetLogo']['NetLogo']"], "nlogo": ["NetLogo Model File", "Model created by NetLogo, a program used for modeling and simulating natural and social phenomena; saves the initial parameters of the simulation as well as source code and interactive buttons that drive the simulation.", "Windows, Mac, Linux, ", "['NetLogo']['NetLogo']['NetLogo']"], "nl": ["Note Ledge File", "Note file created by Kdan Mobile NoteLedge, a note management application for mobile devices; contains notes consisting of text, drawings, video or audio; includes date and location when the file was a created; can be exported as a .PDF or .JPEG for easy sharing.", "iOS, Android, Windows Phone, Windows, Mac, Linux, ", "['Kdan Mobile NoteLedge']['Kdan Mobile NoteLedge'][]['Natron']['Natron']['Natron']"], "nlm": ["Nokia Logo File", "Logo graphic used by some older Nokia mobile phones; stores a monochrome bitmap suitable for the phone's low resolution screen; used for displaying different logos when the phone starts up or when showing different status screens.", "Windows, ", "['LogoManager Classic', 'IrfanView']"], "nlelem": ["NoLimits Track Element File", "File used by NoLimits, a roller coaster simulation game; stores the model structure and associated data for a roller coaster track segment, such as a loop, roll, or spiral; used for constructing NoLimits tracks (.NLTRACK files).", "Windows, ", "['Mad Data NoLimits Rollercoaster Simulation 2']"], "nl2script": ["NoLimits 2 Script File", "Script description file used by NoLimits 2 Roller Coaster Simulation (NL2), a roller coaster simulator; contains a script, which includes relative paths to classes, the preview picture, and other resource files; can be run by the NoLimits Virtual Machine (NLVM) script engine for NL2.", "Windows, ", "['Mad Data NoLimits Rollercoaster Simulation 2']"], "nkx": ["Kontakt Monolith Container File", "Audio file used by Kontakt, a professional audio sampling application; saves a \"monolith,\" which combines the audio samples and the patch information into a single file; enables the data to be stored together instead of in separate files, which can cause file path referencing problems.", "Windows, Mac, ", "['Native Instruments Kontakt']['Native Instruments Kontakt']"], "nks": ["Kontakt Monolith Container", "Audio file used by Kontakt, an application used for audio sampling; stores a \"monolith,\" which combines audio samples and patch information into a single file; enables audio engineers to manage sampling information more easily.", "Windows, Mac, ", "['Native Instruments Kontakt']['Native Instruments Kontakt']"], "nkp": ["Kontakt Presets File", "Audio settings file created by Kontakt, a professional audio sampling program; stores preset values for an instrument and may include settings such as resonance, reverb, and noise; enables users to save and recall specific settings.", "Windows, Mac, ", "['Native Instruments Kontakt']['Native Instruments Kontakt']"], "nkm": ["Kontakt Multi Instrument File", "Audio file used by Kontakt, a professional audio sampling application; saves multiple software instruments and their presets; allows the instruments to be saved together whereas an .NKI file allows only one instrument to be saved.", "Windows, Mac, Windows, ", "['Native Instruments Kontakt']['Native Instruments Kontakt']['MKDS Course Modifier']"], "nki": ["KONTAKT Instrument File", "Software instrument format used by Kontakt, an audio sampling application; contains samples of an instrument or other sounds that were pre-recorded for use in the sampler; can be modified with effects and other presets to make custom sounds.", "Windows, Mac, ", "['Native Instruments KONTAKT', 'nkitool']['Native Instruments KONTAKT']"], "njx": ["NJStar Document", "Text document created by NJStar, a word processor used for authoring Chinese, Japanese, and Korean documents; supports non-English character sets as well as instant translation between English and Chinese, Japanese, and Korean languages.", "Windows, ", "['NJStar Chinese WP', 'NJStar Japanese WP']"], "nji": ["Nero Job Information File", "File used by BackItUp (formerly BackItUp & Burn), a program used to create and restore backups; contains information about a backup job, including the job name, backup name, and backup schedule; used to schedule backup jobs.", "Windows, ", "['Nero BackItUp 2017']"], "nkc": ["Kontakt Library Data File", "File used by Kontakt audio sampling software; used along with a corresponding .NKX file, which contains the sample and patch information; uses the same filename prefix as the NKX file but is much smaller in size; used as part of the sample library.", "Windows, Mac, ", "['Native Instruments Kontakt']['Native Instruments Kontakt']"], "nkb": ["Kontakt Audio Bank", "Audio file used by Kontakt, an audio sampling application; contains a library, or \"bank,\" of audio samples and instruments that can be imported and used by the program; enables custom sounds to be shared and sold by third party vendors.", "Windows, Mac, ", "['Native Instruments Kontakt']['Native Instruments Kontakt']"], "nk2": ["Outlook 2002 Nickname File", "Contains the nickname for an Outlook user that is a associated with a user profile; allows a user to create a nickname and assign the name to an e-mail address.", "Windows, ", "['Microsoft Outlook 2016']"], "nk": ["NUKE Script", "Script written for NUKE or NUKEX, a program used for creating high-quality film and animations; saves a set of instructions for composing an animation; can include node creation and steps for motion and effects; can be visually edited in the NUKE software or hand coded in a text editor.", "Windows, ", "['The Foundry NUKE']"], "njb": ["Nikon Photo Index File", "Contains an index of photos taken with a Nikon digital camera; saved on the camera's SD memory card in the MISC folder; typically named \"order.njb\" by default.", "Windows, Mac, ", "[][]"], "nitf": ["National Imagery Transmission Format File", "Imaging data format used by the U.S. government and military for transmitting documents; may contain a combination of text, graphics, and metadata in a single file; also supports multiple layers; often used for satellite and aerial photos.", "Windows, Mac, Linux, ", "['ITT Visual Information Solutions ENVI', 'ERDAS IMAGINE', 'Newera Graphics Converter Pro', 'XnViewMP', 'GDAL']['XnViewMP', 'GDAL']['XnViewMP', 'GDAL']"], "nim": ["Nim Source Code File", "Source code file written in Nim, (formerly known as Nimrod) a compiled, statically typed programming language; can be opened with any text editor but must be compiled using the Nim compiler before running as a program.\r\n", "Windows, Mac, Linux, ", "['Nim', 'text editor']['Nim', 'text editor']['Nim', 'text editor']"], "nick": ["Outlook 2000 Nickname File", "Stores a nickname for an Outlook user, which is linked to a complete user profile; enables a user to enter a string of characters and assign it as a nickname for an e-mail address.", "Windows, ", "[]"], "nib": ["Interface Builder User Interface File", "File created by Interface Builder, a software development program (included with Apple Xcode) used for building user interfaces for Mac OS X applications; saves a user interface component such as a window or a view as well as the text fields, buttons, and other interactive components.", "Mac, ", "['Apple Xcode']"], "nif": ["Gamebryo Model File", "3D model used by Gamebryo, a game engine used for Fallout 3, Warhammer Online: Age of Reckoning, and other popular video games; supports 3D meshes (geometry), textures, shading, and other model properties; used for storing terrain, game objects, or other 3D models.", "Windows, ", "['Gamebase Gamebryo', 'NifTools']"], "ngt": ["Noni GPSPlot Track File", "GIS file created by Noni GPSPlot, a Pocket PC program used for logging GPS data from an attached GPS device; stores a series of points, which are each timestamped; can be used for importing and mapping streets or geographical regions in a desktop GIS application.", "Windows, Mac, Linux, ", "['Merkaartor']['Merkaartor']['Merkaartor']"], "ngrr": ["Guitar Rig Preset", "Preset file created and used by Guitar Rig, an application that allows users to create sounds for guitar, bass, and other instruments; stores a pre-made or user-made preset for different components, including guitar amps, bass amps, effects, and songs.", "Windows, Mac, ", "['Native Instruments Guitar Rig']['Native Instruments Guitar Rig']"], "ngs": ["Steins;Gate Game File", "File used by Steins;Gate, a Japanese visual novel video game; contains video segments, such as the prologue, featured in the game; may also stores sounds referenced during gameplay; similar to the .MPG file.\r\n", "Windows, ", "['5pb. and Nitroplus Steins;Gate']"], "ngp": ["NeoGeo Pocket ROM", "Game ROM used by emulators for the NeoGeo Pocket (and NeoGeo Pocket Color) handheld game console; contains an image of the data on the original game cartridge and can be used for playing the game on a PC with emulation software.", "Windows, Mac, ", "['NeoPop', 'Koyote']['Neopocott']"], "ngloss": ["Nisus Writer Glossary", "Glossary used by Nisus Writer Pro, a rich text word processing application; contains glossary entries, which act as shortcuts,they are abbreviations that can be typed then are replaced with the corresponding words (that usually contain a lot more characters).", "Mac, ", "['Nisus Writer Pro']"], "ngd": ["Xilinx Netlist File", "File created with Xilinx PLC (programmable logic controller) design software; contains a netlist, which includes the connections and components for the integrated circuit design; converted from a .NGC file and can be generated to a bitstream (.BIT) file for configuring FPGAs (field-programmable gate arrays).", "Windows, ", "['Xilinx ISE Design Suite']"], "ngage": ["N-Gage Game File", "Video game written for the Nokia's N-Gage mobile gaming platform; can be played on an N-Gage phone or a Nokia smartphone that supports the N-Gage 2.0 service; requires the N-Gage application to be installed on the phone in order to run.", "Windows, ", "['Nokia Suite', 'Nokia PC Suite']"], "ngc": ["Xilinx Generated Netlist File", "Data file generated by Xilinx ISE, an application used for creating and testing electronic circuit designs; contains a Xilinx-specific \"netlist,\" which includes the logical design data and constraints for the circuit; used for storing the constructed, or \"synthesized,\" design, which can be passed on for design implementation (e.g., generating .NGD and .BIT files).", "Windows, Windows, Mac, ", "['Xilinx ISE Design Suite']['NeoPop', 'Koyote']['Neopocott']"], "nftr": ["Nintendo DS Font Type File", "Font file used by some Nintendo DS games; stores multiple glyphs (characters) of the font using a bitmap grid for each character; used for displaying game text; can be edited with the program NFTRedit.", "Windows, ", "['NFTRedit']"], "nfs11save": ["Need for Speed: Hot Pursuit Save File", "Game file created by Need for Speed: Hot Pursuit, a racing game; saves control configurations (keyboard, gamepads, steering wheels) and personal settings configured inside the game; enables settings to be saved.", "Windows, ", "['Electronic Arts Need for Speed: Hot Pursuit']"], "nfv": ["Netflix Video File", "An NFV file is a video file created by the Netflix streaming app, available for Android and iOS.  It contains a movie or show downloaded through the app.  NFV files are used for offline viewing, a feature launched in December, 2016.  It allows you to watch movies or shows when not connected to the Internet.", "iOS, Android, ", "['Netflix']['Netflix']"], "nfs": ["Network File System Temporary File", "File created by Network File System, a protocol that allows files to be accessed over a network; contains either a temporary copy of a file that is opened by an NFS process, or a copy of a file that was deleted while still open by an NFS process; enables the client and file server processes to communicate file information.", "Linux, ", "['Network File System']"], "nfo": ["System Information File", "Data file used by Microsoft's System Information tool, a Windows software utility for gathering system information and for diagnosing problems; stores information gathered by the program.", "Windows, Windows, Mac, Linux, Windows, Windows, ", "['Microsoft System Information']['NFOPad', 'CubicDesign Compact NFO Viewer', 'Microsoft type', 'Microsoft Notepad', 'text editor']['Apple TextEdit', 'MacroMates TextMate', 'text editor']['NFO Viewer', 'text editor']['Microsoft Age of Empires'][]"], "nfl": ["Nokia Flash Lite Package", "File created in the Nokia Flash Lite (NFL) format, a package format used to distribute Flash Lite applications for Nokia mobile devices; saved in a compressed .ZIP format and contains a .SWF file and a text descriptor file descriptor.inf; often used for storing mobile media player skins; supported on Nokia Series 40 5th Edition, Feature Pack 1 or later devices.", "Windows, Mac, ", "['Corel WinZip 21', 'WinRAR 5']['Apple Archive Utility']"], "nfm": ["Delphi .NET Form File", "Developer file created by Delphi Windows development software; saves a visual form that can be compiled into an application that runs on Microsoft's .NET Framework; differs from a .DFM file, which can be compiled into a native Win32 executable (.EXE) that does not require the .NET Framework.", "Windows, ", "['Embarcadero Delphi']"], "nfi": ["Dreambox Disc Image", "Disc image created from the hard drive of a Dreambox satellite or cable television receiver; serves as a backup file that can be used to restore data to a Dreambox.", "Windows, ", "[]"], "nfb": ["Nokia Phone Backup File", "Backup file created by Nokia PC Suite, an mobile phone management application that synchronizes Nokia mobile phones with a PC; contains a backup of the phone's data, including user and system data; used for restoring phone data to the same phone or transferring data to another phone.", "Windows, ", "['Nokia PC Suite', 'Nokisoft Noki', 'NbuExplorer']"], "nff": ["Neutral File Format", "Generic 3D geometric design format developed in the 1990s; based on a \"minimal scene description language,\" which describes the geometry and surfaces of objects, including the lighting placement and viewing angle.", "Windows, ", "[]"], "nfc": ["Nokia Phone Backup Copy File", "Backup file created by Nokia PC Suite, a Nokia phone synchronization and management application; stores a backup of the phone's data, including system and user data; used for restoring phone states, as well as transferring data to another phone.", "Windows, ", "['Nokia PC Suite', 'Nokisoft Noki', 'NbuExplorer']"], "nex": ["Navigator Extension", "A NEX file is a .ZIP file saved in the open Navigator Extension (NEX) format for browser add-on development. It contains all the files and folders for an extension and is used to install browser add-ons, like adblockers.  NEX files support a large amount of the Google Chrome web browser (Chromium) extensions.", "Windows, Mac, Linux, ", "['Opera']['Opera']['Opera']"], "nexe": ["Chrome Native Client Executable", "Executable file used by the Google Chrome Web browser; contains an executable that can be run by the browser's Native Client (NaCl) component, similar to how an .EXE file is run by Windows; allows native compiled code (written in C or C++) to be run in the browser quickly and without incurring much overhead.", "Windows, Mac, Linux, ", "['Google Chrome']['Google Chrome']['Google Chrome']"], "neu": ["Pro/ENGINEER Neutral File", "File created by Pro/ENGINEER, a program used for 3D product design; contains part information, including geometry, layering, appearance, parameter data, materials, and other design information; stores parts in a neutral format so they can be imported into other CAD programs.", "Windows, Linux, ", "['Parametric Technology Creo', 'Okino Computer Graphics PolyTrans']['Parametric Technology Creo']"], "networkconnect": ["Apple Network Connect Document", "Document created by Apple's System Preferences, an application included on the Apple operating system; contains information that helps you set up your network.", "Mac, ", "[]"], "netspm": ["NetSpot Map File", "File created by NetSpot, a program used for surveying wireless networks; stores a map on which a wireless network heatmap can be overlaid; often contains building floorplans or property land surveys.", "Mac, ", "['NetSpot']"], "netspd": ["NetSpot Survey Project File", "Project file created by NetSpot, a program used for surveying and visualizing wireless networks; can store multiple network maps, each of which are overlaid with detected wireless information; can be used for planning as well as creating wireless heatmaps in homes and other buildings.", "Mac, ", "['NetSpot']"], "neta": ["Netica Binary File", "File created by Netica, a program used to create Bayesian networks for analyzing uncertainty in business, engineering, medicine, and ecology contexts; saves a diagram that depicts the components of the network; uses a binary format to reduce the file size and to increase the speed of file access.", "Windows, ", "['Norsys Netica']"], "net": ["netViz Project File", "Project created by netViz Enterprise software, a set of programs that enable the visualization of data; often used for diagraming business models and IT infrastructures; can be published and viewed on the Web using netViz webView.", "Windows, Windows, Mac, ", "[]['FileMaker Pro']['FileMaker Pro']"], "nessus": ["Nessus Network Security Scanner File", "File created by Nessus, a network vulnerability scanning application; saves the results of a network security scan as well as the policies used for the performed scan; enables the results from corporate or home network scans to be saved as well as imported for review.", "Windows, Mac, Linux, ", "['Tenable Network Security Nessus']['Tenable Network Security Nessus']['Tenable Network Security Nessus']"], "nes": ["Nintendo (NES) ROM File", "An NES file is a game ROM created from an NES (Nintendo Entertainment System) video game.  It contains the same data as the original NES cartridge and can be opened and played on a Mac or PC using an NES emulator.", "Windows, Mac, Linux, Android, ", "['Nestopia', 'VirtuaNES', 'FCEUX', 'Jnes', 'FakeNES', 'NesterJ', 'iNES', 'MESS']['RockNES', 'Nestopia', 'MESS']['FCEUX', 'Nestopia', 'MESS']['Nesoid']"], "neosave": ["Neopets Save File", "Save file used by Neopets: Puzzle Adventure, a puzzle solving adventure game; contains game data for individual Neopets that is automatically saved as the player progresses through the game; includes the Neopet's level, stats, and bonus points; also includes customized character information such as species, color, and name; not meant to be manually opened.", "Windows, ", "['Infinite Interactive Neopets: Puzzle Adventure']"], "ned": ["OMNeT++ Network Description File", "Network definition file created by OmniNET++, a software package used for building network simulators; stores the network topology structure; used for describing the logical structure of the network that will be simulated in the software.", "Windows, Mac, Linux, ", "['OMNeT++']['OMNeT++']['OMNeT++']"], "ndx": ["dBASE Index File", "Index file that defines the structure and fields of a database; consists of a header followed by a B-tree, which contains a root, branch, and leaf nodes; used primarily by dBASE, but may be recognized by other database programs.", "Windows, Windows, Mac, ", "['dBase', 'Microsoft Visual FoxPro']['Neat 5']['Neat 4']"], "nds": ["Nintendo DS Game ROM", "Game ROM of a video game for the Nintendo DS (NDS), a handheld console that uses two screens, one of which that is touch-sensitive; can be played on a PC using a Nintendo DS emulator; sometimes used for homebrew games and can be played using flashcarts.", "Windows, Mac, Linux, Windows, ", "['NO$GBA', 'DeSmuME', 'iDeaS Emulator', 'DSemu', 'Dualis']['DeSmuME']['DeSmuME', 'iDeaS Emulator']['Nero 2017']"], "neo": ["NeoChrome Bitmap Image", "Raster graphic created by NeoChrome, an early image-editing program used by the Atari ST and TT systems; supports color images and animated frames; can still be opened in some image viewing and conversion programs.", "Windows, Mac, Linux, Web, Android, ", "['Newera Graphics Converter Pro', 'XnViewMP', 'Piotr Fusik RECOIL']['XnViewMP', 'Piotr Fusik RECOIL']['XnViewMP']['Piotr Fusik RECOIL']['Piotr Fusik RECOIL']"], "neko": ["Neko Source Code File", "Source code file written in Neko, a high-level dynamically typed programming language; can be compiled by the Neko compiler into bytecode that is run on the Neko virtual machine, similarly to how Java programs are compiled and then run on the Java Virtual Machine (JVM).", "Windows, Mac, Linux, ", "['Neko', 'text editor']['Neko', 'text editor']['Neko', 'text editor']"], "nef": ["Nikon Electronic Format RAW Image", "An NEF fils is a raw photo captured by a Nikon digital camera.  It is saved in an uncompressed format that stores data exactly as it was captured by the CCD.  NEF files also contains image metadata, which includes the camera ID, lens that was used, and other settings.", "Windows, Mac, Linux, iOS, Android, ", "['File Viewer Plus', 'Nikon ViewNX', 'Adobe Photoshop CC 2017', 'Corel PaintShop Pro X9', 'Corel AfterShot Pro 3', 'Adobe Photoshop Elements 15', 'CorelDRAW Graphics Suite X8', 'ACD Systems Canvas X 2017', 'ACD Systems ACDSee 20', 'Google Picasa', 'Microsoft Windows Photos', 'Microsoft Windows Live Photo Gallery', 'Microsoft Windows Photo Gallery']['Nikon ViewNX', 'Apple Photos', 'Google Picasa', 'Adobe Photoshop CC 2017', 'Adobe Photoshop Elements 15', 'Snap Converter', 'MacPhun ColorStrokes', 'Corel AfterShot Pro 3']['Corel AfterShot Pro 3']['Adobe Photoshop Express']['File Viewer for Android', 'Adobe Photoshop Express']"], "ndl": ["Lotus Notes Doclink File", "Link file used by Lotus Notes, a business productivity and collaboration application suite; saved in an XML format and contains a reference to a Lotus Notes document; used for sharing links to documents over email and in Web pages.", "Windows, ", "['IBM Lotus Notes']"], "ndoc": ["Naver Word", "Online document created by Naver Word, a Web-based word processing and productivity application; supports templates, stylized text, page formatting, tables, charts, and images; can be accessed through an NDrive online storage location.", "Web, iOS, Android, ", "['NHN Naver Word']['NHN Naver Ndrive']['NHN Naver Ndrive']"], "ndk": ["Lotus Notes Design Elements File", "Contains Lotus Notes design elements, which are used to create and customize the interface for Lotus users; \"DESKTOP6.NDK\" contains design elements, while \"CACHE.NDK\" stores recently used elements.", "Windows, ", "[]"], "ndf": ["SQL Server Secondary Database File", "Secondary database file used by Microsoft SQL Server; created when the primary .MDF database becomes too large (such as when there is no disk space left); may also be manually added to the SQL Server File Group to distribute data between the two files.", "Windows, ", "['Microsoft SQL Server 2016']"], "ndc": ["Personal Communications Settings File", "Stores configuration information used by IBM Personal Communications networking software; may include iSeries settings, which can be loaded using the \"iSeries Connection Configuration\" program (PCSNDC.EXE).", "Windows, ", "[]"], "ndb": ["ClamAV Extended Signature File", "File used by ClamAV, an open source antivirus program; contains a signature for a malware program in the following format: MalwareName:TargetType:Offset:HexSignature", "Windows, Mac, Linux, ", "[][][]"], "nda": ["Nero Backup File", "Backup file created by BackItUp (formerly BackItUp and Burn), a program that allows users to compress and back up files; contains encrypted backup data of your files, folders, applications, or drives.", "Windows, ", "['Nero BackItUp 2017']"], "ndif": ["Nokia Data File", "Data file created on a Nokia phone's memory card; may contain backup data or other data used to update information on the phone; sometimes seen as an empty zero kilobyte (0KB) file; may be downloaded from the phone using Nokia PC Suite.", "Windows, Mac, ", "['Nokia PC Suite']['Apple Disk Utility']"], "nd5": ["Renamed NDS File", "Nintendo DS game ROM in which the file extension has been renamed from \".nds\" to \".nd5\"; contains a copy of a Nintendo DS game that be played on a PC using a Nintendo DS emulator.", "Windows, Mac, Linux, ", "['NO$GBA', 'DeSmuME', 'iDeaS Emulator', 'DSemu', 'Dualis']['DeSmuME']['DeSmuME', 'iDeaS Emulator']"], "nd": ["QuickBooks Network Data File", "Configuration file used by QuickBooks financial accounting software; allows network access to a QuickBooks company file; created when the company file is opened.", "Windows, Mac, ", "['Intuit QuickBooks Pro 2016']['Intuit QuickBooks for Mac 2016']"], "ncx": ["EPUB Navigation Control XML File", "Table of contents file created according to the XML-based Open Packaging Format (OPF) standard, which is part of the EPUB eBook specification; stores the document title and author, as well as the navigation points for the eBook; used as part of an overall .EPUB archive.", "Windows, Mac, Linux, ", "['Adobe Digital Editions', 'Adobe InDesign CC 2017', 'Calibre', 'KDE Okular', 'Geometer Plus FBReader']['Adobe Digital Editions', 'Adobe InDesign CC 2017', 'Calibre', 'KDE Okular', 'Geometer Plus FBReader']['Calibre', 'KDE Okular', 'Geometer Plus FBReader']"], "ncw": ["Native Compressed Wave File", "Audio file created by Native Instruments' Kontakt, an audio sampling program; saves an imported wave audio file using compression methods so the file uses less disk space.", "Windows, Mac, Windows, ", "['Native Instruments Kontakt']['Native Instruments Kontakt']['Nero 2017']"], "nct": ["Now Contact File", "File created by Now Contact, a contact information organizer; contains contact data such as a person's name, company, phone number, email, and address; also includes events connected to any contacts such as an appointment, phone call, or to-do task.", "Windows, Mac, Windows, ", "['Now Contact']['Now Contact']['Nero 2017']"], "ncss": ["NCSS Dataset File", "File created by NCSS, a statistical analysis system; contains data in worksheets made up of columns and rows that can be customized by the user; includes any applied filters, automatic transfer calculations, conditional transformations, and column notes; holds a maximum of 2 billion rows and 2 billion columns.  ", "Windows, ", "['NCSS']"], "ncr": ["NCR Image", "Image created by fax machines and related software; contains a header and a bitonal, black and white image; used to compress images into monochrome for sending via fax.", "Windows, Mac, ", "['Adobe Photoshop CC 2017', 'Corel PaintShop Pro X9', 'XnViewMP']['Adobe Photoshop CC 2017', 'XnViewMP']"], "ncorx": ["Adobe Encore Project", "Project file created by Encore, a program bundled with Adobe Premiere Pro and used for creating DVDs and Blu-ray discs; stores all resources for authoring DVD content; includes disc navigation information, references to video assets, menu screens, and other disc information; can be burned to a disc or exported as a Web DVD.", "Windows, Mac, ", "['Adobe Encore CS6']['Adobe Encore CS6']"], "ncor": ["Adobe Encore Project File", "Project file created by Adobe Encore, a media authoring program for DVDs, Blu-ray discs, and Web publishing; contains project information that dictates how a DVD is played, such as \"assets\" (videos, images, audio files, and menus), timelines, and navigation settings.", "Windows, Mac, ", "['Adobe Encore CS6']['Adobe Encore CS6']"], "nco": ["Nero BackItUp File", "Compressed backup file created by Nero BackItup (formerly Nero BackItUp & Burn); contains data to be backed up to a CD or DVD; compressed using standard ZIP compression; may also be protected with a password and encrypted using a 56-bit key.", "Windows, ", "['Nero BackItUp 2017']"], "nclr": ["Nintendo DS Color Palette File", "File used by some games for the Nintendo DS; contains a color palette for the graphics stored in a corresponding .NCGR file, which stores the title screen image for a Nintendo DS game; used by games such as Mario Kart DS.", "Windows, ", "['MKDS Course Modifier', 'Crystal Tile 2']"], "nch": ["Outlook Express Folder File", "Folder containing e-mail messages for a specific mailbox; typically named \"Folders.nch\" and located in the Outlook Express\\Mail folder; should not be moved or renamed.", "Windows, ", "['Microsoft Outlook Express']"], "ncgr": ["Nintendo DS Title Graphics File", "Title screen graphic used by some games for the Nintendo DS handheld console, such as Mario Kart; saves a collection of graphic tiles that make up a picture when arranged on the screen; stored with a color palette (.NCLR) file and an .NSCR file that contains the locations and rotation information for placing the image tiles.", "Windows, ", "['MKDS Course Modifier', 'Crystal Tile 2']"], "ncfg": ["ArcGIS Explorer Configuration File", "Application configuration file used by ArcGIS Explorer, a free GIS program developed by ESRI; contains settings that customize the program, including the user interface, splash screen, logo, application title, and application permissions; allows users to control the appearance and behavior of ArcGIS Explorer.", "Windows, ", "['ESRI ArcGIS Explorer']"], "ncf": ["No Cache File", "Cache file used by Valve Steam game development software; referenced when updating Valve software; similar to a .GCF file, but does not include information about internal data storage.", "Windows, ", "['Valve Steam', 'GCFScape']"], "ncd": ["Nero CoverDesigner File", "Disc artwork created by Nero CoverDesigner, CD or DVD label designer included with the Nero Multimedia Suite; stores the text, graphics, and layout dimensions for the design; can be printed to a disc using a compatible printer.", "Windows, Windows, Mac, ", "['Nero 2017']['NTI Media Maker Express', 'EZB Systems UltraISO', 'Smart Projects IsoBuster']['NTI Dragon Burn 4']"], "ncb": ["Visual C++ IntelliSense Database", "Symbols file used by Visual C++, a component of Microsoft's Visual Studio development software; contains information about different symbols used in a C++ software project, such as user-defined classes.", "Windows, ", "['Microsoft Visual Studio 2017']"], "nc1": ["Mastercam Numerical Control File", "An NC1 file is a numerical control file created by Mastercam, a suite of CAD programs used for designing and manufacturing components.  It contains instructions for directing a machine tool, such as a laser cutter, nester, welder, or drill, during production.  NC1 files are the same as .NC files but with a different extension.", "Windows, ", "['CNC Mastercam', 'FastCAM Drawing Editor']"], "nc": ["Mastercam Numerical Control File", "File created by Mastercam, which includes a suite of CAD programs used for designing and manufacturing components; contains numerical control instructions for directing a machine tool, such as a drill, during production.", "Windows, Windows, Mac, Linux, Linux, ", "['CNC Mastercam']['Unidata netCDF', 'Microsoft Excel 2016', 'The MathWorks MATLAB with njTBX extension', 'ANDX', 'ANAX']['Unidata netCDF']['Unidata netCDF', 'NcView']['mcrypt']"], "nbu": ["Nokia Phone Backup File", "Backup file created by Nokia Suite (formerly Nokia Ovi Suite) or Nokia PC Suite; contains a backup of cell phone data and may include contacts, calendars, text messages, and other user data; used for restoring data to the same phone or transferring data to another phone.", "Windows, ", "['Nokia Suite', 'Nokia PC Suite', 'Nokisoft Noki', 'NbuExplorer', 'Jumping Bytes Mobile Master']"], "nbt": ["Minecraft Named Binary Tag File", "Data file format used by Minecraft, a open-ended 3D world building and exploration game; saves data in the Named Binary Tag (NBT) format, which is a simple binary format developed to store large amounts of binary data; used for storing world, or level, information.", "Windows, Mac, Linux, ", "['NBTExplorer', 'NBTEdit']['NBTExplorer', 'NEINedit']['NBTExplorer']"], "nbm": ["NetBeans Module", "Plug-in file used by NetBeans, a cross-platform Integrated Development Environment (IDE); stores a compressed .ZIP archive of XML, .JAR, and metadata files; also supports pack200 compression (.PACK.GZ extension) for included JAR files; often distributed via download on the Web.", "Windows, Mac, Linux, ", "['Oracle NetBeans']['Oracle NetBeans']['Oracle NetBeans']"], "nbs": ["Minecraft Note Block Studio File", "Audio project created by Minecraft Note Block Studio (NBS), a third-party program used for making custom music for the game Minecraft; saves multiple tracks, called layers, each with notes generated from a keyboard synthesizer and instruments in the program; can be played back in the software to preview the music.", "Windows, Mac, Windows, ", "['Minecraft Note Block Studio', 'Mojang Minecraft']['Mojang Minecraft']['NTI Backup Now']"], "nbp": ["Mathematica Player Notebook File", "Notebook file created by Mathematica, a program used for scientific and mathematical computations; may contain text, graphics, sound, calculations, and user interface components; used to store analysis results as an interactive document.", "Windows, Mac, Linux, Windows, ", "['Wolfram Research CDF Player', 'Wolfram Research Mathematica']['Wolfram Research CDF Player']['Wolfram Research CDF Player'][]"], "nbk": ["NovaBACKUP Job File", "Script created by NovaBACKUP Windows backup software; saves a backup job and contains a list of commands for backing up selected files and folders; includes the target output directory for the backup (.NBD file) and whether the backup is full or incremental.", "Windows, Windows, Windows, Mac, Linux, ", "['NovaStor NovaBACKUP Professional 17'][]['SMART Technologies Notebook']['SMART Technologies Notebook']['SMART Technologies Notebook']"], "nbi": ["Nero BackItUp Information File", "File created by BackItUp (formerly BackItUp & Burn), a program used to compress and backup files; contains information about files that have been backed up; used in conjunction with .NBA files to restore from a backed up archive.", "Windows, ", "['Nero BackItUp 2017']"], "nbh": ["ROM Update Utility Image File", "ROM image used by ROM Update Utility (RUU), a program used for updating the ROM image on some HTC mobile phones; stores low-level system information used to run the phone; can also be updated with htc-flasher, an open source version of the ROM Update Utility.", "Windows, Linux, ", "[]['htc-flasher']"], "nar": ["Nexon game archive", "Archive of assets used by the game Counter-Strike Online, a game developed by the South Korean company Nexon and based off of the Valve game Counter-Strike;  contains textures, audio files, models, and other assets used during gameplay.", "Windows, ", "['Counter-Strike Online', 'CSOTools']"], "nap": ["McAfee ePO Network Associates Package", "File used by McAfee ePolicy Orchestrator (ePO), a software product used for securing enterprise business networks; contains an extension for the ePO software; may include enhancements such as new scanning or reporting capabilities; also used for authorizing purchased software features.", "Windows, Windows, Windows, ", "['McAfee ePolicy Orchestrator']['Microsoft Windows Media Player']['CorelDRAW Graphics Suite X8']"], "nam": ["Aqua3D Network File", "Data file used by Aqua3D, a program used for simulating underwater acoustic networks; saves data that initializes the network environment; includes the simulation space dimensions, node positions, signal transmission events; displays as a 3D environment in the software.", "Linux, Windows, Windows, ", "[]['Bethesda Softworks GECK']['USGS MODFLOW']"], "na2": ["Netscape Address Book File", "Address Book used by the older Netscape Communicator Web browser and email program, as well as the newer Mozilla SeaMonkey application; stores a collection of contacts; usually has the filename pab.na2.", "Windows, Mac, Linux, ", "['Mozilla SeaMonkey']['Mozilla SeaMonkey']['Mozilla SeaMonkey']"], "n64": ["Nintendo 64 Emulator ROM File", "Nintendo 64 game that can be run on a PC using an N64 emulation program; contains the game data from the original N64 cartridge; often called an N64 game ROM or game image file.", "Windows, Mac, Android, ", "['Nemu64', 'Project64', '1964', 'UltraHLE']['Mupen64Plus', 'sixtyforce']['N64oid']"], "n3r": ["Panasonic Security System Video File", "An N3R file is video created by a Panasonic security system, which includes the WV-ASM200, WV-ASE201, WV-ASE202, WV-ASE203, and WV-ASE204 versions.  It contains video recorded by Panasonic security cameras and downloaded using the security system management software.", "Windows, ", "['Panasonic WV-ASM200', 'Panasonic WV-ASE201', 'Panasonic WV-ASE202', 'Panasonic WV-ASE203', 'Panasonic WV-ASE204']"], "n3pmesh": ["Knight Online 3D Mesh File", "3D mesh that defines characters, weapons, and other objects used in the Knight Online video game; contains a group of polygons, such as triangles and quadrilaterals, that define the shape of the object.", "Windows, ", "[]"], "n3d": ["Nuclear 3D File", "3D model or scene used by games created with Nuclear Glory game development software; saves the 3D image and animation information in a format optimized for use by the game engine; used for saving characters, terrain, and other 3D objects.", "Windows, Windows, ", "['Nuclear Glory Nuclear Studio', 'Nuclear Glory Nuclear Basic'][\"Wisdom Tree Super 3D Noah's Ark\"]"], "n2": ["Nitrous Minecraft GLSL Shader File", "3D shader file archive used by Nitrous, a program used for customizing the look of the 3D world in the game Minecraft; saved in a .ZIP format and contains an archive of .FSH, .VSH, and Java .CLASS files; used for enabling the use of GLSL (OpenGL Shading Language) shaders in Minecraft.", "Windows, Mac, Linux, ", "['Nitrous']['Nitrous']['Nitrous']"], "n-gage": ["N-Gage Application", "Game or application developed for the Nokia N-Gage platform; can be installed and opened on an N-Gage compatible device, such as the Nokia E and N series of phones.", "Windows, ", "['SISContents']"]}