{"oab": ["Offline Address Book", "Stores names, e-mail addresses, and other contact information for Microsoft Outlook", "Windows, ", "['Microsoft Outlook 2016']"], "octest": ["Xcode Objective-C Unit Test Bundle", "Developer file created by Xcode, a Mac OS X and iOS application development IDE; saves a bundle of unit tests, which are small, localized tests used for verifying the behavior of individual functions within the overall application source code; enables all test files to be packaged together.", "Mac, ", "['Apple Xcode']"], "oct": ["Radiance Octree File", "Compiled 3D scene created by Radiance, a ray tracing toolkit; stores objects, materials, and lighting properties for the scene; compiled from a .RAD file using the oconv command line tool, which is included in the Radiance package.", "Mac, Linux, ", "['Radiance']['Radiance']"], "o": ["Compiled Object File", "Object file produced by a C compiler; often created instead of a program file during the development process.", "Mac, Linux, ", "['GNU Compiler Collection (GCC)']['GNU Compiler Collection (GCC)']"], "odex": ["Optimized Dalvik Executable", "An ODEX file is created by the Android operating system to increase the boot speed of an Android app (an .APK file).  It is located alongside an APK file and contains optimized code that speeds up the app load process.", "Windows, Mac, Linux, Android, ", "['smali']['smali']['smali']['Google Android']"], "ocr": ["Subtitle Workshop OCR Script", "Script used by Subtitle Workshop, a movie subtitle editor; saves a list of find/replace value pairs that replace optical character recognition (OCR) errors with corrected text; used for making the subtitle text more accurate; can be used for multiple languages.", "Windows, Windows, Mac, ", "['URUSoft Subtitle Workshop']['Nuance OmniPage Ultimate', 'Microsoft Notepad', 'text editor']['Apple TextEdit']"], "ocx": ["ActiveX Control", "Object file used within ActiveX forms; contains control behaviors that typically are triggered by user or program events; may be used for functions such as window resizing and scroll bar movement handling; commonly written programming languages, such as Visual Basic or C++.", "Windows, ", "['Microsoft Visual Studio 2017']"], "odf": ["OpenDocument Formula", "An ODF file is a document created by Apache OpenOffice Math, a program used for creating math formulas.  It contains one or more mathematical equations and may also contain macros.  ODF files are based on the OASIS OpenDocument standard.", "Windows, Mac, Linux, Windows, Windows, Mac, Linux, ", "['Apache OpenOffice', 'LibreOffice', 'Calligra Suite']['Apache OpenOffice', 'Planamesa NeoOffice', 'LibreOffice', 'Calligra Suite']['Apache OpenOffice', 'LibreOffice', 'Calligra Suite']['Microsoft Notepad', 'Microsoft WordPad', 'text editor']['Apache OpenOffice']['Apache OpenOffice']['Apache OpenOffice']"], "odc": ["Office Data Connection File", "Connection information file created by Microsoft Excel, a spreadsheet application included with Microsoft Office; contains properties to connect to, and retrieve data from, an external data source; may include a connection string, data queries, authentication information, and other settings.", "Windows, Mac, Windows, Mac, Linux, ", "['Microsoft Excel 2016', 'Microsoft Internet Explorer', 'Web browser']['Microsoft Excel 2016', 'Apple Safari', 'Mozilla Firefox', 'Web browser']['Apache OpenOffice']['Apache OpenOffice', 'Planamesa NeoOffice']['Apache OpenOffice']"], "odb": ["OpenDocument Database", "File created by Apache OpenOffice Base (OOBase), an open source desktop relational database program; formatted according to the OpenDocument standard; stores an archive of data files that comprise the database; used to save structured information such as tables and records.", "Windows, Mac, Linux, Windows, ", "['Apache OpenOffice', 'LibreOffice', 'Calligra Suite']['Apache OpenOffice', 'Planamesa NeoOffice', 'LibreOffice', 'Calligra Suite']['Apache OpenOffice', 'LibreOffice', 'Calligra Suite'][]"], "od": ["Mascopt Graph Request File", "File used by Mascopt, a program that allows users to visualize and manipulate mathematical graphs; contains a request for a graph; used to specify data for studying and manipulating a stored graph.", "Windows, Mac, Linux, ", "[][][]"], "oci": ["openCanvas Image", "Image created by openCanvas, a drawing program that records stroke events so that images can be automatically redrawn; stores a bitmap image created in the software and uses a proprietary format; often used for anime and other types of digital art.", "Windows, ", "['Portalgraphics openCanvas']"], "oce": ["Open Catalog Extension Connection File", "Database connection file used by the Hyperion Intelligence database management system (DBMS); defines the connection software, type of database, username, password, host, data retrieval method, and optional database name.", "Windows, ", "['Oracle Business Intelligence Suite']"], "ocd": ["OCAD Map File", "File created by OCAD map creation software; contains a map project and can be used for storing topographical maps, city maps, hiking maps, and other types of maps; can incorporate imported geospatial data to georeference the locations on the map.", "Windows, ", "['OCAD']"], "occ": ["Oceanic DataPool File", "File used by Oceanic Consulting Corporation (OCC) for commercial marine research and Arctic engineering; saves a DataPool array, which can be analyzed using OCC's toolbox for Matlab; used internally by OCC's Data Analysis department.", "Windows, ", "['The MathWorks MATLAB with OCC toolbox']"], "oca": ["Custom Control Library Type File", "Accompanying file saved with Visual Basic custom control (.OCX) files; contains standard descriptions of objects, properties, and methods used by OLE Automation; created automatically by Visual Basic and given the same name as the custom control except for the file extension.", "Windows, ", "['Microsoft Visual Studio']"], "ozt": ["MU Online Image File", "Image file created for MU Online, a massive online multiplayer role-playing game; contains a graphic referenced in gameplay, which is used for character appearances, textures, interfaces, etc..", "Windows, ", "['Webzen MU Online', 'MU Online Image Converter']"], "ozj": ["MU Online Image File", "File created for MU Online, a Korean online multiplayer role-playing game; contains an image used for textures, skins, interface, etc., which are referenced during gameplay.", "Windows, ", "['Webzen MU Online', 'MU Online Image Converter']"], "oz": ["Opera Job Management Compressed File", "Compressed file created by Opera Job Management, an application used to manage and inspect the production of doors and windows; contains backup data generated by the software; stores the contents in a proprietary format, which uses Gzip libraries; used for backing up and sharing application data as attachments of auto-generated emails.", "Windows, ", "['Opera Company Opera Job Management']"], "ozb": ["MU Online Image File", "Graphic file created for MU Online, a massive Korean online multiplayer role-playing game; contains an image used for characters and world appearances referenced during gameplay; holds images that make up textures, skins, interface, etc..", "Windows, ", "['Webzen MU Online', 'MU Online Image Converter']"], "oyx": ["Approach Alternate Database Index", "Alternate or backup database index (.ADX) file created by Lotus Approach; used in case the main index file becomes corrupted", "Windows, ", "[]"], "oxygene": ["Oxygene Project File", "Project file created with Oxygene, a programming language and multi-platform software development environment; saved using XML formatting and contains software dependencies, references to source code files, and project build settings.", "Windows, ", "['RemObjects Oxygene']"], "oxps": ["OpenXPS File", "An OXPS file is a file created in the Open XML Paper Specification (OpenXPS) format, which is the same format used by .XPS files.  It is similar to a .PDF file and describes the structure and content of a document.", "Windows, Mac, Linux, ", "['Microsoft XPS Viewer', 'Pagemark XpsViewer', 'Microsoft Word 2016', 'NiXPS View']['Pagemark XpsViewer', 'NiXPS View', 'Microsoft Word 2016']['Pagemark XpsViewer']"], "owx": ["OutWit Hub Automator File", "Automator file created and used by Outwit Hub, an application that extracts and organizes data from online sources; contains information, such as properties and notes, that describes an automator in XML or encrypted format. ", "Windows, Mac, Linux, ", "['Outwit Hub', 'Mozilla Firefox with OutWit Hub add-on']['Outwit Hub', 'Mozilla Firefox with OutWit Hub add-on']['Outwit Hub', 'Mozilla Firefox with OutWit Hub add-on']"], "owl": ["OWL Source Code File", "Source code written in OWL - the \"Obfuscated Weird Language;\" based on the Forth and FALSE programming languages; only supports integer numbers and 26 variables - A through Z.", "Windows, Mac, Linux, ", "[][][]"], "oxt": ["Apache OpenOffice Extension", "Extension that adds additional functionality to Apache OpenOffice (formerly OpenOffice.org) and StarOffice programs; provides extra features such as advanced spell checking, report building, file compression, and many other capabilities.", "Windows, Mac, Linux, ", "['Apache OpenOffice', 'LibreOffice']['Apache OpenOffice', 'Planamesa NeoOffice', 'LibreOffice']['Apache OpenOffice', 'LibreOffice']"], "owm": ["OutWit XML Mashup File", "Mashup generated by Outwit, an application that extracts and organizes data from online sources; consolidates information from multiple sources or services; saved in a standard XML format.", "Windows, Mac, Linux, ", "['Outwit Hub', 'Mozilla Firefox with OutWit Hub add-on']['Outwit Hub', 'Mozilla Firefox with OutWit Hub add-on']['Outwit Hub', 'Mozilla Firefox with OutWit Hub add-on']"], "owg": ["OutWit Gear Database", "Thesaurus used by Outwit, an application for extracting and organizing data from online sources; simplifies Web searches by searching for synonyms of search terms entered by the user.", "Windows, Mac, Linux, ", "['Outwit Hub', 'Mozilla Firefox with OutWit Hub add-on']['Outwit Hub', 'Mozilla Firefox with OutWit Hub add-on']['Outwit Hub', 'Mozilla Firefox with OutWit Hub add-on']"], "owc": ["OutWit Catch Database", "Search database or \"collection basket\" generated by Outwit, an application for extracting and organizing data from online sources; used during the Web harvesting process when content is gathered by Outwit.", "Windows, Mac, Linux, ", "['Outwit Hub', 'Mozilla Firefox with OutWit Hub add-on']['Outwit Hub', 'Mozilla Firefox with OutWit Hub add-on']['Outwit Hub', 'Mozilla Firefox with OutWit Hub add-on']"], "ow": ["Free Pascal 1.0.x Object File", "Developer file created by version 1.0.x of the Free Pascal compiler; contains program objects that have been compiled from source code; used during the linking process to generate an executable program from the objects.", "Windows, ", "['Free Pascal']"], "ovr": ["The Overlay Maker Overlay File", "Drawing overlay file created by The Overlay Maker, a program used for annotating maps; supports drawn objects such as text, icons, and other vector and raster graphics; stores references to drawn resources and the map, but not the resource files themselves.", "Windows, Mac, Linux, ", "['The Overlay Maker']['The Overlay Maker']['The Overlay Maker']"], "ovx": ["Object-based Visual Application Language File", "An OVX file is a data file used to develop applications for Psion devices, such as Netpad, Workabout, and MC 400.  It contains Object-based Visual Application Language (OVAL), which is a programming language similar to Visual Basic.  OVX files are no longer used since Psion computers have been discontinued.", "Windows, ", "[]"], "ovw": ["Logic Pro Overview File", "Visual waveform file created by Logic Pro, a digital audio workstation program; contains a visual representation of an imported audio file or audio data recorded with the software; used for showing track information on the audio timeline.", "Mac, Windows, Mac, ", "['Apple Logic Pro X']['Steinberg Cubase']['Steinberg Cubase']"], "ovpn": ["OpenVPN Configuration File", "Stores connection settings for an OpenVPN session; used for creating a VPN connection with a remote computer; can be opened directly by OpenVPN to start a VPN session.", "Windows, Mac, Linux, ", "[][][]"], "ovp": ["The Overlay Maker Package File", "File created by The Overlay Maker, a map drawing program designed for military planning; stores all map images and drawn objects in a compressed .ZIP archive (with the \".ovp\" extension); used for packaging overlay graphics together with the map.", "Windows, Mac, Linux, ", "['The Overlay Maker']['The Overlay Maker']['The Overlay Maker']"], "ovolog": ["ooVoo Log File", "File created by ooVoo, a free video chat and messaging application; contains a log of ooVoo activity that is sent to the ooVoo support team when debugging is needed.", "Windows, ", "['ooVoo']"], "ovl": ["Rollercoaster Tycoon 3 Data File", "Game archive used by Rollercoaster Tycoon 3, a roller coaster creation video game; stores various types of game data, including 3D models, 2D game graphics, sounds, and layout information for the user interface; used as a game data container.", "Windows, Mac, ", "['Atari RollerCoaster Tycoon 3']['Atari RollerCoaster Tycoon 3']"], "ovh": ["OMSI Vehicle Configuration File", "File created by OMSI The Bus Simulator, an omnibus driving simulation program; similar to other OMSI configuration files like .HUM, .SLI, .SCO, and .BUS files; holds configuration data for vehicles, such as their appearance, that interact on the road with the bus during gameplay; can be customized.", "Windows, ", "['MR Software OMSI The Bus Simulator 2']"], "ovf": ["Open Virtualization File", "Text file that describes the packaging and distribution of software run on virtual machines; formatted using the Open Virtualization Format (OVF) Specification; optimized for distribution and is platform neutral.", "Windows, Mac, Linux, ", "['VMware Workstation 12.5 Pro', 'VMware OVF Tool', 'Oracle VM VirtualBox']['VMware OVF Tool', 'VMware Fusion 8.5', 'Oracle VM VirtualBox']['VMware Workstation 12.5 Pro', 'VMware OVF Tool', 'Oracle VM VirtualBox']"], "ove": ["Overture Musical Score", "Musical score created by Overture, a professional music notation software program developed by GenieSoft; used by composers, arrangers, music educators, and students.", "Windows, Mac, ", "[][]"], "ova": ["Open Virtual Appliance", "An OVA file is a virtual appliance used by virtualization applications such as VMware Workstation and Oracle VM Virtualbox.  It is a package that contains files used to describe a virtual machine, which includes an .OVF descriptor file, optional manifest (.MF) and certificate files, and other related files.", "Windows, Mac, Linux, Windows, ", "['VMware Workstation 12.5 Pro', 'Oracle VM Virtualbox', 'VMware vCenter Converter', 'VMware OVF Tool']['Oracle VM Virtualbox', 'VMware OVF Tool', 'VMware Fusion 8.5']['VMware Workstation 12.5 Pro', 'Oracle VM Virtualbox', 'VMware OVF Tool'][]"], "ov2": ["TomTom Points of Interest Database", "Database of locations called \"points of interest\" that can be overlaid on a TomTom navigation map; may be created manually with TomTom Navigator (using a Pocket PC device) or by converting an existing database to the TomTom Navigator format with TomTom HOME.", "Windows, Mac, ", "['TomTom HOME']['SampoSoft PoiView', 'TomTom HOME']"], "out": ["Compiled Executable File", "Executable file created by various source code compilers; may store executable code or shared libraries; often named a.out; largely replaced by the newer COFF (Common Object File Format) format.", "Linux, Windows, Mac, Linux, ", "['Linux']['Microsoft Notepad', 'Microsoft WordPad', 'text editor']['Apple TextEdit', 'text editor']['text editor']"], "otz": ["OpenLP Theme File", "Theme file used by OpenLP, a free application used for developing multimedia content for church worship services; contains settings that give the presentation (an .OSZ file) a certain appearance; may include fonts, text colors, background images, and other display information.", "Windows, Mac, Linux, ", "['OpenLP']['OpenLP']['OpenLP']"], "otx": ["theWord Encrypted Old Testament Text Module", "File used by theWord, a free Bible reading program; stores a copy of the Old Testament in an encrypted format; differs from an .OT file, which uses a plain text format; can be used for protecting copyrighted content when distributing digital copies of the Old Testament.", "Windows, ", "['theWord']"], "ott": ["OpenDocument Document Template", "An OTT file is a document template saved in OASIS' OpenDocument standard format and created by word processors included in the OpenOffice and LibreOffice suites.  It contains the page layout and default styles for a text document.  OTT files are used for authoring .ODT documents that have the same appearance and formatting.", "Windows, Mac, Linux, ", "['File Viewer Plus', 'Apache OpenOffice', 'LibreOffice']['Apache OpenOffice', 'Planamesa NeoOffice', 'LibreOffice']['Apache OpenOffice', 'LibreOffice']"], "ots": ["OpenDocument Spreadsheet Template", "An OTS file is a spreadsheet template created by the Calc program included in Apache OpenOffice (formerly OpenOffice.org) or another spreadsheet application that supports the OpenDocument standard.  It contains a spreadsheet saved in OASIS' OpenDocument XML-based formatting.  OTS files allow users to create multiple .ODS spreadsheet files using the same styles and formatting.", "Windows, Mac, Linux, Windows, ", "['Apache OpenOffice', 'LibreOffice']['Apache OpenOffice', 'Planamesa NeoOffice', 'LibreOffice']['Apache OpenOffice', 'LibreOffice'][]"], "otrkey": ["OnlineTvRecorder Encoded Video File", "Encoded video file downloaded from OnlineTvRecorder.com (OTR), a website used for recording and downloading TV shows; must be decoded with the OTRKEY Decoder program before it can be watched and can only be decoded by users with a valid OnlineTvRecorder account.", "Windows, Linux, ", "['OTRKey Decoder']['otrtool']"], "otp": ["OpenDocument Presentation Template", "An OTP file is a presentation template created by Impress, a program included with Apache OpenOffice (formerly known as OpenOffice.org).  It contains a presentation, which includes a master slide as well as a content slide with text, images, shapes, multimedia content, transition effects, and other slide elements.  OTP files are used for styling presentations with the same appearance.", "Windows, Mac, Linux, ", "['Apache OpenOffice', 'LibreOffice']['Apache OpenOffice', 'Planamesa NeoOffice', 'LibreOffice']['Apache OpenOffice', 'LibreOffice']"], "otm": ["Outlook Macro File", "Macro created with Microsoft Outlook, an email application; contains scripted functions written in Microsoft's VBA language; often used for automating repetitive tasks, such as scanning email messages or collecting file attachments.", "Windows, ", "['Microsoft Outlook 2016', 'Microsoft Word 2016']"], "oti": ["OpenDocument Image Template", "Image template created by programs that use OASIS's OpenDocument specification; stores the default settings for an image; can be used as the starting point for creating multiple .ODI image documents.", "Windows, Mac, Linux, ", "['Apache OpenOffice']['Apache OpenOffice', 'Planamesa NeoOffice']['Apache OpenOffice']"], "otln": ["Opal Outline File", "Outline created by Opal, an outlining program for Mac OS X; creates hierarchical lists for organizing notes, projects, reports, ideas, etc.; Opal is the successor to Acta and has been completely rewritten for Mac OS X.", "Mac, ", "[]"], "otl": ["NoteTab Outline File", "Document created with NoteTab, a text and HTML editor that includes advanced editing options; typically contains blocks of text that are organized by headings; may be saved as a template for creating other similar files.\r\n", "Windows, ", "[]"], "oth": ["OpenDocument HTML Template", "Template file created by OpenOffice.org or another office productivity application that supports the OpenDocument standard; often contains template header and footer elements as well as style and formatting settings; used for styling HTML documents with a similar appearance.", "Windows, Mac, Linux, ", "['Apache OpenOffice', 'Apache Open Office']['Apache OpenOffice', 'Apache Open Office', 'Planamesa NeoOffice']['Apache OpenOffice']"], "otg": ["OpenDocument Graphic Template", "Drawing template created using the OASIS OpenDocument standard; contains the default layout and drawing information for a vector graphic; stored in a file package using XML formatting.", "Windows, Mac, Linux, ", "['Apache OpenOffice', 'LibreOffice']['Apache OpenOffice', 'Planamesa NeoOffice', 'LibreOffice']['Apache OpenOffice', 'LibreOffice']"], "otf": ["OpenType Font", "An OTF file is a font format developed by Adobe and Microsoft.  It combines aspects of PostScript and TrueType font formats and is fully scalable, meaning the font can be resized without losing quality.", "Windows, Mac, Linux, Windows, Windows, Mac, Linux, ", "['Microsoft Windows Font Viewer', 'FontForge']['Apple Font Book', 'FontForge']['FontForge'][]['Apache OpenOffice', 'Apache Open Office']['Apache OpenOffice', 'Apache Open Office']['Apache OpenOffice', 'Apache Open Office']"], "otc": ["OpenDocument Chart Template", "Chart template created by programs that implement OASIS's OpenDocument standard; stores the default setting and layout information for a chart and may specify the dimensions, plot area, and axis information; used to create multiple .ODC files with the same look and feel.", "Windows, Mac, Linux, ", "['Apache OpenOffice']['Apache OpenOffice', 'Planamesa NeoOffice']['Apache OpenOffice']"], "otb": ["Nokia Over The Air Bitmap Image", "Over The Air (OTA) image used for transmitting pictures between Nokia and Siemens mobile phones; stores a black and white bitmap image containing a maximum of 255x255 pixels; may be saved in a hexadecimal text format or a binary format.", "Windows, Mac, Linux, ", "['XnViewMP']['XnViewMP']['XnViewMP']"], "osx": ["PowerPC Executable File", "Program header for a Power PC application; saved in the PEF (PowerPC Executable Format) binary executable format; can be run directly in Mac OS X (or via Rosetta on Intel machines), but may reference other files that are required for the program to run.", "Mac, ", "[]"], "ota": ["OTA Bitmap Image", "Over The Air (OTA) image used for sending pictures on Nokia and Siemens mobile phones; contains a monochrome bitmap image holding up to a maximum of 255x255 pixels; may be stored in a binary format or in a hexadecimal format in a text file.", "Windows, Mac, Linux, Android, ", "['XnViewMP', 'SMS Picture Maker']['XnViewMP']['XnViewMP']['File Viewer for Android']"], "ot": ["theWord Old Testament Text Module", "File used by theWord, a free Bible reading program; stores a copy of the Old Testament in a plain text format; contains tags that markup the text so that is recognized by theWord; used for distributing digital copies of the Old Testament.", "Windows, ", "['theWord']"], "osz": ["Osu! Beatmap File", "File used by osu!, a rhythm game where players click visual cues in sync with music; contains a compressed beatmap, which includes a song, graphics, and timings and locations of clicks; enables players to save and share custom beatmaps.", "Windows, Windows, Mac, Linux, ", "['osu!']['OpenLP']['OpenLP']['OpenLP']"], "osu": ["Osu! Script", "Game script written for osu!, a rhythm game where players click hit circles in sync with music; saves properties for a game challenge, such as the difficulty, the song that is played, and the timing points for hit objects; can be used by game community members for making custom challenges.", "Windows, ", "['Microsoft Notepad', 'text editor']"], "ost": ["Outlook Offline Folder File", "Stores e-mail messages and other data saved by Microsoft Outlook (2005 or later) from an Exchange server; similar to a Personal Folder (.PST) File, but supports larger file sizes.", "Windows, ", "['Microsoft Outlook 2016', 'Remo Convert OST to PST', 'OEMailRecovery.com Outlook Recovery Toolbox', '4Team Corporation OST PST Viewer']"], "oss": ["Microsoft Outlook Saved Search File", "Search file saved by Microsoft Outlook, an email and calendar program included with Microsoft Office; contains email search criteria for a virtual folder; used for filtering email into virtual email folders that match specific search parameters.", "Windows, ", "['Microsoft Outlook 2016']"], "osr": ["Osu! Replay File", "Game replay created by osu!, a rhythm game where players synchronize mouse clicks with music; saves a recording of a song played by the user, as well as the player name, date played, score, hits and misses, and ranking; often used for sharing replays with friends.", "Windows, ", "['osu!']"], "osp": ["OpenShot Project File", "Video editing project file created by OpenShot, an open source video editor for Linux; contains references to audio, video, and image files, as well as transitions, effects, and sequencing information; supports multiple tracks and nondestructive edits; used for saving and loading a video editing project and exporting it to one of several supported output video formats.", "Linux, ", "['OpenShot']"], "osm": ["OpenStreetMap Map File", "XML file created in the OpenStreetMap (OSM) format, which is used for saving street map information; saves data in the form of \"nodes\" (points), \"ways\" (connections), and \"relations\" (street and object properties, such as tags).", "Windows, Mac, Linux, ", "['Safe Software FME Desktop', 'Merkaartor', 'GeoVisu', 'Gosmore']['Merkaartor']['Merkaartor', 'GPX Viewer']"], "osc": ["OpenStreetMap Change File", "Street map data file created in the OpenStreetMap Change (OSC) format; contains modification data for an existing .OSM street map; enables a central or existing street map to be updated with new data.", "Windows, Mac, Linux, Windows, Linux, ", "['Merkaartor', 'osmchange']['Merkaartor']['Merkaartor', 'osmchange']['Obix']['Obix']"], "osk": ["Osu! Skin File", "Skin file used by osu!, a game of rhythm where players tap visual cues in sync with music; contains graphics and sounds that alter the appearance and sounds of the game; used to customize hit circles, the score display, the slider type, the cursor, and hit bursts.", "Windows, ", "['osu!']"], "osdx": ["Search Connector Description File", "Installation file for a Search Connector (.SEARCHCONNECTOR-MS file) in Microsoft Windows; contains description information for a remote storage location; installs a Search Connector in Windows so users can browse remote locations in the Windows Explorer; useful for setting up remote office work environments.", "Windows, ", "['Microsoft Windows']"], "osb": ["OpenStreetMap Binary Map File", "File used by Merkaartor, an OpenStreetMap (OSM) editor; saves the XML data from an .OSM file in a binary format; allows more compact file sizes and faster manipulation, but is more difficult to read, since it is not stored in plain text.", "Windows, Mac, Linux, ", "['Merkaartor']['Merkaartor']['Merkaartor']"], "osax": ["AppleScript Scripting Addition", "Open Scripting Architecture Extension (OSAX) file created for AppleScript, a language used to automate Mac OS X tasks; contains new commands and other terminology that extends the language; can add features such as mathematical functions and XML parsing.", "Mac, ", "['Apple AppleScript Editor']"], "os": ["ObjectScript Source File", "Executable script with a list of commands and functions written in ObjectScript, a general purpose object-oriented programming language; can be converted into a standalone ObjectScript application by bundling files into a .JAR file.", "Windows, Mac, Linux, ", "['ObjectDevel']['ObjectDevel']['ObjectDevel']"], "orv": ["Oracom Video File", "Video file saved in the Oracom video format, a format used by some Oracom hardware devices; saves the video in a proprietary format but can be played back using a program called \"Movie Viewer\" that is typically supplied with Oracom products.", "Windows, ", "[]"], "orx": ["RadiantOne VDS Database Schema", "Database schema the defines the structure of a database used by the Radiant One Virtual Directory Server (VDS); may be captured from an existing database using the Database Schema Extractor and can be modified using the Schema Manager within RadiantOne.", "Windows, Linux, ", "['Radiant Logic RadiantOne Virtual Directory Server']['Radiant Logic RadiantOne Virtual Directory Server']"], "ort": ["Rich Text Editor Document", "Rich text file created with IBM's Rich Text Editor, a basic word processor included with several IBM programs; contains text and supports text and document formatting; similar to an .RTF file, but created specifically by IBM software.", "Windows, Linux, ", "['IBM Rich Text Editor']['IBM Rich Text Editor']"], "orig": ["Original File", "File that may have originated from various programs; stores a backup copy of a file, which has been renamed with an \".orig\" extension so that the user knows it is the original; most often created manually by a user rather than by a program.", "Windows, Mac, ", "[][]"], "org": ["Lotus Organizer File", "An ORG file is a data file created by Lotus organizer, a program used to manage personal information.  It contains information such as a calendar, contacts, a to do list, and a planner.", "Windows, ", "[]"], "ori": ["Original File", "Often added to a file that already has an extension; may be appended to the filename, i.e. \"page1.html\" may become \"page1.html.ori;\" often used to differentiate between original and backup (.BAK) files.", "Windows, Mac, ", "[][]"], "orf": ["Olympus RAW File", "Unprocessed RAW photo taken with an Olympus digital camera; contains unprocessed image data captured by the camera's sensor; settings such as exposure and white balance can be modified after the picture is taken.", "Windows, Mac, Linux, iOS, Android, ", "['File Viewer Plus', 'Olympus Master', 'Adobe Photoshop CC 2017', 'Corel PaintShop Pro X9', 'Corel AfterShot Pro 3', 'Adobe Photoshop Elements 15', 'CorelDRAW Graphics Suite X8', 'ACD Systems Canvas X 2017', 'ACD Systems ACDSee 20', 'Google Picasa', 'Microsoft Windows Live Photo Gallery']['Olympus Master', 'Adobe Photoshop CC 2017', 'Adobe Photoshop Elements 15', 'Apple Photos', 'Google Picasa', 'MacPhun ColorStrokes', 'Corel AfterShot Pro 3']['Corel AfterShot Pro 3']['Adobe Photoshop Express']['File Viewer for Android', 'Adobe Photoshop Express']"], "ore": ["Ore Executable File", "Source code file written in Ore, a lightweight programming language designed for writing cross-platform batch executables; executed by the Ore Runtime Environment, a program that runs Ore programs on multiple platforms.", "Windows, Mac, Linux, ", "[][][]"], "orc": ["Voyetra Digital Orchestrator File", "Song file created by Voyetra Digital Orchestrator, a music production application; can include multiple tracks and supports MIDI instruments and imported audio data; used for saving musical compositions.", "Windows, ", "[]"], "orderedtest": ["Visual Studio Ordered Test File", "Test container file created by Microsoft Visual Studio, a software development tool that allows developers to create Windows applications; contains references to tests to run for a project, such as unit tests; used for organizing test cases for automated execution.", "Windows, ", "['Microsoft Visual Studio 2017']"], "orb": ["Original eBook Reader File", "An ORB file is an eBook file used by ORB (Original Book Reader), a program used to view ORB eBooks.  It contains an eBook, which includes cover, title, contents, and index pages.", "Windows, ", "['ORB Reader']"], "or6": ["Lotus Organizer 6 File", "Data file created with Lotus Organizer, a personal information manager (PIM) designed to be used as an electronic day planner; may include a calendar, a list of contacts, to-do lists, call records, notes, and other information.", "Windows, ", "[]"], "ora": ["OpenRaster Image File", "Image file saved in the OpenRaster format, and open raster graphics format that supports multiple layers; supports multiple layers and contains both image data and metadata, including XMP and EXIF tags.", "Windows, Mac, Linux, Windows, Linux, ", "['GIMP', 'XnViewMP']['GIMP']['GIMP', 'MyPaint', 'Nathive']['Oracle Database']['Oracle Database']"], "or5": ["Lotus Organizer 5 File", "Organizer file created with Lotus Organizer 5, personal information manager (PIM) software; contains multiple types of data, including a calendar, personal contacts, to-do lists, call records, and other information.", "Windows, ", "[]"], "or4": ["IBM Lotus Organizer 97 GS File", "Organizer file created with Lotus Organizer, a personal information manager (PIM) software program; includes a contact list, calendar, to-do list, call record, and other information.", "Windows, ", "[]"], "opx": ["OrgPlus Org Chart", "Organizational chart created by OrgPlus; used for creating visual diagrams of workforce information that can be shared between multiple users; may be created with OrgPlus Enterprise, Professional, Standard, or OnDemand.", "Windows, Windows, Mac, ", "['Insperity OrgPlus', 'Insperity OrgPlus Reader'][][]"], "oqy": ["Excel OLAP Query File", "Query file used by Microsoft Excel, a spreadsheet application; saves an OLAP query that can be run to populate an Excel PivotTable from an external database or from a \"cube\" data source; allows users to import and refresh data in the spreadsheet.", "Windows, ", "['Microsoft Excel 2016']"], "or2": ["Lotus Organizer 2 File", "Data file created with Lotus Organizer 2, an early personal information manager (PIM) program; may include a calendar of events, personal notes, a task list, and other information.", "Windows, ", "[]"], "or3": ["IBM Lotus Organizer 97 File", "Data file created with Lotus Organizer 97 (a.k.a. Lotus Organizer 3) personal information manager software; contains a calendar, a list of contacts, a to-do list, notes, and other information.", "Windows, ", "[]"], "opus": ["Opus Audio File", "An OPUS file is an audio file created in the Opus format (also called \"Ogg Opus\"), a lossy audio format developed for Internet streaming.  It uses both SILK (used by Skype) and CELT (from Xiph.Org) codecs and supports variable bit rates from 6 kb/s to 510 kb/s.", "Windows, Mac, Linux, ", "['File Viewer Plus', 'VideoLAN VLC media player', 'Foobar2000', 'AIMP', 'Opus-tools']['VideoLAN VLC media player']['VideoLAN VLC media player']"], "opts": ["Linux Configuration Options File", "Options file used for installing and configuring various Linux applications and hardware devices; contains plain text instructions for an installer or program; can be used for overriding setup and installation options, or for specifying required application parameters.", "Linux, ", "['GNU Emacs', 'Pico', 'text editor']"], "options": ["SE-SOFT Configuration File", "Settings file used by SE-SOFT's SE-DesktopApps, such as SE-Explorer, SE-Launcher, and SE-Player; saves configuration options in an XML format; used for saving program defaults and user-selected options.", "Windows, ", "['SE-SOFT SE-DesktopApps']"], "opt": ["Options File", "Configuration file that contains preferences and options settings for a specific program; modified by the program when the user selects different options within the program.", "Windows, Windows, Windows, ", "[]['Opterecenja']['AGiliTy']"], "ops": ["Office Profile Settings File", "Settings file used by the Microsoft Office Profile Wizard (proflwiz.exe), a program used for configuring user information for Microsoft Office programs; no longer used by recent versions of Microsoft Office.", "Windows, ", "['Microsoft Office Profile Wizard']"], "oplc": ["Nokia Operator Logo File", "Image file used by some Nokia mobile phones; stores the manufacturer's logo in a .PNG format; used for displaying the company logo on the Nokia startup screen; can be opened with any image viewer that supports the PNG format.", "Windows, Mac, ", "['image viewer']['image viewer']"], "opml": ["Outline Processor Markup Language File", "Outline document written in OPML (Outline Processor Markup Language); used to exchange lists of Web feeds (such as .RSS files) between Web feed aggregators; also used for other general outlining purposes.", "Windows, Mac, ", "['CS Odessa ConceptDraw MINDMAP', 'OPML Editor', 'Natara Bonsai', 'Tkoutline']['The Omni Group OmniOutliner 4.5', 'CS Odessa ConceptDraw MINDMAP', 'OPML Editor', 'Circus Ponies NoteBook', 'Tkoutline']"], "opf": ["FlipViewer FlipBook File", "FlipBook, such as a digital magazine or other publication that can be read with FlipViewer; saved in the OEB Package Format (OPF) which is formatted in XML; includes metadata that describes the content and a list of pages, images, and text referenced by the publication.", "Windows, Mac, Windows, Mac, Linux, Windows, Mac, ", "[][]['Adobe Digital Editions', 'Adobe InDesign CC 2017', 'Calibre', 'KDE Okular', 'Geometer Plus FBReader']['Adobe Digital Editions', 'Adobe InDesign CC 2017', 'Calibre', 'KDE Okular', 'Geometer Plus FBReader']['Calibre', 'KDE Okular', 'Geometer Plus FBReader'][][]"], "opj": ["OrCAD Project File", "CAD project file created by OrCAD, a program used for designing electric circuits, known as PCBs (printed circuit boards); saves references to files included in the project as well as project settings; usually references at least a .DSN design file; used for storing PCB design information together.", "Windows, ", "['Cadence OrCAD PCB Designer']"], "opdownload": ["Opera Partially Downloaded File", "Partially downloaded file created by the Opera Web browser; holds the contents of the file being downloaded from the browser; the OPDOWNLOAD extension indicates that the download is incomplete, the extension is removed once the download is complete, and the file is then ready to be used. ", "Windows, Mac, Linux, ", "['Opera']['Opera']['Opera']"], "openbsd": ["OpenBSD Readme File", "Readme file created for BSD (Berkeley Software Distribution) Unix systems; saved in a plain text format and contains information about a specific application.", "Windows, Mac, Linux, ", "['text editor']['text editor']['text editor']"], "opeico": ["Opeico Text File", "An OPEICO file is a text file created by Opeico File Viewer, a simple text editor.  It contains plain text typed by the user that may be formatted with fonts and colors.", "Windows, ", "['Opeico File Viewer']"], "opd": ["OmniPage Document", "Document created with OmniPage scanning, OCR, and page creation software; may contain images, text, and page layout information; saved in a proprietary format that can only be opened with OmniPage or OmniPage Professional software.", "Windows, Mac, Windows, ", "['Nuance OmniPage Ultimate']['Nuance OmniPage Pro X']['Diffraction International Durango Interferometry Software']"], "opax": ["Microsoft Office User Settings File", "Holds language neutral resources used by the Office Customization Tool (OCT) to create a custom installation of Microsoft Office; contains user created default settings including default font, font-size, and caching options;", "Windows, ", "['Microsoft Office Customization Tool']"], "opal": ["Microsoft Office User Settings File", "Contains language specific resources used by the Office Customization Tool (OCT) to customize how Microsoft Office is installed; includes resources specific to a particular language like US English, German, Spanish, etc...", "Windows, ", "['Microsoft Office Customization Tool']"], "op2": ["Nastran Output File", "Output file created by MSC Nastran, a structural analysis program; similar to the .F06 file but smaller in size and written in Binary format instead of ASCII; output data helps display the performance of vital areas of the model such as grid point stress; contains mode shapes, static displacements, and grid point stress analysis results computed by MSC Nastran. \r\n", "Windows, Linux, ", "['MSC Nastran', 'pynastran']['MSC Nastran']"], "op4": ["Nastran Output File", "Output file created by MSC Nastran, a program that enables you to test the integrity of different structures such as buildings or spacecraft; generated by DMAP alters, which act like commands to extract information (like a matrix); can be written in Binary or ASCII format; contains vectors and matrices of that can be analyzed and output as a structure array by different Nastran readers.", "Windows, Linux, ", "['MSC Nastran', 'pynastran']['MSC Nastran']"], "op": ["OpenPAT Report", "Report created by OpenPAT (Open Performance Analysis Toolkit) tools, a cross-platform program analysis toolkit that helps identify hotspots, bottlenecks, buffer overflows, and other data and control flow information; contains a report of an instrumented program to show an analysis to the user; stores information, depending on the tool it's generated from, such as hotspot, coverage, or control_flow.", "Windows, Mac, Linux, ", "[][][]"], "ook": ["Arachne Batch Script", "File used by Arachne, a DOS-based Web browser also now supported for Linux; uses the same format as a .BAT file and saves scripted commands that are used to open DOS programs from the Web browser.", "Windows, Linux, ", "['Arachne']['Arachne']"], "oo3template": ["OmniOutliner Template", "Template created by OmniOutliner, an OS X application used to create, collect, and organize information; contains information added by the user that is organized as text, columns, smart checkboxes, pop-up lists, and spreadsheets. ", "Mac, ", "['The Omni Group OmniOutliner 4.5']"], "oo3": ["OmniOutliner 3 File", "Data file created by OmniOutliner, a program used for organizing  information; can store information using text, checkboxes, pop-up lists, and spreadsheets; used for various purposes, including note taking, tracking expenses, and creating agendas.", "Mac, ", "['The Omni Group OmniOutliner 4.5']"], "ontx": ["theWord Encrypted Bible Text Module", "File used by theWord free Bible software; stores a translation of the Bible in an encrypted format; differs from an .ONT file, which does not use encryption; allows users and third-party vendors to protect their version of the Bible.", "Windows, ", "['theWord']"], "onetoc": ["Microsoft OneNote Table of Contents File", "A ONETOC file is an index file created by Microsoft OneNote 2003, a program used to take notes and journal.  It contains information about the ordering of different note-taking sections.  ONETOC files are used for organizing the collection of notes in the notebook.", "Windows, ", "['Microsoft OneNote 2016']"], "ont": ["theWord Bible Text Module", "File used by theWord free Bible software; stores a copy of the Old and New Testament; saved in a plain text format and includes tags that markup the biblical text in a format recognized by theWord; also includes the title, description, and version information; used for distributing digital copies of the Bible.", "Windows, ", "['theWord']"], "onetoc2": ["Microsoft OneNote Table of Contents File", "Index file created by Microsoft OneNote, a program used for personal journaling and note taking; stores information about the ordering of different note-taking sections; used for organizing the collection of notes in the notebook.", "Windows, ", "['Microsoft OneNote 2016']"], "onepkg": ["Microsoft OneNote Package File", "Package file created by OneNote, a program that allows users to create and manage digital notes information; contains multiple OneNote files packaged into a single archive; used to publish notes to other users and to backup OneNote files.", "Windows, ", "[]"], "one": ["OneNote Document", "A ONE file is a document created by OneNote, a note-taking program developed by Microsoft.  It contains one or more sections that store one or more pages.  ONE files may contain text, digitized handwriting, and objects pasted from other applications, such as images, drawings, and audio/video clips.", "Windows, Mac, iOS, Android, Windows Phone, ", "['Microsoft OneNote 2016']['Microsoft OneNote']['Microsoft OneNote']['Microsoft OneNote']['Microsoft OneNote']"], "ond": ["Lotus Notes Encapsulated Memo File", "Plain text message or memo created with Lotus Notes, an e-mail and organization program developed by IBM; saved in a \"minimalist\" format that only includes the default view and is optimized for efficient transport.", "Windows, Mac, ", "['IBM Lotus Notes']['IBM Lotus Notes']"], "omx": ["OtsAV Media Library Information File", "Media information file used by Ots audio software; contains audio analysis data for a corresponding .WAV or .MP3 file; typically created when an audio file is imported into an OtsAV media library.", "Windows, ", "[]"], "oms": ["HP Printer Substrate Presets Package File", "An OMS file is a substrate presets package used by HP printers, such as Latex and Scitex series printers.  It contains an ICC profile and printing presets, such as color calibration targets, total ink volume, drying time, and gloss enhancer volume.  OMS files are used to share presets that configure the process of printing onto different materials, such as paper, textiles, parchment, and plastic.", "Web, ", "[]"], "omo": ["OMake Object File", "Object file created by the OMake Build System, similar to the make program installed on most Unix systems; contains the output of an OMake function.", "Windows, Mac, Linux, ", "[][][]"], "omp": ["Office Manager Document Archive", "Database created with Office Manager, a general-purpose, configurable database management system; supports cataloging data and automatic indexing of documents; enables quick access to Windows documents.", "Windows, Windows, Mac, ", "['Microsoft Access 2016']['MatchWare MindView']['MatchWare MindView']"], "omg": ["OpenMG Audio File", "Compressed audio file that uses Sony's OpenMG technology; based on Sony's ATRAC3 format, but also includes digital rights management DRM to prevent files from being copied illegally; supported by SonicStage, Sony's music jukebox program.", "Windows, Windows, ", "['Sony SonicStage']['O&O Software O&O DiskImage 8']"], "omod": ["Oblivion Mod Archive", "Game file used by Oblivion Mod Manager (OBMM) and Nexus Mod Manager (NMM), two programs used for applying game mods to The Elder Scrolls: Oblivion and Fallout 3; contains the data files that alter regular game content; saved using .7Z compression.", "Windows, ", "['Oblivion Mod Manager', 'Nexus Mod Manager']"], "omf": ["Open Media Framework File", "Standard audio/video format based on the Open Media Framework Interchange (OMFI), a standardized interchange file format; may be exported from digital video editing or audio workstation (DAW) software; commonly used to share project data between multiple applications.", "Windows, Mac, Windows, Mac, ", "['Avid Media Composer', 'Avid Pro Tools', 'Steinberg Cubase', 'Steinberg Nuendo', 'Cakewalk SONAR X3', 'Adobe Audition CC 2017']['Avid Media Composer', 'Avid Pro Tools', 'Steinberg Cubase', 'Steinberg Nuendo', 'Apple Logic Pro X', 'Apple Final Cut Pro X', 'MOTU Digital Performer', 'Adobe Audition CC 2017'][][]"], "omcs": ["Office Manager Access File", "Text file that contains a link to an Office Manager Document Archive (.OMP file) stored on a SQL Server; saves the access parameters for the SQL Server; used for connecting to the database.", "Windows, ", "[]"], "oma": ["Sony OpenMG Music File", "Music file saved in Sony's proprietary ATRAC (Adaptive Transform Acoustic Coding) format; may contain DRM copy protection to prevent the file from being played on unauthorized computers or devices.", "Windows, Mac, Linux, ", "['Sony SonicStage', 'VideoLAN VLC media player']['VideoLAN VLC media player', 'Macgo Mac Media Player']['VideoLAN VLC media player']"], "olt": ["Orbit Downloads List", "File created by Orbit Downloader, a download manager; contains a list of download links (URLs); can be exported for sharing with others, who can import the list by choosing File → Import List of Downloads ... from the application menu.", "Windows, ", "['Orbit Downloader']"], "olm": ["Mac Outlook Database File", "Database file used by Microsoft Outlook for Mac; used as the software's internal format for storing  email messages, contacts, journals, calendar data, and other user application data.", "Mac, ", "['Microsoft Outlook 2016', 'Stellar Phoenix OLM Repair']"], "olp": ["Office Live Package", "Package created by Microsoft Office Live, a web service that provided website creation tools and document sharing and consisted of Office Live Workspace and Office Live Small Business; contains web pages, documents, page templates, and images; includes the placement of all the aspects of your site so everything is placed in the correct location when your receiver opens the package; enables easy transfer to share your web site. ", "Windows, ", "[]"], "oll": ["TrialDirector Object Load List", "Load file used by TrialDirector, a program used to create, organize, and present trial information; contains ASCII text used to establish relationship for multi-page TrialDirector documents and determine which tab is associated with each item.  ", "Windows, ", "['inData TrialDirector']"], "olk14task": ["Outlook Task File", "File used by Microsoft Outlook for Mac, a calendar and email application that replaced Microsoft Entourage; contains a task, or \"to-do,\" that was created in the program; used for marking messages that are flagged for follow up.", "Mac, ", "['Microsoft Outlook 2016']"], "olk14signature": ["Outlook Signature File", "HTML signature saved by Microsoft Outlook for Mac, an email program that replaced Microsoft Entourage; contains an email signature that is formatted using HTML code; saved and loaded automatically through the Outlook interface and is not directly accessed by the user.", "Mac, ", "['Microsoft Outlook 2016']"], "olk14pref": ["Outlook Preferences File", "File created by Outlook for Mac, an email program first released in the 2011 Office suite for Mac; contains software preferences, which can specify composition and reading settings; saved and read automatically by the software.", "Mac, ", "['Microsoft Outlook 2016']"], "olk14note": ["Outlook Note File", "File created by Microsoft Outlook 2011, a program used for email and calendar management; contains a note, which was created using the Notes section of Outlook; stores the note formatting as well as the written text; used for storing personal and business notes logged by the user.", "Mac, ", "['Microsoft Outlook 2016']"], "olk14msgsource": ["Outlook Email Message Data File", "Data file created by Outlook for Mac, an email program first released with the Office 2011 suite; contains all email source data for a message referenced in an .OLK14MESSAGE file; loaded when viewing a specific email message.", "Mac, ", "['Microsoft Outlook 2016']"], "olk14mailaccount": ["Outlook Mail Account File", "File created by Microsoft Outlook for Mac, an email application first released for Mac in the 2011 edition; stores email account settings, including connection and login information; used for storing the account details that allow users to download email and synchronize calendars.", "Mac, ", "['Microsoft Outlook 2016']"], "olk14message": ["Outlook Message File", "Email message file created by Outlook 2011, an email and calendar program for Mac; contains the email's header information, but does not contain the email body contents, which are stored in a separate .OLK14MSGSOURCE file; enables the program to display message overviews while browsing email.", "Mac, ", "['Microsoft Outlook 2016']"], "olk14group": ["Outlook Group File", "File created by Microsoft Outlook for Mac, a calendar and email program that replaced Microsoft Entourage; stores a collection of contacts as a group file; used for organizing contacts in the software.", "Mac, ", "['Microsoft Outlook 2016']"], "olk14event": ["Outlook Calendar Event File", "File created by Microsoft Outlook for Mac, an email and calendar management application; stores data for an event on the Outlook calendar, including the date, time, and invitees; used for saving a local cache of events, even if the calendar is saved remotely.", "Mac, ", "['Microsoft Outlook 2016']"], "olk14contact": ["Outlook Contact File", "File created by Microsoft Outlook for Mac, an email program formerly known as Entourage; contains information for a contact, such as a name, email address, and business information; used for saving contact data entered through the Outlook interface.", "Mac, ", "['Microsoft Outlook 2016']"], "olk14category": ["Outlook Category File", "File created by Microsoft Outlook for Mac, an email application that replaced Microsoft Entourage; stores a category, which can be used for tagging email messages, calendar items, contacts, tasks, and notes; includes the name and color of the category shown in the software.", "Mac, ", "['Microsoft Outlook 2016']"], "olk": ["Outlook Address Book File", "Address book created by Microsoft Outlook, an email application; may contain contact information for people and organizations; can store names, phone numbers, addresses, titles, organization data, and other contact information; used for saving and loading contacts.", "Windows, ", "['Microsoft Outlook 2016', 'Microsoft Word 2016']"], "old": ["Backup File", "Typically used as an indicator for a backup copy of a file; appended to the filename when a newer version of the file has been created or saved by a certain program; often placed after the original file suffix (i.e. document.doc.old would be a backup copy of the file \"document.doc\").", "Windows, Mac, ", "[][]"], "ol": ["Valve Hammer Object Layout File", "File created by Valve Hammer Editor, a mapping tool for the Goldsource engine that runs games like Half-Life and Counter-Strike; contains prefabs, or objects, and their .WAD texture files; referenced by Hammer to map out objects and textures. ", "Windows, ", "['Valve Hammer Editor']"], "olb": ["OLE Object Library", "Object library that contains data types and constants referenced by MS Office components; may cause certain Microsoft programs to not function correctly if moved or renamed.", "Windows, Windows, ", "['Microsoft Word 2016', 'Microsoft Excel 2016', 'Microsoft PowerPoint 2016', 'Microsoft Project 2016', 'Microsoft Visual FoxPro', 'Microsoft Visual Studio 2017']['Cadence OrCAD PCB Designer']"], "ola": ["Online Access File", "\"On-line Access\" digital magazine format; used for saving magazine articles in the format they appear in the print version; includes the same layout, text, images, etc; used in the mid-1990s, but has since been replaced by newer formats, such as the Zinio (.ZNO) format.", "Windows, ", "[]"], "okt": ["Oktalyzer Module", "Module format used for creating songs with Oktalyzer, one of the first audio trackers available for Amiga systems", "Windows, Mac, ", "['Nullsoft Winamp', 'MODPlug Player', 'DeliPlayer', 'MilkyTracker', 'MikMod']['MilkyTracker', 'CocoModX', 'MikMod']"], "oiv": ["OpenIV Mod Package File", "Package used by OpenIV, a versatile editor and installer for games, such as Grand Theft Auto IV and Max Payne 3; contains an .XML file that holds a package description and scripts; may hold a .PNG icon for the mod; similar to a .ZIP archive.", "Windows, ", "['OpenIV']"], "ogz": ["Cube 2 Map File", "Map file used by games developed using the Cube 2 game engine; contains the geometry, spawn points, teleporters, item locations, and other settings for a game map; can be used for storing single or multiplayer maps.", "Windows, Mac, Linux, ", "['Cube 2: Sauerbraten', 'Platinum Arts Sandbox']['Cube 2: Sauerbraten']['Cube 2: Sauerbraten']"], "ogx": ["Ogg Vorbis Multiplexed Media File", "Multiplexed media file saved in the Ogg Vorbis container format; similar to an .OGG file, but can include multiple media streams encoded with different codecs; used for storing compressed audio and video data.", "Windows, Mac, Linux, ", "['Foobar2000', 'VideoLAN VLC media player', 'Apple QuickTime Player with XiphQT plugin', 'Microsoft Windows Media Player with DirectShow filter']['VideoLAN VLC media player', 'Apple QuickTime Player with XiphQT plugin']['XMMS', 'VideoLAN VLC media player']"], "ogv": ["Ogg Video File", "Video file that uses the Xiph.Org's open source Ogg container format; may contain video streams that use one or more different codecs, such as Theora; can be played using a variety of media players.", "Windows, Mac, Linux, iOS, ", "['File Viewer Plus', 'VideoLAN VLC media player', 'Miro Video Converter', 'JRiver Media Center', 'MPUI', 'Media Player Classic with K-Lite Codec Pack']['VideoLAN VLC media player', 'Miro Video Converter', 'MPlayer']['VideoLAN VLC media player', 'Totem']['VideoLAN VLC for iOS 2']"], "ognc": ["Dynamic Web Page", "Web page containing server-side scripts that enable the content to be generated dynamically when the page is loaded; used by Web pages on the Macys.com and Bloomingdales.com websites; for example, \"index.ognc?var1&var2.\"", "Windows, Mac, ", "['Web browser']['Web browser']"], "ogm": ["Ogg Media File", "Compressed video file that uses an altered form of Xiph.Org's Ogg file container format; supports playback of video content that incorporates DirectShow filters; created as an extension to the Ogg specification so that Windows Media Player (older versions) and other programs could easily play Ogg video and audio files.", "Windows, Mac, Linux, ", "['File Viewer Plus', 'MPUI', 'MPlayer', 'VideoLAN VLC media player', 'NCH Prism']['MPlayer', 'VideoLAN VLC media player']['Totem', 'MPlayer', 'VideoLAN VLC media player']"], "ogs": ["Origons Movie Data File", "Data file used by Origons, an online service that allows users to share movie lists with each other; may contain information about DVDs, DivX video, VHS tapes, and other movies owned by the user; allows movie information to be downloaded and uploaded with the service.", "Windows, Web, ", "['Ant Movie Catalog']['Origons']"], "ogg": ["Ogg Vorbis Audio File", "Compressed audio file that uses free, unpatented Ogg Vorbis audio compression; similar to an .MP3 file, but sounds better than an MP3 file of equal size; can include song metadata, including artist information and track data; supported by many software music players and some portable music players.", "Windows, Mac, Linux, Web, iOS, Android, ", "['File Viewer Plus', 'Nullsoft Winamp', 'Roxio Creator NXT Pro 5', 'PCF Miro', 'MPlayer', 'foobar2000', 'BS.Player', 'Xion Audio Player', 'VideoLAN VLC media player', 'Audials One 2017', 'Microsoft Windows Media Player with DirectShow filter', 'RealNetworks RealPlayer Cloud with Xiph OGG plugin', 'Applian Replay Converter', 'Adobe Audition CC 2017']['Eltima Elmedia Player', 'PCF Miro', 'MPlayer', 'MacAmp Lite X', 'Roxio Toast 15', 'VideoLAN VLC media player', 'RealNetworks RealPlayer Cloud with Xiph OGG plugin', 'Apple QuickTime Player with the XiphQT plugin', 'Movavi Video Converter', 'Adobe Audition CC 2017']['Zinf', 'Totem', 'PCF Miro', 'VideoLAN VLC media player', 'RealNetworks RealPlayer Cloud', 'Amarok']['Google Drive']['VideoLAN VLC for iOS 2', 'olimsoft OPlayer']['File Viewer for Android', 'antvplayer Media Converter']"], "ogf": ["S.T.A.L.K.E.R. Model File", "3D model file used by S.T.A.L.K.E.R. first-person shooter games; stores 3D meshes and animation data; used for game models such as characters, weapons, terrain, and environmental objects.", "Windows, ", "['GSC Game World S.T.A.L.K.E.R.: Call of Pripyat', 'GSC Game World S.T.A.L.K.E.R.: Clear Sky', 'GSC Game World S.T.A.L.K.E.R.: Shadow of Chernobyl', 'OGF Master']"], "oga": ["Ogg Vorbis Audio File", "Audio container format that may use one of several encoding schemes, including Ogg FLAC, Ghost, and OggPCM; may also use Ogg Vorbis or Speex compression, although these codecs are not recommended by Xiph.Org due to some compatibility issues (the .OGG extension should be used instead for Ogg Vorbis and Speex).", "Windows, Mac, Linux, ", "['File Viewer Plus', 'VideoLAN VLC media player', 'Nullsoft Winamp', 'Media Player Classic', 'JRiver Media Center', 'Zinf', 'Apple QuickTime Player with the XiphQT plugin']['VideoLAN VLC media player', 'MPlayer', 'Apple QuickTime Player with the XiphQT plugin']['VideoLAN VLC media player', 'Apple QuickTime Player with the XiphQT plugin', 'Totem']"], "oft": ["Outlook File Template", "E-mail template used by Microsoft Outlook, a popular e-mail client for Windows; contains a pre-formatted layout that can be used for creating custom messages with a similar look and feel; may also be saved as an Outlook \"form,\" which includes a script that runs when the file is opened.", "Windows, ", "['File Viewer Plus', 'Microsoft Outlook 2016']"], "ofr": ["OptimFROG Audio File", "Audio file compressed with OptimFROG, a lossless audio compression application that was first introduced in 2001; stores the audio in a proprietary format that is not widely supported by standard media players.", "Windows, Mac, Linux, Windows, ", "['OptimFROG Lossless Audio Compressor', 'Nullsoft Winamp with OptimFROG plug-in', 'Foobar2000 with OptimFROG plug-in']['OptimFROG Lossless Audio Compressor']['OptimFROG Lossless Audio Compressor', 'XMMS with OptimFROG plug-in']['Microsoft System Center Configuration Manager']"], "ofm": ["OmniForm Form", "Form saved in the \"intelligent\" OmniForm format, a proprietary format used by OmniForm scanning and OCR software; can be filled out using OmniForm Filler, included with the OmniForm program.", "Windows, Windows, ", "[]['Melco DesignShop']"], "ofl": ["Ots File List", "ASCII text file that contains lines of text that reference media files; each line contains an absolute path to media files in the list; can be used for generating playlists for OtsAV software.", "Windows, ", "[]"], "ofx": ["Open Financial Exchange File", "Financial data file created in the Open Financial Exchange (OFX) format, an SGML-based file format standardized in 1997 by Intuit, Microsoft, and CheckFree; can contain transactions, statements, and other financial information; used as an open format for transferring data between vendors, consumers, and financial systems; may be sent to individual users as credit card or banking statements from a financial institution.", "Windows, Mac, Linux, Web, ", "['Intuit Quicken', 'Reilly Technologies Moneydance', 'GnuCash', 'Microsoft Money']['Intuit Quicken', 'Reilly Technologies Moneydance', 'GnuCash', 'Apple Numbers 4']['KMyMoney', 'GnuCash']['Sage One']"], "officeui": ["Microsoft Office UI Customization File", "Customization file used by Microsoft Office, a document production suite; contains XML code that customizes ribbons in Microsoft Office; includes code that defines custom tabs, commands, groups, etc. that make up the Microsoft Office UI.", "Windows, Mac, ", "['Microsoft Office 2016']['Microsoft Office 2016']"], "off": ["Object File Format", "ASCII based format used for describing 3D objects; defines collections of planar polygons and vertices that create the object's surface.", "Windows, Mac, Linux, ", "['MeshLab', 'GLC_Player', 'RoffView']['MeshLab', 'GLC_Player', 'RoffView']['MeshLab', 'GLC_Player', 'RoffView']"], "ofc": ["Open Financial Connectivity File", "Financial data format developed by Microsoft as an open format for exchanging data with other financial programs; replaced by the .OFX format in 1997 and is not supported by MS Money 2005 or later.", "Windows, Mac, Linux, ", "['Microsoft Money', 'Reilly Technologies Moneydance']['Reilly Technologies Moneydance']['Reilly Technologies Moneydance']"], "oex": ["Opera Extension", "Extension file used by the Opera Web browser; contains data that adds new functionality to the application; can be used for user interface widgets, such as buttons and search bars, or for running hidden functions in the background.", "Windows, Mac, Linux, ", "['Opera']['Opera']['Opera']"], "oem": ["OEM Setup File", "Original Equipment Manufacturer (OEM) file used during the text-mode setup of Windows operating systems; contains a list of hardware components, files to copy for each hardware component, and a list of registry keys and values to create for each component.", "Windows, Windows, ", "['Microsoft Windows']['OEMEdit']"], "oebzip": ["Zipped Open eBook File", "Zipped electronic publication created in the legacy Open eBook (OEB) format; contains the index, chapters, and page content of an .OEB file but compressed with Zip compression.", "Windows, Mac, Linux, ", "['Geometer Plus FBReader']['Geometer Plus FBReader']['Geometer Plus FBReader']"], "oeb": ["Outlook Express Backup Wizard File", "Backup of an Outlook Express e-mail database created by the Outlook Express Backup Wizard; creates a complete backup of all Outlook Express files, including accounts, identities, e-mail messages, attachments, address books, message rules, lists of blocked senders, and signatures.", "Windows, Windows, Mac, Linux, ", "['QSX Outlook Express Backup Wizard']['Geometer Plus FBReader']['Geometer Plus FBReader']['Geometer Plus FBReader']"], "oeaccount": ["Windows Mail Account File", "XML account file created by Windows Mail, an email program included with Microsoft Windows Vista and Windows 7; contains account data in XML format, such as account name, email address, email server address, connection information, encrypted passwords, and preferences; generated whenever a new email or news feed account is created.", "Windows, ", "['Microsoft Windows Mail']"], "odx": ["BizTalk Server Orchestration File", "Business process orchestration diagram created with Microsoft BizTalk Server; used for creating a visual representation of executable business processes; can be exported by the user and imported by a developer as a starting point for implementing an orchestration.", "Windows, ", "[]"], "odttf": ["Obfuscated OpenType Font", "Font file format used in the XML Paper Specification .XPS file and Microsoft Office 2007 formats; stores an obfuscated OpenType font that is based on the fonts used in the original document.", "Windows, Mac, Linux, ", "['Microsoft XPS Viewer', 'Nuance Power PDF Standard', 'Dolphin Futures XPS Viewer', 'Pagemark XpsViewer', 'Pagemark XpsConvert', 'Mozilla Firefox with Pagemark XpsPlugin', 'XPS Annotator', 'NiXPS View', 'NiXPS Edit']['Nuance PDF Converter for Mac 6', 'Pagemark XpsViewer', 'Apple Safari with Pagemark XpsPlugin', 'Mozilla Firefox with Pagemark XpsPlugin', 'NiXPS View', 'NiXPS Edit']['Pagemark XpsViewer', 'Mozilla Firefox with Pagemark XpsPlugin', 'KDE Okular']"], "odt": ["OpenDocument Text Document", "An ODT file is a text document created with Writer, the Apache OpenOffice word processor.  It contains different elements such as text, images, drawn objects, and styles.  ODT files are formatted using the OASIS OpenDocument XML-based standard.", "Windows, Mac, Linux, Web, iOS, ", "['File Viewer Plus', 'Apache OpenOffice', 'Microsoft Word 2016', 'Corel WordPerfect X8', 'LibreOffice', 'AbiSource AbiWord', 'IBM Lotus Notes']['Apache OpenOffice', 'Planamesa NeoOffice', 'AbiSource AbiWord', 'LibreOffice', 'Apple TextEdit', 'IBM Lotus Notes']['Apache OpenOffice', 'AbiSource AbiWord', 'IBM Lotus Notes', 'LibreOffice', 'Calligra Suite']['Google Drive viewer']['BML Solutions OOReader']"], "odo": ["Online Operating System Write Document", "Document created using Write, an Online Operating System (OOS) program used to create text documents; contains text, page formatting, and other document objects and styles; used to store Write documents within the OOS environment.", "Windows, Mac, Linux, ", "['Microsoft Internet Explorer', 'Mozilla Firefox']['Mozilla Firefox']['Mozilla Firefox']"], "ods": ["OpenDocument Spreadsheet", "An ODS file is a spreadsheet created by the Calc program included with the Apache OpenOffice suite.  It stores data in cells that are organized into rows and columns.  ODS files are formatted using the OASIS OpenDocument XML-based standard.", "Windows, Mac, Linux, Windows, ", "['Apache OpenOffice', 'Microsoft Excel 2016', 'LibreOffice', 'Calligra Suite']['Apache OpenOffice', 'Planamesa NeoOffice', 'LibreOffice', 'Calligra Suite']['Apache OpenOffice', 'LibreOffice', 'Calligra Suite']['Microsoft Outlook Express']"], "odm": ["OpenDocument Master Document", "Master text document created by Apache OpenOffice or another word processor that supports the OpenDocument standard; saves links to external files that contain the document content; may also include a table of contents and an index.", "Windows, Mac, Linux, Windows, Mac, iOS, Android, Windows Phone, ", "['Apache OpenOffice', 'LibreOffice']['Apache OpenOffice', 'LibreOffice']['Apache OpenOffice', 'LibreOffice']['OverDrive Media Console']['OverDrive Media Console']['OverDrive Media Console']['OverDrive Media Console']['OverDrive Media Console']"], "odl": ["Object Description Language File", "File written in the Object Description Language (ODL), a language used in the Windows software programming context; allows developers to make their ActiveX objects visible to other vendors by exposing and publishing properties of the objects.", "Windows, ", "['Microsoft Visual Studio 2017']"], "odp": ["OpenDocument Presentation", "An ODP file is a presentation created by Impress, a presentation editing application included with Apache OpenOffice.  It contains a presentation, which generally includes a title slide followed by content slides with text, images, multimedia content, and transition effects.  ODP files are formatted using the OASIS XML-based OpenDocument standard.", "Windows, Mac, Linux, ", "['File Viewer Plus', 'Apache OpenOffice', 'LibreOffice', 'Calligra Suite']['Apache OpenOffice', 'Planamesa NeoOffice', 'LibreOffice', 'Calligra Suite']['Apache OpenOffice', 'LibreOffice', 'Calligra Suite']"], "odin": ["Locky Ransomware Encrypted File", "An ODIN file is a file encrypted by the Locky Virus, a trojan horse created by cybercriminals that targets Windows users.  It contains a user's file, such as a .WMV or .PDF file, encrypted with RSA algorithm and AES-256 encryption.  ODIN files became prevalent in 2016 and are similar to .LOCKY files.", "Windows, ", "[]"], "odif": ["Open Document Interchange Format", "Encoded binary document that uses the ODIF (Open Document Interchange Format) file format, which is part of the Open Document Architecture (ODA) standard; stores the binary data stream representation of an ODA document; used as a transport format suitable for transmission between systems.", "Windows, Mac, ", "[][]"], "odi": ["OpenDocument Image", "Image document created using the OASIS OpenDocument standard; contains the image graphics as well as XML-based definitions that describe the layout of the image; used for storing, exporting, and importing images in a standard format.", "Windows, Mac, Linux, ", "['Apache OpenOffice']['Apache OpenOffice', 'Planamesa NeoOffice']['Apache OpenOffice']"], "oc5": ["openCanvas 5 Event File", "File created by openCanvas 5, a free drawing program that allows recording and playback of drawing strokes; saves the stroke events used to create a drawing so that it can be automatically redrawn again in the software.", "Windows, ", "['Portalgraphics openCanvas']"], "odg": ["OpenDocument Graphic File", "An ODG file is a drawing created by Draw, an application available in the Apache OpenOffice suite.  It contains a vector graphic, which defines an image using points, lines, and curves.  ODG files are commonly used for logos, illustrations, and other drawings.", "Windows, Mac, Linux, ", "['Apache OpenOffice', 'LibreOffice', 'Calligra Suite']['Apache OpenOffice', 'Planamesa NeoOffice', 'LibreOffice', 'Calligra Suite']['Apache OpenOffice', 'LibreOffice', 'Calligra Suite']"], "oc4": ["openCanvas 4 Event File", "File created by openCanvas, a drawing application that allows playback of drawing events; saves the series of stroke events that were used to create the image; can be played back in the software to see how the image was drawn.", "Windows, ", "['Portalgraphics openCanvas']"], "oc3": ["openCanvas 3 Event File", "File created by openCanvas 3, a drawing program that allows stroke events to be recorded and replayed; saves a recording of the stroke events that took place to create the image; does not save the image itself, which is stored in an .OCI file.", "Windows, ", "['Portalgraphics openCanvas']"], "obw": ["Superior Drummer Sounds File", "File used by Superior Drummer, a program used for making drum tracks; contains a library of drum sounds saved in a proprietary, compressed format; includes many different kick, snare, tom-tom, hi-hat, and cymbal sounds, as well as other drum sounds.", "Windows, Mac, ", "['Toontrack Superior Drummer']['Toontrack Superior Drummer']"], "obz": ["Compressed 3D Object File", "Compressed three-dimensional object file used by Poser, a 3D art and animation program; contains points, polygons, texture maps, and other object information; compresses an .OBJ files for reduced storage.", "Windows, Mac, ", "['Smith Micro Poser 11']['Smith Micro Poser 11']"], "obt": ["Openbox Theme File", "Theme file used by Openbox, an open source window manager for GNOME and KDE Linux desktop environments; saves settings for window borders, menus, scrollbars, and other visual elements; includes the sizes, colors, fonts, and text styles; used for customizing the window appearance.", "Linux, ", "['Openbox']"], "obp": ["Bryce Object File", "3D objects file used by Bryce, a 3D modeling application; contains a collection of objects, which are used as a library for importing 3D elements into a model or scene; used for storing geometric shapes, terrains, vegetation, and other objects.", "Windows, Mac, ", "['DAZ 3D Bryce 7 Pro']['DAZ 3D Bryce 7 Pro']"], "obml16": ["Opera Mini Saved Web Page", "Web page saved in the Opera Binary Markup Language (OBML) format; created by Opera Mini, a web browser for mobile platforms; can only be opened with the Opera Mini browser. ", "Android, ", "['Opera Mini web browser']"], "obml15": ["Opera Mini Saved Web Page", "Saved web page created by Opera Mini, a web browser for mobile platforms; saved in the Opera Binary Markup Language (OBML) format, which can only be opened with the Opera Mini browser. ", "Android, ", "['Opera Mini web browser']"], "obml": ["Opera Mini Saved Web Page", "Web page saved by Opera Mini, a Web browser for mobile platforms; stored in the Opera Binary Markup Language (OBML) format, which is a compact format used for reducing the size of downloaded Web content; can only be opened with the Opera Mini browser.", "Windows, Android, ", "['OperaMiniLargeDevice', 'MicroEmulator']['Opera Mini web browser']"], "obk": ["Backup File", "Backup file created by O&O DiskImage, a file backup and Disk image creation application; contains a compressed, exact duplicate of the original file data; does not contain any drive information like the disk image file extension, .OMG.", "Windows, ", "['O&O Software O&O DiskImage 8', 'Corel WinZip 21']"], "obj": ["Wavefront 3D Object File", "An OBJ file is a standard 3D image format that can be exported and opened by various 3D image editing programs.  It contains a three-dimensional object including 3D coordinates, texture maps, polygonal faces, and other object information.", "Windows, Mac, Linux, Windows, Mac, ", "['NewTek Lightwave 3D', 'Adobe Photoshop CC 2017', 'Autodesk Maya 2017', 'DAZ 3D DAZ Studio 4', 'IMSI TurboCAD Pro 2017', 'Blender', 'MeshLab', 'MAXON Cinema 4D', 'Smith Micro Poser 11', 'Autodesk AutoCAD with OBJ Import plugin', 'Dassault Systemes SolidWorks with OBJ Import plugin', 'Siemens Solid Edge']['NewTek Lightwave 3D', 'Adobe Photoshop CC 2017', 'Autodesk Maya 2017', 'DAZ 3D DAZ Studio 4', 'IMSI TurboCAD Deluxe v10', 'Cheetah3D', 'Blender', 'MeshLab', 'MAXON Cinema 4D', 'Smith Micro Poser 11']['Autodesk Maya 2017', 'Blender', 'MeshLab', 'GLC_Player'][][]"], "oat": ["Android Optimized Application File", "An OAT file is created by the Android operating system in order to speed up the loading time of an Android app (.APK file).  When an app is installed, Android automatically optimizes app data and creates a corresponding OAT file.  Android uses this file to load the app more quickly, which creates a better experience for the user.", "Android, ", "['Google Android']"], "ob2": ["Oberon-2 Source Code File", "An OB2 file is a source code file written in the Oberon programming language.  The file contains a module that may include definitions, variables, constants, and functions.", "Windows, Linux, ", "['File Viewer Plus', 'Excelsior XDS']['Excelsior XDS']"], "obi": ["Outlook RSS Subscription File", "File created by Microsoft Outlook, a calendar and email program; contains RSS subscription names and properties in an XML format; used to store RSS feed subscriptions for an outlook profile.", "Windows, ", "['Microsoft Outlook 2016']"], "ob!": ["Orbit Downloader Incomplete Download", "File partially downloaded with Orbit Downloader, a download manager designed for Web 2.0 content; saved temporarily during the download process and is converted to the actual file when the download is complete.", "Windows, ", "['Orbit Downloader']"], "oar": ["OpenSimulator Archive", "Archive created by OpenSimulator, also known as \"OpenSim,\" an open source 3D application server used for creating virtual environments accessible over a network; contains \"prims,\" or items, and all asset data necessary to fully load the terrain, object textures, and their inventories on a different system.", "Windows, Linux, ", "[][]"], "oam": ["Adobe Edge Animate Widget File", "Animated widget created by Adobe Edge Animate, a program that uses HTML5, CSS, and JavaScript technologies to create animated Web content; contains shapes, images, and other content, as well as a timeline for playing the animation; can be created by publishing from an Edge Animate project (.AN file).", "Windows, Mac, ", "['Adobe Edge Animate CC', 'Adobe Animate CC 2017', 'Adobe InDesign CC 2017', 'Adobe Dreamweaver CC 2017']['Adobe Edge Animate CC', 'Adobe Animate CC 2017', 'Adobe InDesign CC 2017', 'Adobe Dreamweaver CC 2017']"], "obd": ["Office Binder Document", "File created by Office Binder, a program used to link common Microsoft document file types together; stores a \"binder,\" which includes a collection of Office document objects; used for linking document content together from Microsoft Word, Excel, PowerPoint, Project, and Visio files.", "Windows, ", "['Microsoft Office 2016', 'Microsoft Office 97 Unbind Utilities']"], "obb": ["Android Opaque Binary Blob File", "File used by some Android apps sold on the Google Play online store; contains additional app data that is not stored in the main application package (.APK file), such as graphics, media files, or other large program assets; uses an encrypted format.", "Web, ", "['Google Play Developer Console']"]}