{"p": ["Python Pickle File", "A P file is a pickle file created by pickle, a Python module used for converting Python objects to a byte representation for storage on disk or transfer over a network.  It allows for objects to be conveniently stored or transmitted without first having to convert the data to another format.  P files can be \"unpickled\" and loaded back into program memory during runtime.", "Windows, Mac, Linux, Windows, Mac, Windows, Mac, ", "['Python pickle']['Python pickle']['Python pickle']['NewTek LightWave 3D']['NewTek LightWave 3D']['Free Pascal']['Free Pascal', 'Bare Bones BBEdit', 'MacroMates TextMate']"], "p96": ["Win96 Database File", "Stores data recorded by a PRO-97/PRO-2055 Multi-System Trunking Scanner; may include recordings of radio communications or data imported from RadioReference.com", "Windows, ", "[]"], "p7x": ["Packed Digital Signature File", "File created by Microsoft Visual Studio, A Windows SDK; contains data, including a digital signature, to verify that the contents of the Windows Store application haven't been modified after they were digitally signed; held within an .APPX package file. ", "Windows, ", "['Microsoft Visual Studio 2017', 'Windows Store Apps']"], "pae": ["PowerArchiver Encrypted Archive", "Compressed and encrypted archive created by PowerArchiver; may be encrypted using one of five encryption algorithms -- Blowfish (128-bit), DES (64-bit), Triple DES (128-bit), AES 128-bit, and AES 256-bit; may require password to open.", "Windows, ", "['ConeXware PowerArchiver']"], "package": ["Electronic Arts Game Package File", "A PACKAGE file is a resource package file used by various Electronic Arts (EA) games, including The Sims 2, The Sims 3, The Sims Online, Spore, and SimCity 4.  It stores an archive of one or more game files, often in an XML format and may include 3D models, textures, sounds, and other game data, such as characters and neighborhood information.  PACKAGE files are saved in EA's standard DBPF archive format.", "Windows, Mac, Linux, ", "['Electronic Arts The Sims 2', 'Electronic Arts The Sims 3', 'Electronic Arts Spore', 'Ambertation SimPE', 'SporeEdit']['Electronic Arts The Sims 2', 'Electronic Arts The Sims 3', 'Electronic Arts Spore'][]"], "pac": ["Proxy Auto-Config File", "Configuration file used by Web browsers to select an appropriate proxy server; contains a JavaScript function named FindProxyForURL that defines rules for choosing a proxy server based on a given URL; used for controlling and load-balancing Internet traffic, especially in corporate environments.", "Windows, Mac, Linux, Windows, Windows, Windows, Mac, ", "['Microsoft Internet Explorer', 'Mozilla Firefox']['Apple Safari', 'Mozilla Firefox']['Mozilla Firefox']['EZTitles', 'Subtitle Edit']['FMJ-Software Awave Studio']['XnViewMP']['Lemkesoft GraphicConverter', 'XnViewMP']"], "pab": ["Personal Address Book", "Address book file used by Microsoft e-mail programs; contains information for personal and organizational contacts; stored separately from other Outlook data.", "Windows, Mac, ", "['Microsoft Outlook 2016', 'Microsoft Outlook Express', 'Microsoft Exchange Server']['Microsoft Outlook 2016']"], "pa": ["Print Artist Project", "Print project created with Print Artist, a graphic design program; typically designed from a template and may include custom graphics and text; may be a brochure, greeting card, calendar, scrapbook, poster, or other type of printable document.", "Windows, ", "['Nova Development Print Artist']"], "pad": ["ACT! Database Pointer File", "Shortcut file used by the ACT! customer relationship management (CRM) software; contains a pointer to the actual ACT! database files, which are stored in .ADF and .ALF files; often used as a desktop shortcut for opening the database.", "Windows, ", "['Swiftpage Act!']"], "p97": ["Win97 Database File", "Stores data recorded by a PRO-97/PRO-2055 Multi-System Trunking Scanner; may include recordings of radio communications or data imported from RadioReference.com", "Windows, ", "[]"], "p7s": ["Digitally Signed Email Message", "A P7S file is an email message that includes a digital signature.  It can be used for sending secure emails that can only be viewed by the intended recipient.  P7S files verify that the email is from who it claims to be from and that the email has not been modified in transit.", "Windows, Mac, Linux, ", "['Microsoft Outlook 2016', 'Mozilla Thunderbird', 'PostBox']['Apple Mail', 'Mozilla Thunderbird', 'PostBox']['Mozilla Thunderbird']"], "p7m": ["Digitally Encrypted Message", "Encrypted e-mail message in which the contents and attachments are enveloped in an smime.p7m file; may require a private key matching the message's public key to open the document.", "Windows, Mac, ", "['Cryptigo p7mViewer']['Apple Keychain Access']"], "p7c": ["PKCS #7 Certificate File", "Digital certificate file used by various applications to authenticate a Web identity; similar to a .P7B file, both of which contain a public key used to verify an entity using public-key cryptography.", "Windows, Mac, ", "['Microsoft Certificate Manager', 'Microsoft Windows Contacts', 'Adobe Reader', 'Adobe Acrobat DC']['Apple Keychain Access', 'Adobe Reader', 'Adobe Acrobat DC']"], "p7b": ["PKCS #7 Certificate File", "Security file that stores secure certificates used to authenticate a person or device, such as a computer or Web server; similar to a Base-64 (.CER) certificate, but uses different formatting; can be installed using the Certificate Import Wizard by right-clicking the file and selecting \"Install Certificate.\"", "Windows, Mac, Linux, ", "['Microsoft Certificate Manager', 'Adobe Reader']['Apple Keychain Access', 'Adobe Reader']['Adobe Reader']"], "p7r": ["Certificate Request Response File", "File used by various programs that include identity authentication mechanisms; stores a response to a digital certificate request that was issued from an authenticating entity; contains a digital signature.", "Windows, Mac, Linux, ", "['Microsoft Outlook 2016', 'OpenSSL']['Apple Keychain Access', 'Apple Mail', 'OpenSSL']['OpenSSL']"], "pzz": ["Compressed Poser Scene File", "Compressed scene file created with Poser, a 3D figure design and animation program; includes information such as figures, props, lighting, camera angles, and motion saved in the file.", "Windows, Mac, ", "['Smith Micro Poser 11']['Smith Micro Poser 11']"], "pzs": ["PhotoSuite Slide Show File", "Slide Show created by PhotoSuite, an image editor and organizer; contains slide images assembled by the user that appear based on the user-customized settings.", "Windows, Mac, ", "['Roxio Creator NXT Pro 5'][]"], "pzp": ["PhotoSuite Project File", "Project file created by PhotoSuite, a program used to edit digital photos; contains project images, settings, and resources; saves project as a layer-based compositions so that historical edits are modifiable; useful for creating templates for business cards, calendars, and greeting cards.", "Windows, Mac, Windows, ", "['Roxio Creator NXT Pro 5'][][]"], "p65": ["PageMaker 6.5 Document", "Document created with Adobe PageMaker 6.5, a program used by businesses and home office professionals to create page layouts; contains formatted document text and images; used for brochures, cards, newsletters, and other professional publications.", "Windows, Mac, ", "['Adobe InDesign CC 2017']['Adobe InDesign CC 2017']"], "pzfx": ["GraphPad Prism XML Project", "A PZFX file is a Prism project created by GraphPad Prism, a scientific application used to analyze and graph data.  It contains project data including graphs and layouts, notes, and tables. ", "Windows, Mac, iOS, ", "['GraphPad Prism']['GraphPad Prism']['GraphPad Prism Viewer']"], "pzf": ["GraphPad Prism Project", "A PZF file is a Prism project created by GraphPad Prism, an application used to create scientific graphs.  It contains Prism project data such as analysis results and choices, graphs and layouts, tables, and notes.", "Windows, Mac, iOS, ", "['GraphPad Prism']['GraphPad Prism']['GraphPad Prism Viewer']"], "pz3": ["Poser Scene File", "3D scene format used by Poser, an interactive 3D figure design and animation program; used for portraying human diversity, form and expression; contains information about figures, props, lighting, camera angles, and motion.", "Windows, Mac, ", "['Smith Micro Poser 11']['Smith Micro Poser 11']"], "pz2": ["Poser Pose File", "Pose file used by Poser, a 3D figure design program; contains information about figure's joint angles, body position, and morph values; may be applied to figures and props in scenes to specify the way they move.", "Windows, Mac, ", "['Smith Micro Poser 11']['Smith Micro Poser 11']"], "pyw": ["Python GUI Source File", "Python script that displays a graphical user interface (GUI); may contain standard Python code as well as graphical Python code; must be run using pythonw instead of python.", "Windows, Mac, Linux, ", "[][][]"], "pyxel": ["Pyxel Image Document", "Image file created and used by Pyxel Edit, a pixel art drawing application that can create images and animations; contains a pixel image with one or more image layers made up of tiles.", "Windows, Mac, ", "['Pyxel Edit']['Pyxel Edit']"], "pyx": ["Pyrex Source Code File", "Source code file written in Pyrex, a Python-like language used for writing Python extension modules with C-like syntax; may contain references to existing C modules; compiles code that increases the execution time of Python programs.", "Windows, Mac, Linux, ", "['Pyrex', 'Cython']['Pyrex', 'Cython']['Pyrex', 'Cython']"], "pyo": ["Python Optimized Code", "Compiled Python program, similar to a .PYC file, but assert statements and SET_LINENO instructions are removed.", "Windows, Mac, Linux, ", "['Python Software Foundation Python']['Python Software Foundation Python']['Python Software Foundation Python']"], "py": ["Python Script", "A PY file is a program file or script written in Python, an interpreted object-oriented programming language.  It can be created and edited with a text editor, but requires a Python interpreter to run.  PY files are often used for programming web servers and other administrative computer systems.", "Windows, Mac, Linux, ", "['File Viewer Plus', 'Python Software Foundation Python', 'Microsoft Notepad', 'Notepad++', 'text editor']['Python Software Foundation Python', 'MacroMates TextMate', 'text editor']['Python Software Foundation Python', 'GNU Emacs', 'gedit', 'text editor']"], "pxp": ["Counter-Strike PODBot Experience File", "Contains experience information for PODBots in Counter-Strike; \"PODBot\" stands for \"Ping of Death\" Bot and is a character that uses artificial intelligence to move and perform objectives in Counter-Strike; PXP files are typically associated with a specific bot waypoint (.PWF) file.", "Windows, ", "['Valve Counter-Strike']"], "pxv": ["Pixbend Media File", "Transport file containing video content encoded with Pixbend Technology; Pixbend is an alternate video codec designed to produce high quality video while requiring few resources at decoding time; it supports a wide range of video resolutions from mobile video to full HD and beyond.", "Windows, ", "[]"], "pxl": ["Pocket Excel File", "File created by Pocket Excel, a spreadsheet program used on Pocket PC mobile devices; contains data stored as a grid of rows and columns; can be converted into an Excel .XLS file.", "Windows, Mac, ", "['Microsoft ActiveSync']['Planamesa NeoOffice']"], "pxj": ["RecordNow Project", "Disc authoring project created with Sonic RecordNow, a CD/DVD burning program; used for creating data discs, as well as audio CDs and video DVDs; files can be organized by the user and then burned to a disc.", "Windows, ", "[]"], "pxi": ["PlexTools Disc Image", "Disc image created with PlexTools disc copying software (bundled with Plextor drives); commonly used to make backups of CDs and DVDs", "Windows, Windows, Mac, Linux, ", "['EZB Systems UltraISO', 'Smart Projects IsoBuster']['Pyrex', 'Cython']['Pyrex', 'Cython']['Pyrex', 'Cython']"], "pxf": ["Transit XV Pack Project File", "File created by Transit XV, a program that allows users to translate and localize language text for software applications; contains language terms and phrases as well as their translations; used to store all project translation information; saved in a compressed format.", "Windows, ", "[]"], "pxd": ["Pyrex Definition File", "Source code header file used by Pyrex, a language used for building Python modules with C-like syntax and performance; stores Cython declarations that can be included in Cython modules (.PYX files).", "Windows, Mac, Linux, Web, ", "['Pyrex', 'Cython']['Pyrex', 'Cython']['Pyrex', 'Cython']['Autodesk Pixlr']"], "pza": ["PhotoSuite Album File", "Photo album created by PhotoSuite, an image editor and organizer; contains images assembled by the PhotoSuite application and organized in customized albums.", "Windows, Mac, ", "['Roxio Creator NXT Pro 5'][]"], "pyc": ["Python Compiled File", "Complied source code written in the Python programming language.", "Windows, Mac, Linux, ", "['Python Software Foundation Python']['Python Software Foundation Python']['Python Software Foundation Python']"], "pwv": ["Password Vault Archive", "Archive format used by the Secret Space Encryptor Android app to store passwords; contains one or more encrypted passwords, PINs, and notes.", "Android, ", "['Paranoia Works Secret Space Encryptor']"], "pwt": ["AutoCAD Publish To Web Template", "Drawing publishing template created by AutoCAD, a 2D and 3D design and drawing application; stores settings for publishing a drawing (.DWG file) to a Web HTML format; includes the properties for images, text, hyperlinks, colors, Web page titles, and video animations; used for publishing Web drawings with the same formatting.", "Windows, Windows, ", "['Autodesk AutoCAD 2017']['Microsoft Word 2016', 'SoftMaker Office']"], "px": ["Pixel Image File", "Image file saved by the Pixel image editor, a multi-platform image editing, photo retouching, graphics manipulation, and animation program; supports layers, paths, channels, masks, and selections; may also include adjustment and effects layer like a Photoshop (.PSD) document.", "Windows, Mac, Linux, ", "[][][]"], "pyd": ["Python Dynamic Module", "Python extension that can be imported into Python programs", "Windows, Mac, Linux, ", "['Python Software Foundation Python']['Python Software Foundation Python']['Python Software Foundation Python']"], "pxr": ["Pixar Image File", "Uncompressed raster image format used by Pixar workstations; stores image data in RGB or grayscale with 8 bits per channel; developed in 1986 by Pixar and has been used for computer animation and medical imaging purposes.", "Windows, Mac, Linux, ", "['Adobe Photoshop CC 2017', 'Adobe Photoshop Elements 15', 'Wolfram Research Mathematica', 'fCoder Group Image Converter Plus', 'XnViewMP']['Adobe Photoshop CC 2017', 'Adobe Photoshop Elements 15', 'Wolfram Research Mathematica', 'XnViewMP']['Wolfram Research Mathematica']"], "pxm": ["Pixelmator Image File", "Proprietary raster image format used by Pixelmator, an image editing program for Mac OS X; may include multiple layers, layer masks, color correction settings, and image metadata.", "Mac, ", "['Pixelmator 3']"], "pwn": ["Pawn Source Code File", "Source code file programmed in Pawn, an open source programming language used to create embedded scripts in games; compiled into an AMX file, which contains the executable code.", "Windows, ", "[]"], "pwc": ["PictureTaker File", "Compressed Windows installation package used for installing software programs; can be created by a network administrator and deployed over a network", "Windows, ", "[]"], "pwf": ["Counter-Strike PODBot Waypoint File", "Contains waypoints, or locations, or PODBots in Counter-Strike; PODBots are \"Ping of Death\" bots that use artificial intelligence to move and perform objectives on a Counter-Strike level; PWF files are typically associated with a specific map (.BSP) file.", "Windows, ", "['Valve Counter-Strike']"], "pwl": ["Windows Password List", "Password file used by Windows for user logins, network and dial-up passwords; may contain up to 255 passwords, each which store a resource type, name, and password; stored in a proprietary encrypted format in the Windows directory.", "Windows, ", "['ElcomSoft Proactive System Password Recovery']"], "pwi": ["Pocket Word Document", "Document created by Microsoft Word for Windows Mobile edition, a word processing program also referred to as \"Pocket Word;\" created on Pocket PC PDAs running the Windows Mobile operating system; similar to a Word (.DOC) document, but does not support features such as headers, footers, and comments.", "Windows, Mac, ", "['Microsoft Outlook 2016', 'Microsoft Word 2016', 'Microsoft OneNote 2016']['Microsoft Word 2016']"], "pwd": ["Pocket Word Document", "Text document created by Pocket Word for Windows CE, a reduced version of Microsoft Word for the Windows Compact Edition mobile platform; can be opened by TextMaker (included in SoftMaker Office) and converted to more standard formats, such as .DOC and .DOCX.", "Windows, Windows, ", "['SoftMaker Office']['Siemens Solid Edge', 'Okino Computer Graphics PolyTrans']"], "pwa": ["Password Agent File", "Secure encrypted database file format created by Password Agent; used to store passwords, secret notes, and other secure information; accessible only with the correct password", "Windows, ", "[]"], "pvw": ["Pronto for Windows Data View File", "Data file used by Pronto for Windows, a program that allows users to extract data from data loggers; stores page layout and graphical and text formatting information of a data view.", "Windows, ", "['Outram Research Pronto for Windows']"], "pvs": ["Parallels Desktop Configuration File", "Stores configuration settings for Parallels Desktop, a program that allows Windows or Linux to run on an Intel-based Mac; loaded by the the Parallels virtual machine when the program is started.", "Windows, Mac, ", "['VMware vCenter Converter']['Parallels Desktop 12 for Mac']"], "pxb": ["Pixelmator Brush File", "Brush file used by Pixelmator, a Mac OS X image editing program; stores the default stroke style for painting an image; includes the brush shape, diameter, spacing, and other properties; used for drawing basic or custom patterns.", "Mac, ", "['Pixelmator 3']"], "pvm": ["Parallels Virtual Machine", "Virtual machine created with Parallels Desktop emulation software; contains the contents of a hard drive and memory that are used to load a Windows operating system (or other supported OS) on a Macintosh computer.", "Mac, Windows, Mac, Windows, ", "['Parallels Desktop 12 for Mac', 'VMware Fusion 8.5'][][][]"], "pvk": ["Private Key File", "Private key file used by software developers for digitally signing applications; stores the key as a segment of encrypted data in a small file; allows the application bundle to be authenticated by end users; often used in conjunction with .SPC and .PFX files.", "Windows, Mac, Linux, ", "['Microsoft File Signing Tool', 'OpenSSL', 'Pvktool']['OpenSSL']['OpenSSL']"], "pvr": ["POWERVR Texture File", "Texture file used by mobile devices and the Sega Dreamcast; provides a container that hosts compressed texture data that is optimized for POWERVR graphics chips; designed for displaying performance graphics in devices with smaller hardware footprints, such as mobile devices.", "Windows, Mac, Linux, Windows, ", "['Imagination Technologies PVRTexTool', \"Code'n'Web TexturePacker\", 'Adobe Photoshop with PVR plugin', 'Speud Blue Swirl Dream Explorer'][\"Code'n'Web TexturePacker\"]['Imagination Technologies PVRTexTool', \"Code'n'Web TexturePacker\"][]"], "pvhd": ["Paragon Virtual Hard Drive", "Backup format used by Paragon Backup and Recovery, a Windows utility used to create backups of and restore hard drives; stores a backup of a physical or virtual machine or an individual file.", "Windows, ", "['Paragon Backup & Recovery Suite']"], "pvd": ["Polygen3D Vector Descriptor", "Project file created by Polygen3D, a Java tool used for generating 3D surfaces; contains project data such as graphic, surface data and any other project-specific information;", "Windows, Mac, Linux, Windows, ", "['Varden Development Polygen3D']['Varden Development Polygen3D']['Varden Development Polygen3D'][]"], "puz": ["Across Lite Crossword Puzzle", "Electronic crossword puzzle that can be played or printed using Across Lite software; contains a single puzzle that can be filled out by the user.", "Windows, Mac, Windows, ", "['Literate Software Across Lite']['Literate Software Across Lite'][]"], "pup": ["PlayStation 3 Update File", "A PUP file is a file or patch used to update the PlayStation 3 (PS3) system software.  It may include security patches, bug fixes, and extra operating system features.  PUP files are typically named \"PS3UPDAT.PUP.\"", "Windows, Linux, ", "['PS3 PUP Extractor']['Puppy Linux']"], "publication": ["Twixl Publisher Publication", "Publication created by Twixl Publisher, a program that enables users to create interactive content apps for mobile devices; contains one or more articles, which includes its content, layout dimensions, title, and taglines.", "Windows, Mac, iOS, Android, ", "['Twixl Publisher']['Twixl Publisher']['Twixl Viewer']['Twixl Viewer']"], "pub": ["Publisher Document", "A PUB file is a document created by Microsoft Publisher, a desktop publishing program used to create professional documents and marketing materials.  It contains text, raster and vector images, and drawn objects formatted in a document. ", "Windows, Mac, Linux, Windows, Mac, Linux, ", "['Microsoft Publisher 2016', 'Adobe InDesign with PUB2ID Plugin', 'LibreOffice', 'CorelDRAW Graphics Suite X8']['Adobe InDesign with PUB2ID Plugin', 'LibreOffice']['LibreOffice']['PuTTYgen'][][]"], "pu": ["PlantUML File", "File created by PlantUML, an open source diagram writing tool used within programs like Microsoft Word or programming language like Java; contains text that is referenced by PlantUML to create diagram images that can be generated as .PNG or .SVG files; creates sequence, use case, class, activity, component, state, and object diagrams; same as the .PLANTUML file.", "Windows, Mac, Linux, ", "['PlantUML']['PlantUML']['PlantUML']"], "ptx": ["Pro Tools Session File", "Session file format introduced with Pro Tools 10 digital audio workstation (DAW) software; supports audio, MIDI, and software instrument tracks, as well as effects, mixing settings, and other edits; stores references to audio files but not the audio files themselves.", "Windows, Mac, Windows, Mac, Windows, Mac, Linux, Windows, ", "['Avid Pro Tools']['Avid Pro Tools']['West RealLegal E-Transcript Viewer', 'West E-Transcript Bundle Viewer', 'West RealLegal E-Transcript Manager', 'West Publisher', 'West RealLegal E-Transcript Reporter Edition', 'West RealLegal iBinder']['West RealLegal E-Transcript Viewer']['Microsoft Windows Photos', 'UFRaw']['UFRaw', 'MacPhun ColorStrokes'][]['Corel PaintShop Pro X9']"], "ptz": ["E-Transcript Bundle File", "E-Transcript file created by LiveNote or Case Notebook, which allow users to store digital artifacts from legal proceedings; contains text and multi-media contents in a single \"bundle\", including legal transcripts (.PTX files), courtroom video, exhibits, and depositions; used to review and analyze legal proceedings.", "Windows, ", "['West E-Transcript Bundle Viewer', 'West RealLegal E-Transcript Viewer', 'West LiveNote', 'West Case Notebook', 'West Publisher']"], "ptxt": ["Pro Tools Session Template", "Session template used by Pro Tools, a digital audio workstation (DAW); may contain audio, instrument tracks, MIDI, and video media; also includes session presets such as mixing settings, effects, and other user edits.", "Windows, Mac, ", "['Avid Pro Tools']['Avid Pro Tools']"], "ptt": ["MapPoint Map Template", "Template for creating a new map (.PTM) file in Microsoft MapPoint, a business mapping program; may include business travel and sales territory data as well as information from Microsoft Office documents.", "Windows, Windows, Mac, ", "['Microsoft MapPoint']['Avid Pro Tools']['Avid Pro Tools']"], "pts": ["Pro Tools Session", "Audio project created with Pro Tools digital audio workstation (DAW) software; may contain multiple audio and MIDI tracks, mixer settings, audio effects, and references to audio files; does not contain actual audio data.", "Windows, Mac, Windows, Mac, ", "['Avid Pro Tools']['Avid Pro Tools']['New House Internet Services PTGui']['New House Internet Services PTGui']"], "ptr": ["Flash Intro Project File", "Flash project created with Desktop Flash Intro Builder, an easy-to-use Flash intro creation program.", "Windows, ", "[]"], "ptn": ["PaperPort Thumbnail File", "File created by PaperPort, a program used for scanning documents, organizing files, and sharing documents; contains data needed to display thumbnail images; serves as an index file for documents used in PaperPort.", "Windows, ", "['Nuance PaperPort 14']"], "ptf": ["PSP Theme File", "Theme preference file used by the Sony PlayStation Portable (PSP); stores settings for the wallpaper, icons, and sounds used for the PSP interface; can be modified using the \"Theme Settings\" option on the PSP.", "Windows, Mac, Windows, Windows, Mac, ", "['PSP Theme Toolbox'][][]['Avid Pro Tools']['Avid Pro Tools']"], "ptm": ["MapPoint Map File", "Map format used by MapPoint, a mapping program for businesses; may include data such as business travel routes and sales territories; can also reference data in Microsoft Office files; used by multiple versions of MapPoint starting with MapPoint 2000.", "Windows, Windows, Mac, ", "['Microsoft MapPoint']['Nullsoft Winamp', 'MODPlug Player', 'Impulse Tracker']['CocoModX']"], "ptl": ["Rational Rose Petal File", "ASCII text-based file format exported from Rational Rose, a model-based software development program; consists of nested levels enclosed in parentheses that form a tree of nodes.", "Windows, Linux, ", "[][]"], "pth": ["4D Path Document", "Contains connection configuration information for a 4D Server database; may include the server name and location, username, and password; enables access directly from a 4D client machine", "Windows, Mac, ", "['4D Server']['4D Server']"], "ptg": ["PowerTeacher Gradebook Configuration File", "Configuration file used by PowerTeacher Gradebook, a web-based classroom management application; contains grade book configuration information that is referenced when the application connects to the server; includes user id, session id, school number, teacher id, credentials, and language.", "Windows, Mac, Windows, Mac, ", "['Pearson Education PowerTeacher Gradebook']['Pearson Education PowerTeacher Gradebook']['Ambient Design ArtRage Studio']['Ambient Design ArtRage Studio']"], "ptex": ["Ptex Texture File", "A PTEX file is a texture file used by Ptex, a texture mapping system for the rendering of production-quality animation in movies and shorts.  It contains one or more texture images including channels and metadata that can be accessed through the memory-managed cache.", "Windows, ", "['Ptex']"], "ptb": ["Sage 50 Backup File", "A PTB file is a backup file created by Sage 50, accounting software used to organize financial data.  It contains an exact copy of the company data.  PTB files are used to protect a user's financial data in case of data corruption or system errors.", "Windows, Windows, Mac, Linux, ", "['Sage 50']['TuxGuitar']['TuxGuitar']['TuxGuitar']"], "pswx": ["Password Depot Portable File", "File created by Password Depot, a password organizer for Windows, Android, and iOS; saves all password information in a portable XML format, but still encrypts the sensitive information with a master password; allows data to be transferred between the Windows and mobile versions of the software.", "Windows, iOS, Android, ", "['AceBIT Password Depot']['AceBIT Password Depot']['AceBIT Password Depot']"], "psz": ["Compressed PostScript File", "PostScript (.PS) document compressed with .ZIP compression; used for reducing the file size of PostScript documents when transferring them via email or over the Internet; can be unzipped and then opened with any standard PS viewer.", "Windows, Mac, ", "['7-Zip', 'Corel WinZip 21', 'Microsoft Windows zip utility']['Apple Archive Utility']"], "psw": ["Windows Password Reset Disk File", "Password backup file created with Windows' Forgotten Password Wizard; saved on a USB drive, floppy disk, or other media and can be used to reset a password for a Windows user; often uses the filename userkey.psw.", "Windows, Windows, Windows, Mac, Linux, ", "['Microsoft Password Reset Wizard']['AceBIT Password Depot']['Microsoft Word 2016', 'SoftMaker Office', 'Apache OpenOffice', 'LibreOffice']['Planamesa NeoOffice', 'Apache OpenOffice', 'LibreOffice']['Apache OpenOffice', 'LibreOffice']"], "psv": ["PlayStation 2 Save File", "PlayStation 2 (PS2) game file created using a PlayStation 3 (PS3); saved when a PS2 game is played on a PS3 system; can be transferred from the PS3's hard drive to a memory card, which can be used to copy the PSV file to a computer's hard drive.", "Windows, Windows, Windows, Mac, Linux, ", "['PSV Exporter', 'PS2 Save Builder'][]['Microsoft Excel 2016', 'Microsoft Access 2016', 'Apache OpenOffice']['Microsoft Excel 2016', 'Apache OpenOffice']['Apache OpenOffice']"], "pst": ["Outlook Personal Information Store File", "Data storage file that contains personal information used by Microsoft Outlook and Exchange; includes e-mail folders, contacts, addresses, and other data.", "Windows, Mac, ", "['Microsoft Outlook 2016', 'Microsoft Exchange Server', 'Microsoft Outlook Express', 'Remo Repair Outlook (PST)', 'BitDaddys Email Open View Pro', 'Encryptomatic PSTViewer Pro', 'OEMailRecovery.com Outlook Recovery Toolbox']['Microsoft PST Import Tool for Entourage', 'Stellar PST to MBOX Converter for Mac']"], "pssg": ["EGO Engine Textures File", "Graphics file used by games created with the EGO Engine, a race car game engine developed by Codemasters; contains textures for game objects, which may be stored in .DDS, .TGA, or .BMP files; used for racing car skins, track graphics, and other game graphics.", "Windows, ", "['F1 2010 Textures Editor', 'Codemasters Colin McRae: DiRT 3', 'Codemasters Operation Flashpoint: Red River']"], "pss": ["PlayStation 2 Game Video File", "A PSS file is a video file used by games for the PlayStation 2 console.  It contains audio and video data and is used for playing in-game cutscenes and other movies.  PSS files may be converted to more common video types, or split into separate audio and video files using several utilities.", "Windows, Mac, Linux, Windows, Windows, ", "['PSS Plex', 'PSS Player', 'VideoLAN VLC media player']['VideoLAN VLC media player']['VideoLAN VLC media player']['Autodesk AutoCAD 2017'][]"], "psr": ["Powersoft Report File", "Report generated by Sybase products, such as PowerBuilder, InfoMaker, or DataWindow Builder; stores a report template that has been filled with database information; used to store reports and send them over email.", "Windows, ", "[]"], "psproj": ["The Print Shop Project File", "Project created and used by The Print Shop, a layout designing application; stores a saved project that can be edited; includes text, headlines, shapes, lines, images, tables, and other designing features.", "Windows, Mac, ", "['Broderbund The Print Shop']['Broderbund The Print Shop for Mac']"], "psp": ["PaintShop Pro Image File", "Color bitmap image saved in the native PaintShop Pro format; may include layers, guides, vector paths, metadata, and other objects within the image file.", "Windows, Windows, Mac, Windows, Mac, ", "['Corel PaintShop Pro X9', 'CorelDRAW Graphics Suite X8', 'Corel VideoStudio Pro X10 Ultimate', 'ACD Systems Canvas X 2017', 'Serif PhotoPlus', 'Chasys Draw IES']['Web browser', 'text editor']['Web browser', 'text editor']['Adobe Photoshop CC 2017', 'Adobe Photoshop Elements 15']['Adobe Photoshop CC 2017', 'Adobe Photoshop Elements 15']"], "pspimage": ["PaintShop Pro Image", "A PSPIMAGE file is a graphic saved by Corel PaintShop Pro, a program used for editing images and digital photos.  It may contain both raster and vector graphics and supports layers, transparency, filters, and other image effects.  PSPIMAGE files are commonly used for storing touched up photos, as well as for exporting finished images to other raster image file formats.", "Windows, Mac, Linux, ", "['Corel PaintShop Pro X9', 'CorelDRAW Graphics Suite X8', 'Corel Painter 2017', 'Corel VideoStudio Pro X10 Ultimate', 'ACD Systems Canvas X 2017', 'XnViewMP']['Corel Painter 2017', 'XnViewMP']['XnViewMP']"], "pspd": ["PhotoSuite 5 Project File", "Project file created by Roxio PhotoSuite version 5, a program used to turn digital photos into greeting cards, invitations, and posters; contains references to digital photo files as well as image edits, text, and layout formatting; used to save and load a PhotoSuite project.", "Windows, ", "['Roxio Creator NXT Pro 5']"], "pspbrush": ["Paint Shop Photo Pro Brush File", "Paint brush file created by PaintShop Photo Pro, a raster graphics editor previously named Paint Shop Pro; contains a brush, which stores an image that can be repeatedly painted on the canvas; can be a brush included with the program or a custom brush created by the user.", "Windows, Mac, ", "['Corel PaintShop Pro X9', 'CorelDRAW Graphics Suite X8', 'Corel Painter 2017']['Corel Painter 2017']"], "psm": ["Protracker Studio Module", "Tracker format used by Protracker Studio; contains tracks and song patterns that can be played back by an audio tracker.", "Windows, Mac, Windows, Windows, ", "['MODPlug Player']['CocoModX']['Siemens Solid Edge'][]"], "psm1": ["Windows PowerShell Script Module File", "Script used by Windows PowerShell, a program similar to the Windows Command Prompt that provides more advanced shell functionality; contains functions and variables that can be included as a single module in a separate .PS1 script; used for storing reusable PowerShell libraries.", "Windows, ", "['Microsoft Windows PowerShell']"], "psk": ["Unreal Engine Skeletal Mesh File", "File used by the Unreal Engine, a gaming engine used to create first-person shooter games such as Unreal Tournament; contains mesh information for a 3D model; used to import 3D models into the Unreal Engine.", "Windows, Mac, ", "['Epic Games Unreal Engine']['Epic Games Unreal Engine']"], "psi": ["PrimalScript Online Help Shortcut", "Shortcut to online help documentation for PrimalScript, a visual script development program; contains a subject header, file description, and links to online help.", "Windows, ", "[]"], "psh": ["Photodex Slide Show", "Project file created by ProShow, a program used to create professional-quality slide shows with images, video, and audio; contains all setting and added effects necessary to load, create, and play the slide show; commonly used for business presentation materials, personal photography slide shows, and video publishing to the Web.", "Windows, ", "['Photodex Presenter plug-in', 'Photodex ProShow']"], "psg": ["Page Segment File", "Resource file referenced by Advanced Function Presentation (.AFP) files; defines page layout information for a printable file; may be generated using the AFP Toolbox; modifying a PSG file will alter the output of the corresponding AFP file.", "Windows, ", "['Web browser']"], "psf": ["Photoshop Proof Settings File", "Preference file that stores color settings used by Photoshop to provide accurate previews of how images will look when they are printed; can be loaded by selecting View → Proof Setup → Custom... in Photoshop.", "Windows, Mac, Windows, Windows, Mac, Windows, Mac, Linux, Linux, Windows, Windows, Windows, ", "['Adobe Photoshop CC 2017', 'Adobe Photoshop Elements 15']['Adobe Photoshop CC 2017', 'Adobe Photoshop Elements 15']['LinQuest GIANT']['ArcSoft PhotoStudio']['ArcSoft PhotoStudio']['Audio Overload', 'Nullsoft Winamp with the Highly Experimental plugin', 'XMPlay']['Audio Overload']['Audio Overload', 'XMMS with the Highly Experimental plugin'][]['Autodesk AutoCAD 2017'][][]"], "psw6": ["Password Depot 6 File", "File created by Password Depot 6, a password manager for Windows, Android, and iOS; saves a collection of personal passwords; can also store user names, credit card information, software licenses, importance levels, and other related information.", "Windows, iOS, Android, ", "['AceBIT Password Depot']['AceBIT Password Depot']['AceBIT Password Depot']"], "pse": ["Photoshop Elements Photo Project", "Digital photo editing project created by Photoshop Elements (PSE), a trimmed-down version of Adobe Photoshop; similar to a .PSD file (the default extension for Photoshop Elements) and saves the current image layers and applied edits.", "Windows, Mac, ", "['Adobe Photoshop Elements 15']['Adobe Photoshop Elements 15']"], "psdx": ["Photoshop Touch Document", "Image file created by Photoshop Touch, a touch-based drawing program for iPad and Android tablets; similar to a .PSD file used by the desktop version of Photoshop, but supports a reduced set of features; used for storing graphics drawn by hand.", "Windows, Mac, iOS, Android, ", "['Adobe Photoshop CC 2017']['Adobe Photoshop CC 2017']['Adobe Photoshop Touch']['Adobe Photoshop Touch']"], "psd": ["Adobe Photoshop Document", "A PSD file is an image file created by Adobe Photoshop, a professional image-editing program often used to enhance digital photos and create web graphics.  It is the native format used to save files in Photoshop.  PSD files may include image layers, adjustment layers, layer masks, annotations, file information, keywords, and other Photoshop-specific elements.  They are commonly created and shared among graphics professionals.", "Windows, Mac, Linux, Web, iOS, Android, ", "['File Viewer Plus', 'Adobe Photoshop CC 2017', 'Adobe Photoshop Elements', 'Adobe Illustrator CC 2017', 'Adobe InDesign CC 2017', 'CorelDRAW Graphics Suite X8', 'Corel PaintShop Pro X9', 'Corel Painter 2017', 'ACD Systems ACDSee 20', 'ACD Systems Canvas X 2017', 'MAGIX Xara Designer Pro X11', 'GIMP', 'DXTBmp']['Adobe Photoshop CC 2017', 'Adobe Photoshop Elements', 'Adobe Illustrator CC 2017', 'Adobe InDesign CC 2017', 'Snap Converter', 'Apple Preview', 'Corel Painter 2017', 'GIMP', 'Pixelmator 3']['GIMP']['Autodesk Pixlr']['Adobe Photoshop Touch', 'Adobe Photoshop Express', 'Pixelmator 2']['File Viewer for Android', 'Adobe Photoshop Express']"], "psc1": ["Windows PowerShell Console File", "File created by Windows PowerShell, an advanced shell for Windows; contains properties and registered snap-ins (plug-ins) that are used by the current console; used for saving and loading specific shell settings.", "Windows, ", "['Microsoft Windows PowerShell']"], "psc": ["Papyrus Script", "Source code file written in the Papyrus language; used to create a plugin for The Elder Scrolls V: Skyrim; contains functions that define events that occur in the game, such as a message or the behavior of a character.", "Windows, ", "['Bethesda Softworks The Elder Scrolls V: Skyrim Creation Kit', 'Bethesda Softworks The Elder Scrolls 5: Skyrim']"], "psb": ["Photoshop Large Document Format", "Format used for saving large Photoshop documents over 30,000 by 30,000 pixels in size; supports images up to 300,000 by 300,000 pixels; to enable .psb support, check the \"Enable Large Document Format\" within the File Handling pane of the Photoshop Preferences window", "Windows, Mac, Windows, Mac, Linux, ", "['File Viewer Plus', 'Adobe Photoshop CC 2017']['Adobe Photoshop CC 2017']['VideoLAN VLC media player', 'text editor']['VideoLAN VLC media player', 'text editor']['VideoLAN VLC media player', 'text editor']"], "psar": ["PSP Update File", "Data file used to update the Sony PlayStation Portable (PSP); sometimes used for installing custom firmware updates on the PSP; can only be accessed by unpacking the EBOOT.PBP file (see the .PBP entry for more information); typically named \"DATA.PSAR.\"", "Windows, ", "[]"], "psa": ["Unreal Engine Skeletal Animation File", "File used by the Unreal Engine, a 3D gaming engine used to develop first-person shooter games such as Unreal Tournament; contains 3D model animation settings for a .PSK file; used by the Unreal Engine to animate imported 3D models.", "Windows, Mac, Windows, Mac, Windows, Linux, ", "['Epic Games Unreal Engine']['Epic Games Unreal Engine']['Adobe Photoshop Elements 15']['Adobe Photoshop Elements 15'][][]"], "ps1xml": ["Windows PowerShell Display Configuration File", "Configuration file used by Windows PowerShell, a shell program included with Windows 7; contains XML definitions for how output is displayed within the console; used for formatting directory listings, help pages, registry information, and other output.", "Windows, ", "['Microsoft Windows PowerShell']"], "prx": ["Windows Media Profile File", "XML file used by Microsoft Windows multimedia programs for publishing digital video files; stores the audio and video codecs to use, as well as the target bit rates and language; used for publishing videos with the same formatting and quality.", "Windows, Windows, Windows, ", "['Microsoft Windows Media Player', 'Microsoft Windows Live Movie Maker'][]['Oracle Primavera']"], "ps1": ["Windows PowerShell Cmdlet File", "Script, or \"cmdlet,\" used by Windows PowerShell, a Windows shell program built on Microsoft's .NET Framework; contains a series of lines written in the PowerShell scripting language; similar to a .BAT or .CMD file, but executed by Windows PowerShell instead of the Windows CMD.EXE and COMMAND.COM programs.", "Windows, Windows, ", "['File Viewer Plus', 'Microsoft Windows PowerShell']['Microsoft Windows']"], "ps": ["PostScript File", "A PS file is an image saved in the PostScript page description language.  It may contain vector graphics, raster graphics, and text.  PS files can be printed directly by a PostScript printer (i.e., containing a Raster Image Processor) without being opened in an application.", "Windows, Mac, Linux, ", "['Adobe Illustrator CC 2017', 'Adobe Acrobat DC', 'Adobe Photoshop CC 2017', 'Adobe Photoshop Elements 15', 'ACD Systems Canvas X 2017', 'ACD Systems ACDSee 20', 'GSView', 'GPL Ghostscript', 'Inkscape']['Adobe Illustrator CC 2017', 'Adobe Acrobat DC', 'Adobe Photoshop CC 2017', 'Adobe Photoshop Elements 15', 'Inkscape']['Evince', 'GSView', 'Inkscape']"], "prw": ["Artlantis Shader Preview File", "Preview of a three-dimensional image or scene creating with Artlantis, a 3D rendering program; typically saved along with another image file (such as a .TGA file); allows the 3D image to be previewed before opening it.", "Windows, Mac, ", "['Graphisoft ArchiCAD with Artlantis plugin']['Graphisoft ArchiCAD with Artlantis plugin']"], "prv": ["Vue Preview File", "Image preview created by E-on Vue, a program used for 3D environment modeling; contains a preview image of a 3D scene, which typically has a lower resolution than the final rendered scene; used for storing scene previews before final production.", "Windows, Mac, Windows, Windows, ", "['E-on Vue']['E-on Vue']['AutoBAUP Free Folder Hider']['SoftMaker Office']"], "prtl": ["Premiere Pro Title File", "Video title file created by Adobe Premiere Pro, a professional video editing application; contains the text and styles for the main video heading or caption; commonly used for displaying text at the beginning and end segments of a video.", "Windows, Mac, ", "['Adobe Premiere Pro CC 2017']['Adobe Premiere Pro CC 2017']"], "prt": ["Presentations Template", "Presentation template created by Corel Presentations, an application included with Corel WordPerfect Office; saves a slide style and layout that can be used for creating new .SHW presentations.", "Windows, Windows, Mac, Linux, Windows, Windows, Mac, Windows, Mac, Linux, Windows, Windows, Linux, Windows, ", "['Corel Presentations X8']['Parametric Technology Creo', 'Okino Computer Graphics PolyTrans', 'Autodesk Fusion 360', 'Adobe Acrobat DC']['Adobe Acrobat DC']['Parametric Technology Creo']['Kubotek CADKEY', 'Kubotek Spectrum']['Siemens Solid Edge', 'Adobe Acrobat DC']['Adobe Acrobat DC']['Adobe Acrobat DC']['Adobe Acrobat DC'][][]['Caldera CopyRIP', 'Wasatch SoftRIP', 'MainTop DTP&SIII'][][]"], "prs": ["Harvard Graphics Presentation", "Presentation or slide show created with Harvard Graphics presentation software; may include text, images, charts, graphs, and other media; typically created from a pre-built template.", "Windows, Windows, Windows, Windows, ", "[]['Calyx Point', 'Calyx PointCentral'][][]"], "prproj": ["Premiere Pro Project", "A PRPROJ file is a video project created by Adobe Premiere Pro, a video editing application.  It contains a timeline that is comprised of video and audio clips and includes transitions, special effects, and other applied edits.  PRPROJ files also store project settings such as the settings for transitions, the video renderer, audio and video display format, and the capture format.", "Windows, Mac, ", "['Adobe Premiere Pro CC 2017']['Adobe Premiere Pro CC 2017']"], "props": ["Visual Studio Project Property File", "Property sheet created by Microsoft Visual Studio, an SDK used for developing Windows programs and Web applications; may contain build tool properties and user-defined macros; used for saving project configuration settings during development.", "Windows, ", "['Microsoft Visual Studio 2017']"], "provisionprofile": ["Apple Provision Profile", "Provision file created and used to distribute applications to iOS devices not through Apple's App Store; contains a certificate and the information for the device and application necessary to install an enterprise application on an iOS machine.", "Windows, Mac, ", "['Apple iPhone Configuration Utility']['Apple iPhone Configuration Utility']"], "proto": ["Protocol Buffer File", "Developer file created in Google's Protocol Buffer format, a data serialization format used for exchanging data; specifies one or more \"messages\" as logical records, each of which contains name-value pairs (e.g., a Person message may have an ID, name, and address); designed as an alternative to XML for data exchange.", "Windows, Mac, Linux, ", "['protobuf']['protobuf']['protobuf']"], "prop": ["Android Build Properties File", "Build properties file used by Android devices; contains information about your device, such as the model, brand, and version, and how your phone behaves.", "Android, ", "['ES File Explorer File Manager', 'JRummy Apps Root Browser', 'Speed Software Root Explorer', 'JRummy Apps Build Prop Editor']"], "properties": ["Minecraft Properties File", "A PROPERTIES file is a settings file used by Minecraft, a sandbox block construction game.  It is saved in plain text and stores configuration information for the game.  PROPERTIES files may be used for configuring a Minecraft multiplayer server or a game mod.", "Windows, Mac, Linux, Windows, Mac, Linux, ", "['Mojang Minecraft', 'Microsoft Notepad', 'text editor']['Mojang Minecraft', 'Apple TextEdit', 'text editor']['Mojang Minecraft', 'GNU Emacs', 'Vim', 'text editor']['Eclipse IDE for Java Developers', 'Microsoft Notepad', 'gVim', 'text editor']['Eclipse IDE for Java Developers', 'MacroMates TextMate', 'MacVim', 'text editor']['Eclipse IDE for Java Developers', 'Vim', 'GNU Emacs']"], "propdesc": ["Property Description", "XML file that describes properties that can be searched using Windows Search; created for properties that are not already in the property system; must be stored in a global location (not a user directory) in order to function correctly.", "Windows, ", "['Microsoft Windows Search', 'text editor']"], "profimail": ["ProfiMail Settings File", "Contains user settings for ProfiMail, an e-mail program for mobile devices; includes Accounts, Rules, and Signatures settings; typically named \"Settings.profimail.\"", "Android, Windows Phone, ", "[][]"], "profile": ["Bash Shell Profile", "Shell profile used by Linux and Mac OS X terminal programs; contains definitions for a shell environment, such as environment variables, scripts to execute, and other instructions; used for storing pre-defined settings that are loaded when a shell program starts.", "Mac, Linux, Windows, Windows, ", "['Apple Terminal', 'MacroMates TextMate', 'GNU Bash']['GNU Bash'][]['Citrix XenApp']"], "pro5x": ["ProPresenter 5 Bundle File", "Bundle created by ProPresenter, a presentation preparation program; similar to a .ZIP folder, includes .PRO5 documents along with any media elements included in the presentation or playlist selected; helpful for archival purposes and for transferring playlists between computers.", "Windows, Mac, ", "['Renewed Vision ProPresenter']['Renewed Vision ProPresenter']"], "pro5pl": ["ProPresenter Playlist File", "Playlist created by ProPresenter, a media package used for creating multimedia presentations used by churches and sports stadiums; saves an XML playlist consisting of audio, video, and .PRO5 files but does not include the referenced files (only .PRO5PLX files will include the audio and video files in the bundle); used for transferring presentation playlists between computers.", "Windows, Mac, ", "['Renewed Vision ProPresenter']['Renewed Vision ProPresenter']"], "pro5template": ["ProPresenter 5 Template", "Template created by ProPresenter, a program used for presentations in concerts, worship gatherings, sporting events, and concerts; contains data that describes slide properties, such as text size, font, angle, shadows, and background color.", "Windows, Mac, ", "['Renewed Vision ProPresenter']['Renewed Vision ProPresenter']"], "pro5plx": ["ProPresenter 5 Playlist Bundle", "Media package created by ProPresenter, a presentation preparation application used in church services, sporting events, and for television broadcasts; saves a playlist of audio, video, and .PRO5 files; includes the audio and video files used in the playlist; enables presentations to be archived or transferred between computers.", "Windows, Mac, ", "['Renewed Vision ProPresenter']['Renewed Vision ProPresenter']"], "pro5": ["ProPresenter 5 Document", "Presentation file created with ProPresenter, a program used for assembling productions for sporting events and church worship services; located in the ProPresenter Library; may contain multiple presentation slides as well as references to audio and video files; also stores the timeline for when to show each slide.", "Windows, Mac, ", "['Renewed Vision ProPresenter']['Renewed Vision ProPresenter']"], "pro4x": ["ProPresenter 4 Bundle File", "Presentation package created by ProPresenter, a church worship slide preparation application; may include multiple slides as well as documents, audio files, and video files; used for packaging all media files into a single bundle; useful for archival purposes and for transferring playlists between church computers.", "Windows, Mac, ", "['Renewed Vision ProPresenter']['Renewed Vision ProPresenter']"], "pro4plx": ["ProPresenter Playlist Bundle", "Multimedia package created by ProPresenter, a church worship service presentation preparation application; saves a playlist of audio, video, and .PRO4 files and also includes the audio and video files themselves; enables presentations to be archived or transferred between computers.", "Windows, Mac, ", "['Renewed Vision ProPresenter']['Renewed Vision ProPresenter']"], "pro4pl": ["ProPresenter Playlist File", "Multimedia playlist created by ProPresenter, a program used for creating church worship service presentations; saves an XML playlist of audio, video, and .PRO4 files but does not include the referenced files (use .PRO4PLX files to include the audio and video files in the bundle); used for transferring presentations outlines between computers.", "Windows, Mac, ", "['Renewed Vision ProPresenter']['Renewed Vision ProPresenter']"], "pro4": ["ProPresenter 4 Document", "Multimedia presentation created with ProPresenter, an application used for creating productions for church worship services; may contain multiple presentation slides as well as references to audio and video files; also stores the timeline for when to show each slide; used for saving the documents in the application's Library pane.", "Windows, Mac, ", "['Renewed Vision ProPresenter']['Renewed Vision ProPresenter']"], "pro": ["TurboFloorPlan 3D Design File", "Design file created by TurboFloorPlan 3D Home & Landscape, a professional application that enables users to design home and landscape layouts; contains a layout of a home property, which includes foundation, floor, electrical, plumbing, roof, HVAC, deck, landscape, and framing details.", "Windows, Mac, Windows, Mac, iOS, Android, Windows, Mac, Linux, Windows, Mac, Mac, Windows, Mac, Linux, ", "['IMSI TurboFloorPlan 3D Home & Landscape Pro 2017']['IMSI TurboFloorPlan 3D Home & Landscape Pro 2017']['Adobe Dreamweaver CC 2017']['Adobe Dreamweaver CC 2017']['Adobe Proto']['Adobe Proto']['Digia Qt SDK']['Digia Qt SDK']['Digia Qt SDK']['Punch! Software Home and Landscape Design Pro']['Punch! Software Home Design Studio Complete']['Renewed Vision ProPresenter']['KiCad']['KiCad']['KiCad']"], "prk": ["Thrillville Park File", "Theme park design created with Thrillville or Thrillville: Off the Rails; may contain roller-coasters, rides, and other games within the theme park; can be custom designed by the user using the game's \"Build\" feature.", "Windows, ", "[]"], "prj": ["Project File", "Generic project file extension used by multiple programs; typically saves project data and settings and may include references to other files used by the project.", "Windows, Mac, Windows, Linux, ", "['Microsoft Visual Studio', 'IDM UltraEdit', 'ESRI ArcGIS for Desktop', 'Autodesk AutoCAD 2017', 'Steinberg WaveLab', 'Mackie Tracktion', 'PlanetSquires FireFly Visual Designer', 'Progress Stylus Studio', 'Multi Edit Software Multi-Edit']['Freescale CodeWarrior', 'Mackie Tracktion'][][]"], "prnx": ["XtraReports PrintingSystem Document", "Document created by XtraReports, the DevExpress reporting suite used for creating complex, master-detail reports; contains PrintingSystem documents; enables saving and opening saved report documents; based on XML language.", "Windows, ", "['DevExpress Reporting Suite']"], "prn": ["Lotus 1-2-3 Formatted Text File", "A PRN file is a text file created by the Lotus 1-2-3 spreadsheet software.  It contains an export of the currently-active sheet and is saved in a plain text format.  PRN files can be used for importing spreadsheet data into other programs, such as Microsoft Excel.", "Windows, Mac, Windows, Mac, ", "['IBM Collaboration Solutions', 'Microsoft Excel 2016']['IBM Collaboration Solutions', 'Microsoft Excel 2016']['ACD Systems Canvas X 2017', 'AllWeb FastPrint', 'Microsoft Windows Command Prompt'][]"], "printcd2": ["EPSON Print CD File", "File created by EPSON Print CD, a CD label design program used for printing disc labels on supporting EPSON printers, such as the Stylus R200 and R300; saves the images and text used for the label.", "Windows, Mac, ", "['EPSON Print CD']['EPSON Print CD']"], "prm": ["Parameter File", "File used by various applications for inputting data parameters; often saved in a plain text format and uses a key-value structure where each line has a parameter name followed by a value; most times not compatible between different programs.", "Windows, Mac, Linux, Windows, Windows, Mac, Android, ", "['GSAS', 'Gurobi Optimizer']['GSAS', 'Gurobi Optimizer']['IBM ILOG CPLEX Optimization Studio', 'Gurobi Optimizer', 'GSAS']['Acclaim Entertainment Re-Volt', 'FreeVolts', 'R3-DCP', 'Zanoza ZModeler']['Adobe Premiere Pro CC 2017']['Adobe Premiere Pro CC 2017'][]"], "primitives_processed": ["World of Tanks 3D Model File", "3D Model file format used by World of Tanks (WoT), a war game featuring battles between tanks and other armored vehicles; stores information about a 3D model, such as a tank or other armored vehicle; replaced the .PRIMITIVES format with the release of WoT 0.9.10.", "Windows, ", "['Wargaming.net World of Tanks', 'World of Tanks Model Converter', '3D Object Converter']"], "pri": ["Qt Project Include File", "Software development settings file used by applications created for Qt, a cross-platform framework commonly used for building and running mobile applications; contains settings for the qmake command, which builds the application; used for specifying locations of developer files and platform-specific definitions.", "Windows, Mac, Linux, Windows, ", "['Digia Qt SDK']['Digia Qt SDK']['Digia Qt SDK']['Microsoft Visual Studio 2017']"], "prefpane": ["Mac OS X System Preference Pane", "Adds a system preference to the Mac OS X System Preferences window; Apple preferences are stored in System→Library→PreferencePanes, while third-party preferences are stored in the Library→PreferencePanes directory.", "Mac, ", "['Apple OS X']"], "prfpset": ["Premiere Pro Effect Preset File", "Video effects preset file used by Adobe Premiere Pro, a professional video editing and production application; contains effect settings such as motion, opacity, and time remapping values; can be saved and applied to multiple clips.", "Windows, Mac, ", "['Adobe Premiere Pro CC 2017']['Adobe Premiere Pro CC 2017']"], "prf": ["QuarkXPress Preferences File", "A PRF file is an application preferences file created by QuarkXPress, a page layout and publishing application.  it contains saved preferences such as workspace settings and import and export options.  PRF files can be used for transferring preferences between copies of QuarkXPress.", "Windows, Mac, Windows, Mac, Windows, Mac, Windows, Windows, Windows, Windows, Mac, Windows, ", "['QuarkXPress']['QuarkXPress']['Microsoft Outlook 2016']['Microsoft Outlook 2016'][][]['Microsoft Windows']['Microsoft Internet Explorer', 'Microsoft IIS'][][][][]"], "prg": ["Program File", "Program file used by various applications; may be an executable function or script that can be run within another program; may also be a text file that contains source code, which can be compiled into an executable program.", "Windows, Mac, Windows, Windows, Windows, Windows, Windows, Windows, Windows, Windows, Windows, ", "['File Viewer Plus', 'text editor']['text editor']['Hexagon Metrology PC-DMIS']['dBase', 'Harbor MiniGUI']['Midicase.com MPC Editor']['ABB RobotStudio', 'text editor']['CCS64']['File Viewer Plus', 'Microsoft Visual FoxPro']['Polyhedric Software WAVmaker', 'Polyhedric Software Mellosoftron', 'FMJ-Software Awave Studio']['RPG Toolkit']['Gemulator']"], "prel": ["Premiere Elements Project File", "Video project created with Adobe Premiere Elements, a non-linear video editing program for Windows; contains a timeline, multiple audio and video tracks, video effects, and other settings; includes references to audio and video files rather than then media itself.", "Windows, Mac, ", "['Adobe Premiere Elements 15', 'Adobe Premiere Pro CC 2017']['Adobe Premiere Elements 15', 'Adobe Premiere Pro CC 2017']"], "prefab": ["Unity Prefab File", "Prefabricated object file used by Unity, a 3D game development application; contains a 3D object and its properties and may be dropped into any scene; allows developers to reuse objects and animations between scenes and projects.", "Windows, Mac, ", "['Unity Technologies Unity']['Unity Technologies Unity']"], "pref": ["Preferences File", "Settings file used by various applications; often used as an application support file that contains program preferences such as program defaults or other user specified application preferences; uses the generic extension \".pref,\" which is short for \"preferences.\"", "Windows, Mac, ", "[][]"], "prd": ["SoftMaker Presentations Document", "Presentation file created by Presentations, a program included in the SoftMaker Office suite; saves an ordered list of slides and is similar to a Microsoft PowerPoint .PPT or .PPTX file; can be converted to the PowerPoint PPT and PPTX formats.", "Windows, Android, ", "['SoftMaker Office']['SoftMaker Office: Presentations Mobile']"], "prc": ["Product Representation Compact File", "File created in the Product Representation Compact (PRC) format, which is used to represent 3D models and assemblies; contains product structure, geometry, and product manufacturing information (PMI); stores data in a highly compressed format.", "Windows, Mac, Windows, Mac, Linux, Android, Windows, Mac, Windows, ", "['Adobe Acrobat DC']['Adobe Acrobat DC']['Amazon Kindle for PC', 'Geometer Plus FBReader', 'BookDesigner', 'Cool Reader', 'MBP reader']['Amazon Kindle for Mac', 'Geometer Plus FBReader']['Geometer Plus FBReader', 'Cool Reader', 'MBP reader']['Cool Reader']['Palm Desktop']['Palm Desktop']['Corel Presentations X8']"], "pqhero": ["Puzzle Quest Saved Game", "Game saved in Puzzle Quest: Challenge of the Warlords, a puzzle-based role playing game (RPG); saves the player's progress and game statistics so that gameplay can be resumed at a later time.", "Windows, ", "[]"], "ppz": ["Compressed Poser Prop File", "Compressed prop or object referenced by a model or animation created with Poser, a 3D human modeling program; may contain either geometry data or a reference to a .OBJ files that includes geometry information.", "Windows, Mac, ", "['Smith Micro Poser 11']['Smith Micro Poser 11']"], "pptx": ["PowerPoint Open XML Presentation", "A PPTX file is a presentation file created by Microsoft PowerPoint or another presentation program, such as OpenOffice Impress or Apple Keynote.  It contains a collection of slides, including their text, images, formatting, animations, drawn objects, and other media.  PPTX files are commonly used in business meetings, marketing applications, and academic classroom settings.", "Windows, Mac, Linux, Web, iOS, Android, ", "['File Viewer Plus', 'Microsoft PowerPoint 2016', 'Corel WordPerfect X8', 'Apache OpenOffice', 'Kingsoft Presentation', 'Ability Office', 'SoftMaker Office', 'LibreOffice', 'ACD Systems Canvas X 2017']['Microsoft PowerPoint 2016', 'Apple Keynote 7', 'Apache OpenOffice', 'Planamesa NeoOffice', 'LibreOffice']['Apache OpenOffice', 'LibreOffice']['Google Drive']['Microsoft PowerPoint', 'MobiSystems OfficeSuite Pro', 'Infraware Polaris Office', 'Google Drive']['Microsoft PowerPoint', 'SoftMaker Office: Presentations Mobile', 'Kingsoft WPS Office for Android', 'Google Drive', 'MobiSystems OfficeSuite Pro']"], "pptm": ["PowerPoint Open XML Macro-Enabled Presentation", "Macro-enabled presentation created by Microsoft PowerPoint, a program used to create presentations and slide shows; contains a collection of slides, including their text, layout, images, and embedded macros; commonly used to store business, marketing, and academic presentation materials.", "Windows, Mac, iOS, Android, ", "['File Viewer Plus', 'Microsoft PowerPoint 2016', 'Corel Presentations X8']['Microsoft PowerPoint 2016', 'Microsoft Office Open XML File Format Converter']['MobiSystems OfficeSuite Pro']['MobiSystems OfficeSuite Pro']"], "ppx": ["Serif PagePlus Template File", "Template for creating a new document (.PPP file) with PagePlus, a document design and publishing program; includes a predesigned layout that can be used to create multiple documents with a similar appearance.", "Windows, ", "['Serif PagePlus']"], "ppsx": ["PowerPoint Open XML Slide Show", "Slide show created by Microsoft PowerPoint, a program used to create personal and professional presentations and slide shows; includes a finished collection of slides; used for saving finalized presentations and for slide show playback.", "Windows, Mac, Linux, Web, iOS, Android, ", "['File Viewer Plus', 'Microsoft PowerPoint 2016', 'Microsoft PowerPoint Viewer', 'Apache OpenOffice', 'Kingsoft Presentation', 'Ability Office']['Microsoft PowerPoint 2016', 'Microsoft Office Open XML File Format Converter', 'Apache OpenOffice']['Apache OpenOffice']['Google Drive']['MobiSystems OfficeSuite Pro', 'Google Drive']['MobiSystems OfficeSuite Pro', 'Google Drive']"], "ppt": ["PowerPoint Presentation", "A PPT file is an editable slide show created by Microsoft PowerPoint or another presentation program, such as OpenOffice Impress or Apple Keynote.  It may include formatted text, bullet points, images, movies, sound effects, and music.  PPT files are commonly built from one of many templates included with the PowerPoint software, but may also be created from scratch.", "Windows, Mac, Linux, Web, iOS, Android, ", "['File Viewer Plus', 'Microsoft PowerPoint 2016', 'Microsoft PowerPoint Viewer', 'Nuance OmniPage Ultimate', 'ACD Systems Canvas X 2017', 'Corel Presentations X8', 'SoftMaker Office', 'Apache OpenOffice', 'Kingsoft Presentation', 'Ability Office']['Microsoft PowerPoint 2016', 'Apple Keynote 7', 'Apache OpenOffice', 'Google Drive']['Apache OpenOffice']['Google Drive']['Microsoft PowerPoint', 'MobiSystems OfficeSuite Pro', 'Google Drive', 'Infraware Polaris Office']['Microsoft PowerPoint', 'SoftMaker Office: Presentations Mobile', 'Kingsoft WPS Office for Android', 'Google Drive', 'MobiSystems OfficeSuite Pro']"], "pps": ["PowerPoint Slide Show", "A PPS file is a slide show created by Microsoft PowerPoint, a popular program included with Microsoft Office for creating presentations.  It is saved as a completed slide show, which can be viewed by either PowerPoint or PowerPoint Viewer.  PPS files are not editable like .PPT files.", "Windows, Mac, Linux, iOS, Android, ", "['File Viewer Plus', 'Microsoft PowerPoint 2016', 'Microsoft PowerPoint Viewer', 'Apache OpenOffice', 'Ability Office']['Microsoft PowerPoint 2016', 'Apple Keynote 7', 'Apache OpenOffice']['Apache OpenOffice']['MobiSystems OfficeSuite Pro']['MobiSystems OfficeSuite Pro']"], "ppr": ["Cognos PowerPlay Report File", "File generated by Cognos PowerPlay, an OLAP application used for business intelligence analysis; saves a report which can contain charts, graphs, and data tables from statistical analyses; used for competitive intelligence, business performance analysis, financial summaries, and for making projections.", "Windows, Linux, Windows, Windows, ", "['IBM Cognos PowerPlay']['IBM Cognos PowerPlay']['Accord SmartWorks Project Planner Reader']['VamSoft ORF']"], "ppp": ["Serif PagePlus Document", "Project created with Serif Page Plus, a British desktop publishing program for Windows; may contain text, images, charts, tables, and multiple pages.", "Windows, Windows, ", "['Serif PagePlus']['CyberLink PowerProducer 6']"], "ppsm": ["PowerPoint Open XML Macro-Enabled Slide Show", "A PPSM file is a macro-enabled slide show created by Microsoft PowerPoint, a program that allows users to create slide shows and presentations.  It contains a non-editable collection of slides.  PPSM files are used for packaging view-only Open XML-based presentations, such as .PPTX files, for sharing with others.", "Windows, Mac, iOS, Android, ", "['Microsoft PowerPoint 2016', 'Microsoft PowerPoint Viewer']['Microsoft PowerPoint 2016', 'Microsoft PowerPoint Viewer']['MobiSystems OfficeSuite Pro']['MobiSystems OfficeSuite Pro']"], "ppk": ["PuTTY Private Key File", "File created by PuTTYgen (PuTTY Key Generator), a program used for generating keys for public-key cryptography; stores a private key generated by the program; used for enabling secure communication with a remote entity that has the corresponding public key.", "Windows, ", "['PuTTY', 'PuTTYgen']"], "ppm": ["Portable Pixmap Image File", "24-bit color image formatted using a text format; stores each pixel with a number from 0 to 65536, which specifies the color of the pixel; also stores the image height and width, whitespace data, and the maximum color value.", "Windows, Mac, Linux, Android, Windows, ", "['File Viewer Plus', 'GIMP', 'Corel PaintShop Pro X9', 'Adobe Photoshop with CartaPGM plugin', 'ACD Systems Canvas X 2017', 'ACD Systems ACDSee 20', 'Netpbm', 'text editor']['GIMP', 'Planamesa NeoOffice', 'Adobe Photoshop with CartaPGM plugin', 'Netpbm', 'text editor']['GIMP', 'Netpbm', 'text editor']['File Viewer for Android'][]"], "ppj": ["Premiere 6 Project File", "Video project created by Adobe Premiere 6, a video editing application; stores video clips, transitions, and effects; used for saving editing projects; created by the Windows version of Premiere only.", "Windows, Mac, ", "['Adobe Premiere Pro CC 2017']['Adobe Premiere Pro CC 2017']"], "ppf": ["Picture Publisher Image File", "Image file created by Corel Picture Publisher, a program previously owned by Micrografx; contains a bitmap image; can be created and edited with various text, drawing, and painting tools in Picture Publisher.", "Windows, Windows, Windows, Windows, Windows, Windows, ", "['CorelDRAW Graphics Suite X8'][]['STAR Group Transit NXT']['Planit Edgecam'][]['Corel PaintShop Pro X9']"], "ppa": ["PowerPoint Add-in", "Add-in file used by Microsoft PowerPoint, a program that allows users to create presentations; contains custom commands and macros written in the VBA (Visual Basic for Applications) language; used to extend the capabilities of Microsoft PowerPoint.", "Windows, Mac, ", "['Microsoft PowerPoint 2016']['Microsoft PowerPoint 2016']"], "ppd": ["PostScript Printer Description File", "File that serves as a driver for a PostScript printer; describes the font, paper sizes, DPI resolution, memory configuration, and other features and capabilities supported by the printer.", "Windows, Mac, ", "['text editor']['text editor']"], "ppc": ["Mobile Data Studio Project File", "Project file created by Mobile Data Studio, an application used for creating mobile device business applications; saves a collection of user interface pages that include interactive fields; enables users to save application development progress.", "Windows, Windows, ", "['CreativityCorp Mobile Data Studio']['Microsoft PowerPoint 2016']"], "ppam": ["PowerPoint 2007 Add-In", "Add-in file used by Microsoft PowerPoint, a program used to develop slide show presentations; contains components that add additional functionality, including extra commands, custom macros, and new tools; used to extend default PowerPoint functions.", "Windows, Mac, ", "['Microsoft PowerPoint 2016']['Microsoft PowerPoint 2016']"], "potm": ["PowerPoint Open XML Macro-Enabled Presentation Template", "A POTM file is a macro-enabled presentation template created by Microsoft PowerPoint, a program used for creating slide show presentations.  It contains default images, slide templates, macros, and formatting.  POTM files are used to create multiple .PPTM files with the same formatting and macro settings.", "Windows, Mac, ", "['File Viewer Plus', 'Microsoft PowerPoint 2016']['Microsoft PowerPoint 2016', 'Planamesa NeoOffice']"], "potx": ["PowerPoint Open XML Presentation Template", "A POTX file is a presentation template created by PowerPoint, a program that allows users to create slide show presentations.  It contains default styles, text, layout, and formatting.  POTX files are used to create multiple .PPTX files with the same formatting.", "Windows, Mac, ", "['File Viewer Plus', 'Microsoft PowerPoint 2016']['Microsoft PowerPoint 2016', 'Microsoft Office Open XML File Format Converter', 'Planamesa NeoOffice']"], "pov": ["POV-Ray Raytracing Format", "Three-dimensional graphic that uses the Persistence of Vision Raytracer (POV-Ray) format; supports shapes, colors, textures, rotations, light, atmospheric effects, viewing perspectives, and other 3D image properties; stored in an ASCII text format.", "Windows, Mac, Linux, Windows, ", "['POV-Ray']['POV-Ray']['POV-Ray'][]"], "pp2": ["PingPlotter Data File", "Stores data collected by PingPlotter, a visual traceroute network troubleshooting tool; allows network problems to be identified and monitored using a graphical display; lists each location, or hop, that data moves through from its starting point to its destination; includes IP addresses, DNS names, and response times.", "Windows, Windows, Mac, ", "[]['Smith Micro Poser 11']['Smith Micro Poser 11']"], "por": ["SPSS Portable File", "ASCII text data file created by SPSS, a statistics processing application; stores exported data from the software in a plain text format, which is easily readable by other applications; used for sharing data between programs and computer systems.", "Windows, Mac, Linux, ", "['IBM SPSS']['IBM SPSS']['IBM SPSS']"], "popshape": ["PopChar Character Shape File", "Character shape file used by PopChar, an OS X utility tool for accessing special characters and adding them to documents; contains a drawing of a character shape. ", "Mac, ", "['Ergonis PopChar']"], "policy": ["Java Policy Implementation File", "A POLICY file is a configuration file used by Java Runtime Environment (JRE) and Java SE Development Kit (JDK) to determine the granted permissions for each Java program.  It contains a list of permission information that specifies the types of system resource accesses that can be used by a Java program.", "Windows, Mac, Linux, ", "['Oracle Java Runtime Environment', 'Oracle Java SE Development Kit']['Oracle Java Runtime Environment', 'Oracle Java SE Development Kit']['Oracle Java Runtime Environment', 'Oracle Java SE Development Kit']"], "pot": ["Portable Object File", "Object file that may be referenced by Java programs, GNU gettext, or other applications; often used to store properties and other basic information; saved in a human-readable format that can be viewed in a text editor.", "Windows, Mac, Linux, Windows, Mac, ", "['text editor']['text editor']['text editor']['File Viewer Plus', 'Microsoft PowerPoint 2016', 'Kingsoft Presentation']['Microsoft PowerPoint 2016', 'Planamesa NeoOffice']"], "pol": ["Windows Policy File", "File typically named Registry.pol and created by Group Policy Object Editor, an administration tool for Windows; saves registry keys created while authoring an Administrative Template; can specify local or global user settings.", "Windows, ", "['Microsoft Group Policy Object Editor', 'Registry.Pol Viewer Utility']"], "poi": ["Magellan Maestro Point of Interest File", "Point of Interest (POI) file used by Magellan Maestro personal navigation systems; contains one or more points of interest, including their names and locations; can be a navigation destination or a point used to generate navigational routes.", "Windows, ", "[]"], "pod": ["Terminal Reality Game Data File", "Container format used by Terminal Reality games; may store various types of game data, such as 3D models, textures, sounds, maps, and the user interface.", "Windows, Mac, Windows, Mac, Linux, Windows, Mac, Linux, ", "['Dragon UnPACKer', 'BR2PodTools']['Dragon UnPACKer'][][][]['File Viewer Plus', 'text editor']['Perl', 'MacroMates TextMate', 'text editor']['perldoc', 'text editor']"], "po": ["Portable Object", "Text-based object file used in software development; may be referenced by Java programs, GNU gettext, or other software programs as a properties file; saved in a human-readable format that can be viewed in a text editor.", "Windows, Mac, Linux, ", "['text editor']['text editor']['text editor']"], "pnz": ["Panorama Database Set", "File created by Panorama, a fast database and spreadsheet program; saves references to database files (.PAN files) but does not store the actual databases themselves; enables multiple databases to be opened at once.", "Windows, Mac, ", "['ProVUE Development Panorama']['ProVUE Development Panorama']"], "pns": ["PNG Stereo Image", "Stereoscopic image used for creating 3D effects from 2D images; contains two side-by-side .PNG images that produce a three-dimensional image when combined together in a stereoscopic image rendering software.", "Windows, Linux, Windows, Windows, ", "['NVIDIA 3D Vision Photo Viewer']['zyk'][][]"], "pnm": ["Portable Any Map Image", "Bitmap image created in the Portable Any Map format, which was designed to handle several types of portable monochrome, grayscale, and color images; may include raster graphic data in a .PBM, .PGM, or .PPM format; may be stored using binary data or ASCII text.", "Windows, Mac, Linux, ", "['Newera Graphics Converter Pro', 'ImageMagick', 'XnViewMP', 'GIMP', 'The MathWorks MATLAB', 'Wolfram Research Mathematica', 'Adobe Photoshop CC 2017']['ImageMagick', 'XnViewMP', 'GIMP', 'The MathWorks MATLAB', 'Wolfram Research Mathematica', 'Adobe Photoshop CC 2017']['ImageMagick', 'XnViewMP', 'GIMP', 'Wolfram Research Mathematica']"], "pnh": ["Project ROME Plug-in Archive", "Plugin used by Project ROME, a content creating and publishing application; contains data that adds functionality to the program; used to expand the capabilities of the program; can be created by third party developers.", "Windows, Mac, ", "['Adobe Project ROME']['Adobe Project ROME']"], "pnproj": ["Programmer's Notepad Project File", "Programming project created with Programmer's Notepad, a text editor designed for writing and editing source code; contains values set according to a project template (.PNPT) file; also stores project settings and properties.", "Windows, ", "[\"Programmer's Notepad\"]"], "png": ["Portable Network Graphic", "A PNG file is an image file stored in the Portable Network Graphic (PNG) format.  It contains a bitmap of indexed colors and uses lossless compression, similar to a .GIF file but without copyright limitations.  PNG files are commonly used to store graphics for web images.", "Windows, Mac, Linux, Web, iOS, Android, ", "['File Viewer Plus', 'Microsoft Windows Photos', 'Microsoft Windows Photo Viewer', 'Microsoft Paint', 'Adobe Photoshop CC 2017', 'Adobe Photoshop Elements 15', 'Adobe Illustrator CC 2017', 'CorelDRAW Graphics Suite X8', 'Corel PaintShop Pro X9', 'ACD Systems ACDSee 20', 'ACD Systems Canvas X 2017', 'Roxio Creator NXT Pro 5', 'picture viewer', 'Web browser']['Apple Preview', 'Apple Photos', 'Apple Safari', 'Adobe Photoshop CC 2017', 'Adobe Photoshop Elements 15', 'Adobe Illustrator CC 2017', 'Roxio Toast 15', 'MacPhun ColorStrokes', 'picture viewer', 'Web browser']['GIMP', 'picture viewer', 'Web browser']['Google Drive', 'Microsoft OneDrive']['Google Drive', 'Pixelmator 2', 'Microsoft OneDrive', 'Adobe Photoshop Express']['Google Drive', 'Microsoft OneDrive', 'Adobe Photoshop Express']"], "pnf": ["Precompiled INF File", "A PNF file is a system-maintained configuration file that is created when an .INF file is run.  It is stored in the %Windir%Inf or %Systemroot%Inf folder in Windows.", "Windows, ", "[]"], "pna": ["PhatNoise Audio File", "Proprietary audio format developed by PhatNoise; playable with PhatNoise software or PhatNoise audio hardware, such as PhatBox automotive sound systems; supported on Windows systems directly and on Mac OS X via third party support.", "Windows, Mac, ", "[][]"], "pmt": ["PageMaker Template File", "File created for PageMaker 7.0, a page layout designing and formatting application; contains a character set template for identifying key strokes for ASCII characters available in most fonts; created for each version of PageMaker; replaced the .T65 PageMaker file.", "Windows, Mac, ", "['Adobe PageMaker 7', 'Adobe InDesign CC 2017']['Adobe PageMaker 7', 'Adobe InDesign CC 2017']"], "pn": ["Powernoodle File", "File created by Powernoodle, an online collaboration application used for discussing business plans, ideas, and implementations; stores content created through a Powernoodle session, such as diagrams, outlines, debriefings, or other business document content; allows users to template their organization's intellectual property, processes, business rules, and knowledge in order to share with others.", "Web, ", "['Powernoodle']"], "pmx": ["MikuMikuDance Model File", "3D model used by MikuMikuDance (MMD), a dance animation program originally created in Japanese; contains a 3D mesh for models, dancers, characters, and other accessories that can be texturized and animated with the MikuMikuDance tools; used for storing different dancer models.", "Windows, Windows, Mac, ", "['MikuMikuDance', 'Pmx Editor']['Broderbund PrintMaster v7 Platinum']['Broderbund PrintMaster v7 Platinum']"], "pmr": ["Avid Persisent Media Record File", "Media database file created by Avid video editing and finishing applications; saves an index of information about Media Objects (MOB), which are the assets used by the editing project; enables the software to keep up-to-date information on audio and video resources.", "Windows, Mac, Windows, ", "['Avid Media Composer', 'Avid NewsCutter', 'Avid Symphony', 'Avid Xpress']['Avid Media Composer', 'Avid NewsCutter', 'Avid Symphony', 'Avid Xpress']['Microsoft Performance Monitor']"], "pmp": ["AutoCAD Plot Model Parameter File", "File used by AutoCAD, a CAD program used for creating designs; contains custom configuration information for a .PC3 file, including plotter calibration data and paper size; used to store common plotter calibration settings for use with multiple PC3 files.", "Windows, ", "['Autodesk AutoCAD 2017']"], "pmo": ["Broderbund Print Meta Object File", "File created by PrintMaster, a program used to create greeting cards, brochures, CD labels, and other prints; contains all project information, including graphics, layouts, and other settings; used to transfer projects between programs within the Broderbund creativity suite.", "Windows, Windows, ", "['Broderbund PrintMaster v7 Platinum']['Pegasus Mail']"], "pmm": ["MikuMikuDance PolygonMovieMaker File", "3D dance animation project created by MikuMikuDance, a dance animation program originally created in Japanese; contains model, animation, and music settings for a 3D dance routine; supports multiple dancers in the same scene.", "Windows, Windows, ", "['MikuMikuDance']['Pegasus Mail']"], "pml": ["Process Monitor Log File", "Log file created by Process Monitor, a real-time process monitoring tool for Windows; contains a log of system activities in the file system and registry, as well as in system processes and threads; used for analyzing issues with computer performance and security permissions.", "Windows, Windows, Mac, Linux, Windows, Mac, Linux, Android, Windows Phone, ", "['Sysinternals Process Monitor']['Pyre']['Pyre']['Pyre']['eReader', 'Calibre']['eReader', 'Calibre']['eReader', 'Calibre']['eReader']['eReader']"], "pmg": ["PageMaker Group File", "File created by PageMaker, a program used to create page layouts; contains an .EPS graphic, which includes both a low resolution raster graphic and PostScript data for high resolution prints; created using the \"PS Group it\" feature, which groups objects together and replaces the page graphics with a generated PMG file.", "Windows, Windows, Mac, ", "['Adobe PageMaker 7', 'Adobe InDesign CC 2017']['Adobe Photoshop CC 2017', 'Adobe Photoshop Elements 15']['Adobe Photoshop CC 2017', 'Adobe Photoshop Elements 15']"], "pmf": ["ESRI Published Map File", "Read-only map file created with ArcMap, a application included with ESRI Desktop GIS; stores a constrained version of a .MXD map file; can be viewed with the free ArcReader application, which allows maps to be shared with users who have not purchased the commercial ArcGIS software; often emailed to clients or co-workers in collaborative office environments.", "Windows, Windows, Windows, ", "['ESRI ArcReader', 'ESRI ArcGIS for Desktop'][]['Eassos PartitionGuru']"], "pmj": ["Pegasus Mail Configuration File", "File used by Pegasus Mail, a client email program; contains mailbox configuration information, such as default mail views; commonly found with the file name state.pmj in the root directory of a Pegasus Mail installation.", "Windows, ", "['Pegasus Mail']"], "pmd": ["PageMaker Document", "Page layout file created with Adobe PageMaker, a program used for creating professional publications such as newsletters and brochures; contains formatted text, images, and drawn objects; can import images created in other Adobe programs.", "Windows, Mac, Windows, Mac, Windows, Android, Windows, ", "['Adobe PageMaker 7', 'Adobe InDesign CS6']['Adobe PageMaker 7', 'Adobe InDesign CS6']['Smith Micro Poser 11']['Smith Micro Poser 11']['SoftMaker Office']['SoftMaker Office: PlanMaker Mobile']['MikuMikuDance', 'PMD Editor']"], "pmatrix": ["Priority Matrix Project File", "File created by Priority Matrix, a program used for planning, tracking, and organizing priorities across projects and devices; includes priority information for agendas, tasks, and other action items; used by project managers and also within collaborative team environments for sharing project information.", "Windows, Mac, iOS, ", "['Appfluence Priority Matrix']['Appfluence Priority Matrix']['Appfluence Priority Matrix']"], "pmc": ["Performance Monitor Counter File", "Contains settings for Performance Monitor, a system monitoring program for Windows NT and Windows Server; includes charting configuration options and Counter Monitor settings that specific which processes to monitor.", "Windows, ", "[]"], "pm": ["Unix XV Graphic File", "Bitmap image format generated by the Unix program \"xv,\" an interactive image manipulation program for the X Window System; also a used by IBM's OS/2 Presentation Manager.", "Windows, Mac, Linux, Windows, Mac, Linux, ", "['XnViewMP', 'Newera Graphics Converter Pro']['XnViewMP', 'Lemkesoft GraphicConverter'][]['File Viewer Plus', 'text editor']['MacroMates TextMate', 'Bare Bones BBEdit', 'Bare Bones TextWrangler', 'text editor']['text editor']"], "ply": ["Finale Playback File", "Music file created by Finale music notation software; saves audio data for sheet music that can be played back in the software; used for playing musical compositions.", "Windows, Mac, Windows, Mac, Linux, ", "['MakeMusic Finale']['MakeMusic Finale']['quick3D', 'Wolfram Research Mathematica', 'MeshLab', 'Blender']['Wolfram Research Mathematica', 'MeshLab', 'Blender']['Wolfram Research Mathematica', 'MeshLab', 'Blender', 'ZipPack', 'PLY Tools', 'RPly']"], "plx64": ["64-bit Linux IDA Plugin Module", "64-bit Linux plugin module used by IDA (The Interactive Disassembler), a multi-processor tool used to debug and disassemble executable files into low-level assembly language code; contains a plugin written in C++ that extends the capabilities of the IDA tool.", "Linux, ", "['Hex-Rays IDA']"], "plx": ["Perl Executable File", "Executable program written in the Perl programming language; often used for Web applications that are run on a Web server, but may be run on any system that includes a Perl interpreter.", "Windows, Mac, Linux, Linux, ", "['ActiveState ActivePerl', 'Microsoft IIS']['ActiveState ActivePerl', 'Bare Bones BBEdit']['ActiveState ActivePerl']['Hex-Rays IDA']"], "plw": ["32-bit Windows IDA Plugin Module", "32-bit Windows plugin module used by IDA (The Interactive Disassembler), a multi-processor debugger and disassembler; contains data written in C++ that extends the functionality of the IDA tool.", "Windows, Windows, ", "['Hex-Rays IDA']['Pico Technology PicoLog']"], "plugin": ["Adobe Photoshop Plug-in", "A PLUGIN file is a plugin used by Photoshop, an image-editing application.  It stores content that extends the functionality of the default Photoshop application and is often used for adding image effects and filters, or support for a new raster image format.  PLUGIN files may be created and sold by third-party developers.  Several preinstalled PLUGIN files are stored in Photoshop installations within the Plug-ins directory.", "Windows, Mac, Mac, ", "['Adobe Photoshop CC 2017']['Adobe Photoshop CC 2017']['Apple QuickTime Player', 'Apple Safari', 'Mozilla Firefox']"], "plsc": ["Messenger Plus! Live Script File", "Script written for Messenger Plus! Live, an add-on for Windows Live Messenger; adds extra functionality to the Windows messaging program; may also allow Windows Live Messenger to interact with other programs.", "Windows, ", "['Microsoft Windows Live Messenger']"], "plsk": ["Messenger Plus! Live Skin Pack", "Skin that can be applied to the interface of Windows Live Messenger (WLM), a popular instant messaging program for Windows; requires the Messenger Plus! Live add-on, which provides extra functionality for WLM.", "Windows, ", "['Microsoft Windows Live Messenger']"], "plt": ["Tecplot Binary Data File", "Data file created by Tecplot, a scientific visualization program; saves output data created through a scientific computation in the software; may contain multiple frames and datasets; used for rendering complex 2D and 3D visualizations and may be rendered to a static image or an animated visualization.", "Windows, Mac, Linux, Windows, Windows, Mac, Linux, ", "['Tecplot 360']['Tecplot 360']['Tecplot 360']['Autodesk AutoCAD 2017', 'Software Companions ViewCompanion Pro', 'CADSoftTools ABViewer']['IMSI TurboCAD Pro 2017', 'ideaMK PLT Viewer', 'Autodesk AutoCAD 2017', 'CADSoftTools ABViewer', 'CorelDRAW Graphics Suite X8', 'Corel Presentations X8', 'Trix DrawingCenter', 'IrfanView']['IMSI TurboCAD Deluxe v10', 'vhf interservice Cenon']['vhf interservice Cenon']"], "pls": ["Audio Playlist", "Playlist containing a list of audio files that can be played back by a variety of music players; may also be used to redirect to an Ogg Vorbis (.OGG) audio file; contains references to the files' locations, but does not contain actual audio data.", "Windows, Mac, Linux, Windows, Linux, Windows, Mac, Windows, ", "['Apple iTunes', 'RealNetworks RealPlayer Cloud', 'Nullsoft Winamp', 'Roxio Creator NXT Pro 5', 'Voyetra AudioStation', 'CyberLink PowerDVD 16', 'VideoLAN VLC media player', 'Clementine']['Apple iTunes', 'RealNetworks RealPlayer Cloud', 'VideoLAN VLC media player', 'Clementine']['VideoLAN VLC media player', 'Clementine']['Oracle Database']['Oracle Database']['MYOB Technology AccountRight']['MYOB Technology AccountEdge']['Pico Technology PicoLog']"], "plp": ["Photo Locker Picture", "Locked picture created by Photo Locker, an Android app used to hide photos on your device; stores a picture that has been \"locked\" by the app in order to hide the image from being viewed by others.", "Android, ", "['Rupees & Dollars Photo Locker']"], "plr": ["Terraria Player File", "Player profile saved by Terraria, a 2D sandbox construction action and adventure game; saves the player's status, including health and mana points and appearance; used for tracking player progress throughout the game.", "Windows, Windows, ", "['Re-Logic Terraria']['Image Space rFactor', 'Microsoft Notepad', 'NotePad++', 'text editor']"], "plproj": ["Adobe Prelude Project File", "Project file created by Adobe Prelude, a program used for organizing video footage files during video production; saves references to all media files that have been imported, or \"ingested,\" into the project; allows video producers and editors to organize all video assets in one location.", "Windows, Mac, ", "['Adobe Prelude CC 2017']['Adobe Prelude CC 2017']"], "pln": ["ArchiCAD Project File", "Solo project file that contains a 3D model created with ArchiCAD architectural design software; used by architects to design building structures, interiors, exteriors, and landscapes; uses the Archicad Virtual Building technology to simulate the way a real building is constructed.", "Windows, Mac, Windows, Windows, Windows, Mac, ", "['Graphisoft ArchiCAD']['Graphisoft ArchiCAD'][]['Microsoft Flight Simulator X Gold Edition']['Adobe InDesign CC 2017']['Adobe InDesign CC 2017']"], "ple": ["Messenger Plus! Live Encrypted Log File", "Log file containing saved chat sessions from Windows Live Messenger with the Messenger Plus! Live extension; saves text from instant messaging sessions in an encrypted format that can only be opened with Messenger Plus! Live.", "Windows, ", "[]"], "plist": ["Mac OS X Property List File", "Settings file, also known as a \"properties file,\" used by Mac OS X applications; formatted in XML and based on Apple's Core Foundation DTD; contains properties and configuration settings for various programs.", "Windows, Mac, ", "['Microsoft Notepad', 'Corel WordPerfect X8', 'Notepad++', 'text editor']['Fat Cat PlistEdit Pro', 'PrefEdit', 'Night Productions Pref Setter', 'Late Night Property List Tools', 'Apple plutil', 'text editor']"], "plc": ["PL/B Source File", "Program source code file created with Sunbelt PL/B; written in the PL/B programming language, a high-level, English-like language optimized for screen, file, and string manipulation.", "Windows, Linux, ", "[][]"], "pli": ["PL/I Source Code File", "Program source code file written in the PL/I (Programming Language One) language; developed by IBM in the 1960s and is often used for business, engineering, and scientific applications.", "Windows, Mac, Linux, ", "[][][]"], "playground": ["Xcode Playground File", "Developer file created by Apple Xcode, an IDE used for creating iOS and OS X apps; saves an interactive work area so that programmers can write and test code in real-time while they develop; contains source code written in Apple's Swift programming language, which was released with iOS 8 and OS X Yosemite.", "Mac, ", "['Apple Xcode']"], "playmission": ["MissionPlayer Game File", "Game file used by MissionPlayer, an application used to play 3D first-person perspective games created by the MissionMaker software; contains a playable  game exported from a .MISSION file in MissionMaker.", "Windows, ", "['Immersive Education MissionPlayer']"], "plantuml": ["PlantUML File", "File created by PlantUML, a UML diagram creator used within programs like Sublime Text Editor or programming language like HTML; same as the .PU file; contains code referenced by PlantUML to create diagram images that can be generated as .PNG or .SVG files; creates sequence, use case, class, activity, component, state, and object diagrams.", "Windows, Mac, Linux, ", "['PlantUML']['PlantUML']['PlantUML']"], "player": ["Terraria Mobile Player File", "Player profile created and used by the mobile version of Terraria, a 2D sandbox construction action and adventure game; stores a player's game progress, which includes mana points, health, and appearance.", "iOS, Android, Windows, ", "['Re-Logic Terraria']['Re-Logic Terraria']['Pokémon Type Wild']"], "pl2": ["3D Home Architect Second Level Floor Plan", "Building floor plan created with 3D Home Architect Deluxe, a home design program; stores the second floor layout, which may include physical objects along with custom surface materials and colors.", "Windows, ", "['Broderbund 3D Home Architect Deluxe']"], "planner": ["Gnome Planner File", "Project file created by Planner, a project management program; can include a Gantt chart, tasks, resources, and resource utilization; used by project managers for saving project plans and tracking progress.", "Windows, Linux, ", "['Gnome Planner']['Gnome Planner']"], "plan": ["Calligra Plan Document", "Project plan created by Calligra Plan, a project management program included with the Calligra Suite; stores a list of tasks, resources, and a timeline, as well as the completion level of tasks; used for storing information for mid-sized projects.", "Linux, ", "['Calligra Suite']"], "pla": ["Sansa Playlist File", "Music playlist for a SanDisk Sansa portable media player; saved in the PLP playlist format, which lists locations of files in a standard text format; must be transferred to the PLAYLISTS folder on the Sansa device to be recognized by the player.", "Windows, Mac, Linux, Windows, Mac, Windows, ", "['text editor']['text editor']['text editor']['Graphisoft ArchiCAD']['Graphisoft ArchiCAD'][]"], "pl0": ["3D Home Architect Foundation Floor Plan", "Building foundation floor plan created with 3D Home Architect Deluxe, a home design program; stores the layout of the house's structural foundation; the actual ground floor layout is stored in a .PL1 file.\r\n", "Windows, ", "['Broderbund 3D Home Architect Deluxe']"], "pl1": ["PL/I Source Code", "Program written in PL/I (Programming Language One), a language designed primarily for data processing applications; supports recursion and structured programming; designed to be highly-structured, yet is also free-form, having no reserved keywords.", "Windows, Mac, Linux, Windows, Windows, ", "[][][]['Broderbund 3D Home Architect Deluxe'][]"], "pkx": ["Decrypted 3DS Pokémon Save File", "Decrypted Pokémon file used by Pokémon games for the Nintendo 3DS platform, such as Pokémon X and Pokémon Y; stores information about a Pokémon, including the species, EXP, abilities, attacks, and current owner.", "Windows, ", "['PKHeX']"], "pl": ["Perl Script", "A PL file is a script written in Perl that is compiled and run using a Perl interpreter.  It contains lines of Perl program code with variables, operations, functions, and comments.  PL files may be difficult to read due to the brief and compact nature of the Perl language syntax.", "Windows, Mac, Linux, Windows, Mac, Linux, Windows, Mac, Linux, ", "['File Viewer Plus', 'Perl', 'Strawberry Perl', 'ActiveState ActivePerl', 'IndigoStar PerlEdit', 'Microsoft Notepad', 'ES-Computing EditPlus']['Perl', 'ActiveState ActivePerl', 'Late Night Affrus', 'MacroMates TextMate', 'Bare Bones BBEdit']['Perl', 'ActiveState ActivePerl'][][][]['BRL-CAD']['BRL-CAD']['BRL-CAD']"], "pkpass": ["Passbook Pass File", "A PKPASS file is a file used by Passbook, an iOS 6 app used for saving boarding passes, coupons, loyalty cards, movie tickets, and other passes.  It may contain a pass provided by a vendor (e.g., Starbucks, Delta Air Lines, etc.) or a custom user-generated pass.  PKPASS files can be used to track confirmation codes, logins, balances, and other information.", "iOS, Android, ", "['Apple Passbook']['Above Mobile Limited PassWallet']"], "pks": ["Oracle Package Spec File", "Package specifications file created by Oracle PL/SQL software; contains specifications, TYPE definitions, and predefined exceptions for an Oracle Package (.PKB) file.", "Windows, ", "['text editor']"], "pkh": ["Oracle Package File", "Package created with Oracle PL/SQL database software; contains SQL code and scripts used for accessing information from Oracle-compatible databases; can be run as a script.", "Windows, ", "['text editor']"], "pkgdef": ["Visual Studio Shell File", "File created by Microsoft Visual Studio, a Microsoft SDK; contains application configuration settings used to customize an isolated shell application; looks similar to the .REG file.", "Windows, ", "['Microsoft Visual Studio 2017']"], "pkgundef": ["Visual Studio Shell File", "File created by Microsoft Visual Studio, a Windows system SDK; contains metadata, much like the .PKGDEF file, but is used to exclude certain registry entries from an isolated shell application; can list multiple registries to exclude.", "Windows, ", "['Microsoft Visual Studio 2017']"], "pkg": ["Symbian Package File", "A PKG file is a package created for Symbian OS devices.  It contains instructions in plain text format that are required to create a .SIS file, including the vendor name, software dependencies, and application files to copy.", "Windows, Windows, Mac, Mac, Windows, Windows, Mac, ", "['Easy SIS Creator', 'UnSIS'][][]['CharlesSoft Pacifist']['Microsoft Midtown Madness 2', 'Zanoza ZModeler']['Adobe Acrobat DC']['Adobe Acrobat DC']"], "pkf": ["Audition Peak File", "Peak file created by Adobe Audition, an audio production application; contains waveform data related to a specific .WAV file; generated automatically when an audio file is opened or imported.", "Windows, Mac, ", "['Adobe Audition CC 2017']['Adobe Audition CC 2017']"], "pkb": ["Oracle Package Body File", "Package body or script created with Oracle PL/SQL database software; used by standard Oracle databases and Oracle Database Gateway for APPC (Advanced Program-to-Program Communication).", "Windows, ", "['text editor']"], "pka": ["Packet Tracer Activity File", "Activity file for a practice session created with Packet Tracer, an interactive network systems learning tool; includes instructions for designing, configuring, monitoring, and troubleshooting various network setups.", "Windows, ", "['Cisco Packet Tracer']"], "pk4": ["Doom 3 Engine Game Data File", "Compressed game data file used by games that use the id Tech 4 game engine, which was developed by id Software for Doom 3; stores game assets, such as maps, graphics, audio files, or other data used for gameplay; similar to the .PK3 format.", "Windows, ", "['QuArK', 'Corel WinZip 21']"], "pk2": ["Silkroad Online Game Data File", "Contains game data used by Silkroad, a massively-multiplayer online role-playing game (MMORPG) developed by Joymax, a South Korean company; may contain game graphics, sounds, music, etc; saved in a compressed and encrypted format.", "Windows, ", "[]"], "pk3": ["Quake 3 Engine Game Data File", "Compressed game data file used by games based on the Quake III engine (id Tech 3), which was developed by id Software; may contain maps, textures, audio clips, or other data used for gameplay; can be modified to create custom game content.", "Windows, Windows, Mac, Linux, ", "['id Software Quake 3', 'QuArK', 'PakScape', 'Corel WinZip 21', '7-Zip']['ZDoom', 'GZDoom', 'Skulltag']['Skulltag']['Skulltag']"], "pk": ["Audition Peak File", "Contains the visual representation of an audio waveform for a corresponding audio file; generated automatically by Audition and Cool Edit Pro when an audio file is opened; saved in the same folder as the original audio file.", "Windows, Windows, Mac, ", "['Adobe Audition CC 2017']['MikTeX', 'TeXworks', 'BaKoMa TeX']['TeXworks']"], "pjx": ["FoxPro Project", "Project created by FoxPro database development software; may contain programs, menus, reports, labels, forms, and library files.", "Windows, ", "['Microsoft Visual FoxPro']"], "pjs": ["TestComplete Project Suite File", "Settings file used by TestComplete, an application that enables users to test a variety of desktop, mobile, and web applications; stores common settings, such as what information is displayed in the TestComplete panels, for a project suite.", "Windows, Windows, Mac, Linux, Android, ", "['SmartBear TestComplete']['VideoLAN VLC media player', 'text editor']['VideoLAN VLC media player', 'text editor']['VideoLAN VLC media player', 'text editor']['J2 Interactive MX Player']"], "pjt": ["FoxPro Project Memo", "Contains notes about a FoxPro project (.PJX file)", "Windows, Windows, ", "['Microsoft Visual FoxPro']['Golden Software Didger']"], "pjm": ["xPlan Model", "Model created by xPlan, a project management application; similar to the .PJ2 file; holds a Documents folder and two .XML files; contains project data input such as reports, project tasks, resources, and events.", "Mac, iOS, ", "['adnx xPlan']['adnx xPlan']"], "piz": ["Zipped File", "Compressed .ZIP archive that has been renamed with the extension reversed; sometimes used for sending zipped email attachments so that email server filters don't block the message; also used to hide the file type or to prevent opening.", "Windows, Mac, ", "['Corel WinZip 21', 'Smith Micro StuffIt Deluxe for Windows']['Smith Micro StuffIt Deluxe 16']"], "pj2": ["xPlan Document", "Project file created by xPlan, a project management program; contains project data such as budget amount, weekly details, milestones reached, and updated progress.", "Mac, iOS, ", "['adnx xPlan']['adnx xPlan']"], "pixadex": ["Pixadex Icon", "Icon image file used by CandyBar and other Pixadex-compatible icon applications; stores multiple images at varying resolutions (i.e., 512x512, 256x256, 128x128, etc.); used for applying custom icons to the Mac OS X operating system.", "Mac, ", "['Panic CandyBar']"], "pipd": ["PIPE-FLO Demo Project File", "CAD file created by the demo version of PIPE-FLO pipe system design software; saves a schematic of the piping system and incorporates pipelines, pumps, compressors, control valves, and other components; enables designs to be stored by the trial version of the software.", "Windows, ", "['Engineered Software PIPE-FLO', 'Engineered Software Flow of Fluids']"], "pip": ["Office Personalized Settings File", "Preference file used by Microsoft Office programs to store \"Personalized Menus and Toolbars\" settings; created by each Office application by evaluating what menu commands are used most; only commonly used commands are displayed in a shortened version of each menu.", "Windows, ", "['Microsoft Word 2016', 'Microsoft PowerPoint 2016', 'Microsoft Excel 2016']"], "pix": ["PCI Geomatics Database File", "PCIDSK file (PCI Geomatics Database File) created by Geomatica, a geomatics program used for processing and analyzing geographic images; contains spatial information split across multiple image channels; often used for storing small to very large geospatial data sets, such as satellite images.", "Windows, Mac, Linux, Windows, Mac, Linux, Windows, Mac, Linux, ", "['PCI Geomatics Geomatica', 'ESRI ArcGIS for Desktop', 'Safe Software FME Desktop', 'GDAL']['GDAL']['GDAL']['BRL-CAD']['BRL-CAD']['BRL-CAD']['ACD Systems Canvas X 2017', 'ACD Systems ACDSee 20', 'CorelDRAW Graphics Suite X8', 'GIMP']['GIMP']['GIMP']"], "piv": ["Pivot Stickfigure Animation", "Native animation format used by Pivot Stickfigure Animator, a program for creating stick figure animations; contains stick figures that have moveable parts, or \"joints,\" which can be moved and saved as individual animation frames.", "Windows, ", "['Pivot Stickfigure Animator']"], "piskel": ["Piskel Sprite", "Graphic created by Piskel, a desktop and web application used to create pixel art and animated sprites; contains a graphic, which includes the model version, name, layers, frames per second, height, and width of the pixel art.", "Windows, Mac, Linux, Web, ", "['Piskel']['Piskel']['Piskel']['Piskel']"], "pipe": ["PIPE-FLO Project File", "CAD file created by PIPE-FLO, a program used for designing piping systems; stores a schematic of the piping system (series, branching, or looped) and can include pipelines, pumps, compressors, control valves, and other components; used for both liquid and gas systems.", "Windows, ", "['Engineered Software PIPE-FLO', 'Engineered Software Flow of Fluids']"], "pkt": ["Packet Tracer Network Simulation Model", "Contains a simulation of a network setup for Packet Tracer, a network monitoring program developed by Cisco; allows users to test various network configurations; used primarily for educational purposes.", "Windows, Linux, ", "['Cisco Packet Tracer']['Cisco Packet Tracer']"], "pim": ["Pro Tools Controller Plug-in Mappings File", "File created by Pro Tools, a digital audio workstation for recording, editing, and mixing audio; contains a customized layout of parameters for a control surface (i.e., D-control, D-command, C24, and Command 8); allows plug-in control surface mappings to be saved and reloaded.", "Windows, Mac, Windows, ", "['Avid Pro Tools']['Avid Pro Tools'][]"], "pio": ["Pro Tools I/O Settings File", "Settings file created by Pro Tools, a digital audio workstation (DAW); saves input and output settings, including input sources, output formats, bus configurations, mic preamps, and H/W insert delay; allows settings to be saved and reused between sessions.", "Windows, Mac, ", "['Avid Pro Tools']['Avid Pro Tools']"], "pika": ["Pika Software Builder Project File", "Developer file created by Pika Software Builder, a Windows software development application that helps users create Windows programs (.EXE files) without having to write source code; saves the program window as well as buttons, labels, text fields, images, and any other user interface elements saved in the window.", "Windows, ", "['Pika Software Builder']"], "pict": ["Picture File", "Image file saved in the Macintosh PICT format; may contain both vector and bitmap data and can use thousands of colors; also supports RLE (Run-length encoding) and JPEG compression to reduce the file size.", "Windows, Mac, Android, ", "['File Viewer Plus', 'Adobe Photoshop CC 2017', 'Adobe Photoshop Elements 15', 'Adobe After Effects CC 2017', 'CorelDRAW Graphics Suite X8', 'Corel PaintShop Pro X9', 'ACD Systems Canvas X 2017', 'ACD Systems ACDSee 20']['Apple Preview', 'Adobe Photoshop CC 2017', 'Adobe Photoshop Elements 15', 'Adobe After Effects CC 2017', 'Planamesa NeoOffice', 'Lemkesoft GraphicConverter', 'CocoModX']['File Viewer for Android']"], "pigs": ["Packaged Indigo Renderer Scene File", "3D scene used by Indigo Renderer, a program used for generating photorealistic images; saves an .IGS scene file, but packages it using .ZIP compression so the file size is smaller; often exported using the Indigo Renderer plug-in, which is available for several 3D modeling products, including 3ds Max, Blender, Cinema 4D, and Maya.", "Windows, Mac, Linux, ", "['Glare Technologies Indigo Renderer', 'Glare Technologies Indigo RT']['Glare Technologies Indigo Renderer', 'Glare Technologies Indigo RT']['Glare Technologies Indigo Renderer', 'Glare Technologies Indigo RT']"], "pigm": ["Packaged Indigo Renderer Material File", "File created by Indigo Renderer, a program used for creating photorealistic 3D images; saves a material (.IGM file) in a .ZIP format; significantly reduces the material file size and therefore is often used for distributing materials online.", "Windows, Mac, Linux, ", "['Glare Technologies Indigo Renderer', 'Glare Technologies Indigo RT']['Glare Technologies Indigo Renderer', 'Glare Technologies Indigo RT']['Glare Technologies Indigo Renderer', 'Glare Technologies Indigo RT']"], "pie": ["GlovePIE Controller Script", "Script that allows a hardware controller to work with GlovePIE (Glove Programmable Input Emulator); maps hardware functions, such as movements and button actions, to software commands; allows non-PC input devices (not just gloves) to be used with a Windows computer.", "Windows, ", "[]"], "pictclipping": ["Picture Clipping File", "Image captured by the Mac OS X Finder when a user highlights and drags a graphic to the desktop; supports both image content as well as embedded textual data; often used for copying iTunes album cover art graphics.", "Mac, ", "['Apple Finder', 'Lemkesoft GraphicConverter']"], "pi2": ["Portrait Innovations Photo", "High-resolution digital photo format used by Portrait Innovations studios; saved in a proprietary image format that can only be viewed using Portrait Innovations software.", "Windows, Mac, Windows, Mac, ", "[][]['Logipole Konvertor', 'XnViewMP']['Lemkesoft GraphicConverter', 'XnViewMP']"], "picnc": ["Houdini 3D Compositing Image", "Raster image created by Houdini Apprentice, the reduced version of the full Houdini 3D modeling software; includes color values, the color map, and the image size; used for storing rendered 3D models.", "Windows, Mac, Linux, ", "['Side Effects Houdini Apprentice']['Side Effects Houdini Apprentice']['Side Effects Houdini Apprentice']"], "pic": ["Generic Picture File", "Bitmap image created by IBM Lotus or a variety of other applications; possible programs include Advanced Art Studio, Micrografx Draw, and SoftImage 3D; should not be confused with the .PICT format.", "Windows, Mac, Linux, Windows, Mac, Linux, Windows, Mac, Linux, ", "['Corel PaintShop Pro X9', 'ACD Systems Canvas X 2017', 'ACD Systems ACDSee 20', 'XnViewMP']['Apple Preview', 'XnViewMP']['XnViewMP']['Side Effects Houdini']['Side Effects Houdini']['Side Effects Houdini']['Apple QuickTime Player', 'XnViewMP']['Apple QuickTime Player', 'XnViewMP']['XnViewMP']"], "photoslibrary": ["Photos Library", "Library of digitals photos created by Photos, an image organization application bundled with OS X 10.10.3 and later; contains data referenced by your Photos Library, which includes thumbnails, resources, albums, and other properties; located in the \"Pictures\" folder of your home directory.", "Mac, ", "['Apple Photos']"], "photoshow": ["Roxio PhotoShow Project", "Slide show project created by Roxio PhotoShow, a program included with Roxio Creator used for creating personal slide shows; often contains digital photos and videos; can be burned to a DVD or exported to the .WMV and .MPG video formats.", "Windows, ", "['Roxio Creator NXT Pro 5']"], "phy": ["3ds Max Physique File", "3D model file created by 3ds Max, a software package used for modeling and animation; defines how a 3D skin looks when matching a biped skeleton's movements; allows the biped's physique to capture motion properties such as bone rigidness, muscle bulging, and tendon stretching.", "Windows, Windows, ", "['Autodesk 3ds Max 2017'][]"], "php": ["PHP Source Code File", "A PHP file is a webpage that contains PHP (Hypertext Preprocessor) code.  It may include PHP functions that can process online forms, get the date and time, or access information from a database, such as a MySQL database.", "Windows, Mac, Linux, iOS, ", "['File Viewer Plus', 'Adobe Dreamweaver CC 2017', 'Eclipse PHP Development Tools', 'Zend Studio', 'MPSoftware phpDesigner', 'ES-Computing EditPlus', 'Blumentals WeBuilder', 'Notepad++', 'text editor', 'Apache Web Server', 'WampServer', 'Web browser']['Adobe Dreamweaver CC 2017', 'Eclipse PHP Development Tools', 'Zend Studio', 'MacroMates TextMate', 'Bare Bones BBEdit', 'text editor', 'Apache Web Server', 'MAMP', 'Chocolat', 'Sublime Text 3', 'Web browser']['Eclipse PHP Development Tools', 'Zend Studio', 'text editor', 'Apache Web Server', 'Web browser']['Alexander Blach Textastic Code Editor']"], "photolibrary": ["iPhoto Photo Library", "Library of digital photos created by iPhoto, an image organization application; contains all of the images that appear in your iPhoto application along with the edits that have been made to them; created whenever you add another library in iPhoto.", "Mac, ", "['Apple iPhoto 9.6', 'Apple Photos']"], "phn": ["Algodoo Phun Phunlet", "Animation scene, or \"phunlet,\" created with Phun, a 2D physics creation program; saved in a text format that contains objects and object properties.", "Windows, Mac, Linux, ", "[][][]"], "phm": ["Pro Home Manager Data File", "Database used by Pro Home Manager, a home maintenance and inventory management program; may include maintenance schedules, appointment reminders, service contracts, and a list of household assets.", "Windows, ", "[]"], "pho": ["Gerber Photoplot File", "File created by printed circuit board (PCB) design applications; contains a photoplot, which is a generated image of a PCB design that can be used in the process of manufacturing PCBs; often generated from a .GBR file and can be viewed in several Gerber compatible applications.", "Windows, Windows, ", "['PentaLogix ViewMate', 'GraphiCode GC-Prevue', 'Altium Designer', 'Artwork Conversion GBR2DXF']['MBROLA']"], "phd": ["PhotoDirector Project File", "Photo project created by PhotoDirector, a program used for editing digital photos; supports imported photos from many different camera RAW formats, including .DNG, .CR2, .SRF, and many others; contains the library of imported images and stores any user edits; used as the native project save format and is saved with other data files and folders that contain the digital photo data.", "Windows, Mac, Windows, ", "['CyberLink PhotoDirector 8 Ultra']['CyberLink PhotoDirector 8 Ultra']['IBM HeapRoots', 'IBM HeapAnalyzer']"], "phl": ["Kindle Popular Highlights File", "File created by the Amazon Kindle e-reading device; stores Popular Highlights, which are sections or phrases within the eBook that have been highlighted by Kindle users; enables the gray dashed underline behavior for popularly marked items; saved in an XML format.", "Windows, Mac, ", "['Microsoft Notepad', 'text editor']['Apple TextEdit', 'text editor']"], "phj": ["PhCNC Project File", "File created by PhCNC, a Printed Circuit Board (PCB) prototyping software; contains a PhCNC project, including customized settings like tabs positions and tool tables; holds all information related to the project in a compressed format, which makes the file 4-5 times smaller than the actual volume of files imported into the project.", "Windows, ", "['AccurateCNC, Inc. PhCNC']"], "phb": ["Motorola Phone Book File", "Phone book file used by Motorola mobile phones; contains contacts, including names, phone numbers, and other address information; used to backup and restore user phone books.", "Windows, Windows, ", "['Motorola Phone Tools']['ArcSoft PhotoStudio']"], "phar": ["PHP Archive", "File packaged in the PHAR (PHP Archive) format, which can be created using the Phar PHP class; stores a collection of files and supports bzip2 and gzip compression as well as a checksums for the archive; used for distributing and running PHP applications using a single file.", "Windows, Mac, Linux, ", "['PHP', 'Phar']['PHP', 'Phar']['PHP', 'Phar']"], "ph": ["Perl Header File", "Header file that may be referenced by one or more Perl (.PL) scripts; contains Perl code that may include variable declarations and functions; similar to a C header (.H) file, but used by Perl programs.", "Windows, Mac, Linux, Windows, Mac, ", "['text editor']['text editor']['text editor'][][]"], "pgs": ["PageStream Document", "Document created and used by PageStream, a cross-platform document publishing program; contains document elements such as text blocks, images, formatting, styles, and objects.", "Windows, Mac, Linux, ", "['Grasshopper PageStream']['Grasshopper PageStream']['Grasshopper PageStream']"], "pgp": ["PGP Security Key", "Security key or digital signature file that verifies a user's identity; used for  decrypting a file encrypted with Pretty Good Privacy (PGP) software; ensures that protected files can only be opened by authorized users.", "Windows, Mac, Windows, ", "['PGP Desktop']['PGP Desktop']['Autodesk AutoCAD 2017', 'Microsoft Notepad', 'Microsoft WordPad', 'text editor']"], "pgn": ["Portable Game Notation File", "Text-based file format used to record moves in a chess match; also includes the event name, location, date, round, player names, and result of the game.", "Windows, Mac, Linux, ", "['ChessBase Fritz', 'ChessBase'][][]"], "pgf": ["Progressive Graphics File", "Bitmap image created in the Progressive Graphics File (PGF) format, which was designed to improve on the JPEG standard by reducing compression time and increasing compression ratios; supports lossy and lossless compression.", "Windows, Mac, Linux, Windows, ", "['NCH PhotoPad Image Editor', 'libPGF']['Lemkesoft GraphicConverter', 'libPGF']['libPGF']['Pokémon Mystery Gift Editor']"], "pgm": ["Portable Gray Map Image", "A PGM file is a grayscale image file saved in the portable gray map (PGM) format and encoded with one or two bytes (8 or 16 bits) per pixel.  It contains header information and a grid of numbers that represent different shades of gray from black (0) to white (up to 65,536).  PGM files are typically stored in ASCII text format, but also have a binary representation.", "Windows, Mac, Linux, Android, ", "['File Viewer Plus', 'GIMP', 'Corel PaintShop Pro X9', 'ACD Systems Canvas X 2017', 'ACD Systems ACDSee 20', 'Inkscape', 'Netpbm', 'Adobe Photoshop with CartaPGM plug-in', 'text editor']['GIMP', 'Inkscape', 'Netpbm', 'Adobe Photoshop with CartaPGM plug-in', 'text editor']['GIMP', 'Inkscape', 'Netpbm', 'text editor']['File Viewer for Android']"], "pgi": ["Video Recording File", "File created by various video recording devices, including those from Panasonic, JVC, and Canon; contains timestamp, duration, and title information for recorded videos; typically found with .MOD and .MOI files.", "Windows, ", "[]"], "pgd": ["PGP Disk Image", "Encrypted disk image created by PGP, a data encryption program now owned by Symantec; saves data for a disk partition that can be mounted within a desktop environment; used for protecting sensitive files on the computer.", "Windows, Mac, Linux, ", "['Symantec Drive Encryption', 'Symantec PGP Desktop']['Symantec Drive Encryption', 'Symantec PGP Desktop']['Symantec Drive Encryption']"], "pfm": ["Printer Font Metrics File", "Adobe Type 1 font used by the Microsoft Windows operating system; includes measurements of characters within the font; requires an associated .PFB file for the font; does not contain the actual font glyphs, but helps the font in the PFB file to be displayed correctly.", "Windows, Android, ", "['Microsoft Windows Font Viewer']['File Viewer for Android']"], "pfx": ["PKCS #12 Certificate File", "Encrypted security file that stores secure certificates used to authenticate a person or device, such as a computer or web server; requires a password to be opened; can be installed by right-clicking the file and selecting \"Install PFX.\"", "Windows, Mac, Windows, ", "['Adobe Acrobat DC', 'Microsoft Certificate Manager']['Adobe Acrobat DC'][]"], "pfr": ["Portable Font Resource File", "Compact, platform-independent format for representing high-quality, scalable outline fonts; based on the TrueDoc PFR Specification developed by Bitstream, Inc; used for embedding rasterized fonts into Web pages and for displaying text on digital televisions.", "Windows, Windows, ", "[]['Corel PaintShop Pro X9']"], "pfl": ["PDFill Project File", "Modified PDF document created with PDFill, a PDF editing program; may include additional text, images, highlights, comments, and forms with editable fields; can be exported as a standard .PDF file.", "Windows, Windows, Windows, ", "['PlotSoft PDFill']['PhotoFiltre Studio']['Nolo Quicken WillMaker']"], "pfile": ["Rights Management Protected File", "A PFILE file is a file protected with Microsoft Rights Management (RMS), an application used to protect a user's digital information.  It contains a file, such as a .VSDX or .DOC file, that has been encrypted with RMS.  PFILE files are generically protected whereas .PPDF, PTXT, and PJPG files are protected as read-only.", "Windows, Mac, ", "['Microsoft Azure Information Protection Viewer']['Microsoft RMS Sharing']"], "pfc": ["AOL Personal File Cabinet", "File format used by America Online to store favorites (bookmarks), as well as e-mail messages and contact information; may include email addresses, phone numbers, street addresses, company information, groups, and distribution lists.", "Windows, Mac, ", "['AOL', 'Connected ePreserver', 'PFCEx']['AOL Desktop for Mac']"], "pfb": ["Printer Font Binary File", "Adobe Type 1 font for Windows; similar to a .PFA file, but has been encoded in binary format; requires the associated .PFM file as well; both the PFB and PFM files should be stored within the system Fonts folder in order to be active.", "Windows, Mac, Linux, ", "['CorelDRAW Graphics Suite X8', 'FontForge', 'Autodesk AutoCAD 2017']['FontForge']['FontForge']"], "pfa": ["Printer Font ASCII File", "Adobe Type 1 font containing outlines of characters within the font; formatted in ASCII text (a human-readable format); should be stored in the system Fonts folder.", "Windows, Mac, Linux, ", "['FontForge']['FontForge']['FontForge']"], "pf": ["Private File", "Password-protected file compressed and encrypted by Stuffit Deluxe; similar to a .SIT file, but requires a password to decrypt and decompress; often used for archiving confidential or personal data.", "Windows, Mac, Windows, ", "['Smith Micro StuffIt Deluxe for Windows']['Smith Micro StuffIt Deluxe 16'][]"], "pez": ["Prezi Desktop Presentation", "Presentation created by Prezi Desktop, a program used for making \"zooming presentations,\" which feature a single canvas that can be panned, rotated, and zoomed to view different notes and pictures on the canvas; may contain several zoomed freeze frames that the presenter can navigate through sequentially.", "Windows, Mac, Web, ", "['Prezi Desktop']['Prezi Desktop']['Prezi.com']"], "pes": ["Brother Embroidery Format", "CAM (computer aided manufacturing) file that contains instructions for creating embroideries with a sewing machine; includes codes such as \"stop,\" \"jump,\" and \"trim;\" also includes the colors for the design from the supported Brother color palette; can be opened and viewed by various sewing programs.", "Windows, Windows, Mac, ", "['File Viewer Plus', 'Embroidermodder', 'BALARAD Embird Studio', \"Designer's Gallery StudioPlus\", 'Buzz Tools', 'S & S Computing SewWhat!']['File Viewer Plus', \"Code'n'Web PhysicsEditor\"][\"Code'n'Web PhysicsEditor\"]"], "pex": ["Merak Peep Data File", "Stores data models and reports created with Merak Peep, a petroleum economic evaluation program; used to create \"What if\" scenarios, analyze risks and market sensitivity, forecast production levels, and estimate reserves.", "Windows, Windows, Linux, Windows, ", "[][][]['West Publisher', 'West E-Transcript Bundle Viewer']"], "pet": ["Puppy Linux Install Package", "Application package created for PuppyLinux; typically used for installing software programs; saved in a stored in a \"tarball\" compressed archive format (.TGZ files) with an md5sum checksum appended to the end.", "Windows, Mac, Linux, ", "['Smith Micro StuffIt Deluxe for Windows', 'Corel WinZip 21', 'WinRAR 5', '7-zip']['Smith Micro StuffIt Deluxe 16']['PETget']"], "pep": ["TurboProject Project File", "Project created with TurboProject, a project planning and scheduling program; serves as a project blueprint, which contains activities, timelines, scheduled resources, workflow connections, goals, and milestones; used for planning, scheduling, and\r\nmanaging projects.", "Windows, ", "[]"], "pen": ["Paint Shop Pro Pen Preset File", "Contains pen presets for the pen tool in Paint Shop Pro; includes custom pen settings that can be loaded into the program; should be stored within the Presets folder within the Paint Shop Pro application folder.", "Windows, Windows, ", "['Corel PaintShop Pro X9']['Logitech io2 Software']"], "pem": ["Privacy Enhanced Mail Certificate", "Base64-encoded certificate file, such as a PEM-encoded X509 certificate; used to authenticate a secure website; typically imported from a Unix-based Apache Web server and compatible with OpenSSL applications.", "Windows, Mac, Linux, ", "['Microsoft IIS']['Apple Keychain Access', 'Apache Web Server']['Apache Web Server']"], "pek": ["Adobe Peak Waveform File", "Audio metadata file used by Adobe applications such as Premiere Pro, After Effects, Soundbooth, and Encore; contains visual waveform data used for displaying audio waveform previews on the audio track timeline.", "Windows, Mac, ", "['Adobe Premiere Pro CC 2017', 'Adobe After Effects CC 2017', 'Adobe Audition CC 2017', 'Adobe Encore CS6']['Adobe Premiere Pro CC 2017', 'Adobe After Effects CC 2017', 'Adobe Audition CC 2017', 'Adobe Encore CS6']"], "pef": ["Pentax Electronic File", "Uncompressed RAW photograph taken with a Pentax digital camera; stores image information exactly how it was captured by the camera's sensor, with no compression or color adjustment.", "Windows, Mac, Linux, iOS, Android, Windows, Mac, Linux, ", "['File Viewer Plus', 'Corel PaintShop Pro X9', 'ACD Systems Canvas X 2017', 'ACD Systems ACDSee 20', 'Adobe Photoshop CC 2017', 'Adobe Photoshop Elements 15', 'Google Picasa', 'UFRaw', 'Microsoft Windows Live Photo Gallery']['Adobe Photoshop CC 2017', 'Adobe Photoshop Elements 15', 'GIMP with UFRaw plugin', 'Google Picasa', 'MacPhun ColorStrokes']['GIMP with UFRaw plugin']['Adobe Photoshop Express']['File Viewer for Android', 'Adobe Photoshop Express']['Braille Utils']['Braille Utils']['Braille Utils']"], "pea": ["PEA File Archive", "Compressed file archive created with PeaZip, an file archiving, encryption, and file splitting tool; supports deflate-based compression, multi-volume file spanning, AES256 in EAX mode for authenticated encryption; also uses a cryptographically strong hash to check file and volume integrity.", "Windows, Linux, ", "['PeaZip']['PeaZip']"], "pe4": ["Photo Explorer Thumbnail Archive", "Archive or cache of thumbnail images used by Ulead Photo Explorer; contains small versions of images stored in a photo album; makes it possible to quickly browse through the images in an album.", "Windows, Windows, ", "['Ulead Photo Explorer']['Ulead PhotoImpact']"], "peak": ["Steinberg Peak File", "Contains the waveform image of a corresponding Cubase audio file; used for visually displaying the audio data within the Cubase track window; generated automatically when an audio file is recorded or imported into Cubase.", "Windows, Mac, ", "['Steinberg Cubase']['Steinberg Cubase']"], "pdx": ["Adobe Acrobat Index File", "Index file created by Adobe Acrobat, a document creator and viewer program; contains an index of documents and directories; enables the capability to search across multiple .PDF documents; useful for businesses that use large sets of PDF documents, such as lawyers.", "Windows, Mac, Windows, ", "['Adobe Acrobat DC']['Adobe Acrobat DC'][]"], "pdw": ["pDRAW32 DNA File", "DNA file saved in the pDRAW32 format, which is used by molecular biology software; contains sequence data as well as the DNA name and coordinates for genetic elements on DNA plots.", "Windows, Mac, Linux, Windows, ", "['AcaClone pDRAW32', 'GSL Biotech SnapGene', 'GSL Biotech SnapGene Viewer', 'Genome Compiler']['AcaClone pDRAW32', 'GSL Biotech SnapGene', 'GSL Biotech SnapGene Viewer', 'Genome Compiler']['AcaClone pDRAW32']['Microsoft Word 2016']"], "pdpcomp": ["Pdplayer Composition File", "Composition file created and used by Pdplayer, a professional image sequence player; saves all the elements of your composition, including all of the image and video layers.", "Windows, Mac, Linux, ", "['Chaos Group Pdplayer']['Chaos Group Pdplayer']['Chaos Group Pdplayer']"], "pdr": ["Windows Port Driver", "Driver file that allows certain USB devices, such as USB flash drives, to be recognized and used by a Windows-based computer; similar to a virtual device driver (.VXD file) used by other hardware.", "Windows, Windows, ", "[]['Microsoft Word 2016']"], "pds": ["PowerDirector Script File", "Video project file or slide show created with PowerDirector, a digital video-editing program; stores references to audio and video files and includes settings for menus, effects, transitions, and other home video production information; used for authoring video CDs, DVDs, Blu-ray, and AVCHD discs.", "Windows, Windows, Mac, Linux, ", "['CyberLink PowerDirector 15 Ultra', 'CyberLink PowerProducer 6']['NASA PDS Tools Package', 'NASA NASAView']['NASA PDS Tools Package', 'NASA NASAView']['NASA PDS Tools Package', 'NASA NASAView']"], "pdp": ["Palo Alto Software Plan Component File", "Plan component file created by Business Plan Pro, an application used to create business plans; contains a component of a plan, which may be a table, equation, chart, or topic; can be downloaded and imported into your plan.", "Windows, Windows, Mac, ", "['Palo Alto Software Business Plan Pro']['Adobe Acrobat DC', 'Adobe Photoshop CC 2017']['Adobe Acrobat DC', 'Adobe Photoshop CC 2017']"], "pdn": ["paint.net Image File", "Bitmap image format used by paint.net, a free photo-editing program for Windows; supports multiple layers, transparency, image effects, and different bit-depths; can only be opened with paint.net, but can be exported by paint.net to a more standard format.", "Windows, ", "['dotPDN paint.net', 'Chasys Draw IES']"], "pdm": ["PowerDesigner Database File", "Database created with Sybase PowerDesigner, an enterprise modeling and design program; stores database information as well as references to other files, such as the database definition (.XDB) file and model definition (.XEM) files.", "Windows, Windows, Windows, ", "[]['Microsoft Visual Studio', 'text editor']['Microsoft Word 2016']"], "pdi": ["InstantCopy Disc Image", "DVD disc image \"ripped\" from the original DVD using Pinnacle Systems' InstantCopy DVD copying program.", "Windows, ", "['Lightning UK! ImgBurn']"], "pdfig": ["PDF Index Generator Project File", "Project file saved by PDF Index Generator, a program used to create book indexes for .PDF files; contains all generated index data, as well as the project settings for the index, such as the input filename, pages numbers to index, and words to include or exclude; saved in an XML format.", "Windows, Mac, Linux, ", "['PDF Colony PDF Index Generator']['PDF Colony PDF Index Generator']['PDF Colony PDF Index Generator']"], "pdf": ["Portable Document Format File", "A PDF file is a multi-platform document created by Adobe Acrobat or another PDF application.  The PDF format is commonly used for saving documents and publications in a standard format that can be viewed on multiple platforms.  In many cases, PDF files are created from existing documents instead of from scratch.", "Windows, Mac, Linux, Web, iOS, Android, Windows Phone, ", "['File Viewer Plus', 'Adobe Acrobat DC', 'Nitro Pro 10', 'Foxit Reader', 'IMSI TurboPDF', 'Corel WordPerfect X8', 'Nuance Power PDF Standard', 'LibreOffice', 'Icecream PDF Converter', 'Web browser']['Apple Preview', 'Adobe Acrobat DC', 'Apple Pages', 'Nuance PDF Converter for Mac 6', 'Solid PDF to Word', 'LibreOffice', 'Smile PDFpenPro', 'Web browser']['KPDF', 'KDE Okular', 'Evince', 'PDFedit', 'LibreOffice', 'Web browser']['Google Drive', 'Microsoft OneDrive']['Apple iBooks', 'Apple Pages', 'Adobe Acrobat Reader', 'Infraware Polaris Office', 'Good.iWare GoodReader', 'MobiSystems OfficeSuite Pro', 'Google Drive']['File Viewer for Android', 'Adobe Reader', 'Google Play Books', 'Kingsoft WPS Office for Android', 'Google Drive'][]"], "pdo": ["Pepakura Designer File", "A PDO file is a digital origami file created by Pepakura Designer, a program that allows user to generate paper craft models from 3D model data.  It contains a 3D model and its corresponding 2D paper cutout, which stores the paper model's folding lines, cuts, and patterns.  PDO files are used for printing the design on paper, which can then be folded and glued into the original 3D model.", "Windows, ", "['Tama Pepakura Designer', 'Tama Pepakura Viewer']"], "pde": ["Processing Development Environment Source Code File", "Source code file written in the Processing programming language; may contain functions, variables, and other programming constructs; used for storing Processing programs, called \"sketches,\" and running them within the Processing IDE; can be used for programming images, animations, and interactions.", "Windows, Mac, Linux, Windows, Mac, Linux, Windows, ", "['Processing']['Processing', 'MacroMates TextMate', 'Chocolat', 'Kod']['Processing']['Arduino']['Arduino']['Arduino']['Microsoft Excel 2016']"], "pdd": ["Adobe PhotoDeluxe Image", "Image created with Adobe PhotoDeluxe, an entry level photo-editing software program that streamlined common editing tasks; replaced by Adobe Photoshop Elements in 2002, which is more similar to Adobe's flagship Photoshop program.", "Windows, Mac, Windows, ", "['Adobe PhotoDeluxe', 'Adobe Photoshop CC 2017', 'Adobe Photoshop Elements 15', 'Adobe Illustrator CC 2017', 'Adobe InDesign CC 2017', 'ACD Systems Canvas X 2017']['Adobe PhotoDeluxe', 'Adobe Photoshop CC 2017', 'Adobe Photoshop Elements 15', 'Adobe Illustrator CC 2017', 'Adobe InDesign CC 2017'][]"], "pdc": ["Lizard Safeguard Secure PDF File", "Copy-protected .PDF file encrypted with Lizard Safeguard PDF security software; protects the PDF document from unauthorized viewing, copying, sharing, modifying, screen grabbing, and printing.", "Windows, Mac, ", "[][]"], "pdadj": ["PhotoDirector Preset File", "Preset file used by PhotoDirector, a digital photo editing program; stores default or customized image editing adjustments, such as color and contrast effects, that can be applied to other photos.", "Windows, Mac, ", "['CyberLink PhotoDirector 8 Ultra']['CyberLink PhotoDirector 8 Ultra']"], "pd5": ["Windows Live Photo Gallery Information File", "Database file created by Windows Live Photo Gallery, a program used for managing home photos and movies; stores metadata about personal images and videos; used to track information on personal media files.", "Windows, ", "['Microsoft Windows Live Photo Gallery']"], "pdas": ["PDAStore Data Store File", "Data storage format used by PDAStore, a program for saving and categorizing information on a PDA; data saved in a PDAStore file can be browsed and searched with the PDAStore program.", "Windows, ", "[]"], "pd4": ["Windows Live Photo Gallery Information File", "Database file used by Windows Live Photo Gallery, a program that allows users to manage home photos and movies; contains metadata describing personal images and videos, including the file name, properties, path, and thumbnail information; used to track multimedia file information.", "Windows, Windows, Mac, ", "['Microsoft Windows Live Photo Gallery']['Sci-Ed Clone Manager', 'GSL Biotech SnapGene']['GSL Biotech SnapGene']"], "pctl": ["Kaspersky Parental Control Settings File", "Account profile created by Kaspersky Internet Security, and antivirus and malware protection application; contains settings that limit a person's usage of the computer; commonly created by parents for saving specific limitation settings associated with their children's computer accounts.", "Windows, ", "['Kaspersky Internet Security 2017']"], "pdb": ["Program Database", "A PDB file is a database file used by several applications, including Pegasus, Quicken, MS Visual Studio, and Palm Pilot software.  It stores data in a structured format and is typically installed with the corresponding application.", "Windows, Mac, Windows, Mac, Linux, Web, Windows, Windows, Windows, Mac, Linux, Android, ", "['Intuit Quicken', 'Microsoft Visual Studio 2017']['Intuit Quicken']['Avogadro', 'Jmol', 'RasMol', 'Microsoft Internet Explorer with JmolApplet or Protein Workshop applet', 'Agile Molecule Abalone', 'Agile Molecule Ascalaph']['Avogadro', 'Jmol', 'Apple Safari with JmolApplet or Protein Workshop applet']['Avogadro', 'Jmol', 'RasMol', 'Mozilla Firefox with JmolApplet or Protein Workshop applet']['Animated Physics', 'QuickPDB']['Tanida Demo Builder'][]['Palm Desktop', 'Fictionwise eReader', 'LLUSoft PDB Explorer', 'DC & Co iSilo', 'XnViewMP']['Planamesa NeoOffice', 'Fictionwise eReader', 'Lemkesoft GraphicConverter', 'PorDiBle', 'txt2pdbdoc', 'XnViewMP']['txt2pdbdoc', 'XnViewMP']['Fictionwise eReader']"], "pcx": ["Paintbrush Bitmap Image File", "Raster image format developed by ZSoft; became one of the original bitmap image formats for the DOS/Windows platform; supports 24-bit color images, 8-bit grayscale and indexed color images, and 1-bit black and white images; compressed using RLE encoding.", "Windows, Mac, Linux, Android, ", "['File Viewer Plus', 'Microsoft Windows Picture and Fax Viewer', 'Adobe Photoshop CC 2017', 'Adobe Photoshop Elements 15', 'Adobe Illustrator CC 2017', 'Corel PaintShop Pro X9', 'Corel Presentations X8', 'ACD Systems Canvas X 2017', 'ACD Systems ACDSee 20', 'Nuance OmniPage Ultimate', 'GIMP']['Adobe Photoshop CC 2017', 'Adobe Photoshop Elements 15', 'Adobe Illustrator CC 2017', 'Planamesa NeoOffice', 'GIMP']['GIMP']['File Viewer for Android']"], "pcsav": ["Mass Effect 2 Saved Game", "Saved game file created by Mass Effect 2, a galactic action role-playing game; includes the player profile, achievements, and items; may be an auto-saved game created by the software or a user-created saved game; can be edited with Gibbed's Mass Effect 2 or 3 Save Editor, or converted to the .XBSAV format for use on the Xbox.", "Windows, ", "[\"Gibbed's Mass Effect 3 Save Editor\", \"Gibbed's Mass Effect 2 Save Editor\", 'Electronic Arts Mass Effect 2']"], "pcr": ["PCMark Vantage Benchmark File", "File created by PCMark Vantage, a program that is used to create performance benchmarks for Windows computers and their programs; contains the results of a system benchmark, including CPU, memory, and disk performance.", "Windows, ", "['FutureMark PCMark05', 'Futuremark PCMark Vantage', 'Futuremark PCMark Vantage Online ResultBrowser']"], "pct": ["Picture File", "A PCT file is an image saved in the Macintosh PICT format, which was developed by Apple in 1984 for storing images using Apple QuickDraw technology.  It contains image data in one of two formats, PICT 1, the original format that stores 8 colors, or PICT 2, a newer format that allows thousands of colors (24 and 32-bit images).  PCT files support both raster and vector images.", "Windows, Mac, Windows, ", "['Adobe Photoshop CC 2017', 'Adobe Photoshop Elements 15', 'Adobe Illustrator CC 2017', 'Adobe After Effects CC 2017', 'ACD Systems ACDSee 20', 'CorelDRAW Graphics Suite X8', 'Corel PaintShop Pro X9', 'XnViewMP']['Apple Preview', 'Adobe Photoshop CC 2017', 'Adobe Photoshop Elements 15', 'Adobe Illustrator CC 2017', 'Adobe After Effects CC 2017', 'Lemkesoft GraphicConverter', 'XnViewMP']['ChemSep']"], "pcp": ["Windows Installer Patch Creation Properties File", "File used by the Windows Installer, which is the standard installer software included with the Windows operating system; contains global settings for a software patch package; used for generating .MSP patch files.", "Windows, ", "['Microsoft Windows SDK']"], "pck": ["System Center Configuration Manager Package File", "File used by System Center Configuration Manager (SCCM), an application used to administer large groups of Windows computer systems; contains an update package, which can store system and application files; used for updating client systems.", "Windows, Windows, ", "['Microsoft System Center Configuration Manager']['Perfect World']"], "pcl": ["Printer Command Language Document", "Digital printed document created in the Printer Command Language (PCL) page description language; describes the layout of text and graphics for the document; originally used by Hewlett-Packard printers in the 1980s and now used by HP LaserJet printers and others; widely used but offers fewer features than the PostScript (.PS) format.", "Windows, Mac, Linux, ", "['OpenPCL Viewer', 'PageTech PCL Reader', 'RedTitan Technology EscapeE', 'PageTech PCL Works', 'PageTech PCLTool SDK', 'CoolUtils PCL Viewer']['OpenPCL Viewer']['OpenPCL Viewer']"], "pch": ["Precompiled Header File", "Contains programming code referenced by a source code file, often using an #include preprocessor directive; may reference other header (.H) files and other resources.", "Windows, Mac, Linux, Windows, Linux, ", "['Microsoft Visual Studio 2017', 'Code::Blocks', 'text editor']['Apple Xcode', 'Code::Blocks', 'MacroMates TextMate', 'text editor']['Code::Blocks']['MSC Nastran']['MSC Nastran']"], "pcg": ["Korg Instrument Bank File", "Contains a collection of instruments for the Korg Triton or Korg Trinity synthesizers; includes instrument names, associated samples, and other instrument parameters, such as oscillators, keyboard splits, and velocity ranges.", "Windows, ", "['FMJ-Software Awave Studio']"], "pcc": ["Mass Effect Package", "File used by Mass Effect 2 and 3, a first person shooter game based on the Unreal Engine 3 gaming engine; may contain various game data, including models, textures, and rooms; commonly used to modify (or \"mod\") game content.", "Windows, Windows, Mac, Linux, ", "['Electronic Arts Mass Effect 3', 'Electronic Arts Mass Effect 2', 'Unreal Model Viewer', 'Unreal Package Extractor']['text editor']['text editor']['text editor']"], "pcd": ["Pokémon Wonder Card File", "Game file used by Pokémon games for the Nintendo DS portable gaming device; stores information for a Wonder Card, which can be contained in a \"mystery gift\" received from the in-game deliveryman at the Poké Mart; unlocks items and events in the game.", "Windows, Windows, Windows, Mac, Linux, Android, ", "['Pokémon Mystery Gift Editor', 'Pokesav']['ChemSep', 'AmsterCHEM COCO']['File Viewer Plus', 'Corel PaintShop Pro X9', 'ACD Systems ACDSee 20', 'XnViewMP', 'IrfanView']['Adobe Photoshop with Kodak Photo CD plug-in', 'Apache OpenOffice', 'Planamesa NeoOffice', 'XnViewMP']['Apache OpenOffice']['File Viewer for Android']"], "pcb": ["Printed Circuit Board Design File", "Design or model of a printed circuit board (PCB), which provides connections to electrical components; used for creating the layout that is used for printing the physical board; saved in a standard ASCII text format.", "Windows, Mac, Linux, ", "['Altium Designer', 'Zuken CADSTAR', 'CadSoft EAGLE']['CadSoft EAGLE']['CadSoft EAGLE']"], "pcast": ["iTunes Podcast File", "XML file created by iTunes, a music shopping and playback program; contains information for subscribing to a podcast, including the link, title, category, and subtitle; used for sharing recommended podcasts or favorites with others over email or the Web.", "Windows, Mac, ", "['Apple iTunes', 'JRiver Media Center']['Apple iTunes']"], "pca": ["Perfect Clarity Audio File", "Audio format used by MAGIX Sound Forge Pro audio editing program; originally created by Sonic Foundry, which was bought by Sony then acquired by MAGIX.", "Windows, ", "['MAGIX Sound Forge Pro 11', 'MAGIX ACID Pro 7']"], "pcapng": ["Pcap-NG Packet Capture File", "Packet capture format that contains a \"dump\" of data packets captured over a network; saved in the PCAP Next Generation file format, a standard format for storing captured data.", "Windows, Mac, Linux, ", "['Wireshark', 'Netresec CapLoader']['Wireshark']['Wireshark']"], "pcap": ["Packet Capture Data", "Data file created by Wireshark (formerly Ethereal), a free program used for network analysis; contains network packet data created during a live network capture; used for \"packet sniffing\" and analyzing data network characteristics; can be analyzed using software that includes the libpcap or WinPcap libraries.", "Windows, Mac, Linux, ", "['Wireshark', 'Netresec NetworkMiner', 'WinDump']['Wireshark']['Wireshark', 'Netresec NetworkMiner', 'tcpdump']"], "pc7": ["PowerCADD 7 Drawing File", "CAD drawing created with PowerCADD 7, a Macintosh-only architecture and design program; may contain building designs and layouts, machinery designs, or 2D drawings.", "Mac, ", "[]"], "pc3": ["AutoCAD Plotter Configuration File", "File created by AutoCAD, a CAD program used to create 2D and 3D designs; contains plotter properties, such as color depth, media type, and print quality; used to configure specific plotter settings and save them for later use.", "Windows, Windows, Mac, ", "['Autodesk AutoCAD 2017']['Logipole Konvertor', 'XnViewMP']['Lemkesoft GraphicConverter', 'XnViewMP']"], "pc6": ["PowerCADD 6 Drawing File", "Drawing file created with PowerCADD 6, a Macintosh CAD program; may contain architectural designs, floor plans, machinery assemblies, or 2D drawings.", "Mac, ", "[]"], "pc": ["Personal Composer File", "Musical Score created with Personal Composer, a music notation, MIDI, sequencing, and publishing program; can be created using the software interface or recorded from a MIDI instrument.", "Windows, Windows, Linux, ", "['Personal Composer']['Oracle ProC Precompiler']['Oracle ProC Precompiler']"], "pbxuser": ["Xcode Project User Data File", "File created by Xcode, a software development application for Mac OS X; saves user settings for the development project, including the currently-opened files, window settings, build preferences, project directories, and many more properties; used for remembering local settings.", "Mac, ", "['Apple Xcode']"], "pbxproj": ["Xcode Project Data File", "Data file created by Xcode, a development application for Mac OS X; saves project data such as the list of source code and resource files and the build properties; also saves the Group data, which organizes the resource files in a virtual folder hierarchy.", "Mac, ", "['Apple Xcode']"], "pbxbtree": ["Xcode Auto-Complete File", "File created by Xcode, a software development tool for Mac OS X; contains references to functions, protocols, imports, and other data; used for code hinting and autocompletion by Xcode's CodeSense component.", "Mac, ", "['Apple Xcode']"], "pbx5script": ["Personal Backup Script", "File created by Personal Backup, a program used for creating backups on the Mac; defines what data will be backed up and can be run periodically on a schedule in Personal Backup; used for saving and loading backup jobs and can be opened to run the job.", "Mac, ", "['Intego Mac Premium Bundle X9']"], "pbp": ["PSP Firmware Update File", "Firmware update image file used for updating the firmware of the Sony Playstation Portable (PSP); commonly used to install game demos on the PSP, but can also be used for installing homebrew games and applications; sometimes used to modify or hack the PSP; typically named \"EBOOT.PBP.\"", "Windows, ", "['PBP Unpacker']"], "pbn": ["Portable Bridge Notation File", "Game file created in the Portable Bridge Notation (PBN) format, a standard format used for storing data for the card game Bridge; can save the results of a game as well as specify rules for dealing, bidding, playing, and teaching; allows data from one bridge game to be used in another game.", "Windows, ", "['EasyBridge', 'WBridge5', 'RoboBridge', 'BridgeVu', 'text editor']"], "pbm": ["Portable Bitmap Image", "1-bit black and white image; formatted in text format; basic raster image format in which each pixel is represented by a byte that contains a 1 or 0; 1 represents black and 0 represents white pixels. ", "Windows, Mac, Linux, Android, ", "['File Viewer Plus', 'Adobe Photoshop CC 2017', 'ACD Systems Canvas X 2017', 'ACD Systems ACDSee 20', 'Newera Graphics Converter Pro', 'Corel PaintShop Pro X9', 'Inkscape', 'Netpbm', 'text editor']['Adobe Photoshop CC 2017', 'Lemkesoft GraphicConverter', 'Inkscape', 'Netpbm', 'text editor']['Inkscape', 'Netpbm', 'text editor']['File Viewer for Android']"], "pbk": ["Dial-Up Phone Book File", "Data file used by the Network Connections utility in Microsoft Windows, which is also referred to as the Remote Access Phonebook; stores saved dial-up connection settings, which include phone numbers, logins, and passwords; can save data for multiple connections.", "Windows, Windows, Mac, ", "['Microsoft Windows']['Adobe Pixel Bender Toolkit']['Adobe Pixel Bender Toolkit']"], "pbj": ["Pixel Bender Bytecode File", "Image filter file created by Pixel Bender Toolkit, an application used for creating custom image filters for Flash applications, Photoshop, and other Adobe products; contains byte code (executable binary code) that has been compiled from a .PBK file; used for performing image manipulations such as blurs, pixelations, fades, and twirls.", "Windows, Mac, Windows, ", "['Adobe Pixel Bender Toolkit', 'Adobe Flash Player']['Adobe Pixel Bender Toolkit', 'Adobe Flash Player']['CyberLink PowerBackup 2.6']"], "pbix": ["Power BI Desktop File", "A PBIX file is a document created by Power BI Desktop, a Microsoft application used to create reports and visualizations.  It contains queries, data models, visualizations, settings, and reports added by the user.  ", "Windows, ", "['Microsoft Power BI Desktop']"], "pbi": ["PC BSD Installer Package", "Installation package created for the PC-BSD operating system; contains a setup file and libraries necessary for a full installation; starts the PC-BSD installation wizard when opened; similar to the SETUP.EXE file included with Windows programs.", "Linux, ", "['PC-BSD']"], "pbg": ["Pixel Bender Graph File", "File created by Pixel Bender Toolkit, a program used for creating image manipulation filters for programs such as Photoshop, Flash Player, and After Effects; contains a processing graph that includes multiple Pixel Bender kernels (image filters); allows developers to connect multiple kernels into a single processing unit.", "Windows, Mac, ", "['Adobe Pixel Bender Toolkit']['Adobe Pixel Bender Toolkit']"], "pbf": ["Paragon Backup File", "Backup archive created by one of Paragon's backup and recovery applications; stores backup files in a proprietary format; can be browsed within the software, which enables users to restore individual files or a whole file system.", "Windows, Windows, Windows, ", "['Paragon Backup & Recovery Suite', 'Paragon System Backup']['CyberLink PowerBackup 2.6']['FMJ-Software Awave Studio']"], "pbd": ["EaseUS Todo Backup File", "Backup file created by EaseUS Todo Backup, a backup and restore utility for Windows; may include system or user files and can be used for storing entire disk partitions; often saved on external media or some other device that can be used to restore files in case the local computer is damaged.", "Windows, Windows, ", "['EaseUS Todo Backup'][]"], "pb": ["PureBasic Source File", "Program file containing source code created with PureBasic; based on the BASIC programming languauge; may include variables, functions, and references to other source files.", "Windows, Mac, Linux, ", "['text editor']['text editor']['text editor']"], "paw": ["Pawaa File", "File created in the pawaaFILE format, a format developed by Pawaa Software for secure storage and transmission of files, particularly in enterprise environments; encapsulates any file with an encryption layer and a usage policy so that the file is protected from unwanted access; also enforces audit trails and expiration dates so the file has additional levels of distribution control.", "Windows, Mac, Mac, ", "[]['Paw']['Personal Ancestry Writer II']"], "patch": ["Patch File", "File created by Mercurial, a control management developer tool; contains the differences between two different versions of the same text or source file; used by developers that are making changes to different versions of the same file; enables updating of older text files to newer version text files.", "Windows, Mac, Linux, ", "['Mercurial']['Mercurial']['Mercurial']"], "pat": ["AutoCAD Hatch Pattern File", "CAD file used by AutoCAD, a professional CAD drawing application; stores a hatch pattern which can be used to texturize or fill an area; helps give a material appearance (e.g., brick, aluminum, glass, or plastic) to drawn objects.", "Windows, Windows, Mac, Linux, Windows, Mac, Linux, Windows, Windows, Mac, Windows, Windows, Windows, ", "['Autodesk AutoCAD 2017']['Adobe Photoshop CC 2017', 'ACD Systems Canvas X 2017', 'Corel PaintShop Pro X9', 'Corel Presentations X8', 'GIMP']['Adobe Photoshop CC 2017', 'GIMP']['GIMP']['Synology Assistant']['Synology Assistant']['Synology Assistant']['CorelDRAW Graphics Suite X8']['Autodesk AutoCAD 2017', 'AeroHydro SurfaceWorks']['Autodesk AutoCAD 2017']['Ketron Software']['FMJ-Software Awave Studio']['Kega Fusion']"], "pas": ["Delphi Unit Source File", "Source code file created in Delphi, a software development application used for building Windows programs; written in the Delphi language, which is a variant of the Object Pascal language; can be compiled into native Win32 code with the Delphi compiler.", "Windows, Windows, Mac, Linux, ", "['File Viewer Plus', 'Embarcadero Delphi']['File Viewer Plus', 'Free Pascal', 'Xidicone Zeus', 'Embarcadero Turbo Pascal', 'RemObjects Oxygene', 'Notepad++']['Free Pascal', 'MacroMates TextMate', 'Bare Bones BBEdit']['Free Pascal']"], "passwordwallet4": ["PasswordWallet 4 Data File", "File created by PasswordWallet, a personal private information manager; stores passwords, login information, and other sensitive user information; uses encryption so that the data can be opened without the correct password.", "Windows, Mac, ", "['S3 PasswordWallet']['S3 PasswordWallet']"], "partimg": ["Partimage File", "Disk partition saved to a disk image file with the Unix Partition Image program; may be compressed using .GZIP or .BZIP2 compression and can be split into multiple files that can be copied onto more than one disk.", "Linux, ", "[]"], "partial": ["Internet Explorer Partially Downloaded File", "A PARTIAL file is a partially downloaded file created by Microsoft Internet Explorer 9 (IE9) or later and also created by Microsoft Edge, the successor to Internet Explorer.  It saves the contents of a file as it is being downloaded.  PARTIAL files mark the download as incomplete and enable downloads to be resumed.", "Windows, ", "['Microsoft Internet Explorer', 'Microsoft Edge']"], "part": ["Partially Downloaded File", "A PART file is a partially downloaded file from the Internet used for downloads that are in progress or have been stopped.  Some PART files can be resumed at a later time using the same program that started the download.  PART files are typically used by Mozilla Firefox and several file transfer programs, such as Go!Zilla, eMule, and the discontinued eDonkey program.", "Windows, Mac, Linux, ", "['Free Download Manager', 'FlashGet', 'Headlight Go!Zilla', 'Mozilla Firefox', 'Jdownloader', 'Skype']['Mozilla Firefox', 'Jdownloader', 'Skype']['Mozilla Firefox', 'Jdownloader', 'zsync', 'Skype']"], "par2": ["Parchive 2 Index File", "Index file that contains a group of parity volumes in a Parchive 2 (PAR2) archive; may be used to recover a file archive when one of the files in the archive is lost.", "Windows, Mac, Linux, ", "['QuickPar']['EZ7z'][]"], "par": ["FMS Aircraft Parameters File", "A PAR file is an aircraft parameters file used by FMS (Flying-Model-Simulator), a flight simulation game for Windows.  It saves the airplane geometry and physics properties such as mass, center of gravity, and inertia moments.  PAR files are used for creating custom aircraft to fly in the game.", "Windows, Windows, Mac, Linux, Windows, Mac, Windows, Mac, ", "['FMS']['QuickPar']['UnRarX'][]['Siemens Solid Edge', 'Adobe Acrobat DC']['Adobe Acrobat DC'][][]"], "paq7": ["PAQ7 Data Archive", "File archive compressed with the seventh version of PAQ, an open-source data compression archiver; about three times faster than PAQ6.", "Windows, Linux, ", "[][]"], "papa": ["Game Save Backup File", "File created by Flipline Studios games, which include Papa's Cupcakeria, Hot Doggeria, and Burgeria; file contains saved game progress data; data is automatically saved after each level on to the player's computer.", "Web, ", "['Flipline Studios']"], "pano": ["Camera Panoramic Picture", "File created by Windows Camera, a photo and video recording application; contains a photo generated from several different images taken from the same vantage point and \"stitched\" together by the Camera application.", "Windows, ", "['Microsoft OneDrive']"], "paq": ["Hewlett-Packard Software Restore File", "Contains data used for restoring system files or other data pre-installed on a Hewlett-Packard (HP) computer system; saved in a compressed and encrypted archive format; typically found on HP system software installer or recovery disks.", "Windows, ", "['Corel WinZip 21']"], "paq6": ["PAQ6 Data Archive", "File archive compressed with the sixth version of PAQ, an open-source data compression archiver.", "Windows, Linux, ", "[][]"], "pandora": ["Pandora Android App Executable", "File used by the Android mobile operating system app Pandora as a hidden file format; when the Pandora application is used to keep an audio or video file private, the app appends the .pandora extention to the file.", "Android, ", "['Pandora']"], "pando": ["Pando File", "Contains meta-data information of a file or group of files to be transferred using Pando, a program used to transfer files similarly to a BitTorrent client; used to reference other locations of the file/files to download from.", "Windows, Mac, ", "['Pando Networks Pando']['Pando Networks Pando']"], "pan": ["Panorama Database File", "Database file created by Panorama, a data manipulation application; saves data in a structured proprietary format and can be viewed in the form of a spreadsheet in the software; can be filtered, sorted, searched, and saved using the software's highly efficient algorithms.", "Windows, Mac, ", "['ProVUE Development Panorama', 'ProVUE Development Panorama Sheets']['ProVUE Development Panorama', 'ProVUE Development Panorama Sheets']"], "pak": ["Video Game Package", "A PAK file is an archive used by video games such as Quake, Hexen, Crysis, Far Cry, and Half-Life.  It may include graphics, objects, textures, sounds, and other game data \"packed\" into a single file.  PAK files are often just a renamed .ZIP file.", "Windows, Windows, Mac, Windows, Mac, Linux, ", "['Leinen PAK Explorer', 'Pak Explorer', 'Sprite Explorer', 'DePacker', 'QuArK', 'Wally']['Smith Micro StuffIt Deluxe for Windows', 'Corel WinZip 21', 'ESTsoft ALZip', 'Avanquest PowerDesk Pro']['Smith Micro StuffIt Deluxe 16', 'The Unarchiver']['Simutrans', 'PakBuilder']['Simutrans']['Simutrans']"], "pages": ["Pages Document", "A PAGES files is a document created by Apple Pages, a word processor and page layout program.  It may be a basic text document or a complex multi-page brochure.  PAGES files can include text, pictures, tables, graphs, and charts and may be created from a blank page or built from a template.", "Windows, Mac, Web, iOS, ", "['File Viewer Plus']['Apple Pages']['Google Drive', 'Google Drive viewer', 'Zamzar']['Apple Pages']"], "paf": ["Portable Application Installer File", "Installer for a portable application stored on a USB flash drive; can be installed and run on any Windows computer from the USB drive; includes software such as Firefox Portable, OpenOffice.org Portable, 7-Zip Portable, as well as many other games, programs, and utilities.", "Windows, Windows, ", "[]['FamilySearch Personal Ancestral File', 'RootsMagic']"], "pages-tef": ["Pages iCloud Document", "Text document created by Pages, the word processor included with Apple's iWork suite; used as the save format when a user chooses to save the document to iCloud; differs from the standard .PAGES extension, but doesn't affect the contents of the document when reopened in Pages.", "Mac, iOS, ", "['Apple Pages']['Apple Pages']"], "p64": ["64-bit Windows IDA Plugin Module", "64-bit Windows plugin module used by IDA (The Interactive Disassembler), a utility used to disassemble executable files into low-level assembly language code; contains data written in C++ that extends the functionality of the IDA tool.", "Windows, ", "['Hex-Rays IDA']"], "p5d": ["Planner 5D Project", "A P5D file is a project created by Planner 5D, a 2D and 3D home design and interior decor program.  It contains a home design project, which includes the layout of the house, construction materials, furniture, and appliances.  P5D files may also store objects located around the exterior of the home such as paths, trees, plants, and pools.", "Windows, Web, iOS, Android, ", "['Planner 5D']['Planner 5D']['Planner 5D']['Planner 5D']"], "p3t": ["PlayStation 3 Theme File", "Theme file for a Sony PlayStation 3 video game system; includes background images, buttons, layouts, sound files, and other settings used to customize the interface of the PS3; can be downloaded and installed using the PS3 console's browser application.", "Windows, Linux, ", "['P3T Unpacker']['P3T Unpacker']"], "p3l": ["Adobe Photoshop Light Preset File", "3D light settings file used by Adobe Photoshop, an image-editing program; stores the color, locations, directionality, and magnitudes lights in a three-dimensional space; can store point, spot, infinite, and image-based lights; used by Photoshop's 3D image-editing component to save and load preset lighting properties and add them to one or more 3D scenes.", "Windows, Mac, ", "['Adobe Photoshop CC 2017']['Adobe Photoshop CC 2017']"], "p3d": ["Peak3D 3D Graphics File", "Three-dimensional model created with Peak3D, a computer graphics 3d modeling program; supports both 2D and 3D images with support for polygons, cameras, and multiple types of lighting effects.", "Windows, Windows, Mac, Linux, ", "[]['Panda3D']['Panda3D']['Panda3D']"], "p3": ["Primavera P3 Project File", "Project scheduling file created by Primavera P3, a project planning software often used for construction projects; saves the tasks, timeline, and resources for completing a project; allows the project manager to plan and track progress.", "Windows, ", "['Oracle Primavera']"], "p2m": ["PhotoWorks Appearance File", "File created by PhotoWorks, a program used to create 2D and 3D images from SolidWorks CAD models; contains an appearance, which is a set of properties that define how the surface of an object is displayed.", "Windows, Windows, ", "[][]"], "p2z": ["Compressed Poser Pose File", "Compressed pose file created with Poser, a 3D figure design program; may include information about figure joint angles, body position, and morph values; can be applied to Poser figures as well as entire scenes.", "Windows, Mac, ", "['Smith Micro Poser 11']['Smith Micro Poser 11']"], "p2i": ["Power2Go Disc Image", "Disc image file created by Power2Go, a CD, DVD, and Blu-ray disc burning application; stores the full contents of the target disc image in a proprietary format; can be used for burning multiple discs with the same contents; can also be browsed in the software.", "Windows, ", "['CyberLink Power2Go 11']"], "p2g": ["Power2Go Project File", "Disc image project created by Power2Go, a disc authoring and burning application; saved in an XML format and stores CD, DVD, or Blu-ray disc project settings; used for authoring audio, video, data, or mixed mode discs.", "Windows, ", "['CyberLink Power2Go 11']"], "p2p": ["FolderShare Placeholder File", "Shortcut to a file used by FolderShare, a Windows Live computer synchronizing service; contains a reference to a specific file and is used in place of the actual file; most often seen when On Demand Sync is active; double-clicking a P2P file within FolderShare should download the actual file to your computer.", "Windows, Mac, ", "[][]"], "p21": ["Express STEP Data Model File", "3D model format used for three-dimensional product data representation and exchange; saved in an ACSII text format specified by ISO 10303-21; used primarily for industrial automation systems and integration purposes.", "Windows, ", "[]"], "p12": ["Personal Information Exchange File", "File containing a digital certificate that uses PKCS#12 (Public Key Cryptography Standard #12) encryption; used as a portable format for transferring personal private keys or other sensitive information; used by various security and encryption programs.", "Windows, Mac, ", "['Microsoft Certificate Manager', 'Microsoft IIS', 'Adobe Reader', 'Adobe Acrobat DC']['Apple Keychain Access', 'Adobe Reader', 'Adobe Acrobat DC']"], "p10": ["Certificate Request File", "A P10 file is used by programs that include public-key cryptography authentication mechanisms.  It contains a request, which asks the receiving entity, usually a certificate authority (CA), to digitally sign a file.  P10 files are created using the PKCS#10 (Public-Key Cryptography Standards #10) standard.", "Windows, Mac, Linux, ", "['Microsoft Outlook 2016', 'OpenSSL']['Apple Keychain Access', 'Apple Mail', 'OpenSSL']['OpenSSL']"], "p01": ["Toast CD Image", "Copy of a CD saved as a disk image by Toast, a disc creation program for the Macintosh", "Windows, Mac, Windows, Windows, ", "['EZB Systems UltraISO', 'Smart Projects IsoBuster', 'PowerISO']['Roxio Toast 15']['EZB Systems UltraISO']['QuickPar']"]}