{"qbb": ["QuickBooks Backup File", "Backup file created by QuickBooks, a money management application; stores a full backup of company financial data, letters, templates, and logos; used for restoring the original data in the event that the primary .QBW is lost or becomes corrupted.", "Windows, Mac, ", "['Intuit QuickBooks Pro 2016']['Intuit QuickBooks for Mac 2016']"], "qb2009": ["QuickBooks 2009 File", "Company data file created by the Mac version of QuickBooks, a small business accounting application; contains financial data, report definitions, letters, and a company profile; enables companies to store and monitor their financial data; used for tracking income and expenses, as well as filing taxes.", "Windows, Mac, ", "['Intuit QuickBooks Pro 2016']['Intuit QuickBooks for Mac 2016']"], "qb2007": ["QuickBooks 2007 File", "Company accounting file created by the Mac version of QuickBooks, a small business accounting program; contains financial data, such as income and expenses for a company; also stores report definitions, letters, and a company profile; used for tracking income and expenses, as well as for filing taxes.", "Windows, Mac, ", "['Intuit QuickBooks Pro 2016']['Intuit QuickBooks for Mac 2016']"], "qb2012": ["QuickBooks 2012 File", "File created by the Mac version of QuickBooks money management software; can include company financial data, payroll information, and customer and employee data; often used for tracking small business finances; can be used for generating tax forms, invoices, payroll, and financial reports.", "Mac, ", "['Intuit QuickBooks for Mac 2016']"], "qb2011": ["QuickBooks 2011 File", "File created by the Mac version of QuickBooks money management software; stores company financial data, report definitions, and letters; can be used for generating payroll information, tax forms, and reports.", "Mac, ", "['Intuit QuickBooks for Mac 2016']"], "qba": ["QuickBooks Accountant's Copy Work File", "Copy of the work file created by QuickBooks, an application used for entering and storing financial data; contains the modified QuickBooks data exported from one computer to the accountant's computer; the exported data is restored by the accountant on their computer which creates the QBA extension.", "Windows, Mac, ", "['Intuit QuickBooks Pro 2016']['Intuit QuickBooks for Mac 2016']"], "qb2014": ["QuickBooks 2014 File", "File created by QuickBooks for Mac, a financial management application; contains financial data for a company including employee profiles, payroll information, and customer data; can generate tax forms, invoices, financial reports, and more.", "Mac, ", "['Intuit QuickBooks for Mac 2016']"], "qb2013": ["QuickBooks 2013 File", "File created by QuickBooks for Mac, a financial management software; contains a company's financial data including payroll information, employee data, and customer information; able to generate tax forms, payroll, financial reports, and more.", "Mac, ", "['Intuit QuickBooks for Mac 2016']"], "qb2010": ["QuickBooks 2010 File", "Data file created by the Mac version of QuickBooks, a money management application; contains company financial data as well as report definitions and letters; enables companies to store and monitor financial information; can be used for generating payroll, tax forms, and reports.", "Windows, Mac, ", "['Intuit QuickBooks Pro 2016']['Intuit QuickBooks for Mac 2016']"], "qb2006": ["QuickBooks 2006 File", "Accounting data file created by the Mac version of QuickBooks, a small business accounting program; contains company financial management information, such as income and expenses; used for tracking financial data, as well as filing taxes.", "Windows, Mac, ", "['Intuit QuickBooks Pro 2016']['Intuit QuickBooks for Mac 2016']"], "qb2005": ["QuickBooks 2005 File", "Company accounting data file created by the Mac version of QuickBooks, a small business money management application; stores company income and expense information; used for tracking financial data, as well as for filing taxes and managing payroll.", "Windows, Mac, ", "['Intuit QuickBooks Pro 2016']['Intuit QuickBooks for Mac 2016']"], "q9s": ["Mr. Contrast Photoshop Plug-In", "Photoshop plug-in developed by Flaming Pear Software; adds dramatic contrast to photos and hyper-emphasizes detail; must reside in the Plug-ins folder within the application folder to work.", "Windows, Mac, ", "['Adobe Photoshop CC 2017', 'Corel PaintShop Pro X9']['Adobe Photoshop CC 2017']"], "qat": ["Microsoft Office Quick Access Toolbar File", "Customization file used by Microsoft Office, a document production suite; contains XML code that customizes ribbons in Microsoft Office; includes code that defines custom commands, groups, groups, tabs, etc. that make up the Microsoft Office UI.", "Windows, Mac, ", "['Microsoft Office 2016']['Microsoft Office 2016']"], "qb": ["Diploma Question Bank File", "Question file used by Wimba Diploma, a program used to create exam questions; contains questions referenced by exams; includes the question type, such as essay, multiple choice, and true/false; also stores location information that orders how the questions appear in the bank.", "Windows, Mac, ", "['Wimba Diploma']['Wimba Diploma']"], "qar": ["QlikView Extension", "Add-on file used by QlikView, a data analysis program used for business intelligence reporting; stores an archive of files, which specifies a new visualization or user interface component; sometimes used for integrating third-party visualizations.", "Windows, ", "['QlikTech International QlikView']"], "qxp": ["QuarkXPress Project File", "QuarkXPress project file created by QuarkXPress version 6 and later; contains page layout information, text, and images; may consist of a single page or multiple pages.", "Windows, Mac, ", "['QuarkXPress', 'Adobe InDesign with Q2ID Plugin']['QuarkXPress', 'Adobe InDesign with Q2ID Plugin']"], "qxt": ["QuarkXPress Template", "Template file for creating new QuarkXPress projects; used for designing multiple documents with similar layouts, such as brochures, newsletters, books, etc; may be included with the QuarkXPress software or created by the user.", "Windows, Mac, ", "['QuarkXPress', 'Adobe InDesign with Q2ID Plugin']['QuarkXPress', 'Adobe InDesign with Q2ID Plugin']"], "qxl": ["QuarkXPress Library", "QuarkXPress library that contains images, calendars, XTensions, or other content referenced by QuarkXPress; may be inserted into an open QuarkXPress document.", "Windows, Mac, ", "['QuarkXPress']['QuarkXPress']"], "qxf": ["Quicken Essentials for Mac Exchange File", "File created by Quicken Essentials for Mac, the Mac version of the Quicken financial software; saves exported financial data in a format that can be transferred to a PC and opened with the Windows version of Quicken.", "Windows, ", "['Intuit Quicken']"], "qxd": ["QuarkXPress Document", "Desktop publishing document created using QuarkXPress 5 or earlier; contains formatted text and images as well as page layout properties; may be used to create page layouts for newspapers, magazines, flyers, books, and brochures.", "Windows, Mac, ", "['QuarkXPress', 'Adobe InDesign with Q2ID Plugin']['QuarkXPress', 'Adobe InDesign with Q2ID Plugin']"], "qxb": ["QuarkXPress Book File", "Digital book file created by QuarkXPress, a professional page layout and publishing application; contains the pages of a book, including a master page, book sections, page text and numbering, and page formatting; can be a completed book or a part of a larger book.", "Windows, Mac, ", "['QuarkXPress']['QuarkXPress']"], "qvw": ["QlikView Document", "Document created by QlikView, a business intelligence analysis application; stores a QlikView application, which contains reports, charts, and key indicators for a business; used for analyzing business finances and other competitive intelligence information.", "Windows, ", "['QlikTech International QlikView']"], "qx": ["Quexal Source Code", "Source code for a Quexal program; can incorporate MMX / iSSE instructions; used mainly for multimedia applications.", "Windows, ", "['Quexal']"], "qwq": ["OpenQwaq Auto-Launch File", "File used by OpenQwaq, a program used for virtual online collaboration; saves connection settings and opens a live online 3D environment in which each person can be represented by a virtual avatar.", "Windows, Mac, Linux, ", "['OpenQwaq']['OpenQwaq']['OpenQwaq']"], "qwd": ["QuakeWorld Demo File", "Game file used by the QuakeWorld demo, an improved multiplayer version of Quake", "Windows, ", "[]"], "qvt": ["QlikView Theme File", "Theme file used by QlikView, a business intelligence analysis program; contains information that specifies the layout and styles of document objects; used for changing the look and feel of QlikView documents (.QVW files).", "Windows, ", "['QlikTech International QlikView']"], "qvpp": ["QlikView Extension Properties Page File", "Visual layout file used by QlikView, a business intelligence (BI) reporting application; contains HTML source code that specifies the layout of the properties page of an extension (.QAR file); used for formatting graphs and other BI data for a visualization.", "Windows, ", "['QlikTech International QlikView']"], "qvp": ["ViewletBuilder Project File", "Project file created by ViewletBuilder, a program used for creating interactive Flash presentations; contains resources for the project, such as screenshots, images, and audio files; can be exported to a Flash-based Web presentation.", "Windows, Mac, Linux, ", "['Qarbon ViewletBuilder']['Qarbon ViewletBuilder']['Qarbon ViewletBuilder']"], "qvf": ["Qlik Sense Desktop App File", "A QVF file is an app created by Qlik Sense Desktop, an analytics program used to create personalized, interactive reports and data visualizations.  It contains one or more visualizations of data, such as charts, maps, tables, and plots.  QVF files also include settings that configure the appearance of the visualizations.", "Windows, ", "['Qlik Sense Desktop']"], "qvd": ["QlikView Data File", "Database file used by QlikView, a business intelligence tool; saves an uncompressed \"RAM image\" representation of a QlikView table as it was stored in memory when open in QlikView; allows the database to be opened and loaded into memory quickly.", "Windows, ", "['QlikTech International QlikView']"], "quiz": ["Quobject Quiz Package", "Package of .QUOX files created for Quobject Explorer, a program used for preparing quizzes and exams; stores the archive using .ZIP compression and saves the QUOX files in the order they appear on the exam.", "Windows, ", "['Quobject Explorer']"], "qvm": ["Q Virtual Machine", "Virtual machine used by Q, an operating system emulator built for Mac OS X; serves as a hard disk that can be loaded by the emulator, which allows Windows and Linux systems to run within Mac OS X.", "Mac, Windows, Mac, ", "[]['id Software Quake 3']['id Software Quake 3']"], "quox": ["Question Object File Format", "File created in the Question Object File Format, a format used for exchanging quiz questions for exams; may include text, pictures, and MathML, a mathematics language; used for sharing quiz questions between teachers.", "Windows, ", "['Quobject Designer', 'Quobject Explorer']"], "quickendata": ["Quicken Essentials for Mac Data File", "Financial data format used by Quicken Essentials for Mac, the Mac OS X version of the Quicken personal financial management software; saves financial data for the user, such as account, loan, investment, and transaction information.", "Mac, ", "['Intuit Quicken']"], "quicken2017": ["Quicken 2017 Data File", "A QUICKEN2017 file is a financial data file created by the 2017 version of Quicken for Mac, a financial management program.  It contains user data for several accounts, including personal information, transactions, reports, and settings.  QUICKEN2017 files were introduced in the 2017 version of Quicken and are used exclusively by the software.", "Mac, ", "['Intuit Quicken']"], "quickenbackup": ["Quicken Essentials for Mac Backup File", "Backup file created by Quicken Essentials for Mac, the Mac version of the Quicken personal and business financial management software; stores a backup of the user's data, which is stored in a .QUICKENDATA file; should be created periodically by Quicken Essentials for Mac users and sent to a secure location.", "Mac, ", "['Intuit Quicken']"], "quicken2016": ["Quicken 2016 Data File", "A QUICKEN2016 file is a financial data file created by the 2016 version of Quicken, a financial management program.  It contains user data for multiple accounts, including personal information, transactions, reports, and settings.  QUICKEN2016 files are used exclusively by the 2016 version of Quicken for macOS (OS X).", "Mac, ", "['Intuit Quicken']"], "quicken2017backup": ["Quicken 2017 Backup File", "A QUICKEN2017BACKUP file is a backup file created by the 2017 version of Quicken financial management software.  It contains all user and account data, which may include personal information, reports, settings, and transactions.", "Mac, ", "['Intuit Quicken']"], "quicken2016backup": ["Quicken 2016 Backup File", "A QUICKEN2016BACKUP file is a backup file created by Quicken 2016 financial management software.  It contains all user and account data that can be used for back up purposes.", "Mac, ", "['Intuit Quicken']"], "quicken2015": ["Quicken 2015 Data File", "Financial data file created by Quicken 2015, a financial management program; saves user data for multiple accounts, including personal information, transactions, reports, and settings; used exclusively by the 2015 version of Quicken for OS X.", "Mac, ", "['Intuit Quicken']"], "quicken2015backup": ["Quicken 2015 Backup File", "Backup file created by Quicken 2015 financial management software; saves all user and account data in a single file that can be used for back up purposes; similar to a .quickenbackup file created by Quicken Essentials, but created by the 2015 version of Quicken for Mac.", "Mac, ", "['Intuit Quicken']"], "qtz": ["Quartz Composer File", "Animation created with Quartz Composer, a development tool created by Apple for processing and rendering graphical data; may include 2D images, 3D objects, textures, audio, MIDI data, and 2D and 3D effects.", "Mac, ", "['Apple QuickTime Player']"], "qualsoftcode": ["J&ASoft Code Archive File", "Archive utilized by J&ASoft programs, such as QualSoft or eXPerience; contains backup code for programs created by J&ASoft; includes program configuration files such as .CACHE, .CS, and .CONFIG.", "Windows, ", "['WinRAR 5', 'J&ASoft Speedy Browser']"], "qua": ["Avira AntiVir Quarantined File", "File created by Avira AntiVir, an antivirus application; saves an infected file in an encrypted format so that it cannot be opened manually; used for quarantining files that contain viruses.", "Windows, ", "['Avira Antivirus Pro 2016']"], "qtx": ["QuickTime Extension", "Component used by Apple QuickTime Player; enables support for additional video codecs and file formats; allows QuickTime to play video files encoded with third-party codecs; must be installed in the correct folder in order to be recognized by QuickTime.", "Windows, Mac, ", "[][]"], "qtr": ["QuickTime Extension Resource", "Resource file referenced by a QuickTime extension (.QTX file) that provides support for additional video codecs; stores the resource fork, which contains Macintosh-style resources.", "Windows, Mac, ", "[][]"], "qtp": ["QuickTime Preferences File", "Preferences file created by QuickTime, a video playback program; contains preferences such as connection speed, software update options, taskbar icon display, and file association notifications; used to remember and automatically apply user preferences within QuickTime. ", "Windows, ", "['Apple QuickTime Player']"], "qtm": ["Apple QuickTime Movie File", "Video file created by QuickTime, a video capture and movie playback program; stores compressed video and audio data in a proprietary Apple format; more commonly seen with the .MOV extension.", "Windows, Mac, ", "['Roxio Creator NXT Pro 5', 'CyberLink PowerDVD 16']['Roxio Toast 15', 'Roxio Popcorn']"], "qtl": ["QuickTime Link File", "Text file that contains a link to a QuickTime movie (.MOV) file; includes the MIME type and the location of the media file; may also include other QuickTime settings, which are defined by the following variables:\r\n\r\nautoplay\r\ncontroller\r\nfullscreen\r\nhref\r\nloop\r\nplayeveryframe\r\nqtnext\r\nquitwhendone\r\n\r\nQTL files are often referenced in Web page links.  Clicking a QTL link will open QuickTime player if the Web server must be configured with \"application /x-quicktimeplayer\" as the MIME type for QTL files.", "Windows, Mac, ", "['Apple QuickTime Player']['Apple QuickTime Player']"], "qtindex": ["Adobe QTIndex File", "File generated by some Adobe programs, such as After Effects and Premiere Pro; stores cached QuickTime media information used by the programs for processing imported media more quickly; may be created with .CFA and .PEK files.", "Windows, Mac, ", "['Adobe After Effects CC 2017', 'Adobe Premiere Pro CC 2017']['Adobe After Effects CC 2017', 'Adobe Premiere Pro CC 2017']"], "qtif": ["QuickTime Image File", "Image file created and compressed with Apple QuickTime; may be referenced by programs and movies that are based on QuickTime; uses the same atom types as a QuickTime movie: \"idsc\" (which contains the image description) and \"idat\" (which contains the image data).", "Windows, Mac, ", "['Apple QuickTime Player', 'ACD Systems ACDSee 20', 'Adobe Flash Professional CC']['Apple QuickTime Player', 'Adobe Flash Professional CC']"], "qti": ["QuickTime Image File", "Image created and compressed with Apple QuickTime; uses the same atom types as a QuickTime movie: \"idsc\" (which contains the image description) and \"idat\" (which contains the image data).", "Windows, Mac, ", "['Apple QuickTime Player', 'ACD Systems ACDSee 20']['Apple QuickTime Player']"], "qtch": ["QuickTime Cache File", "(Cache|cache file created by QuickTime, a media player for Mac and Windows; saves the cache of an audio or video file downloaded or streamed from the Internet; can be opened in QuickTime Player by changing the file extension to match the original file (e.g., .MP3, .MPEG, .MOV), but only if the file was created by QuickTime 6.5 or earlier.", "Windows, Mac, ", "['Apple QuickTime Player']['Apple QuickTime Player']"], "qt": ["Apple QuickTime Movie", "QuickTime multimedia format developed by Apple Computer; cross-platform, meaning it is supported on both Macintosh and Windows systems; may contain a compressed audio and video track.", "Windows, Mac, ", "['Apple QuickTime Player', 'Roxio Creator NXT Pro 5', 'CyberLink PowerDVD 16', 'Adobe Flash Professional CC', 'Attractor Mobile Software Codec Packs']['Apple QuickTime Player', 'Roxio Toast 15', 'Roxio Popcorn', 'Adobe Flash Professional CC', 'Eltima Elmedia Player']"], "qss": ["Qt Style Sheet", "Style sheet file used by Qt (pronounced \"cute\") programs; contains definitions for the look and feel of GUI elements, including fonts, sizes, colors, layouts, and mouse-over behaviors; stores a library of styles that can be incorporated into a user interface.", "Windows, Mac, Linux, ", "['Digia Qt SDK', 'Microsoft Notepad']['Digia Qt SDK']['Digia Qt SDK']"], "qsf": ["Qualtrics Survey File", "Data file exported by Qualtrics online survey software; formatted in XML and is generated when the \"Export Survey\" option is selected; can be used as a backup file and may be imported into the survey system for later use.", "Windows, Mac, ", "['Qualtrics Survey Solutions (online)']['Qualtrics Survey Solutions (online)']"], "qs": ["Qt Install Script", "Automation install script used by Qt, a cross-platform application development toolkit; contains data used to locate and install user-defined features; compressed with the 7zip format.", "Windows, Mac, Linux, ", "['Digia Qt SDK']['Digia Qt SDK']['Digia Qt SDK']"], "qsd": ["Quicken Data File", "File created by Quicken, a program used for tracking personal and business finances; contains financial data that can be backed up along with .QDF, .QPH, and .QEL files.", "Windows, Mac, ", "['Intuit Quicken']['Intuit Quicken']"], "qry": ["Query File", "Generic query file often containing database queries written in SQL, a language used to insert, update, or delete records from relational databases; sometimes used to run a single query or to run multiple queries in batch; can be executed with products such as MySQL and Microsoft SQL Server.", "Windows, Mac, Linux, ", "['Microsoft SQL Server 2016', 'MySQL']['MySQL']['MySQL']"], "qrp": ["QuickReport File", "File created by QuickReport, a program that allows users to design and create reports; contains report components, such as graphics, text, tables, and layout information; can be generated programmatically by using the QuickReport API.", "Windows, ", "['Embarcadero Delphi with QBS QuickReport or QRDesign plug-in', 'Embarcadero C++Builder', 'Zyl Soft RepView', 'Dr. Regener QuickReport-Viewer', 'Responsive Software QRP Viewer', '3Engine QuickReport Viewer']"], "qrm": ["Qworum Message File", "Message format used by Qworum, a platform for Web mashups; may be sent from one website to another to provide interactive services; formatted in XML and may contain remote procedure calls RPC.", "Windows, Mac, Linux, ", "['Microsoft Internet Explorer with Qworum plug-in', 'Mozilla Firefox with Qworum plug-in', 'Google Chrome with Qworum plug-in']['Mozilla Firefox with Qworum plug-in', 'Google Chrome with Qworum plug-in']['Mozilla Firefox with Qworum plug-in', 'Google Chrome with Qworum plug-in']"], "qrc": ["Qt Resource Collection File", "XML file used by programs created with Qt, a cross-platform application development toolkit; contains a list of application resources, such as image files; included as part of the application bundle when the Qt application is built.", "Windows, Mac, Linux, Windows, Mac, ", "['Digia Qt SDK', 'Riverbank Computing PyQt']['Digia Qt SDK', 'Riverbank Computing PyQt']['Digia Qt SDK', 'Riverbank Computing PyQt']['QuarkXPress']['QuarkXPress']"], "qpx": ["FoxPro Compiled Query Program", "Executable database query created by a FoxPro .QPR file.", "Windows, Windows, Windows, Mac, ", "['Microsoft Visual FoxPro']['Corel WordPerfect X8']['Apple QuickTime Player']['Apple QuickTime Player']"], "qpw": ["Quattro Pro Spreadsheet", "File created by Quattro Pro, a spreadsheet program provided as part of the Corel WordPerfect Office suite; contains charts, calculations, scripts, and other data in a two-dimensional cell grid; used most commonly for business office tasks or in personal finance.", "Windows, ", "['Corel Quattro Pro X8']"], "qpt": ["QuarkXPress Project Template", "Template file created by QuarkXPress, a program used to create professional page layouts; stores text, images, and page formatting information; enables users to create multiple .QXP files that have the same look and feel and layout properties.", "Windows, Mac, ", "['QuarkXPress']['QuarkXPress']"], "qpr": ["FoxPro Generated Query Program", "Source code of a query program generated by FoxPro", "Windows, ", "['Microsoft Visual FoxPro']"], "qpb": ["QuickBooks Point of Sale Data File", "File created by QuickBooks Point of Sale (POS), a business sales tracking application; may be the primary data file or a backup file automatically created by the software; enables the business data to be saved (and restored in the case of a backup).", "Windows, ", "['Intuit QuickBooks Point of Sale Desktop 12']"], "qph": ["Qt Phrase Books File", "Language translation file created by Qt Linguist, a program used for translating and internationalizing Qt (pronounced \"Cute\") applications; contains text phrases and their translations into another language; provides a translation repository that can be used by multiple Qt applications.", "Windows, Mac, Linux, Windows, Mac, ", "['Nokia Qt Linguist', 'Digia Qt SDK']['Nokia Qt Linguist', 'Digia Qt SDK']['Nokia Qt Linguist', 'Digia Qt SDK']['Intuit Quicken']['Intuit Quicken']"], "qpf": ["Quartus II Project File", "Project file created by Quartus II, a program for analyzing and optimizing HDL (Hardware Description Language) designs; includes data related to a single design analysis project; also contains information about the current version of the Quartus II software and all the revisions created for the project.", "Windows, Linux, Windows, Windows, ", "['Altera Quartus II']['Altera Quartus II']['Klumbu QuickPad']['Act-3D Quest3D']"], "qpm": ["Quick Pallet Maker Input Data", "Contains primary package information and box and pallet settings; used for calculating shipping pallet arrangements from primary package dimensions.", "Windows, Mac, ", "['Koona Software Quick Pallet Maker']['Koona Software Quick Pallet Maker']"], "qmtf": ["Quicken Mac Transfer File", "A QMTF file is a transfer file created by Quicken for Mac, a financial management program.  It contains user financial data, such as personal information, transactions, and reports, in a text format.  QMTF files are used to transfer data from Quicken to other financial software.", "Mac, ", "['Intuit Quicken', 'Reilly Technologies Moneydance', 'Scimonoce SEE Finance', 'IGG Banktivity 5']"], "qml": ["QT Meta Language File", "Language file used by Qt SDK, a desktop, mobile, and embedded UI development framework for C++ and QML languages; contains JavaScript-based QML source code encoded in UTF-8 format; often used to develop mobile applications and components such as buttons.", "Windows, Mac, Linux, ", "['Digia Qt SDK']['Digia Qt SDK']['Digia Qt SDK']"], "qmk": ["YanCEyDesktop Quickmarks File", "File created by YanCEyDesktop, a desktop reader for YanCEyWare eBooks; stores eBook bookmarks, called \"quickmarks,\" that have been created by the user; allows users to save locations within eBooks and quickly navigate to them.", "Windows, ", "[]"], "qmg": ["Samsung Theme Graphics File", "File included as part of a Samsung mobile phone theme; saves a graphic for a part of the theme (.SMT file); may be for the phone background, a button, or another visual item; compiled into a proprietary Samsung binary format.", "Windows, ", "['Samsung Theme Designer']"], "qmbl": ["LabQuest Document", "Data file created and used by LabQuest, an interface used to collect sensor data; stores experiment results recorded from a LabQuest device;  may contain data-collection settings, data tables, analyses, graphs, and notes.", "Windows, Mac, iOS, ", "['Vernier LabQuest', 'Vernier Logger Pro', 'Vernier Logger Lite']['Vernier LabQuest', 'Vernier Logger Pro', 'Vernier Logger Lite']['Vernier Graphical Analysis']"], "qm": ["Qt Compiled Translation Source File", "Compiled language translation file created by Qt Linguist, a program used to create translations for Qt applications; contains source text and translations into another language; stored in a compact binary format.", "Windows, Mac, Linux, ", "['Digia Qt SDK']['Digia Qt SDK']['Digia Qt SDK']"], "qky": ["Quirky Kernel", "Kernel used to boot up on Linux; variant of Puppy Linux but condensed to the kernel for more efficient network booting, which is booting up a computer from a network instead of a local drive. ", "Linux, ", "['GNU GRUB', 'UNetbootin']"], "qlgenerator": ["Quick Look Generator File", "Supporting file or plug-in for Apple's Quick Look tool; enables various types of files to be viewed directly in the Finder using the Quick Look feature.", "Mac, ", "[]"], "qiz": ["Exam Builder Quiz", "A QIZ file contains a quiz created by Scientific Notebook or Scientific WorkPlace, which are mathematical and scientific word processors.  It storess formulas and conditions that are referenced every time the QIZ file is opened in order to generate different quiz questions for the user.", "Windows, Mac, ", "['MacKichan Software Scientific WorkPlace', 'MacKichan Software Scientific Notebook']['MacKichan Software Scientific WorkPlace', 'MacKichan Software Scientific Notebook']"], "qit": ["QIT Trojan Horse File", "Trojan horse file used to infect computers and execute malicious program code; contains executable content that allows hackers to gain full control over a computer; used for various malicious purposes.", "Windows, ", "[]"], "qif": ["Quicken Interchange Format File", "ASCII text file generated by Quicken financial software; contains a user's financial accounts in a text format; used to transfer data between different Quicken data files or from a financial institution's website to Quicken software.", "Windows, Mac, Linux, Windows, Mac, ", "['Intuit Quicken', 'Microsoft Money', 'Corel Quattro Pro X8', 'GnuCash']['Intuit Quicken', 'GnuCash']['GnuCash']['Apple QuickTime Player', 'ACD Systems ACDSee 20']['Apple QuickTime Player']"], "qic": ["Windows Backup File", "Backup file created by the backup utility included with Windows 95 and 98; saved in the QIC-113 format; contains a collection of files in a compressed archive that are expanded when restored using the Windows Backup program.", "Windows, ", "['Microsoft Windows Backup Utility']"], "qfx": ["Quicken Financial Exchange File", "Financial data format used for importing data into Quicken financial software; may include account balances, transactions, and other information recorded in a standardized format; similar to the .OFX format, but is a proprietary format used by Quicken.", "Windows, Mac, Linux, Web, ", "['Intuit Quicken', 'GnuCash', 'ProperSoft QFX2CSV']['Intuit Quicken', 'GnuCash', 'ProperSoft QFX2CSV']['GnuCash']['FreshBooks']"], "qfilter": ["ColorSync Utility Quartz Filter", "File created by ColorSync Utility, a color management application; contains a default or original filter that can be customized and applied to the colors in a file; not intended to be manually opened.", "Mac, ", "['Apple ColorSync Utility']"], "qf": ["Qompose Web Page Template", "Web page template created with Qompose (pronounced \"compose\"), an HTML templating language; allows multiple pages to be built from the same basic layout; uses \"tokens\" to specify different sections of each page.", "Windows, Windows, Windows, Mac, ", "['Web browser']['text editor']['Wimba Diploma']['Wimba Diploma']"], "qel": ["Quicken Electronic Library", "Contains online banking information associated with a Quicken account; stores a list of banking institutions and login information used to download account data over the Internet.", "Windows, Mac, ", "['Intuit Quicken']['Intuit Quicken']"], "qdt": ["Quicken 3 & 4 Data File", "Financial data file used by Quicken versions 3 & 4 for DOS; used as the primary file for storing the user's financial data, but has been replaced by newer formats in later versions of the software.", "Windows, ", "['Intuit Quicken']"], "qdfm": ["Quicken Data File (Macintosh)", "Financial data format used by Quicken personal finance software for the Mac", "Mac, ", "['Intuit Quicken']"], "qds": ["Windows Directory Query File", "Saved search file created in Microsoft Windows' \"My Network Places;\" contains the search criteria and scope information for searching folders and files in Active Directory, a centralized permissions management program.", "Windows, ", "['Microsoft Windows']"], "qdp": ["Quick and Dandy Plotter File", "File used by Quick and Dandy Plotter (QDP), a program used to plot graphs from ASCII text input files; contains plotter coordinates, such as X and Y values; may also include commands to format the output.", "Linux, Windows, ", "[][]"], "qdl": ["QDL Program", "Program code written in the Cue Description Language, also known as \"QDL;\" designed to be human-readable, human-writable, easy to parse, easy to generate, and efficiently executable.", "Windows, Mac, ", "['text editor']['text editor']"], "qdfx": ["Quicken Financial Exchange File", "Data file used by Quicken Essentials for Mac, a personal financial management program; used for converting data files from older versions of Quicken into a format that can be imported into newer versions of Quicken Essentials.", "Mac, ", "['Intuit Quicken']"], "qdf-backup": ["Quicken Data Backup File", "Backup file for the .QDF file, the primary data format used by Quicken, a personal finance software; contains saved accounts, transactions, portfolios, and balance information.", "Windows, Mac, ", "['Intuit Quicken']['Intuit Quicken']"], "qdf": ["Quicken Data File", "Financial data format used by Quicken personal finance software for Windows; saves accounts, transactions, portfolios, and balance information.", "Windows, Mac, Windows, Mac, Linux, Windows, ", "['Intuit Quicken']['Intuit Quicken'][][][][]"], "qdb": ["Quicken 5 & 6 Data File", "File created by Quicken versions 5 & 6 for Windows; saves the user's personal financial data in a proprietary format; replaced by the .QDF format in Quicken 98 and later.", "Windows, ", "['Intuit Quicken']"], "qdat": ["QuickTime Install Cache File", "File used by QuickTime, a video player program developed by Apple; contains installation data used for installing QuickTime; may be found on Windows systems with the name QuickTimeInstallCache.qdat and bundled with an .EXE installer file.", "Windows, ", "[]"], "qcp": ["PureVoice Audio File", "Audio file created in QUALCOMM's PureVoice format; used for both human voice recordings and mobile phone ringtones; designed for vocal frequencies and uses variable encoding rates to take advantage of natural pauses in human speech; sometimes sent as an email attachment, which can be played using QUALCOMM's PureVoice Player-Recorder, a plugin for email applications.", "Windows, Mac, Linux, ", "['File Viewer Plus', 'D.R. Software QCP Converter', 'VideoLAN VLC media player']['VideoLAN VLC media player']['VideoLAN VLC media player']"], "qcow": ["QEMU Copy On Write Disk Image", "Disk image file saved in the QEMU Copy On Write (QCOW) format, a format used by QEMU virtualization software; stores the contents of a virtual machine's hard drive; supports zlib compression and AES encryption of separate, independent clusters. ", "Windows, Linux, ", "['QEMU']['QEMU']"], "qda": ["Quadruple D Archive", "Compressed archive created with Quadruple D (Do the DirectDraw with Delphi); part of a DirectX graphics library that is commonly used Japanese PC games written in Delphi; includes the Quadruple D Archiver for creating and opening QDA archives.", "Windows, ", "[]"], "qcow2": ["QEMU Copy On Write Version 2 Disk Image", "Disk image file saved in the second version of the QEMU Copy On Write (QCOW2) format, a format used by QEMU virtualization software; stores the hard drive contents of a virtual machine; similar to the .QCOW extension which is saved in the QCOW format; features a different strategy for storing multiple snapshots of the virtual machine. ", "Windows, Linux, ", "['QEMU']['QEMU']"], "qby": ["QuickBooks Accountant's Copy Import File", "Import file created by QuickBooks, an program used for entering, organizing, and storing financial data; contains the accountant's modified, finished .QBA file ready to be imported into the company file. ", "Windows, Mac, ", "['Intuit QuickBooks Pro 2016']['Intuit QuickBooks for Mac 2016']"], "qc": ["Half-Life Model Compiler Script", "Script used for compiling .SMD (Studiomdl Data) ASCII-based game models into Half-Life .MDL model files; contains commands for specifying the model name, the SMD model file, the locations of materials, and other properties; compiles to an MDL file using Studiomdl, a Valve command-line utility.", "Windows, Windows, ", "['chUmbaLum sOft MilkShape 3D', 'GUI StudioMDL', 'Valve Half-Life', 'Microsoft Notepad', 'Blender with Blender Source Tools plug-in', 'text editor']['id Software Quake', 'Microsoft Notepad', 'text editor']"], "qbxml": ["QuickBooks XML Format File", "Data file created by the online version of QuickBooks, a company money management program; contains company financial data in XML format.", "Windows, ", "['Zed Axis']"], "qbw": ["QuickBooks Data File", "File created by QuickBooks, a company money management program; contains financial data, templates, letters, logos, and images; also stores files from the QuickBooks Financial Statement Designer, Cash Flow Projector, Business Planner, and Loan Manager.", "Windows, Mac, ", "['Intuit QuickBooks Pro 2016']['Intuit QuickBooks for Mac 2016']"], "qbx": ["QuickBooks Accountant Transfer File", "Accountant transfer file based off a QuickBooks company .QBW file; saves QuickBooks data in a format designed for accountants and tax preparers; entries within the QBX file cannot be modified except for adding General Journal notes.", "Windows, Mac, Web, ", "['Intuit QuickBooks Pro 2016']['Intuit QuickBooks for Mac 2016']['BLOCKS']"], "qbr": ["QuickBooks Report Template", "Template created by QuickBooks, an application used for entering and storing financial data; contains the template settings for exported report(s) that move between QuickBooks company files.", "Windows, Mac, ", "['Intuit QuickBooks Pro 2016']['Intuit QuickBooks for Mac 2016']"], "qbo": ["QuickBooks Online Bank Statement File", "File used by QuickBooks, a program used for small business and personal finances; contains an electronic statement downloaded from an online account; used to import and synchronize online bank statements on a local computer.", "Windows, Mac, Web, ", "['Intuit QuickBooks Pro 2016']['Intuit QuickBooks for Mac 2016']['FreshBooks']"], "qbmd": ["QuickBooks Backup File", "Backup data file created by some Mac versions of QuickBooks, a small business accounting application; contains an exact copy of a company data file, which may have a .QB2007 or .QB2009 extension; used for restoring financial data in the event that the original data file becomes corrupted.", "Windows, Mac, ", "['Intuit QuickBooks Pro 2016']['Intuit QuickBooks for Mac 2016']"], "qbmb": ["QuickBooks Backup File", "Company backup data file created by Mac versions of QuickBooks small business accounting software; contains the backup copy of a company data file, which may have a .QB2012, .QB2011, etc. extension; used for restoring a recent copy of the original data file in the event it becomes corrupted.", "Windows, Mac, ", "['Intuit QuickBooks Pro 2016']['Intuit QuickBooks for Mac 2016']"], "qbm": ["QuickBooks Portable Company File", "File created by QuickBooks, a program that allows businesses to track their finances; contains a compacted version of company financial data only; used to temporarily move company financial data through email or using a small capacity external storage device.", "Windows, Mac, ", "['Intuit QuickBooks Pro 2016']['Intuit QuickBooks for Mac 2016']"], "q9r": ["Glitterato Photoshop Plug-In", "Photoshop plug-in developed by Flaming Pear Software; creates realistic stars and nebulas; must reside in the Plug-ins folder within the application folder to work.", "Windows, Mac, ", "['Adobe Photoshop CC 2017', 'Corel PaintShop Pro X9']['Adobe Photoshop CC 2017']"], "qbk": ["QuickTax Backup File", "Backup file created by QuickTax, a program used to file Canadian tax returns; contains a copy of a corresponding .Q08 or .Q09 tax return file; auto-saved by default each time a tax return file is saved.", "Windows, Mac, ", "['Intuit Canada TurboTax', 'Intuit Canada QuickTax']['Intuit Canada TurboTax', 'Intuit Canada QuickTax']"], "qbj": ["QuickBooks General Journal Entry File", "General Journal Entry file used by QuickBooks,  a professional financial accounting program; contains manually-recorded transactions, or transfers, of amounts between accounts; may include the accounts, customers, and employees associated with the data, as well as memos and reports.", "Windows, Mac, ", "['Intuit QuickBooks Pro 2016']['Intuit QuickBooks for Mac 2016']"], "q8r": ["Flood Photoshop Plug-in", "Photoshop plug-in developed by Flaming Pear Software; used for creating 3D watery images with realistic reflections; must reside in the Plug-ins folder within the application folder to work.", "Windows, Mac, ", "['Adobe Photoshop CC 2017', 'Corel PaintShop Pro X9']['Adobe Photoshop CC 2017']"], "q7q": ["India Ink Photoshop Plug-in", "Photoshop plug-in developed by Flaming Pear Software; converts color images to black-and-white halftones and creates colorful etched effects; must reside in the Plug-ins folder within the application folder to work.", "Windows, Mac, ", "['Adobe Photoshop CC 2017', 'Corel PaintShop Pro X9']['Adobe Photoshop CC 2017']"], "q5r": ["Melancholytron Photoshop Plug-in", "Photoshop plug-in developed by Flaming Pear Software; adjusts hue and focus to make pictures moody, nostalgic, and sad; must reside in the Plug-ins folder within the application folder to work.", "Windows, Mac, ", "['Adobe Photoshop CC 2017', 'Corel PaintShop Pro X9']['Adobe Photoshop CC 2017']"], "q4q": ["Solar Cell Photoshop Plug-in", "Photoshop plug-in developed by Flaming Pear Software; used for creating suns and stars with customizable effects; must reside in the Plug-ins folder within the application folder to work.", "Windows, Mac, ", "['Adobe Photoshop CC 2017', 'Corel PaintShop Pro X9']['Adobe Photoshop CC 2017']"], "q2d": ["Quick 3D Cover Design File", "Cover design created with the Quick 3D Cover, a program used to create 3D product images for software boxshots, eBooks, jewel cases, and other products; stores the selected design template as well as user-specified text, graphics, and colors.", "Windows, ", "[]"], "q3d": ["Quest3D Project File", "File created by Quest3D, a program used for creating 3D applications; contains all 3D project-related files in a single archive, including .CGR files; used to publish Quest3D programs to the Web for sharing with others.", "Windows, ", "[]"], "q3c": ["Quick 3D Cover Project File", "Cover design created by Quick 3D Cover, a program used to create artwork for eBooks, software boxshots, DVD cases, and other products; saves the selected product template as well as text, images, dimensions, and graphical effects for the image; may be saved using different 3D angles and views.", "Windows, ", "[]"], "q2q": ["Flexify Photoshop Plug-in", "Photoshop plug-in developed by Flaming Pear Software; used for transforming images into different shapes and applying various lens effects; must reside in the Plug-ins folder within the Photoshop application folder to work.", "Windows, Mac, ", "['Adobe Photoshop CC 2017', 'Corel PaintShop Pro X9']['Adobe Photoshop CC 2017']"], "q1q": ["LunarCell Photoshop Plug-in", "Photoshop plug-in developed by Flaming Pear Software for creating 3D planets; includes customizable texture, climate, air, and cloud settings; must reside in the Plug-ins folder within the application folder to work.", "Windows, Mac, ", "['Adobe Photoshop CC 2017', 'Corel PaintShop Pro X9']['Adobe Photoshop CC 2017']"], "q1": ["Winamp Equalizer Presets File", "Library of equalizer (EQ) settings created by Winamp, an audio playback application; contains multiple presets for different EQ settings, identified by name.", "Windows, ", "['Nullsoft Winamp']"], "q2": ["Winamp Equalizer Auto-Load Presets File", "Library of user-created equalizer (EQ) settings created in Winamp, a audio playback program; contains auto-load presets of EQ settings for specific media files.", "Windows, ", "['Nullsoft Winamp']"], "q09": ["QuickTax 2009 Tax Return", "Tax return created by QuickTax 2009, a program that assists in filing Canadian tax returns for the 2009 tax year; stores Canadian tax forms and data filled out by the user; used in the 2010 calendar year to file taxes for the previous 2009 tax year.", "Windows, Mac, ", "['Intuit Canada TurboTax', 'Intuit Canada QuickTax']['Intuit Canada TurboTax', 'Intuit Canada QuickTax']"], "q07": ["QuickTax 2007 Tax Return", "Tax return created by QuickTax 2007, a program used for filing Canadian taxes for the 2007 tax year; contains tax forms filled out by the user; created during the 2008 year for the 2007 year taxes.", "Windows, Mac, ", "['Intuit Canada TurboTax', 'Intuit Canada QuickTax']['Intuit Canada TurboTax', 'Intuit Canada QuickTax']"], "q08": ["QuickTax 2008 Tax Return", "Tax return created by QuickTax 2008, a program that assists users with entering and filing 2008 tax returns; includes tax data and forms filled out by the user; typically filled out in the 2009 calendar year for the previous 2008 tax year.", "Windows, Mac, ", "['Intuit Canada TurboTax', 'Intuit Canada QuickTax']['Intuit Canada TurboTax', 'Intuit Canada QuickTax']"]}