{"r": ["R Script File", "Script written in R, a programming language used for statistical analysis and graphing purposes; contains code that can be executed within the R software environment; may contain commands that create objects (functions, values, etc.) and produce visualizations of the computed data.", "Windows, Mac, Linux, Mac, Windows, Mac, Linux, Windows, Mac, Linux, Windows, Mac, ", "['File Viewer Plus', 'R', 'RStudio']['R', 'RStudio']['R', 'RStudio']['Apple Xcode', 'MacroMates TextMate', 'Bare Bones BBEdit'][][][]['Ratfor']['Ratfor']['Ratfor']['Apple iTunes', 'music player']['Apple iTunes', 'music player']"], "ram": ["Real Audio Metadata File", "Link file used by RealPlayer, a program used for streaming Internet audio and video; saved in plain text and contains a hyperlink to a corresponding .RA file, which can be streamed; includes a \"pnm\" or \"rtsp\" URL, which are the protocols used to access and play RealAudio data.", "Windows, Mac, Linux, iOS, Android, ", "['RealNetworks RealPlayer Cloud', 'JRiver Media Center', 'DVDVideoSoft Free Audio Converter', 'VideoLAN VLC media player', 'Web browser']['RealNetworks RealPlayer Cloud', 'VideoLAN VLC media player', 'Web browser']['RealNetworks RealPlayer Cloud', 'VideoLAN VLC media player', 'Web browser']['RealNetworks RealPlayer Cloud']['RealNetworks RealPlayer Cloud']"], "ral": ["WinRail Track Design File", "Railroad track design created with WinRail, a program for designing model railway layouts; defines how the tracks are positioned and includes the article numbers of the tracks used; may also contain other content such as buildings, trees, roadbeds, and other objects.", "Windows, ", "[]"], "rap": ["Raptor Flowchart File", "A RAP file is a flowchart created by RAPTOR, a flowchart-based programming environment.  It contains a flowchart, which is a collection of connected symbols that represent instructions to be executed and when they are to be executed.", "Windows, ", "['Raptor']"], "rat": ["PICS Rating File", "File used by implementations of the PICS (Platform for Internet Content Selection) Web rating system, which is used to rate websites based on content; saved in a plain text format and specifies categories for rating explicit material such as language, sexual material, and violence.", "Windows, ", "['Microsoft Content Advisor', 'text editor']"], "raskinplace": ["Raskin Place Layout File", "Settings file used by Raskin, an alternative to the Mac OS X desktop that provides a zoomable user interface; describes the layout of files inside a Raskin-Place, which is a visual grouping of files on the hard drive; helps arrange the way information is displayed.", "Mac, ", "['Raskin']"], "rasunsoft": ["Rasunsoft Game Replay File", "Game replay file used by OFF Road, a car racing game for Windows; contains a series of frames, or scenes, that can be shared and replayed to review gameplay; includes actors and vehicle positions.", "Windows, ", "[]"], "raf": ["Fuji RAW Image File", "Uncompressed RAW photograph taken with a Fuji digital camera, such as a high-end FinePix model; contains unprocessed image data; may also include a .JPG version of the same image within the file.", "Windows, Mac, iOS, Android, ", "['File Viewer Plus', 'Corel PaintShop Pro X9', 'ACD Systems ACDSee 20', 'Adobe Photoshop CC 2017', 'Adobe Photoshop Elements 15', 'Adobe Photoshop Lightroom 6', 'ACD Systems Canvas X 2017', 'Adobe DNG Converter', 'Google Picasa', 'Helicon Filter', 'FastStone Image Viewer', 'Fuji Hyper-Utility Software']['Apple Photos', 'Adobe Photoshop CC 2017', 'Adobe Photoshop Elements 15', 'Adobe Photoshop Lightroom 6', 'Adobe DNG Converter', 'Google Picasa', 'Fuji Hyper-Utility Software', 'MacPhun ColorStrokes']['Adobe Photoshop Express']['File Viewer for Android', 'Adobe Photoshop Express']"], "ras": ["Remedy Archive System File", "Game resource file used by Max Payne video games; contains default information referenced by the game, such as textures, models, level data, and music; similar to .MPM files.", "Windows, Mac, Linux, Android, Windows, Mac, Linux, Android, ", "['Rockstar Games Max Payne', 'Rockstar Games Max Payne 2', 'Remedy Entertainment MaxED', 'Audacity']['Audacity']['Audacity']['File Viewer for Android']['Corel PaintShop Pro X9', 'FMJ-Software Image Eye', 'ACD Systems Canvas X 2017', 'ACD Systems ACDSee 20', 'XnViewMP', 'GIMP']['Planamesa NeoOffice', 'Lemkesoft GraphicConverter', 'XnViewMP', 'GIMP']['GIMP']['File Viewer for Android']"], "raskinlicense": ["Raskin License File", "Software license file used by Raskin, a zoomable user interface that is an alternative to the default Mac OS X desktop; contains license information used to register a valid copy of Raskin.", "Mac, ", "['Raskin']"], "rar": ["WinRAR Compressed Archive", "A RAR file is an archive that contains one or more files compressed with RAR compression.  It uses a higher compression ratio than typical ZIP compression and incorporates a proprietary compression algorithm that is now used by other compressors, including 7-Zip for its .7Z files.  RAR files may be extracted using a variety of programs.", "Windows, Mac, Linux, Android, ", "['File Viewer Plus', 'WinRAR 5', 'Corel WinZip 20', 'Smith Micro StuffIt Deluxe for Windows', '7-Zip', 'Zipeg', 'PeaZip', 'B1 Free Archiver', 'WinMount International WinMount', 'Whirling Dervishes Alpha ZIP', 'Free RAR Extract Frog']['Corel WinZip Mac 5', 'Smith Micro StuffIt Deluxe 16', 'Incredible Bee Archiver', 'The Unarchiver', 'B1 Free Archiver', 'UnRarX', 'Zipeg']['B1 Free Archiver', 'PeaZip']['ES File Explorer File Manager', 'RARLAB RAR', 'ZDevs ZArchiver']"], "radq": ["Need for Madness Game Archive", "Game data file used by Need for Madness, a car racing and stunts game; saves game assets, such as music, car physics properties, and car models; saved in a compressed .ZIP format.", "Windows, Mac, Linux, ", "['RadicalPlay.com Need for Madness']['RadicalPlay.com Need for Madness']['RadicalPlay.com Need for Madness']"], "radiumkey2": ["Radium 2 License File", "Software license file used by Radium, an Internet radio program for Mac; stores a license key for the software and can be applied by double-clicking the file, which opens in Radium and registers a valid copy of the software.", "Mac, ", "['CatPig Studios Radium']"], "ra": ["Real Audio File", "Audio file used by RealPlayer, an audio and video streaming program; may reference a streaming audio file online or may contain audio data; can use various codecs to compress audio with variable bit rates; uses a proprietary Real compression algorithm.", "Windows, Mac, Linux, iOS, Android, ", "['File Viewer Plus', 'RealNetworks RealPlayer Cloud', 'JRiver Media Center', 'VideoLAN VLC media player', 'DVDVideoSoft Free Audio Converter', 'Web browser']['RealNetworks RealPlayer Cloud', 'VideoLAN VLC media player', 'Web browser']['RealNetworks RealPlayer Cloud', 'VideoLAN VLC media player', 'Web browser']['RealNetworks RealPlayer Cloud']['RealNetworks RealPlayer Cloud']"], "r3d": ["REDCODE Video File", "Native video format used by RED high-resolution video cameras; compressed using REDCODE, an advanced wavelet technology codec that creates visually lossless images.", "Windows, Mac, ", "['REDCINE-X', 'Adobe Premiere Pro CC 2017', 'Adobe After Effects CC 2017', 'Adobe SpeedGrade CC 2017', 'Avid Media Composer', 'Microsoft Windows Photos']['REDCINE-X', 'Adobe Premiere Pro CC 2017', 'Adobe After Effects CC 2017', 'Adobe SpeedGrade CC 2017', 'ShedWorx Smart Converter', 'Apple Final Cut Pro X']"], "rzx": ["File Crypt Encrypted File", "Protected file encrypted with File Crypt, a freeware program for creating encrypted files; requires a password to be decrypted and opened.", "Windows, ", "[]"], "rad": ["Radar ViewPoint Radar Data", "Radar data analysis format used for locating aircraft and monitoring airspace.", "Windows, Windows, Windows, Mac, Linux, Windows, ", "[]['Citrix XenApp']['Valve VRAD', 'Valve Source SDK']['Radiance']['Radiance']['Reality Adlib Tracker', 'Adlib Tracker II']"], "rzn": ["Red Zion Notes File", "Notes file used by the Slovenian software program, Red Zion E-book (also known as \"Red Zion E-knjiga\"); saved in a text format that can be opened and edited by the user.", "Windows, ", "[]"], "rzs": ["Red Zion Security File", "Temporary file generated by Red Zion E-book, or \"E-knjiga,\" a Slovenian software program; used to authorize viewing rights for a Red Zion eBook (.RZB) file; saved in a compressed format.", "Windows, ", "[]"], "rzk": ["Red Zion Key File", "Security key used for copy-protecting digital books saved in the Red Zion E-book format; contains user rights for a specific Red Zion E-Book (.RZB) file.", "Windows, Windows, ", "[]['text editor']"], "rzb": ["Red Zion Book File", "Digital book, or e-book format used by Red Zion E-book, a Slovenian software program (also known as \"Red Zion E-knjiga\"); contains text and other information that can be read by the E-book program.", "Windows, ", "[]"], "rxc": ["Roxio Certificate File", "Software certificate used by Roxio software applications; contains information that enables the software to be run on the computer; installed automatically by a legally purchased version of the software.", "Windows, ", "['Roxio Creator NXT Pro 5', 'Roxio Easy VHS to DVD 3 Plus']"], "rz": ["Rzip Compressed File", "File archive compressed with rzip, a data compression utility based on the bzip2 format; compresses data in two stages ? file encoding and compression.", "Linux, ", "[]"], "rxe": ["Lego Mindstorms NXT Executable Program", "Program written for a Lego Mindstorms NXT robot, a programmable robot developed by LEGO; contains instructions that can be executed by an NXT robot; may control the robot's motors as well as the touch, sound, light, and ultrasonic sensors.", "Windows, Mac, ", "[][]"], "rxdata": ["RMXP Data File", "Role Playing Game (RPG) data file created by RPG Maker XP, a software development program for creating original role-playing games", "Windows, ", "[]"], "rx2": ["REX2 Audio File", "Audio loops file used by digital audio workstation (DAW) applications; contains audio loop samples stored in Propellerhead's proprietary REX2 format; supports both mono and stereo, whereas the .REX format only supports mono.", "Windows, Mac, ", "['Propellerhead ReCycle', 'Propellerhead Reason', 'Avid Pro Tools', 'Steinberg Cubase', 'Cakewalk SONAR X3', 'Cockos REAPER', 'PreSonus Studio One']['Propellerhead ReCycle', 'Propellerhead Reason', 'Avid Pro Tools', 'Steinberg Cubase', 'PreSonus Studio One']"], "rwz": ["Outlook Rules Wizard File", "Email rules file created by Microsoft Outlook, an email and calendar application; stores email filters, which specify actions to take for email messages that match a certain set of criteria; stores all rules for an email account.", "Windows, Windows, Mac, ", "['Microsoft Outlook 2016']['Rawzor Photo', 'Microsoft Windows Photos']['Rawzor Photo']"], "rwtheme": ["RapidWeaver Theme", "Theme file used by RapidWeaver, a website development application for Mac; saves graphics, layout settings, and other information that stylize the appearance of the website; may be developed and sold by third parties; can be double-clicked to install.", "Mac, ", "['Realmac RapidWeaver']"], "rwt": ["ReadWriteThink Timeline", "An RWT file is a timeline created by RWT Timeline, an iOS app that allows users to make a graphical representation of related items or events.  It contains a timeline, which includes events, times, event descriptions, and images.  RWT files can be opened using the Timeline web program or the iOS Timeline app.", "Web, iOS, Web, ", "['ReadWriteThink Timeline']['International Reading Association RWT Timeline']['ReadWriteThink Printing Press']"], "rwsw": ["RapidWeaver Site File", "Site file created with RapidWeaver, a website creation program for Mac OS X; includes site settings and a list of Web pages contained within the site; serves as the main project file and is used for saving Web development projects.", "Mac, ", "['Realmac RapidWeaver']"], "rwplugin": ["RapidWeaver Plugin", "Plugin file used by RapidWeaver, a Mac Web development program that advertises code-free development; adds new functionality to the base software; used for adding components that can be integrated into webpages, such as HTML5 video players and image browsers.", "Mac, ", "['Realmac RapidWeaver']"], "rwstyle": ["RapidWeaver Style File", "File used by RapidWeaver, a website development program for Mac; saves colors and other options for a website theme; allows the settings to be saved and reused across website projects.", "Windows, Mac, ", "['Realmac RapidWeaver']['Realmac RapidWeaver']"], "rwsnippet": ["RapidWeaver Snippet File", "File used by RapidWeaver, a code-free Web development application for Mac; saves a code snippet for a component that can be included in multiple websites; used for popup menus, mouse over behaviors, and other webpage elements.", "Mac, ", "['Realmac RapidWeaver']"], "rwp": ["RapidWeaver Package", "Stores website content for a website created with RapidWeaver, a Web development program for Mac OS X; includes HTML pages, style sheets, and images; can be published to MobileMe or an FTP server with RapidWeaver.", "Mac, ", "['Realmac RapidWeaver']"], "rwlibrary": ["Paperless Receipt Library", "Digital receipt collection created by Paperless, a program used to organize electronic copies of receipts and other documents; stores scanned images of paper receipts, as well as the transaction information; used for archiving personal financial records.", "Mac, ", "['Mariner Paperless']"], "rwl": ["Leica RAW Image", "Camera RAW image created by a Leica digital camera; saves the picture in a proprietary raw format and maintains the original data as captured by the camera's CCD; often touched up using photo editing software before publishing to the Web, a slide show, or to another digital publication.", "Windows, Mac, iOS, Android, ", "['File Viewer Plus', 'Phase One Capture One', 'Microsoft Windows Photos', 'Adobe Photoshop Elements 15', 'ACD Systems ACDSee 20', 'Adobe Photoshop Lightroom with Adobe Camera Raw plug-in', 'CyberLink PhotoDirector 8 Ultra', 'Adobe Photoshop CC 2017']['Phase One Capture One', 'Adobe Photoshop Elements 15', 'Adobe Photoshop Lightroom with Adobe Camera Raw plug-in', 'MacPhun ColorStrokes', 'Adobe Photoshop CC 2017', 'CyberLink PhotoDirector 8 Ultra']['Adobe Photoshop Express']['Adobe Photoshop Express']"], "rw3": ["RapidWeaver 3 Site File", "Site file created with RapidWeaver 3, an easy-to-used Web development program for Mac OS X; contains a list of Web pages built within the site; serves as the project file for a Web development project and can only be opened by RapidWeaver.", "Mac, ", "['Realmac RapidWeaver']"], "rw2": ["Panasonic RAW Image", "Camera RAW file created by a Panasonic digital camera, such as the LX3 and LX5; contains a RAW raster image as captured by the camera sensor; can be adjusted for color, exposure, and other properties in an image editor.", "Windows, Mac, Linux, iOS, Android, ", "['File Viewer Plus', 'Adobe Photoshop Elements 15', 'Corel PaintShop Pro X9', 'ACD Systems ACDSee 20', 'ACD Systems Canvas X 2017', 'Adobe DNG Converter', 'RawTherapee', 'Helicon Filter', 'IrfanView', 'XnViewMP', 'Logipole Konvertor', 'FastStone Image Viewer', 'GraphicRegion.com Able Batch Converter']['Adobe Photoshop Elements 15', 'Adobe DNG Converter', 'XnViewMP', 'MacPhun ColorStrokes']['XnViewMP']['Adobe Photoshop Express']['Adobe Photoshop Express']"], "rvx": ["Real Protected Video File", "Purchased video file used by RealPlayer, an audio and video playback program; stores a video purchased by a user from the RealPlayer music store; contains proprietary protection information that only allows the file to be played back by the user that purchased the video.", "Windows, Mac, Linux, ", "['RealNetworks RealPlayer Cloud']['RealNetworks RealPlayer Cloud']['RealNetworks RealPlayer Cloud']"], "rwg": ["Random Word Generator Project File", "Project file used by Random Word Generator, a program used to create sets of random words; contains settings and restrictions for a word list; used to save and load project information and to generate lists of related words.", "Windows, ", "[]"], "rwd": ["NRG Raw Wind Data File", "Data file created by NRG Systems' Symphonie data loggers, which capture wind speed and direction information; can be uploaded to a PC and processed using Symphonie Data Retriever, a free program provided by NRG Systems.", "Windows, Windows, ", "['NRG Systems Symphonie Data Retriever']['Microsoft Flight Simulator X Gold Edition', 'FSX Mission Rewards Decompile Utility']"], "rvt": ["Revit Project File", "Architectural design project created with Revit, a building information modeling (BIM) program; includes a 3D building design that may contain floor plans, elevations, sections, which can all be viewed on the fly as a fully rendered 3D scene; also includes project settings and related data.", "Windows, ", "['Autodesk AutoCAD Architecture 2017', 'Autodesk Revit Structure', 'Autodesk Revit MEP']"], "rvp": ["Sharp Blu-ray Player Firmware File", "An RVP file is a firmware file used by Sharp Blu-ray players, primarily BD-HP20U players.  It contains a firmware update to improve the performance of a Blu-ray player and keep up with technological advancements.  RVP files are used for a variety of updates such as the playback of movies released by certain studios or the clarity of audio.", "Windows, Mac, Linux, ", "[][][]"], "rvproj2": ["RPG Maker VX Ace Project File", "Game project created with RPG Maker VX Ace, a role-playing game (RPG) development program; similar to the .RVPROJ file, which is the project file associated with Enterbrain RPG Maker VX; contains links to resources, such as audio, graphics, and data files, referenced by the game; includes .RVDATA2 files.", "Windows, ", "['Enterbrain RPG Maker VX Ace']"], "rvid": ["Snapz Pro X Recorded Video File", "Video file created by Snapz Pro X, a screen capture and recording program; saves a screen recording video in a proprietary format; can be exported to standard video formats in the software so that it can be shared with others and online.", "Mac, ", "['Ambrosia Snapz Pro X']"], "rvg": ["RVG X-ray Image", "Image format used by dental radiography systems developed by Kodak; created by dental imaging sensors to store x-ray images of a patient's mouth. ", "Windows, iOS, ", "['Kodak RVG']['Trophy RVG Mobile']"], "rvproj": ["RPG Maker VX Project File", "Game project created with RPG Maker VX, a role-playing game (RPG) development program; named \"Game.rvproj\" by default and saved in the game project folder along with the Game.exe file; contains links to game resources, including audio, data, and graphics files.", "Windows, ", "['Enterbrain RPG Maker VX']"], "rvl": ["Muvee Reveal X Project File", "Movie project created by muvee Reveal X, a program used for making home videos; saves a list of photos, videos, and music for the movie; also includes the presentation style that shows different transitions and effects.", "Windows, Mac, iOS, ", "['muvee Reveal X']['Adobe Revel']['Adobe Revel']"], "rvf": ["RichView Format File", "An RVF file is a TRichView document saved in the RichView format (RVF), which supports \"rich text.\"  It may contain text, images, bullets, hotspots (bullets with hypertext link), tables, and style templates.  RVF files may be saved in text or binary (more compact) format using the RVFOptions component in TRichView.", "Windows, ", "['TRichView', 'Aignesberger AM-Notebook']"], "rvdata2": ["RPG Maker VX Ace Data File", "Game data file created by RPG Maker VX Ace (RPGVX), an application that enables you to create role-playing games; stores various types of game data, such as items, characters, armors, enemies, skills, maps, ; used for saving development progress while creating your role-playing game; similar to .RVDATA files, which are used by Enterbrain's RPG Maker VX.", "Windows, ", "['Enterbrain RPG Maker VX Ace']"], "rvdata": ["RPG Maker VX Data File", "Game data file created by RPG Maker VX (RPGVX), a software development tool used to create role-playing games; may store various types of game data, including maps, items, character information, and enemies; used for saving development progress while creating an RPG.", "Windows, ", "['Enterbrain RPG Maker VX']"], "rum": ["Bink Video Subtitle File", "Small file that contains information about subtitle frames in Bink video (.BIK) files; typically saved along with a corresponding BIK file; used by some video games that include Bink video clips.", "Windows, Mac, ", "[][]"], "ruleset": ["Visual Studio Code Analysis Rule Set File", "Code analysis settings file created by Visual Studio, an application used to develop Windows-based programs and Web applications; contains a collection of rules for performing code analysis; used for transferring rule sets between projects.", "Windows, ", "['Microsoft Visual Studio 2017']"], "rv": ["Real Video File", "Video file saved in the proprietary Real video format; similar to a .RM file, but specifies the file contains video (not just audio); can be played by RealPlayer as well as other video players that have a supporting Real codec installed.", "Windows, Mac, Linux, ", "['RealNetworks RealPlayer Cloud', 'Media Player Classic with Real Alternative component', 'Microsoft Windows Media Player with Real Alternative component', 'Online Media Technologies AVS Video Converter']['RealNetworks RealPlayer Cloud', 'Eltima Elmedia Player']['RealNetworks RealPlayer Cloud']"], "run": ["Linux Executable File", "Executable file typically used for Linux program installers; contains program data and instructions for making the installation; often used for distributing device drivers and software applications.", "Linux, Windows, Windows, Mac, ", "['Linux'][]['Human Head Studios Rune']['Human Head Studios Rune']"], "rws": ["RenderWare Stream File", "Game data file used by some games that utilize Criterion Software's RenderWare engine; often contains audio data although the binary format supports various kinds of game data including models and textures.", "Windows, Windows, ", "['RWS2WAV']['eEye Digital Security Retina Wireless Scanner']"], "rul": ["InstallShield Rules File", "File used by InstallShield, a program used for creating Windows software installers; contains source code written in InstallScript, a proprietary language used for InstallShield projects; used for scripting custom installation functionality.", "Windows, ", "['Flexera InstallShield']"], "ruf": ["Samsung DVD and Blu-ray Player Firmware File", "Firmware file used by Samsung Blu-ray and DVD players; contains operating system-level functions that run the player; used to deploy firmware upgrades using a USB storage device.", "Windows, ", "[]"], "ruel": ["Revo Uninstaller Pro Log", "Exported log in the Ruel format created and used by Revo Uninstaller Pro, a program that helps users uninstall programs; contains log data for a program; includes information about properties, registry items, and files and folders.", "Windows, ", "['Revo Uninstaller Pro']"], "ru": ["Java Russian Font Properties File", "Settings file used by Java applications; contains mappings between logical font names in the Java program and the actual fonts on the computer system; specifies fonts that contain Russian glyphs to be used by the program, instead of the standard Latin fonts.", "Windows, Mac, Linux, ", "['Oracle Java Runtime Environment', 'text editor']['Oracle Java Runtime Environment', 'text editor']['Oracle Java Runtime Environment', 'text editor']"], "rtx": ["Rich Text Document", "Text document that includes text formatting, such as bold characters, underlining, italics, different fonts and font sizes, etc; can be opened by most basic text editors and word processors.", "Windows, Mac, ", "['Microsoft Notepad', 'Microsoft WordPad', 'text editor']['Apple TextEdit', 'text editor']"], "rtwsh": ["Radiotracker Wishlist File", "Music wishlist created by Audials Radiotracker, a program used for recording online radio station streams; contains a list of artists and songs that the user would like to find playing on an Internet radio station; uses a simple XML format.", "Windows, ", "['Audials Radiotracker 2017']"], "rtttl": ["Ring Tone Transfer Language File", "File written in the Ring Tone Text Transfer Language (RTTTL) format; contains the ringtone name, control settings (such as duration, octave, and beats), and a sequence of letters that represent the notes (only one note at a time can be produced from a range of four octaves).", "Windows, ", "['LogoManager Classic']"], "rttex": ["Robinson Technologies Texture File", "An RTTEX file is a texture file saved in the Robinson Technologies Texture (RTTEX) format.  It is used by Growtopia, a game that allows you to build worlds, compose music, choose an occupation, trade items, and earn achievements.  RTTEX files store one or more textures for gameplay elements, such as characters, items, and landscape.", "Windows, Mac, ", "['Growtopia']['Growtopia']"], "rtstn": ["Audials Station File", "File created by Audials Internet stream recording software; saves information about an Internet radio station, including the URL, bitrate, genre, and the maximum allowed listeners; uses a simple XML format.", "Windows, ", "['Audials Radiotracker 2017', 'Audials Tunebite 2017', 'Audials One 2017']"], "rts": ["Royal TS Remote Connection File", "Contains settings for Royal TS, a program that creates remote connections to other computers using the Windows Remote Desktop Protocol (RDP); may include configuration information for multiple remote desktop connections, which can be organized into folders.", "Windows, Windows, Mac, Windows, Windows, Mac, ", "['code4ward Royal TS']['RealNetworks RealPlayer Cloud']['RealNetworks RealPlayer Cloud'][]['Apple QuickTime Player']['Apple QuickTime Player']"], "rtp": ["Gromacs Residue Topology Parameter File", "An RTP file is a molecular data file used by Gromacs, a program used for simulating molecular dynamics.  It saves residue information, which represents the base parts of a molecule and may contain atoms, bonds, angles, dihedrals, and impropers.  RTP files are used as a data file for molecular analysis.", "Linux, Windows, Mac, ", "['Gromacs']['Intuit TurboTax Deluxe']['Intuit TurboTax Deluxe']"], "rtm": ["Real Tracker Module", "Audio module containing tracks, patterns, and instruments that can be played back by the Real Tracker DOS-based audio tracking program.", "Windows, Windows, Mac, Linux, ", "[]['National Instruments LabVIEW']['National Instruments LabVIEW']['National Instruments LabVIEW']"], "rtl": ["Raster Transfer Language File", "Printer and plotter file created in Hewlett-Packard's Raster Transfer Language (HP-RTL); used to instruct the plotter on the layout of image objects such as scanned photographs and help shade areas. ", "Windows, ", "['eLynx SwiftView Viewer']"], "rti": ["Real Tracker Instrument", "Instrument, or \"voice,\" that can be played back in Real Tracker, a sound tracking program.", "Windows, ", "[]"], "rtfd": ["Rich Text Format Directory File", "Rich text file similar to an .RTF document, but may contain attachments, such as images, PDFs, fonts, or other files; originally developed for the NeXT operating system and later moved to Mac OS X.", "Mac, ", "['Apple TextEdit', 'Bean']"], "rte": ["RTE Encoded File", "RTEncoder format developed for exchanging copyrighted files; uses an encoded format to protect the copyright", "Windows, Mac, Windows, Windows, ", "[][]['Autodesk AutoCAD Architecture 2017', 'Autodesk Revit Structure', 'Autodesk Revit MEP']['Fugawi Global Navigator', 'Garmin MapSource']"], "rtf": ["Rich Text Format File", "An RTF file is a common text file format that supports \"rich text.\"  It includes several types of text formatting, such as bold type, italics, different fonts and font sizes, and custom tab settings.  RTF files can also support images such as .JPG and .PNG files saved within the text file.", "Windows, Mac, Linux, iOS, Android, ", "['File Viewer Plus', 'Microsoft WordPad', 'Microsoft Word 2016', 'Corel WordPerfect X8', 'Nuance OmniPage Ultimate', 'AbiSource AbiWord', 'text editor']['Apple TextEdit', 'Apple Pages', 'Microsoft Word 2016', 'AbiSource AbiWord', 'Wondershare PDF Editor for Mac 5', 'text editor']['AbiSource AbiWord', 'Les Hardy RTF Editor']['MobiSystems OfficeSuite Pro']['MobiSystems OfficeSuite Pro']"], "rtd": ["Robot Structural Analysis Design File", "CAD file created by Robot Structural Analysis, a program used for analyzing complex building structures; stores a 3D model of a building and can include materials and design codes; may be used for identifying structural strengths or weak points.", "Windows, Windows, Mac, ", "['Autodesk Robot Structural Analysis Professional 2016']['RagTime']['RagTime']"], "rtc": ["Live Meeting Connection File", "File used by Microsoft Office Live Meeting, a program used for online collaborations and meetings; contains link information to join or begin a meeting; commonly found with the name launch.rtc.", "Windows, ", "['Microsoft Office Live Meeting', 'Microsoft Internet Explorer']"], "rta": ["RoboHelp RTA Data File", "Project data file created by RoboHelp, a multiplatform help authoring system; saved as one of several files of a RoboHelp project and contains information used internally by RoboHelp when opening and saving projects.", "Windows, Mac, Windows, ", "['Adobe RoboHelp']['Adobe RoboHelp']['True Audio TrueRTA']"], "rt": ["RealText Streaming Text File", "Text presentation streamed from the Internet, often via the Web using the RealPlayer plug-in; may be a text-only stream, or may be combined with an audio or video media stream.", "Windows, Mac, Linux, ", "['RealNetworks RealPlayer Cloud', 'VideoLAN VLC media player', 'Web browser']['RealNetworks RealPlayer Cloud', 'Eltima Elmedia Player', 'VideoLAN VLC media player', 'Web browser']['RealNetworks RealPlayer Cloud', 'VideoLAN VLC media player', 'Web browser']"], "rsx": ["RED Metadata XML File", "Video metadata file created by RED digital camera software; saves a \"look\" for an .R3D video clip that defines how the video clip appears; enables perspectives to be saved.", "Windows, Mac, ", "['REDCINE-X']['REDCINE-X']"], "rsw": ["R&R SQL Report Writer Report File", "Standalone SQL Report Writer definition file used by R&R ReportWorks, a program for designing reports for data stored in Xbase (.DBF) and SQL databases; saved in an SQL compound file format; used by Windows SQL editions Arpeggio and later.", "Windows, ", "[]"], "rsv": ["RSView32 Project File", "File created by RSView32, a program used to monitor and control machine processes; contains project information, including graphical user interface components, program code, and machine connection settings; used to build a human-machine interface application.", "Windows, ", "[]"], "rst": ["reStructuredText File", "Text file that contains code written in the reStructuredText markup language; can apply basic styles and formatting to text documents; used for in-line program documentation (primarily for Python), and for creating standalone documents and simple Web pages.", "Windows, Mac, Linux, Windows, Linux, ", "['gVim', 'Microsoft Notepad', 'Microsoft Wordpad', 'text editor']['MacroMates TextMate', 'Apple TextEdit', 'text editor']['text editor']['Clark Labs IDRISI Selva', 'Clark Labs Land Change Modeler', 'ESRI ArcGIS for Desktop', 'ERDAS IMAGINE', 'Golden Software Voxler', 'GDAL', 'PCI Geomatics Geomatica']['GDAL']"], "rsrc": ["Macintosh Resource File", "File commonly used by older Mac OS applications (Mac OS 9 and earlier), but also used by some Mac OS X applications; contains a library of data and can include images, icons, and custom data; also used by Mac OS X for storing system themes.", "Mac, ", "['Mathemaesthetics Resorcerer', 'Geekspiff ThemePark']"], "rsr": ["Poser Model Preview File", "Preview image of a 3D model created with Poser, a 3D model rendering and animation program; provides a thumbnail preview image of the model in the Library palette; saved with the same filename as the file it represents, except for the extension.", "Windows, Mac, ", "['Smith Micro Poser 11']['Smith Micro Poser 11']"], "rss": ["Rich Site Summary", "An RSS file is a Rich Site Summary file saved in an XML-based syndication format.  It contains news headlines and other web content along with metadata such as the author's name and the publish date.  RSS files are used by many websites for distributing information that is often updated via RSS in an efficient, text-only format.  ", "Windows, Mac, Linux, Windows, Windows, ", "['Mozilla Firefox', 'NewzCrawler', 'FeedDemon', 'RssReader', 'BottomFeeder']['Mozilla Firefox', 'Utsire Shrook', 'NewsGator NetNewsWire', 'Cynical Peak Cyndicate', 'BottomFeeder']['Mozilla Firefox', 'BottomFeeder']['Bentley RAM Structural System'][]"], "rsp": ["RSLogix PLC Program File", "Project file created by RSLogix, an application used for programming Allen-Bradley programmable logic controllers (PLCs); contains saved program logic built using the free-form ladder editor; used for storing PLC \"ladder logic\" designs.", "Windows, ", "['Rockwell Automation RSLogix']"], "rso": ["NXT Brick Audio File", "Proprietary audio format used by LEGO's programmable MINDSTORMS NXT robot; RSO files are typically used to play short alerts or other system sounds; they can be converted to standard .WAV files using the RSO conversion utilities.", "Windows, Mac, Linux, Windows, ", "[][][]['Software AG ARIS']"], "rsn": ["Reason Project File", "Audio production project created with Reason, a software synthesizer and music creation program; may include multiple MIDI tracks, drum loops, audio effects settings, and virtual audio rack configurations.", "Windows, Mac, ", "['Propellerhead Reason']['Propellerhead Reason']"], "rsg": ["RaySupreme Graph", "Graph created by RaySupreme, a 3D modeling and rendering program; contains a RaySupreme 3D project graph; holds many customizable features including a motion path tool, scale tool, world light settings, material template filter settings, camera settings, etc.", "Windows, Mac, Linux, ", "['BrainDistrict GmbH RaySupreme']['BrainDistrict GmbH RaySupreme']['BrainDistrict GmbH RaySupreme']"], "rsm": ["RouterSim Network Visualizer File", "Computer network layout created by Network Visualizer, a program used for computer network design and simulation; supports routers, switches, hosts, and other devices; often used in IT training environments for learning about different network configurations.", "Windows, Windows, Windows, ", "['RouterSim CCNA Network Visualizer']['WinWay Resume Deluxe']['Software AG ARIS']"], "rsd": ["Rosetta Stone Data File", "An RSD file is a data file created for Rosetta Stone, an interactive language teaching program.  It contains language data referenced by Rosetta Stone and is not meant to be manually opened.  RSD files are located in the \"data\" and \"speech\" folders within the Rosetta Stone .ISO file on the Language Disc.", "Windows, Mac, Windows, Mac, Linux, ", "['Rosetta Stone Language Learning']['Rosetta Stone Language Learning'][][][]"], "rsf": ["Recovery State File", "File created by Data Recovery Wizard, a program that helps users recover lost data from their computer, storage device, and server; contains recovery scan results for user-specified file types and locations.", "Windows, Mac, Windows, Mac, Windows, ", "['EaseUS Data Recovery Wizard']['EaseUS Data Recovery Wizard']['LEGO MINDSTORMS EV3']['LEGO MINDSTORMS EV3'][]"], "rsdf": ["RapidShare Download File", "Encrypted file format that contains links to downloadable files; used for saving a list of downloads; links are encrypted to hide the file locations from the public.", "Windows, Mac, Linux, ", "['JDownloader', 'CryptLoad', 'Mipony']['JDownloader']['JDownloader']"], "rsc": ["Symbian Application Compiled Resource File", "Compiled resource file used by applications of Symbian OS, an open source operating system designed for touchscreen devices, mobile devices, and smartphones; contains resources that are compiled from .RSS files into a binary format.", "Windows, ", "[]"], "rsb": ["Red Storm Bitmap File", "Bitmap image used by various Ubisoft Red Storm games, including Tom Clancy's Rainbow Six: Rogue Spear; contains an image stored in a proprietary format; used to store game images, such as character faces and body graphics.", "Windows, ", "['Corel PaintShop Pro X9', 'ACD Systems Canvas X 2017', 'ACD Systems ACDSee 20']"], "rsa": ["RSA Certificate File", "File that contains an RSA digital certificate; used in public-key cryptography and enables a remote entity to be authenticated; may be used by a software program for secure communication with a remote server.", "Windows, Mac, Linux, Windows, Mac, Linux, ", "['OpenSSL', 'Mozilla Firefox', 'Adobe Photoshop Elements 15']['OpenSSL', 'Mozilla Firefox']['OpenSSL', 'Mozilla Firefox']['Mojang Minecraft']['Mojang Minecraft']['Mojang Minecraft']"], "rs2": ["RailSim2 Saved Layout File", "Saved game file created by RailSim2, a railroad simulation game; saves the layout information for a 3D railway constructed by the player; saved in a plain text format in the \\Layout\\ directory of the game installation and can be opened through the game interface.", "Windows, ", "['RailSim2']"], "rs": ["Rust Source Code File", "Developer file written in Rust, a programming language used for developing large-scale, high-performance applications; uses language constructs that help developers avoid common programming errors, such as buffer overflows or lack of type safety.", "Windows, Linux, Windows, Windows, Windows, Mac, Linux, ", "['rustc', 'text editor']['rustc', 'text editor']['Microsoft Windows']['Utilant RapidSketch']['XnViewMP', 'GIMP']['XnViewMP', 'Lemkesoft GraphicConverter', 'GIMP']['XnViewMP', 'GIMP']"], "rrt": ["Rhapzode Resource Template", "Template for creating a custom PowerPoint presentation (.PPS file); sequenced and managed by Rhapzode, a third-party program for authoring and exporting compiled PowerPoint presentations.", "Windows, ", "[]"], "rrr": ["Registry Mechanic Backup File", "Backup file containing entries from the Windows registry; created by Registry Mechanic when optimizing the registry; used to restore removed registry entries if necessary.", "Windows, Windows, ", "['PC Tools Registry Mechanic'][]"], "rri": ["RealWorld Image", "Image format used by RealWorld Graphics products such as RealWorld Icon Editor and RealWorld Cursor Editor; saves a raster image that was edited in the software, but uses a proprietary format that can only be opened in RealWorld Graphics programs; used for making Windows icon and cursor graphics.", "Windows, ", "['RealWorld Icon Editor', 'RealWorld Cursor Editor']"], "rrd": ["Reduced Resolution Dataset File", "GIS file created by geospatial processing programs such as ERDAS IMAGINE and ArcGIS Desktop; stores a reduced dataset from an original raster image using pyramid layers, which speed up the display of raster maps; often used for saving discrete zoom levels on a map.", "Windows, ", "['ESRI ArcGIS for Desktop', 'ERDAS IMAGINE']"], "rra": ["vRigger Rigging Gear File", "Data file used by vRigger, a program used for creating rope rigging system designs; saves data for a piece of rigging gear such as a pulley, carabiner, climbing harness, or another piece of equipment; used as part of a vRigger object library and can be included within a rigging system illustration.", "Windows, ", "['Iterum vRigger']"], "rpyc": ["Ren'Py Compiled Script", "Compiled script created by Ren'Py, a visual novel engine that allows users to create interactive digital stories; stores the compiled version of a .RPY game script, which is written using both Ren'Py Script and Python statements.", "Windows, Mac, Linux, ", "[\"Ren'Py\"][\"Ren'Py\"][\"Ren'Py\"]"], "rpyb": ["Ren'Py Bytecode File", "File used by Ren'Py, a visual novel game engine often used to create interactive Japanese visual novels; saves a compiled script (.RPY file) and includes the bytecode that runs the novel; used alongside .RPYC compiled script files.", "Windows, Mac, Linux, ", "[\"Ren'Py\"][\"Ren'Py\"][\"Ren'Py\"]"], "rpy": ["Touhou Project Replay File", "Replay of a game played within one of the Touhou Project games, a series of Japanese scrolling shooter games; records the movements made during a game and can be replayed within the Touhou Project software.", "Windows, Windows, Mac, Linux, Windows, Mac, Linux, ", "[]['Python Software Foundation Python', 'Twisted Matrix Labs Twisted Web', 'gVim']['Python Software Foundation Python', 'MacroMates TextMate', 'MacVim', 'Twisted Matrix Labs Twisted Web']['Python Software Foundation Python', 'Twisted Matrix Labs Twisted Web', 'Vim'][\"Ren'Py\"][\"Ren'Py\"][\"Ren'Py\"]"], "rpx": ["Wii U Game", "An RPX file is an executable game file run by the Wii U console or Cemu emulator to play games such as Mario Kart 8 or Super Mario Maker.  It contains all the files needed to run the game such as the game ROM and texture files.  RPX files are large in size due to the amount of files stored within them.", "Windows, ", "['Cemu']"], "rpv": ["RealPlayer Visualization File", "Visualization file used by RealPlayer, an application used to stream Internet audio and video; contains information about a visualization such as the image and the settings for how it responds to sounds.", "Windows, ", "['RealNetworks RealPlayer']"], "rptr": ["RafflePrinter Document", "Project file created by RafflePrinter, a program used to design and print raffle tickets; stores the raffle ticket design, including the text, images, layout, and ticket numbering settings; can be exported to .XPS format and printed on A4 paper.", "Windows, ", "['RafflePrinter']"], "rpt": ["Crystal Reports File", "An RPT file is a report or output file created by Crystal Reports, a program used for business-oriented reporting.  It can store data from multiple sources and different types of databases.  RPT files may be interactive, giving users capabilities such as live filtering and sorting.", "Windows, Mac, Windows, Mac, Windows, Mac, Linux, ", "['SAP Crystal Reports', 'SAP Crystal Reports Viewer', 'Microsoft Visual Studio with Crystal Reports plug-in']['SAP Crystal Reports Viewer']['Acclivity AccountEdge Pro']['Acclivity AccountEdge Pro']['Microsoft Notepad', 'Notepad++', 'text editor']['Apple TextEdit', 'text editor']['Beaver', 'gedit', 'text editor']"], "rps": ["3ds Max Render Preset Settings", "Contains settings for rendering scenes within Autodesk 3ds Max and Autodesk VIZ; includes room, lighting, and camera information; can be used for rendering multiple 3D scenes or objects with the same settings.", "Windows, ", "['Autodesk 3ds Max 2017']"], "rproj": ["R Project", "Project created and used by RStudio, an open source IDE for the R programming language; contains project information used to customize the behavior of RStudio, such as loading RStudio settings and restoring previously edited source documents into editor tabs; also used to indicate whether to load the .RHISTORY file for use in the RStudio History pane and the .RDATA file in the project's main directory.", "Windows, Mac, Linux, ", "['RStudio']['RStudio']['RStudio']"], "rpres": ["R Presentation File", "Presentation file created and used by RStudio, an open source IDE for the R programming language; contains information formatted in Markdown syntax that describes presentation slides based on your .RPROJ file; includes slide titles, author and date, slide content, R code chunks that display code, embedded images, and the slide background color.", "Windows, Mac, Linux, ", "['RStudio']['RStudio']['RStudio']"], "rpprj": ["Axure RP Shared Project File", "Shared project created by Axure RP, a prototyping and wireframing application; saves a diagram that can be shared, annotated, versioned, and iteratively upgraded during the design process; often used for creating mockups of user interfaces.", "Windows, Mac, ", "['Axure RP']['Axure RP']"], "rpmsg": ["Outlook Restricted Permission Message", "Email message file created by Outlook, an email and calendar application; stores the message body and attachments, but limits who can view, print, copy, or forward the email based on permissions set by the sender; incorporates encryption so that only authorized entities have rights.", "Windows, Mac, ", "['Microsoft Outlook 2016']['Microsoft Outlook 2016']"], "rpm": ["Red Hat Package Manager File", "An RPM file is an installation package originally developed for the Red Hat Linux operating system, but now used by many other Linux distributions as well.  RPM files are commonly used for installing programs on Linux systems.", "Windows, Mac, Linux, Windows, ", "['File Viewer Plus']['Incredible Bee Archiver', 'The Unarchiver']['Red Hat Package Manager', 'Alien']['RealNetworks RealPlayer Cloud']"], "rpp": ["REAPER Project File", "Project file created by REAPER, a program used for recording, editing, mixing, and mastering music; contains information about tracks and their settings; used for saving and loading project information.", "Windows, ", "['Cockos REAPER']"], "rpln": ["InDesign Required Plug-in File", "Plugin file used by InDesign, a page layout program used for page design and print publishing; contains functions required by the application to run and is located in a Required directory of the InDesign installation directory.", "Windows, Mac, ", "['Adobe InDesign CC 2017']['Adobe InDesign CC 2017']"], "rplib": ["Axure RP Widget Library File", "Widget used by Axure RP, a wireframing and prototyping tool; may contain a new icon or interactive visual element that can be placed within an Axure RP diagram (.RP project file); enables custom elements to be used for prototypes and mockups.", "Windows, Mac, ", "['Axure RP']['Axure RP']"], "rpl": ["Toribash Replay File", "Replay of a match performed in Toribash, a 3D fighting game where players design the fighters' moves; saved in a high-quality MPEG format that can be viewed on multiple platforms.", "Windows, Mac, Linux, Windows, ", "['Nabi Studios Toribash']['Nabi Studios Toribash']['Nabi Studios Toribash']['DF Interactive Special Force']"], "rpk": ["RadLight Media Player Skin", "Custom skin for RadLight, an audio and video media player for Windows; serves as a theme file for the RadLight program; can be loaded by the user to customize the player's interface.", "Windows, ", "[]"], "rpkg": ["Hitman Game Patch Archive", "An RPKG file is a patch archive used by Hitman, a third-person stealth assassin video game.  It contains game data, which includes textures, voice dialogue, and other assets that appear in the game.", "Windows, ", "['IO Interactive Hitman']"], "rpgproject": ["RPG Maker MV Project", "An RPGPROJECT is a game project file created by RPG Maker MV, a program used to create role-playing games (RPG).  It contains project data for a game, which includes maps, character sprites, audio played during gameplay, and other graphics.", "Windows, ", "['Enterbrain RPG Maker MV']"], "rpj": ["Real Pac Batch Job File", "Batch process file written in UNI*Script, an interpreted script language developed by Uni Comp, Inc; stores scripts that automate various tasks for Uni Comp's products, including Real Pac v.2 and later.", "Windows, ", "['Uni Comp Real Pac']"], "rpi": ["Render Plug-in", "Plug-in used by game system emulators; contains features that extend and enhance gameplay, such as a Magnification Filter that increases clarity of images and video seen during gameplay.", "Windows, Mac, Linux, ", "['Kega Fusion']['Kega Fusion']['Kega Fusion']"], "rpb": ["Radmin Phonebook File", "Phonebook file used by Radmin, a remote access program; contains connection information for multiple servers; may include local machines or computers accessed over the Internet.", "Windows, ", "['Famatech Radmin 3']"], "rp2": ["RetroPlatform Player Program Archive", "Compressed file archive that contains program data and related media for a game or other application; used for archiving programs for retro platforms, such as Amiga and Commodore systems; can be opened and played without requiring manual configuration.", "Windows, Mac, Linux, ", "['Cloanto Amiga Forever']['E-UAE']['E-UAE']"], "rpa": ["RIB Project Archive File", "File created by iTWO, a construction planning and engineering software package; contains an archive of a Progress ObjectStore database, which is the backend storage format for iTWO project data; used for creating backups as well as archiving projects.", "Windows, ", "['RIB iTWO']"], "rpd": ["RIB Project Database File", "Database file used by iTWO, an application suite used for construction planning and engineering; stores a Progress ObjectStore Database, which contains all data for an iTWO planning project; used as a backend storage format for iTWO.", "Windows, Windows, Mac, Linux, ", "['RIB iTWO'][][][]"], "rpc": ["Rich Page Content Document", "An RPC file is a document created by Synthrone Crafter, an e-content production application used by retailers to administer, manage, format, and update e-content.  It contains the content of a page or product, which may include text, images, video, or forms.", "Web, ", "['Synthrone Crafter']"], "rp": ["Axure RP Project File", "Project file created by Axure RP, a wireframing and prototyping tool; contains a diagram that may include text fields, buttons, images, and other visual elements; used for creating mockups and preliminary designs before implementation.", "Windows, Mac, Windows, Mac, Linux, ", "['Axure RP']['Axure RP']['RealNetworks RealPlayer Cloud']['RealNetworks RealPlayer Cloud']['RealNetworks RealPlayer Cloud']"], "rp9": ["RetroPlatform Disk Image Archive", "Packaging format used by RetroPlatform, the technology used in the Amiga Forever and C64 Forever emulators; contains one or more disk image files (i.e. .ADF or .D64 files) and a manifest.xml file; compressed as a .ZIP archive, which is renamed to \".rp9.\"", "Windows, Mac, Linux, ", "['Cloanto Amiga Forever']['E-UAE']['E-UAE']"], "rpf": ["Grand Theft Auto Data File", "Game file used by Grand Theft Auto (GTA) IV and V, an action-adventure game; may include data such as player 3D models, texture graphics, and game audio; sometimes replaced with other RPF \"mod\" files that alter game content.", "Windows, Windows, Mac, ", "['Rockstar Games Grand Theft Auto 4', 'Rockstar Games Grand Theft Auto 5', 'SparkIV']['Autodesk 3ds Max 2017', 'Adobe After Effects CC 2017', 'NewTek LightWave 3D', 'XnViewMP']['Adobe After Effects CC 2017', 'NewTek LightWave 3D']"], "rox": ["Roxio Project File", "Disc compilation project created by Roxio Creator, a disc burning, video editing, and photo enhancement application; stores the information for an audio, video, or data disc compilation; used for burning CDs or DVDs in the software.", "Windows, Windows, ", "['Roxio Creator NXT Pro 5'][]"], "roxio": ["Roxio Project", "Disc compilation project file saved using Roxio Creator, home multimedia application; saved using XML formatting and may contain an audio, video, or data disc compilation; can be used for burning discs in the software.", "Windows, ", "['Roxio Creator NXT Pro 5']"], "rov": ["Report Object Variable", "Parameter used by Actuate reporting functions; determines what data is imported into Report Object Instances (.ROI files).", "Windows, ", "[]"], "rou": ["Gerber Route File", "Contains routing data used in printed circuit board (PCB) manufacturing; saved in a standard Gerber format and includes plating and count information about the drilling tools used to create the board.", "Windows, ", "['Altium Designer']"], "rotestresult": ["RemObjects SDK Test Results File", "Developer file created by Service Tester, a testing utility included with the RemObjects SDK; saves the results of a RemObjects application stress test; used for saving test results for viewing later; stores results generated from running a test with an .ROTEST file.", "Windows, ", "['RemObjects SDK']"], "rotest": ["RemObjects SDK Test File", "Developer file created using the RemObjects SDK, a remoting framework used for building networked data driven applications; contains settings for testing a RemObjects service; used by Service Tester, a RemObjects SDK utility for stress testing applications.", "Windows, ", "['RemObjects SDK']"], "rot": ["Homeworld 2 Graphics File", "Graphics file used by Homeworld 2, a space-based real-time strategy game; may be used to store icons, 3D textures, and other graphics within the game; can include multiple images in a single file.", "Windows, ", "['Sierra Homeworld 2']"], "roz": ["aSc TimeTables Schedule File", "Schedule file created and used by aSc TimeTables, an application used by teachers to create school schedules; store schedule information such as courses, grade levels, rooms, teachers, students, school, periods, and days.", "Windows, Mac, ", "['aSc TimeTables']['aSc TimeTables']"], "ros": ["BattleScribe Roster Editor File", "File created by BattleScribe Roster Editor, a program used for building army lists for table top war games, such as Warhammer 40,000 or Warhammer Fantasy; saves a list of army units and their abilities, organized into categories.", "Windows, iOS, Android, ", "['BattleScribe']['BattleScribe']['BattleScribe']"], "roq": ["Id Software Game Video", "Recording of an Id Software game saved in the \"RoQ\" format; stores a user's gameplay in a video format that can be played back in various Id Software video games, including Quake 3 and Doom 3.", "Windows, ", "['Id Software Quake 3', 'Media Player Classic']"], "rom": ["Read Only Memory Image", "A ROM file is a file that contains a copy of the ROM for a hardware device.  It is commonly used for software emulation or for updating the firmware on a certain device.  ", "Windows, Mac, Linux, Windows, Mac, Windows, ", "['Basilisk II', 'Mini vMac', 'SheepShaver']['Basilisk II', 'Mini vMac', 'SheepShaver']['Basilisk II', 'Mini vMac', 'SheepShaver']['Project64', '1964', 'UltraHLE', 'UltraHLE 2064', 'SupraHLE', 'Nemu64', 'Mupen64Plus', 'Daedalus']['sixtyforce', 'Mupen64Plus']['Tripwire Interactive Killing Floor']"], "rol": ["Ad Lib Synthesized Instrument", "Instrument format used by Ad Lib Visual Composer; supported by Roland audio hardware, such as the MPU401 MIDI interface.", "Windows, Mac, Linux, ", "['Audio Overload', 'Nullsoft Winamp with the AdPlug plugin']['Audio Overload']['Audio Overload']"], "roi": ["Report Object Instance", "Information object used by Actuate reporting software; can pull and integrate real-time data from several different data sources", "Windows, Windows, ", "[][]"], "rog": ["Roger 2 Input Data File", "File format used by Roger 2, an Irish civil engineering program.", "Windows, ", "[]"], "rofl": ["League of Legends Replay File", "An ROFL file is a replay file created by League of Legends (LoL), a multiplayer online battle arena (MOBA) game.  It contains a video of LoL gameplay that has been downloaded from the game.", "Windows, Mac, ", "['Riot Games League of Legends']['Riot Games League of Legends']"], "rodz": ["Ancestry Genealogical Database File", "Genealogy database used by Ancestry, a free genealogical database program; contains information about the user's genealogical line; includes relative information such as names, birth dates, birthplace, and photos.", "Windows, ", "['Nethar Ancestry']"], "rodx": ["Ancestry Genealogical Database File", "Genealogy database used by Ancestry, a program that helps users keep track of their genealogical information; contains a user's genealogical line, which includes family names, birth dates, anniversaries, photos, and birthplaces.", "Windows, ", "['Nethar Ancestry']"], "rodl": ["RemObjects Definition Language File", "Developer file created by RemObjects SDK, a software development application used for building middle-tier software; uses and XML format and defines the services provided by the developed software, including the API and supported data formats; used as the interface, or user specification, for how to interact with the services.", "Windows, ", "['RemObjects SDK']"], "roadtrip": ["Road Trip Planner File", "Road trip file created and used by Road Trip Planner, an OS X application that enables users to plan road trips; contains a map with various information such as location pins, trip itineraries, and trip details.", "Mac, ", "['Modesitt Road Trip Planner']"], "rns": ["Reason Song File", "Song created with Reason, an audio production program that includes composition and sound design features; stores sequencer data and virtual rack settings.", "Windows, Mac, ", "['Propellerhead Reason']['Propellerhead Reason']"], "roca": ["RIB office Compressed Archive", "Data file created by RIB office, a project management application for planners and engineers; stores a compressed archive of the office project management data; includes schedules, drawings, employee information, contract data, contacts, and invoices; used for archiving snapshots of the database.", "Windows, ", "[]"], "rod": ["RIB office Database File", "Database file used by RIB office, a project management application for planners and engineers in building construction, civil engineering, and road construction; stores all office data in the Progress ObjectStore database format; used as the backend format for saving RIB office data.", "Windows, Windows, Windows, ", "[][]['Nethar Ancestry']"], "rock": ["Rockbox Plug-in", "Plug-in file used by Rockbox, an open source firmware for portable music players; stores a game or another small application that can run on Rockbox; enables Rockbox \"apps\" to be used on iPods, SanDisk MP3 players, and other portable music players.", "Windows, Mac, Linux, ", "['Rockbox Utility']['Rockbox Utility']['Rockbox Utility']"], "rnx": ["RealPlayer Settings File", "File created by RealPlayer, an audio and video playback program; contains exported settings, such as favorites or presets; used to share favorites and presets with others.", "Windows, ", "['RealNetworks RealPlayer Cloud']"], "rnq": ["Renque Model File", "Model of an event simulation created by Renque, a discrete event simulator; capable of modeling any imaginable discrete event process.", "Windows, ", "[]"], "rng": ["Nokia Composer Ringtone", "Monophonic ringtone format used by Nokia cell phones; can be created using the Nokia Composer program included with certain Nokia phones; because it is a monophonic format, only one note can be played at a time", "Windows, Windows, Mac, Linux, ", "[]['SyncRO Soft oXygen XML Editor', 'Apache OpenOffice', 'Monkfish XMLBlueprint XML Editor']['SyncRO Soft oXygen XML Editor', 'Apache OpenOffice']['SyncRO Soft oXygen XML Editor', 'Apache OpenOffice']"], "rmx": ["RealJukebox Format", "Copy-protected audio file used by RealPlayer, a music playback and streaming program; securely stores the audio data so that it may not be played unless the security key is found; can be linked to a particular computer or key.", "Windows, Mac, Linux, Windows, ", "['RealNetworks RealPlayer Cloud']['RealNetworks RealPlayer Cloud']['RealNetworks RealPlayer Cloud']['Thomson Reuters Reference Manager']"], "rnd": ["PGP Random Seed File", "Random seed file used by PGP (Pretty Good Privacy) encryption software; may be used for generating random numbers; typically named \"randseed.rnd\" and saved in the \"Application Data\\PGP Corporation\\PGP\" directory.", "Windows, Mac, Windows, Linux, ", "[][]['PuTTY']['PuTTY']"], "rmuf": ["Alpha Five Runtime License File", "License file used by Alpha Five, an IDE used to develop Web applications; contains the maximum number of users that can access a database; used by the Alpha Five runtime engine to control and track concurrent database users.", "Windows, ", "['Alpha Software Alpha Anywhere']"], "rnc": ["RNC ProPack Archive", "Compressed or \"packed\" file archive created with ProPack, a multi-format file packing utility; developed by Rob Northern Computing (RNC) and is now a freely distributed program.", "Windows, Windows, Mac, Linux, ", "['RNC ProPack']['SyncRO Soft oXygen XML Editor', 'text editor']['SyncRO Soft oXygen XML Editor', 'text editor']['SyncRO Soft oXygen XML Editor', 'text editor']"], "rmvb": ["RealMedia Variable Bit Rate File", "Real Media video file compressed using a variable bit rate, which is optimized for the content of the video; a newer variation of the standard Real Media (.RM) file format that allows for more efficient compression.", "Windows, Mac, Linux, iOS, ", "['File Viewer Plus', 'RealNetworks RealPlayer Cloud', 'VideoLAN VLC media player', 'GRETECH GOM Player', 'Aiseesoft Video Converter Ultimate']['RealNetworks RealPlayer Cloud', 'Eltima Elmedia Player', 'Aiseesoft Video Converter Ultimate']['RealNetworks RealPlayer Cloud', 'VideoLAN VLC media player']['olimsoft OPlayer']"], "rmv": ["The Simpsons Hit & Run Video File", "Video file used by some video games developed by Radical Entertainment and published by Vivendi Universal Games, such as The Simpsons: Hit & Run and Hulk; saves in-game video for cutscenes and credits.", "Windows, ", "[]"], "rmt": ["Router Firmware File", "Firmware file used by various routers, including Linksys routers; contains data and programs used to operate a router; used to provide firmware updates for bug fixes and security patches.", "Windows, Mac, Linux, ", "['Microsoft Internet Explorer', 'Mozilla Firefox', 'Web browser']['Apple Safari', 'Mozilla Firefox']['Mozilla Firefox']"], "rmr": ["ResumeMaker File", "Resume file created by ResumeMaker, a program that allows users to create professional resumes; contains resume page formatting, text, and images; can be exported to Microsoft Word (.DOC) format.", "Windows, ", "['Individual Software ResumeMaker Professional Deluxe']"], "rmskin": ["Rainmeter Skin File", "Skin or theme file used by Rainmeter, a desktop customization platform used to run desktop applets similar to widgets for Mac OS X or gadgets for the Windows Sidebar; stores a Zip archive of applet images, fonts, metadata, and compiled program code; commonly used for applying themes to the desktop, and adding weather and news reports, clocks, small games, and system performance tools.", "Windows, ", "['Rainmeter']"], "rms": ["Java Application Settings File", "Preference file for a Java application; stores settings and configuration information related to the application; typically saves data in a structured database format.", "Windows, Mac, Linux, Windows, Mac, Linux, ", "['Oracle Java Virtual Machine']['Oracle Java Virtual Machine']['Oracle Java Virtual Machine'][][][]"], "rmp": ["Magellan Raster Map File", "GIS file used by Magellan Triton GPS devices; saves a raster map, which is a plain bitmap image sometimes scanned from paper; also stores metadata for location information so the map is calibrated to real world coordinates.", "Windows, Mac, Linux, Windows, Mac, Linux, ", "['Mobile Atlas Creator']['Mobile Atlas Creator']['Mobile Atlas Creator']['RealNetworks RealPlayer Cloud', 'Apple iTunes']['RealNetworks RealPlayer Cloud', 'Apple iTunes']['RealNetworks RealPlayer Cloud']"], "rmm": ["RAM Meta File", "Text file that contains the location of a Real Audio Media (RAM) file; includes a URL where the media file can be accessed as well as other information about the file, such as the height and width of the video.", "Windows, Mac, Linux, ", "['RealNetworks RealPlayer Cloud', 'Media Player Classic']['RealNetworks RealPlayer Cloud']['RealNetworks RealPlayer Cloud']"], "rml": ["Redline Markup Language File", "File created by Volo View, a program used for marking up CAD drawings; saved in an XML format and contains annotations and other markups that are displayed in red text when overlaid on a drawing; enables design reviewers to embed notes in CAD drawings.", "Windows, Windows, Windows, ", "['Autodesk Volo View', 'Autodesk AutoCAD 2017']['Elixir Technology Elixir Repertoire'][]"], "rmj": ["Real Media Jukebox Audio File", "Proprietary audio format used by Real Media Jukebox, also known as RealJukebox; saved in a slightly different format than .RA and .RAM files, which are used by RealPlayer.", "Windows, Mac, Linux, ", "['RealNetworks RealPlayer Cloud', 'NCH Switch', 'Logipole Konvertor']['RealNetworks RealPlayer Cloud', 'NCH Switch']['RealNetworks RealPlayer Cloud']"], "rmi": ["RMID MIDI File", "MIDI file stored in the Resource Interchange File Format (RIFF); technically, a MIDI file wrapped in an RIFF container; the format was originally introduced by Microsoft and later extended by MIDI.org; often referred to as a RIFF RMID file.", "Windows, Mac, Linux, ", "['Microsoft Windows Media Player', 'Apple QuickTime Player', 'Nullsoft Winamp', 'VideoLAN VLC media player', \"vanBasco's Karaoke Player\"]['Apple QuickTime Player', 'VideoLAN VLC media player']['VideoLAN VLC media player']"], "rmh": ["Rights-Managed HTML Document", "An RMH file is a rights-managed .HTML document created by the Rights-Managed HTML SDK.  It contains MIME encapsulation of Aggregate HTML Documents (MHTML) content.  RMH files are used to secure content so that only the intended recipient can view or print the MHTML content in the original format using Internet Explorer with the Rights Management add-on installed.", "Windows, ", "['Microsoft Internet Explorer with the Rights Management add-on']"], "rmf": ["Rich Music Format Audio File", "Audio file created in the Rich Music Format, an audio format created by Beatnik; used as a container format for MIDI files and other standard audio formats; can be encrypted to protect original music; used by some older video games.", "Windows, Mac, Windows, Windows, Mac, ", "['Oracle Java Sound']['Oracle Java Sound']['Valve Hammer Editor']['Adobe Reader', 'Adobe Acrobat DC']['Adobe Reader', 'Adobe Acrobat DC']"], "rls": ["Symbian Localization File", "Developer file used by Symbian OS mobile applications; contains strings, such as user popup messages and menu text, that are translated into different languages; allows an application to be localized into multiple languages.", "Windows, ", "[]"], "rll": ["Microsoft Resource Library", "An RLL file is a resource library used by various Windows programs.  It contains program resource information, such as program data and global parameters.  RLL files typically store resources for a corresponding dynamic link library (.DLL) file.", "Windows, ", "['Microsoft Visual Studio 2017']"], "rmd": ["Reference Manager Data File", "Data file created by Reference Manager, an application used for creating bibliographies; saves the references for the bibliography and is also saved with a separate .RMX index file; used for storing citations and other references.", "Windows, Windows, Mac, Linux, Windows, Mac, Windows, Mac, Linux, ", "['Thomson Reuters Reference Manager']['R', 'RStudio']['R', 'RStudio']['R', 'RStudio']['REDCINE-X', 'Adobe Premiere Pro CC 2017']['REDCINE-X', 'Adobe Premiere Pro CC 2017']['RealNetworks RealPlayer Cloud']['RealNetworks RealPlayer Cloud']['RealNetworks RealPlayer Cloud']"], "rmbak": ["Registry Mechanic Backup File", "Backup file created by Registry Mechanic, a program used for optimizing the Windows registry and computer performance; stores a backup copy of important registry system files before they are modified.", "Windows, ", "['PC Tools Registry Mechanic']"], "rm": ["RealMedia File", "An RM file is a multimedia file used by RealPlayer, an audio and video playback and streaming program.  It contains audio or video data or a link to a streaming media file, which is played back as it is downloaded.  RM files are commonly used for streaming content over the Internet such as video and Internet radio.", "Windows, Mac, Linux, iOS, Android, ", "['File Viewer Plus', 'RealNetworks RealPlayer Cloud', 'VideoLAN VLC media player', 'GRETECH GOM Player', 'Applian Replay Converter', 'Xilisoft Video Converter Ultimate', 'Online Media Technologies AVS Video Converter', 'Aiseesoft Video Converter Ultimate']['RealNetworks RealPlayer Cloud', 'VideoLAN VLC media player', 'Aiseesoft Video Converter Ultimate', 'Eltima Elmedia Player']['RealNetworks RealPlayer Cloud', 'VideoLAN VLC media player']['RealNetworks RealPlayer Cloud', 'olimsoft OPlayer']['RealNetworks RealPlayer Cloud']"], "rli": ["RealWorld Graphics Layered Image", "Image file created by RealWorld Graphics software products such as RealWorld Icon Editor, RealWorld Cursor Editor, RealWorld Photos, or RealWorld Paint; supports mulitiple independent editing layers as well as both vector and raster graphics; can be saved as a standard .PNG, .JPG, or .GIF file; can also be used for making Windows icons and cursors.", "Windows, ", "['RealWorld Icon Editor', 'RealWorld Cursor Editor', 'RealWorld Paint', 'RealWorld Photos']"], "rlf": ["ArcGIS Report Layout File", "Report template created by ArcGIS Desktop geospatial visualization and analysis software; stores the layout for a report and includes template fields and source data information; used for generating geospatial reports (.RDF files).", "Windows, ", "['ESRI ArcGIS for Desktop']"], "rl": ["R.viewer List File", "File created by R.viewer, a tool used for creating lists of files and folders on a Windows hard drive; saves the file list as well as an identification of damaged and restored files; allows users to track corrupted files for repair.", "Windows, Windows, Mac, ", "['R.LAB R.viewer']['Trilobyte The 7th Guest', 'The 7th Guest Toolset', 'The 11th Hour Toolset']['Trilobyte The 7th Guest']"], "rkt": ["Racket Source Code File", "Program source code written in the Racket language; may be used for various purposes, whether it be storing a Racket module that can perform a specific function and work with other RKT modules in order to act as a project or containing metadata that describes a package.", "Windows, Mac, Linux, ", "['Racket']['Racket']['Racket']"], "rkp": ["Rockchip MP4 Player Game", "Game developed for a Rockchip portable MP4 player, such as the Rockchip 2606 or 2608; can only be played on a Rockchip player if the correct firmware is installed.", "Windows, ", "[]"], "rkg": ["Mario Kart Wii Ghost Data File", "Data file utilized by the Nintendo Mario Kart Wii video game; contains ghost data referenced by the game; includes the race time, vehicle, and character.", "Windows, Mac, ", "['Riivolution']['Riivolution']"], "rle": ["Run Length Encoded Bitmap", "4 or 8-bit RLE-encoded bitmap image; basically a .DIB file that uses RLE (Run-length encoding) compression; common image format used in early versions of Windows and CompuServe software.", "Windows, Mac, Linux, Windows, Mac, ", "['Adobe Photoshop CC 2017', 'Adobe Photoshop Elements 15', 'Adobe Illustrator CC 2017', 'Newera Graphics Converter Pro', 'Corel PaintShop Pro X9', 'ACD Systems Canvas X 2017', 'Hamrick VuePrint', 'XnViewMP', 'BRL-CAD']['Adobe Photoshop CC 2017', 'Adobe Photoshop Elements 15', 'Adobe Illustrator CC 2017', 'XnViewMP', 'BRL-CAD']['BRL-CAD']['Golly']['Golly']"], "rk": ["WinRK File Archive", "Compressed archive created with WinRK; uses PWCM, FPW, ROLZ2, and ROLZ3 compression and other proprietary compression algorithms; may also incorporate .PAQ7 file compression techniques.", "Windows, ", "[]"], "rjs": ["Ruby Javascript File", "Ruby on Rails file containing both Ruby code and JavaScript; similar to a .RHTML page, but allows Ruby code to be embedded within JavaScript functions; requires a Ruby engine on a Web server to be parsed correctly.", "Windows, Mac, Linux, Windows, ", "['Web browser', 'text editor']['Web browser', 'text editor', 'MacroMates TextMate']['Web browser', 'text editor'][]"], "rip": ["Hit'n'Mix Audio Mashup File", "Audio project file created by Hit'n'Mix, a program used to create audio mashups from song files; contains audio segments that have been ripped and split from an .MP3, .CDA, or .WAV audio file; used by both home DJs (disc jockeys) and mashup pioneers; can be exported to .MP3 format.", "Windows, ", "[\"Hit'n'Mix\"]"], "rix": ["ColoRIX Image", "Bitmap graphic created by ColoRIX, a paint program developed by RIX Softworks for the MS-DOS operating system; supports color graphics; was used to store graphics on DOS-based systems in the 1980s and 1990s.", "Windows, Mac, Linux, ", "['XnViewMP']['XnViewMP']['XnViewMP']"], "rise": ["RISE Editor Model File", "Model file created by the RISE Editor, a CASE (Computer Aided Software Engineering) tool used to develop engineering and information system diagrams; contains a model, which may include drawings, entities, relations, interfaces, views, and notes.", "Windows, ", "['RISE to Bloome RISE Editor']"], "ris": ["Research Information Systems Citation File", "An RIS file is a bibliographic citation file saved in a format developed by Research Information Systems (RIS).  It contains a series of lines delimited by two-character codes and a corresponding value.  RIS files provide information such as title, author, publication date, keywords, publisher, issue number, and start and end page.", "Windows, Mac, Linux, ", "['Thomson Reuters EndNote', 'Wandora']['BibDesk', 'Thomson Reuters EndNote', 'Wandora']['Wandora']"], "rim": ["BioWare Resource Image File", "Game data file used by some games developed by BioWare, including Neverwinter Nights and Star Wars: Knights of the Old Republic; similar to the .ERF format also used by BioWare games; used as an game application support file.", "Windows, ", "['ERF/RIM Editor']"], "riff": ["Painter Raster Image", "Image saved by Corel Painter, a digital art studio used to create digital paintings; contains raster graphics split across one or more layers; allows the painted graphics to be separate from the canvas so that artists can customize the canvas later.", "Windows, Mac, ", "['Corel Painter 2017', 'CorelDRAW Graphics Suite X8']['Corel Painter 2017', 'Lemkesoft GraphicConverter']"], "rig": ["vRigger Design File", "File created by vRigger rigging system design software; stores a design for a  rope rigging system and can include ropes, pulleys, carabiners, cables, knots, and other rigging data; used for generating illustrations for mountain, industrial, or urban rescue situations, as well as for theatrical environments.", "Windows, Windows, ", "['Iterum vRigger']['Hidden Temple Studios Antibody']"], "rif": ["Painter Raster Image File", "An RIF file is a raster image created by Corel Painter (formerly MetaCreations Painter), a program used for digital painting.  It contains an image that may include brushstrokes, pencil sketches, image hose graphics, and various other painted elements.", "Windows, Mac, ", "['Corel Painter 2017', 'CorelDRAW Graphics Suite X8']['Corel Painter 2017']"], "rhtml": ["Ruby HTML Web Page", "Web page containing Ruby code or scripts; processed on a Web server running Ruby on Rails before the page is sent to the Web browser.", "Windows, Mac, ", "['Web browser']['Web browser', 'MacroMates TextMate']"], "rhp": ["Rhino Plug-in", "Plugin file used by Rhino, a 3D modeling application; contains data that adds extra functionality to the software; may provide additional 3D editing capabilities or support for importing additional image formats.", "Windows, ", "['McNeel Rhino']"], "rhistory": ["R History File", "Data file created by R, a statistical computing and graphing application; contains the history of commands entered by the user during an open R session; similar to a .BASH_HISTORY file for the Bash shell; enables the user to push the up arrow to scan through the list of previously entered commands.", "Windows, Mac, Linux, ", "['R', 'RStudio']['R', 'RStudio']['R', 'RStudio']"], "rgss2a": ["RPG Maker VX RGSS Encrypted Archive", "Encrypted file created by RPG Maker VX (RPGVX), a program used to create original role-playing games (RPGs); contains all data for the game, including graphics, audio, items, characters, and maps; used for protecting original game material with encryption.", "Windows, ", "['Enterbrain RPG Maker VX']"], "ric": ["NXT Image File", "Image format used for displaying images on the LEGO Mindstorms NXT brick, the \"brain\" of an NXT robot; may include multiple sprite sheets, CopyBits, VarMaps, parameters, and other data.", "Windows, ", "['National Instruments LabVIEW For LEGO Mindstorms']"], "rgt": ["Relic Entertainment Game Texture File", "An RGT file is a game texture file used by Relic Entertainment games such as \"Dawn of War\" and \"Dawn of War: Winter Assault.\"  It contains textures for models that appear in the game.", "Windows, ", "[\"Corsix's Mod Studio\"]"], "rgssad": ["RPG Maker VX RGSS Encrypted Archive", "Encrypted Archive file created by RPG Maker VX (RPGVX), a program used to create original role-playing games (RPGs); contains data and graphic files for the game; identical to the .RGSS2A file except it does not hold audio files; encrypted to protect original game material.", "Windows, ", "['Enterbrain RPG Maker VX']"], "rgss3a": ["RPG Maker VX Ace RGSS Encrypted Archive", "An RGSS3A file is an archive file created by RPG Maker VX Ace, a role-playing game (RPG) creator.  It contains game data such as characters, graphics, and maps.  RGSS3A files are encrypted to protect original game material.", "Windows, ", "['Enterbrain RPG Maker VX Ace']"], "rgs": ["Registry Script", "Script used by ATL (Active Template Library) C++ projects, Microsoft Visual Studio, Flexera InstallShield, and other software development and deployment programs; contains code that registers the software with Windows.", "Windows, ", "['Microsoft Visual Studio 2017', 'Flexera InstallShield']"], "rgo": ["RepliGo File", "File format used by RepliGo Server for BlackBerry Enterprise Server and RepliGo Professional; used for converting common file types to a format that can be viewed on BlackBerry smartphones.", "Windows, ", "[]"], "rgmb": ["RootsMagic Backup File", "Backup file created by RootsMagic, a genealogy program used for capturing family history information; saves a backup of an .RGMC project file; used for archiving on external media and can be used for restoring the original project if it becomes lost or corrupted.", "Windows, ", "['RootsMagic']"], "rgf": ["LEGO MINDSTORMS EV3 Robot Graphics File", "Graphics file created by LEGO MINDSTORMS EV3, a program that enables you to create and program LEGO robots; contains an image edited by the Image Editor tool in the LEGO MINDSTORMS EV3 application; includes text boxes, shapes, drawings, and other editing tools.", "Windows, Mac, ", "['LEGO MINDSTORMS EV3']['LEGO MINDSTORMS EV3']"], "rgrp": ["Pro Tools Region Group File", "File created by Pro Tools, a professional audio recording, editing, and mixing application; saves a collection of audio and MIDI regions (such as multiple audio tracks) that can be edited together as a single group; replaced by the clip group (.CGRP) format in Pro Tools 10.", "Windows, Mac, ", "['Avid Pro Tools']['Avid Pro Tools']"], "rgp": ["RealArcade Game Package", "Data used by RealArcade games, a portal developed by RealNetworks for downloading and buying arcade games.", "Windows, Mac, ", "[][]"], "rgn": ["Garmin Regional Map File", "Map data file saved in a database format; contains a map of a specific region that can be loaded by Garmin software and GPS devices; may also contain information that can be used to update a GPS device's firmware.", "Windows, Mac, ", "['TurboCCC TTSVoiceEditor'][]"], "rgmc": ["RootsMagic Genealogy Project File", "Family history project file created by RootsMagic, a program used for capturing family history information; saves ancestors and descendants and includes timeline and personal information; can be printed to reports such as pedigree charts, family group sheets, and narrative reports.", "Windows, ", "['RootsMagic']"], "rgd": ["Raft Saved Game File", "An RGD file is a saved game file created by Raft, a game where the player attempts to survive on a raft in the ocean.  It contains saved game progress, which includes the player's health, water, and food levels and additions to the raft.", "Windows, Mac, Linux, ", "['Raft']['Raft']['Raft']"], "rge": ["Entourage File Archive", "Archive of items from an Entourage database; may include mail messages, tasks, contacts, notes, calendar events, and project files; created using the Export command from the Entourage File menu; may be imported using the Import command.", "Mac, ", "['Microsoft Outlook 2016', 'Stellar Phoenix Entourage Recovery']"], "rgba": ["RGB Bitmap", "An RGBA file is a color bitmap image format created by Silicon Graphics (SGI).   It is similar to the .RGB file as it supports color RGB channels with an alpha channel.", "Windows, Mac, Linux, ", "['File Viewer Plus', 'XnViewMP', 'ImageMagick']['XnViewMP', 'ImageMagick']['ImageMagick']"], "rft": ["Revit Family Template File", "Template for creating a data family in Revit, a building information modeling (BIM) program; used for starting a new family from scratch and may contain several custom 3D model designs.", "Windows, Windows, Windows, ", "['Autodesk AutoCAD Architecture 2017', 'Autodesk Revit Structure', 'Autodesk Revit MEP']['Siber Systems RoboForm']['Corel WordPerfect X8']"], "rgb": ["RGB Bitmap", "Color bitmap image format created by Silicon Graphics (SGI); generic format used for saving RGB color images on SGI workstations; recognized by various image viewing programs.", "Windows, Mac, Linux, Windows, Mac, ", "['File Viewer Plus', 'ACD Systems ACDSee 20', 'ACD Systems Canvas X 2017', 'Corel PaintShop Pro X9', 'Apple QuickTime Player', 'XnViewMP', 'GIMP']['Apple QuickTime Player', 'XnViewMP', 'GIMP']['GIMP']['XnViewMP']['XnViewMP']"], "rfw": ["Rockchip Firmware File", "Firmware file used by MP3 and MP4 portable media players that have the Rockchip processor; contains functions that run the player, as well as images and styles for the screen display.", "Windows, ", "[]"], "rfu": ["Remote Firmware Update", "File created for firmware updates, used by the HP LaserJet P3010 series printer; contains firmware updates; packaged together with an associated .README file as a self-extracting .EXE file.", "Windows, Mac, Linux, ", "[][][]"], "rfq": ["RoboForm SearchCard File", "File created by RoboForm, a password manager and form filler application; contains automated search information, such as keywords, form filling instructions, and other automated actions; used to automate manual search steps.", "Windows, ", "['Siber Systems RoboForm']"], "rfp": ["RoboForm Passcard File", "Passcard file used by RoboForm, a secure password manager and form filler application; contains online passwords that have been entered by the user; used to automatically enter passwords into online websites.", "Windows, ", "['Siber Systems RoboForm']"], "rfo": ["RoboForm Option File", "File used by RoboForm, a program that allows users to securely store their personal information; contains various types of RoboForm program data, such as software licenses, caches, or settings; used to store RoboForm installation information and program preferences.", "Windows, ", "['Siber Systems RoboForm']"], "rfn": ["RoboForm Safenote File", "Safenote file created by RoboForm, a program used for securely storing personal information; contains a secret text fragment, such as an ATM password or a lock key combination; used to safely save and review sensitive personal information.", "Windows, ", "['Siber Systems RoboForm']"], "rfm": ["rFactor Modification File", "Mod file used for altering the car and track settings in rFactor, a 3D race simulation game; saved in a text format that can be modified with a text editor; users can change the values of parameters in the RFM file to modify the gameplay.", "Windows, ", "['Image Space rFactor', 'text editor']"], "rflw": ["Edge Reflow Data File", "File created by Edge Reflow, a responsive web design application; contains your Reflow project settings such as page layout and styling data; examples of contained data include margin size, typography settings, background, and borders.", "Windows, Mac, ", "['Adobe Edge Reflow CC']['Adobe Edge Reflow CC']"], "rfl": ["Reason ReFill Sound Bank", "Component package for Reason, a song creation program that includes a virtual studio rack and an advanced sequencer; may contain patches, samples, song files, and .REX files; .WAV and .AIF files are compressed to about half their original file size when stored in ReFills (created using ReFill Packer).", "Windows, Mac, ", "['Propellerhead Reason']['Propellerhead Reason']"], "rfgs_pc": ["Red Faction: Guerilla Saved Game File", "Saved game file created by Red Faction: Guerilla, a third-person shooter game and the third part of the Red Faction series; stores game progress as well as player settings when the game was saved; used for saving and loading game states.", "Windows, ", "['Volition Red Faction: Guerilla']"], "rfd": ["Recogniform Form Designer File", "File created by Recogniform document recognition software; contains the page layout structure, text, and other formatting information; used for scanning and storing digital copies of paper forms.", "Windows, Windows, ", "['Recogniform Form Designer']['Dragon UnPACKer']"], "rfb": ["RoboForm Bookmark File", "Bookmark file created by RoboForm, a program used to securely fill online forms with personal information; contains a website bookmark similar to a Web browser favorite; includes a text field for storing notes about websites.", "Windows, ", "['Siber Systems RoboForm']"], "rfa": ["Revit Family File", "Data file that can be loaded into a project created with Revit, a building information modeling (BIM) program; contains one or more 3D models that can be imported into a 3D scene; may be created and saved using the Revit Family Editor.", "Windows, Windows, ", "['Autodesk AutoCAD Architecture 2017', 'Autodesk Revit Structure', 'Autodesk Revit MEP']['Electronic Arts Battlefield 1942']"], "rfc": ["RoboForm Contact File", "Contact file created by RoboForm, a program that allows users to securely store passwords and fill online forms; contains address book contacts, including names, phone numbers, email addresses, and other contact information.", "Windows, ", "['Siber Systems RoboForm']"], "rf1": ["Retirement Forecast File", "Data file used by the Retirement Forecast software program.", "Windows, ", "[]"], "rez": ["Lithtech Game Engine Resource File", "Resource file used by first-person shooter games that are developed with the Lithtech gaming engine; contains game content, including meshes, textures, music, maps, and other game objects; commonly used to modify game content.", "Windows, Windows, Mac, Windows, Mac, ", "['Dragon UnPACKer', 'SmileGate Crossfire']['OpenText FirstClass']['OpenText FirstClass']['Ambrosia Escape Velocity', 'Ambrosia EV Nova', 'EVNEW']['Ambrosia Escape Velocity', 'Ambrosia EV Nova']"], "rex": ["ReCycle Loop File", "Audio loop format used by ReCycle, a sampled loop creation and editing program; stores audio data and loop slicing information; REX files can be quantized, have the tempo changed, and can be tuned or detuned.", "Windows, Mac, Windows, Mac, Linux, ", "['Propellerhead ReCycle', 'Propellerhead Reason', 'Avid Pro Tools']['Propellerhead ReCycle', 'Propellerhead Reason', 'Avid Pro Tools']['Regina REXX Interpreter', 'BRexx']['BRexx']['Regina REXX Interpreter', 'BRexx']"], "rev": ["RAR Recovery Volume Set", "Recovery volume created with RAR file compression and archiving software; contains redundancy data that can be used to reconstruct missing files within a RAR volume set; only used with multi-volume archives.", "Windows, Windows, Mac, Linux, ", "['WinRAR 5']['RunRev LiveCode']['RunRev LiveCode']['RunRev LiveCode']"], "rexx": ["Rexx Source File", "Source file written in the Restructured Extended Executor (Rexx) programming language, a scripting and macro language mainly used to generate reports and process data; contains source code, which includes functions, variables, and other statements that tell the program how to function.", "Windows, Mac, Linux, ", "['Regina REXX Interpreter', 'BRexx']['BRexx']['Regina REXX Interpreter', 'BRexx']"], "resw": ["Windows Resources File", "Resource file used by Windows and Silverlight applications; contains strings that are used to localize the application for different languages and contexts; replaces .RESX files in some application development scenarios; often used with XAML applications, which abstract the user interface strings to resource files.", "Windows, ", "['Microsoft Visual Studio 2017']"], "ret": ["BusinessObjects Template", "Template for creating a new report with BusinessObjects, a business performance optimization program; contains report settings and pre-defined queries that serve as a starting point for creating a new report.", "Windows, ", "[]"], "resx": [".NET Managed Resources File", "Resource file used by programs developed with Microsoft's .NET Framework; stores objects and strings for a program in an XML format; may contain both plain text information as well as binary data, which is encoded as text within the XML tags.", "Windows, ", "['Microsoft Visual Studio 2017']"], "resmoncfg": ["Resource Monitor Configuration File", "Settings file created by Resource Monitor, a system performance monitoring tool included with Windows; saved using XML formatting and includes user resource monitoring selections such as which processes or resource types to monitor.", "Windows, ", "[]"], "req": ["SSL Certificate Request File", "File used in the process of setting up a digital certificate; stores a Certificate Signing Request (CSR) which contains information that uniquely identifies the initiator of the request; sent to a trusted entity (a certificate authority) who uses the request to generate a valid digital certificate for the requester.", "Windows, Mac, Linux, Windows, ", "['Microsoft Exchange Server', 'OpenSSL']['OpenSSL']['OpenSSL']['Microsoft Notepad']"], "resjson": ["Windows JavaScript Resources File", "Developer file used by Windows Metro style apps developed for Windows 8; saved in a JSON (JavaScript Object Notation) format and contains strings that are often used for localizing the app's user interface.", "Windows, ", "['Microsoft Visual Studio 2017', 'text editor']"], "resources": ["Visual Studio Resource File", "File created by Visual Studio, a software development application created by Microsoft; may contain both strings and objects, but objects must be serializable; used for bundling and persisting application assets so they can be accessed in a standard way in Visual Studio programs.", "Windows, ", "['Microsoft Visual Studio 2017']"], "res": ["Valve Resource File", "File used by Valve Steam and games developed by Valve; may store information for a user interface skin, custom HUDs, hitsounds, and other information such as the number of times a player has played a map.", "Windows, Windows, Windows, Windows, ", "['Valve Steam']['Microsoft Visual Studio 2017', 'Resource Hacker', 'ResEdit']['Embarcadero Delphi', 'Embarcadero Technologies C++ Builder']['LucasArts Star Wars: Knights of the Old Republic']"], "rem": ["BlackBerry Encrypted Data File", "File stored on a BlackBerry smartphone; may be one of several different file types, but uses an \".rem\" extension to indicate the file has been encrypted; often has a compound file extension, such as \".jpg.rem,\" which would be an encrypted JPEG image file.", "Windows, Mac, ", "['Research In Motion BlackBerry Desktop Manager']['Research In Motion BlackBerry Desktop Manager']"], "rels": ["Open Office XML Relationships File", "File contained within Microsoft Open Office XML documents; contains XML specifications for how \"parts\" within a \"package\" are connected to form a document; saved in a _rels directory of an Open Office XML document.", "Windows, Mac, ", "['Microsoft Word 2016', 'Microsoft Excel 2016', 'Microsoft PowerPoint 2016']['Microsoft Word 2016', 'Microsoft Excel 2016', 'Microsoft PowerPoint 2016']"], "rep": ["Grand Theft Auto Replay File", "Replay file created by Grand Theft Auto (GTA), a car racing and campaign game; contains a series of frames, or scenes, which capture gameplay information at a particular time, including actors, weather, pedestrians, and vehicle positions; used to share and review gameplay experiences.", "Windows, Windows, Mac, Linux, Windows, Mac, ", "['Rockstar Games Grand Theft Auto', 'GTA Replays Manager']['X-Plane']['X-Plane']['X-Plane']['Blizzard StarCraft']['Blizzard StarCraft']"], "reloc": ["Windows EXE Relocation Section File", "File that may be included in a Windows executable (.EXE) file; stores the relocation section of the executable, which affects how the program is loaded and run in memory; often included in Windows 16-bit and 32-bit executables.", "Windows, ", "['Jrsoftware StripReloc', '7-Zip']"], "refresh": ["Visual Studio Refresh File", "File created by Visual Studio, a software development application; saved in a plain text format and contains a reference to a project dependency, such as a .DLL file or other library, that is required by the project; allows the dependency to be \"refreshed\" automaticaly by Visual Studio without the user having to manually update it.", "Windows, ", "['Microsoft Visual Studio 2017']"], "reference": ["Budget In Brief Reference File", "Reference file used by Budget In Brief, a program used for integrating budget data into a single document; contains a list of references that can be imported into a Budget In Brief .BOOK file.", "Windows, ", "['Microsoft Notepad']"], "ref": ["IDRISI Raster Image Reference File", "File created by IDRISI Taiga, a GIS imaging application; stores geographic reference information so that .RST images can be projected according to specific unit measurements; can be used for multiple raster images.", "Windows, Linux, Windows, ", "['Clark Labs IDRISI Selva', 'GDAL']['GDAL'][]"], "rel": ["Relocatable Module File", "File created for Nintendo Wii games such as Super Smash Bros. and Mario Kart; contains gameplay data such as stage models and characters referenced by the game; functions similarly to a .DLL file in the Windows OS.", "Windows, Windows, ", "['Stage Switcher']['Symantec Norton Security 2017']"], "regtrans-ms": ["Registry Transaction Log File", "File created with the Microsoft Common Log File System (CLFS), a Windows component used to create transaction logs; contains transaction read and write information about changes to the user or system registry restore data, which is stored in the NTUSER.DAT or SCHEMA.DAT files; used with a .BLF file to comprise the transaction log.", "Windows, ", "['Microsoft Common Log File System']"], "redir": ["Spotify Executable Redirect File", "File used by Spotify, a proram used for streaming music online; saved as part of the Spotify installation (C:\\Program Files\\Spotify\\ directory) and uses the filename spotify.exe.redir.", "Windows, ", "['Spotify']"], "reg": ["Registry File", "Updates the Windows Registry when run; custom REG files can be created to alter different aspects of Windows; to create your own registry update file, follow these steps:\r\n\r\nLaunch Regedit (From the start menu, select Run, type \"Regedit\")\r\nSelect the section of the registry you are interested in modifying\r\nFrom the File menu, select Export\r\nChoose \"Selected Branch\" from the Export Range option at the bottom of the window.\r\nSave the file as a \".reg\" file.\r\n\r\nNOTE: Manually updating the Windows registry is an advanced process and should only be performed if you know exactly what you are doing.  Incorrect registry updates may render Windows inoperable.", "Windows, Windows, Mac, ", "['Microsoft Registry Editor'][][]"], "red": ["CADViewer Redline Markup File", "CAD file created by CADViewer, a program used for reviewing CAD designs; saves annotations, or redlines, that have been written by a design reviewer; enables notes and other jotted items to be saved alongside a CAD design.", "Windows, Mac, Linux, ", "['Tailor Made CADViewer']['Tailor Made CADViewer']['Tailor Made CADViewer']"], "reb": ["REBOL Script File", "Script that contains code written in the REBOL (Relative Expression Based Object Language) programming language; can be compiled into an executable program using a REBOL compiler.", "Windows, Mac, Linux, Windows, ", "[][][]['Reimbursement Tracker']"], "record": ["GarageBand Records Audio File", "Audio file created by GarageBand Records, a program used for producing music albums and music videos and posting them to iTunes; contains a recording creating by the user.", "Windows, ", "['Microsoft Windows Media Player']"], "rec": ["Topfield PVR Recording", "Video file created by a Topfield PVR digital video recorder; saved in a proprietary compressed format that can be viewed on a Topfield PVR or using a supporting third-party video player.", "Windows, Mac, Linux, Windows, ", "['Squared 5 MPEG Streamclip', 'VideoLAN VLC media player', 'Elecard MPEG Player', 'DRD Systems VideoReDo']['Squared 5 MPEG Streamclip', 'VideoLAN VLC media player', 'Eltima Elmedia Player']['VideoLAN VLC media player']['Breaktru eJuice Me Up', 'Juice Grinder']"], "readme": ["Readme File", "Text document referred to as a \"readme file;\" contains important information about the installation or usage a of certain software program or software update; may be included with a software installer or installed with an application.", "Windows, Mac, ", "['text editor']['text editor']"], "rdx": ["Reflex Data File", "Data file used by Borland Reflex, an early database program developed for DOS; stores data in a flat file format.", "Windows, ", "[]"], "rdw": ["Real-DRAW Project File", "Project format created and used by Real-DRAW, a vector graphics editor; contains a canvas along with any edits that have been made to it, which includes objects, shapes, styles, colors, curves, shapes, and shadows & effects. ", "Windows, ", "['MediaChance Real-DRAW']"], "rds": ["Ray Dream Studio Scene File", "3D scene created by Ray Dream Studio, an older 3D drawing and animation program originally developed by MetaCreations; contains three-dimensional objects and animation settings; supports lighting, textures, shading, and other effects.", "Windows, ", "['DAZ 3D DAZ Studio 4', 'DAZ 3D Bryce 7 Pro']"], "rdr": ["Remote Desktop Manager Report Settings File", "An RDR file is a report created by Remote Desktop Manager, software used to centralize remote connections, credentials, and passwords.  It contains settings for creating reports regarding a user's entries, logs, credentials, and security information.", "Windows, Mac, ", "['Devolutions Remote Desktop Manager']['Devolutions Remote Desktop Manager']"], "rdoc_options": ["Ruby Document Options File", "File created by RDoc, a documentation application for Ruby projects; contains options, or settings, for generating documentation for your Ruby project; includes the comment format, character-set, excluded files, and output directory; included with your .GEM package.", "Windows, Mac, Linux, ", "['RDoc', 'text editor']['RDoc', 'text editor']['RDoc', 'text editor']"], "rdoc": ["Ruby Document", "Document created by RDoc, a Ruby documentation application; contains documentation information in RDoc markup language that is compiled in HTML to document Ruby projects online. ", "Windows, Mac, Linux, ", "['RDoc', 'text editor']['RDoc', 'text editor']['RDoc', 'text editor']"], "rdp": ["Remote Desktop Configuration File", "Contains the necessary information for a connection to a terminal server, including the configuration of the options when the file was saved; used by Microsoft's Remote Desktop Services and related applications.", "Windows, Mac, Linux, ", "['Microsoft Remote Desktop Connection', 'Microsoft Terminal Services Client']['Microsoft Remote Desktop Connection']['Terminal Server Client']"], "rdo": ["Xerox Rawster Document Object File", "Metafile used by the Xerox Document Assembler software for Xerox Digipath Scan and Makeready workstations and the DocuTech line of printers and scanners; defines how the printer/scanner should print or scan each page.", "Windows, Mac, ", "[][]"], "rdlx": ["Power View Project File", "File created by Power View, a data analysis and visualization tool used with Microsoft enterprise software such as SharePoint Server and SQL Server; may contain line graphs, bar charts, glyph graphs, and other visualizations; provides business intelligence (BI) reports for data analysts and decision makers.", "Windows, ", "['Microsoft Power View']"], "rdlc": ["Visual Studio Client Report Definition File", "Report definition file created by Microsoft Visual Studio, an application that allows developers to create Windows programs; contains layout settings, text fields, graphics, and other information for the report; stored using XML formatting.", "Windows, ", "['Microsoft Visual Studio 2017']"], "rdl": ["MicroStation Redline File", "Vector-based drawing format used by Bentley Microstation; saved as a \"reference attachment\" and is displayed with an active model, such as a .DGN or .DWG file; used for plotting or construction purposes.", "Windows, ", "['Autodesk AutoCAD 2017']"], "rdi": ["Rohos Disk Image File", "File created by Rohos disk drive encryption software; stores a password protected set of files as a hidden disk partition; used for storing sensitive information on the local computer or on an external drive such as a USB flash drive.", "Windows, Windows, ", "['Tesline-Service Rohos Mini Drive', 'Tesline-Service Rohos Disk Encryption'][]"], "rdg": ["RDCman Config File", "Config file used by RDCman, which stands for Microsoft Remote Desktop Connection Manager; stores connectivity settings, which includes a list of servers in which the computer is connected; designed to be portable meaning that you can share them with other users so they can get connected quicker to select servers.", "Windows, ", "['Microsoft Remote Desktop Connection Manager']"], "rdc": ["IDRISI Raster Documentation File", "GIS metadata file created by IDRISI Taiga, a program used for imaging spatial data; saves descriptive information about the raster image stored in a .RST file; also can store a reference to the .REF geographical reference file for the image, as well as an .SMP palette file.", "Windows, Linux, ", "['Clark Labs IDRISI Selva', 'Clark Labs Land Change Modeler', 'ESRI ArcGIS for Desktop', 'ERDAS IMAGINE', 'GDAL']['GDAL']"], "rdata": ["R Workspace File", "File created by R, a statistical computation and graphing program developed by The R Project for Statistical Computing; saves a workspace, which includes the function and value objects created during an open session in R; used for storing a working environment that can be extended or modified later.", "Windows, Mac, Linux, ", "['R', 'RStudio', 'Safe Software FME Desktop']['R', 'RStudio']['R', 'RStudio']"], "rdf": ["ArcGIS Report Document File", "Report file created by ArcGIS Desktop, an application suite for geospatial analysis and visualization; stores a generated report, which can include GIS statistics formatted as tabular data; generated from a report layout (.RLF) file.", "Windows, Windows, Mac, Linux, Windows, Mac, Windows, Windows, ", "['ESRI ArcGIS for Desktop']['Mozilla Firefox', 'Mozilla SeaMonkey', 'Altova XMLSpy', 'SyncRO Soft oXygen XML Editor', 'Liquid Technologies Liquid XML Studio']['Mozilla Firefox', 'Mozilla SeaMonkey', 'SyncRO Soft oXygen XML Editor']['Mozilla Firefox', 'Mozilla SeaMonkey', 'SyncRO Soft oXygen XML Editor']['Microsoft Excel 2016', 'Oracle Database']['Microsoft Excel 2016']['ReluxSuite']['CyberLink PowerProducer 6']"], "rcx": ["REDCINE-X Project File", "Video project created by REDCINE-X, a program used for editing videos captured with RED digital cameras; saves references to video clips as well as video editing decisions; used for high definition video projects.", "Windows, Mac, ", "['REDCINE-X']['REDCINE-X']"], "rdb": ["Retrospect Backup Set", "One of several files from a backup set created with Retrospect Backup software; contains exact data backed up from a hard drive and cataloged by the program; can be used to restore data that has been lost or corrupted on the original hard disk; file names are displayed incrementally as AA000000.RDB, AA000001.RDB, AA000002.RDB, etc. ", "Windows, Mac, Windows, Windows, Mac, ", "[][][]['Project64', 'Nemu64'][]"], "rda": ["R Data File", "File created by older versions of R, a statistical analysis and graphing program; saves the statistical objects (functions, values) created by the user at the R prompt while the program is open; used as the older extension for R, which now uses the .RDATA extension.", "Windows, Mac, Linux, Windows, ", "['R', 'RStudio']['R', 'RStudio']['R', 'RStudio']['Ubisoft Anno 2070', 'Ubisoft Anno 1404', 'RDA Explorer']"], "rcy": ["ReCycle 1.x Document", "Audio data file created by ReCycle 1.x, a program used to create audio sample loops; contains the audio data in slices, which can be stretched to match specific tempos; used for storing audio sample work.", "Windows, Mac, ", "['Propellerhead ReCycle']['Propellerhead ReCycle']"], "rcut": ["Webinaria Recording Cut", "Recording project created and used by Webinaria, an application used to record software tutorials and demonstrations; contains edits, such as added intervals for text and sound, that have been made to a screen recording; does not contain actual video. ", "Windows, ", "['Webinaria']"], "rcu": ["RealWorld Layered Cursor Image", "Windows cursor image created by RealWorld Cursor Editor, a program used for creating Windows cursors in the .CUR and .ANI formats; saves an edited image and supports multiple independent editing layers; similar to an .RLI file, which is a RealWorld multi-layered image.", "Windows, ", "['RealWorld Cursor Editor']"], "rct": ["Visual Studio Resource Template", "Template file created by Visual Studio, a Windows software development tool; may store bitmaps, cursors, dialogs, HTML, icons, and other resources; saves time when creating new resources (.RC files) with similar settings and features.", "Windows, ", "['Microsoft Visual Studio 2017']"], "rctd": ["RabbitCT Dataset", "Dataset used by RabbitCTRunner, an open platform for benchmarking 3D cone-beam reconstruction algorithms; contains a preprocessed C-arm CT collection of data from a rabbit; accessed by RabbitCTRunner, which performs the benchmark and evaluation of the data.", "Windows, Mac, Linux, ", "['RabbitCTRunner']['RabbitCTRunner']['RabbitCTRunner']"], "rcproject": ["iMovie '08 Project", "Movie project created with iMovie '08 (a.k.a. iMovie 7) or later; includes a timeline with references to video clips, as well as effects, audio tracks, transitions, and other settings.", "Mac, ", "['Apple iMovie 10', 'Apple Final Cut Pro X']"], "rcs": ["RandomControl Scene File", "3D scene file used by RandomControl software products such as fryrender and Arion; stores a scene exported from a 3D modeling software application (that has the fryrender or Arion plugin); used for storing the scene in a format that can be submitted to the rendering engine.", "Windows, ", "['RandomControl fryrender', 'RandomControl Arion']"], "rcrec": ["LogMeIn Remote Control Session Recording", "Remote Control session recording format created by the Windows version of LogMeIn, an application used to remotely access a PC or Mac; contains a recording of the screen content from a Remote Control session. ", "Windows, ", "['LogMeIn Pro']"], "rcl": ["Easy CD and DVD Creator 6 Project", "CD or DVD authoring project created with Roxio's Easy CD and DVD Creator 6; contains disc structure information and references to files that will be included on the disc.", "Windows, Windows, ", "['Roxio Creator NXT Pro 5']['Recolored']"], "rcg": ["Recog Character Recognition Set", "Data file used by Recog, a program that learns and recognizes characters and symbols; contains character recognition data that enables Recog to identify mouse-drawn characters.", "Windows, ", "[]"], "rcf": ["SonicWALL VPN Configuration File", "Configuration file used by SoniCWALL Global VPN Client, a program that allows client workstations to connect to a Virtual Private Network (VPN); saved using XML formatting and contains connection information for one or more VPNs; used by organizations for setting up remote connections for employees.", "Windows, ", "['SonicWALL Global VPN Client']"], "rc1": ["Samsung Mobile Device Firmware File", "System file used by some Samsung mobile devices; stores data used for running the operating system; not meant to be opened or modified manually, but some users have used programs such as MultiLoader to change system themes.", "Windows, ", "[]"], "rc": ["Resource Script", "Developer file used by software development applications such as Visual Studio and Borland C++; saved in a plain text format and includes references to resources, such as user interface components, images, or icon files; used for compiling the resources into .RES files used by the final program build.", "Windows, ", "['File Viewer Plus', 'Microsoft Visual Studio 2017', 'Embarcadero C++Builder', 'Borland C++Builder', 'Resource Hacker']"], "rc2": ["Visual Studio Resources File", "Developer file used by Visual Studio, a software development program for Windows; saves resources, such as icons, bitmaps, and user interface components; differs from an .RC file because Visual Studio's Resource Compiler does not manage the resources in the RC2 file.", "Windows, Windows, ", "['Microsoft Visual Studio 2017'][]"], "rbz": ["SketchUp Plugin", "A RBZ file is a plugin used by SketchUp, a 3D modeling program used for computer-aided design (CAD).  It stores one or more Ruby scripts (.RB files) that are compressed with .ZIP compression.  RBZ files are useful for reducing the size of SketchUp plugins when distributing and installing them.", "Windows, Mac, ", "['Trimble SketchUp']['Trimble SketchUp']"], "rbxs": ["ROBLOX Script", "Script created for ROBLOX, an application used to develop and play online multiplayer building games; contains source code written in the Lua programming language; used for creating custom ROBLOX game content, such as vehicles, tools, and new gameplay features.", "Windows, Mac, iOS, Android, ", "['ROBLOX', 'ROBLOX Studio']['ROBLOX', 'ROBLOX Studio']['ROBLOX Mobile']['ROBLOX']"], "rbxmx": ["ROBLOX Model", "An RBXMX files is a 3D model used by ROBLOX Studio, a ROBLOX building tool.  It contains a model, which may be a vehicle, person, animal, plant, building, or other object.", "Windows, Mac, iOS, Android, ", "['ROBLOX', 'ROBLOX Studio']['ROBLOX', 'ROBLOX Studio']['ROBLOX Mobile']['ROBLOX']"], "rbx": ["Rembo-C Compiled Script", "Program written in Rembo-C, a language similar to C and typically used for automating server management operations; compiled from a .RBC file into an executable file that can be run on a server with Rembo software installed.", "Windows, Linux, ", "[][]"], "rbxm": ["ROBLOX Model", "3D model used by ROBLOX, an online multiplayer game in which users can custom build their own characters; designed to be a kid-friendly environment where people can exercise their creativity.", "Windows, Mac, iOS, Android, ", "['ROBLOX Studio', 'ROBLOX']['ROBLOX Studio', 'ROBLOX']['ROBLOX Mobile']['ROBLOX']"], "rbxl": ["ROBLOX Location File", "Location file that defines a place in ROBLOX, an online multiplayer building game; describes a playing field, which consists of 3D models (.RBXM files), parts, tools, scripts, and teams; defines the playing area, or 3D world, within ROBLOX.", "Windows, Mac, iOS, Android, ", "['ROBLOX', 'ROBLOX Studio']['ROBLOX', 'ROBLOX Studio']['ROBLOX Mobile']['ROBLOX']"], "rbw": ["Ruby Script", "Source code file written in Ruby, an object-oriented scripting language designed to be intuitive and easy to read; may also use the .RB extension, except Ruby scripts that use the \".rbw\" extension are typically meant for graphical interface code.", "Windows, Mac, Linux, Windows, Mac, Linux, ", "['File Viewer Plus', 'Ruby', 'JRuby', 'ActiveState Komodo Edit', 'Trimble Sketchup']['Ruby', 'Apple Xcode', 'MacRuby', 'JRuby', 'ActiveState Komodo Edit', 'MacroMates TextMate', 'Trimble Sketchup']['Ruby', 'ActiveState Komodo Edit']['Xojo']['Xojo']['Xojo']"], "rbvcp": ["Real Studio Version Controlled Project", "Software development project created by Xojo, a crossplatform software development IDE; similar to an .RBP file but also saves version control information that can be used for reverting the project back to a previous revision.", "Windows, Mac, Linux, ", "['Xojo']['Xojo']['Xojo']"], "rbt": ["LEGO MINDSTORMS NXT Program", "Program written for a LEGO MINDSTORMS NXT robot using the NXT-G programming system; includes functions that define the movements and actions of the robot, such as picking up an object. ", "Windows, Mac, ", "['LEGO MINDSTORMS NXT']['LEGO MINDSTORMS NXT']"], "rbp": ["Real Studio Project File", "Project file created by Xojo, a software development IDE that uses the Realbasic programming language; can be built into a single executable that runs without depending on external .DLL files or virtual machines.", "Windows, Mac, Linux, ", "['Xojo']['Xojo']['Xojo']"], "rbm": ["Real Studio Menu File", "Menu file created by Xojo, a software development IDE; contains a menu bar for a desktop application that is being developed in the Xojo IDE; used to export a menu bar from one project to another; includes information describing the menu bar, such as menus, items, IDs, behaviors, platform-specific shortcuts, and appearance;  replaced by the .XOJO_BINARY_MENU, .XOJO_XML_MENU, and .XOJO_MENU file extensions.", "Windows, Mac, Linux, ", "['Xojo']['Xojo']['Xojo']"], "rbs": ["Windows Installer Rollback Script", "Script created during a software installation run by Windows Installer; contains a set of instructions used to restore the pre-installation system state if the installation does not complete; if the installation is successful, the file is deleted automatically.", "Windows, Windows, Mac, Windows, Mac, Linux, ", "['Microsoft Windows Installer']['Propellerhead Rebirth', 'Image-Line FL Studio']['Propellerhead Rebirth']['Microsoft Windows Media Player', 'Nullsoft Winamp', 'VideoLAN VLC media player', 'audio player']['Apple QuickTime Player', 'Apple iTunes', 'VideoLAN VLC media player', 'audio player']['VideoLAN VLC media player', 'audio player']"], "rco": ["PlayStation Portable Resource File", "File used by the PlayStation Portable (PSP), a gaming device developed by Sony; contains resources for the PSP, including system information, sounds, icons, and other theme graphics; commonly used to customize the look and feel of the PSP interface.", "Windows, ", "[]"], "rbk": ["Windows 95 Registry Backup File", "Backup file of the Windows 95 or 98 registry, which stores system and application settings, file associations, and other data; can be used to restore the registry if it becomes corrupted.", "Windows, ", "['PC Tools Registry Mechanic']"], "rbj": ["XRK Compiled Redcode Object File", "File used by XRK (Extra Redcode Kit), a program that simulates battles between \"warriors\" that are programmed in a low-level assembly language called Redcode; stores compiled source code and is used to simulate one warrior's actions against another's in XRK.", "Windows, ", "['Extra Redcode Kit']"], "rbf": ["Windows Installer Rollback File", "Archive of files created during a software installation process run by Windows Installer; contains files that can be restored if the installation does not successfully complete; if the installation is successful, the rollback file is automatically deleted.", "Windows, Windows, Windows, Windows, Mac, ", "['Microsoft Windows Installer']['Stellar Insta Backup Gold']['CELADE REDATAM'][][]"], "rb": ["Ruby Source Code", "Software program written in Ruby, an object-oriented scripting language; designed to be simple, efficient, and easy to read; can be edited with a text editor and run using Ruby.", "Windows, Mac, Linux, Windows, Mac, Linux, Windows Phone, ", "['File Viewer Plus', 'Ruby', 'JRuby', 'ActiveState Komodo Edit', 'Trimble Sketchup']['Ruby', 'Apple Xcode', 'MacRuby', 'JRuby', 'ActiveState Komodo Edit', 'MacroMates TextMate', 'Trimble Sketchup']['Ruby', 'ActiveState Komodo Edit']['Xojo']['Xojo']['Xojo'][]"], "ray": ["Rayshade Image", "Three-dimensional ray-traced image created with Rayshade, a free scene rendering program; contains a 3D scene defined in an ASCII text format; may include object primitives, lighting, shadows, and texture mappings.", "Windows, Mac, Linux, ", "[][][]"], "rcd": ["pcAnywhere Recorded Session File", "Recording created by pcAnywhere remote desktop control software; stores a screen recording of the remote desktop environment as it is being used; may include multiple sessions in a single file; can be used for technical support logs.", "Windows, Windows, Mac, Android, Windows, ", "['Symantec pcAnywhere']['LEGO MINDSTORMS NXT']['LEGO MINDSTORMS NXT']['LEGO MINDdroid']['Arcade']"], "rbc": ["Rembo-C Script", "Script written in Rembo-C, a scripting language that uses syntax similar to C; often used for automating server management operations; requires a Rembo installation on the server to run, but can be edited in a text editor.", "Windows, Linux, Windows, Mac, ", "['text editor']['text editor'][][]"], "rb4": ["Resume Builder 4 File", "Resume document created by Resume Builder version 4, a program used to format and print resumes; supports text, images, and page layout formatting, as well as several different international languages; may be exported to a Microsoft Word document, .HTML Web page, or a text file.", "Windows, Windows, ", "[][]"], "rax": ["Real Music Store Audio File", "Audio file purchased from the Real Music Store and played by Real Player, an audio and video streaming and playback program; stored in a proprietary format with DRM protection; can be converted to more popular file formats, such as .MP3.", "Windows, Mac, Linux, ", "['RealNetworks RealPlayer Cloud', 'SoundTaxi Media Suite']['RealNetworks RealPlayer Cloud']['RealNetworks RealPlayer Cloud']"], "raw": ["Raw Image Data File", "A RAW file is an image generated by digital cameras such as Panasonic, Leica, and Casio cameras.  It contains uncompressed, raw image data that can be adjusted for exposure and white balance using software that supports the format.  RAW files are used for storing unaltered image data as captured by a digital camera's CCD.", "Windows, Mac, Linux, Android, Windows, Mac, Linux, Windows, Mac, Linux, ", "['File Viewer Plus', 'Adobe Photoshop CC 2017', 'Adobe Photoshop Elements 15', 'Corel PaintShop Pro X9', 'ACD Systems ACDSee 20', 'ACD Systems Canvas X 2017', 'Google Picasa', 'RawTherapee', 'Microsoft Windows Photos', 'GIMP with UFRaw plug-in']['Apple Preview', 'Adobe Photoshop CC 2017', 'Adobe Photoshop Elements 15', 'Google Picasa', 'GIMP with UFRaw plug-in', 'MacPhun ColorStrokes']['RawTherapee', 'digiKam', 'UFRaw', 'GIMP with UFRaw plug-in']['File Viewer for Android']['Dolphin']['Dolphin']['Dolphin']['NCH Switch', 'NCH WavePad', 'Adobe Audition CC 2017', 'Audacity', 'MAGIX SpectraLayers Pro 4', 'FMJ-Software Awave Audio']['NCH Switch', 'NCH WavePad', 'Audacity', 'MAGIX SpectraLayers Pro 4']['Audacity']"], "r30": ["WinRAR Split Archive Part 30", "File used as part of a multi-volume compressed RAR archive; contains compressed file contents as part of a larger archive; can be reconstructed with the other compressed parts back into the original file.", "Windows, Mac, Linux, ", "['WinRAR 5', 'Corel WinZip 21', 'Smith Micro StuffIt Deluxe for Windows']['RARLAB RAR', 'Incredible Bee Archiver', 'Smith Micro StuffIt Deluxe 16']['RARLAB RAR']"], "rav": ["Rave Reports Project File", "Project file created by Rave Reports, a report designing application; saves the page layout, graphics, text, and fillable fields for one or more reports; can be deployed within a built application so that reports are served to the user within the program's user interface; can also be hosted by a Rave Reports Server that provides reports on demand.", "Windows, ", "['Nevrona Designs Rave Reports']"], "r2": ["WinRAR Multi-Volume Archive Part 2", "Archive file that is compressed using WinRAR, a program used to create single or multi-volume archives; contains part two of a compressed volume; stores a compressed part or fragment of a larger file; may use the extensions R0 through R99.", "Windows, Mac, Linux, ", "['WinRAR 5', 'Corel WinZip 21']['UnRarX', 'RARLAB RAR for Mac OS X']['RARLAB RAR for Linux']"], "ratdvd": ["RatDVD Disk Image", "Compressed DVD disk image stored in the ratDVD container format; can reduce the size of a 9 GB video DVD to 1-3 GB; maintains full picture quality, multiple audio channels, video angles, etc; also saves multiple versions of the movie, special features, complete menus, and navigation features.", "Windows, ", "[]"], "r1": ["WinRAR Multi-Volume Archive Part 1", "Archive file that is part of a RAR multi-volume archive; contains part one of a compressed volume; stores a compressed part or fragment of a larger file; may use the extensions R0 through R99.", "Windows, Mac, Linux, ", "['WinRAR 5', 'Corel WinZip 21']['UnRarX', 'RARLAB RAR for Mac OS X']['RARLAB RAR for Linux']"], "r21": ["WinRAR Split Archive Part 21", "File created as part of a multi-volume compressed .RAR archive; stores part 21 of a compressed, split archive; used for reconstructing an original file with the other split archive parts.", "Windows, Mac, Linux, ", "['WinRAR 5', 'Smith Micro StuffIt Deluxe for Windows', 'Corel WinZip 21', 'Whirling Dervishes Alpha ZIP', '7-Zip', 'Zipeg']['UnRarX', 'Smith Micro StuffIt Deluxe 16', 'Incredible Bee Archiver', 'Zipeg'][]"], "r1m": ["RealOne Streaming Media File", "Temporary file saved by RealPlayer or RealOne Player when a streaming media file is downloaded from the Internet; created as a buffer when the media file is being streamed by RealOne Player; not meant to be opened by the user.", "Windows, Mac, ", "['RealNetworks RealPlayer Cloud']['RealNetworks RealPlayer Cloud']"], "r04": ["WinRAR Split Archive Part 4", "An R04 file is a split archive created by WinRAR (Windows) or RAR (macOS or Unix).  It contains one or more files split into several parts.  R04 files are the fourth part of a split compressed archive (see .R01, .R02, and .R03).", "Windows, Mac, Linux, ", "['WinRAR 5', 'Corel WinZip 21', '7-Zip']['RARLAB RAR for Mac OS X', 'Incredible Bee Archiver']['RARLAB RAR for Linux']"], "r02": ["WinRAR Split Archive Part 2", "Part two of a compressed archive created with WinRAR or RAR (see .R01); split into several parts, which allows a large archive to be saved on multiple disks; may use file extensions numbered from R00 to R99.", "Windows, Mac, Linux, ", "['WinRAR 5', 'Corel WinZip 21', '7-Zip']['RARLAB RAR for Mac OS X', 'Incredible Bee Archiver']['RARLAB RAR for Linux']"], "r03": ["WinRAR Split Archive Part 3", "Part three (see .R01 and .R02) of a compressed archive created with WinRAR (Windows) or RAR (Mac or Unix); split into several parts, allowing a single archive to be spanned across multiple discs; may be numbered from R00 to R99.", "Windows, Mac, Linux, ", "['WinRAR 5', 'Corel WinZip 21', '7-Zip']['RARLAB RAR for Mac OS X', 'Incredible Bee Archiver']['RARLAB RAR for Linux']"], "r01": ["WinRAR Split Archive Part 1", "An R01 file is part one of a compressed archive split into several parts by WinRAR or RAR.   It is typically created for saving a large archive on multiple disks.   R01 files are followed by the .R02 file, .R03 file, and so on up to R99 depending on the size of the archive.", "Windows, Mac, Linux, ", "['WinRAR 5', 'Corel WinZip 21', '7-Zip']['RARLAB RAR', 'Incredible Bee Archiver']['RARLAB RAR for Linux']"], "r00": ["WinRAR Compressed Archive", "File archive compressed using the WinRAR or RAR file compression utilities; may be a single archive or one of several parts of a split archive (see the .R01, .R02, and .R03 file extension entries).", "Windows, Mac, Linux, ", "['WinRAR 5', 'Corel WinZip 21', '7-Zip']['UnRarX', 'RARLAB RAR for Mac OS X', 'Incredible Bee Archiver']['RARLAB RAR for Linux']"], "r0": ["WinRAR Compressed Archive", "Archive file that is compressed using WinRAR or RAR programs; may be a standalone archive or a part of a multi-volume archive (see the .R1 and .R2 file extension entries); used to store a compressed part or fragment of a larger file.", "Windows, Mac, Linux, ", "['WinRAR 5', 'Corel WinZip 21']['UnRarX', 'RARLAB RAR for Mac OS X', 'Incredible Bee Archiver']['RARLAB RAR for Linux']"]}