{"s": ["Source Code File", "Generic source code file that contains the source for a computer program; may be written in a number of different programming languages; can be opened and edited with a text editor.", "Windows, Mac, Linux, Windows, ", "['Microsoft Visual Studio 2017', 'Microsoft Notepad', 'gVim']['Apple Xcode', 'MacroMates TextMate', 'Bare Bones BBEdit', 'MacVim']['Pico', 'GNU Emacs'][]"], "sav": ["Nintendo DS Save File", "A SAV file is a saved game used by Nintendo DS portable game system emulators such as DeSmuME and NO$GBA.  It stores the state of the current game progress and includes game information such as the character name, experience points, completed levels, and in-game resources.", "Windows, Mac, Linux, Windows, Mac, Windows, Mac, Linux, Windows, Windows, Mac, ", "['NO$GBA', 'iDeaS Emulator', 'DeSmuME']['DeSmuME']['DeSmuME'][][]['IBM SPSS']['IBM SPSS']['IBM SPSS'][\"Gibbed's Mass Effect 3 Save Editor\", 'Electronic Arts Mass Effect 3']['Bethesda Softworks Fallout 2', 'WinRAR 5']['Parallels Desktop 12 for Mac']"], "sat": ["ACIS SAT 3D Model File", "3D model saved in Spatial's ACIS solid modeling format; stores three-dimensional geometry information in a standard text file format; used for exchanging 3D data between multiple systems and is supported by many 3D CAD programs that include Spatial's 3D ACIS Modeler component.", "Windows, Mac, Linux, Web, iOS, Android, Windows Phone, ", "['Spatial 3D ACIS Modeler', 'Autodesk AutoCAD 2017', 'IMSI TurboCAD Pro 2017', 'Dassault Systemes SolidWorks', 'Adobe Acrobat DC', 'Autodesk Fusion 360']['Spatial 3D ACIS Modeler', 'Autodesk AutoCAD 2017', 'IMSI TurboCAD Deluxe v10', 'Dassault Systemes SolidWorks', 'Adobe Acrobat DC', 'Autodesk Fusion 360']['Spatial 3D ACIS Modeler']['ShareCAD.org', 'Autodesk Fusion 360']['Autodesk Fusion 360']['Autodesk Fusion 360']['Autodesk Fusion 360']"], "saver": ["Mac OS X Screen Saver", "Screen saver for Mac OS X; runs when the computer has been idle for a specific amount of time; may be included with the Mac OS X operating system or created by a third-party developer.", "Mac, ", "['Apple OS X']"], "sbc": ["Office Accounting Company Shortcut File", "Company file shortcut saved by Microsoft Office Accounting, an online banking program; stores a shortcut that points to the location of the .SBD accounting data file; commonly saved to a shared folder so multiple users can access accounting information from different computers.", "Windows, ", "[]"], "sbd": ["Office Accounting Company Data File", "Company accounting database created by Microsoft Office Accounting, a program used for online banking; contains company bank account data, payroll, bills, and other financial information; used to track financial data for businesses online.", "Windows, Windows, Windows, Mac, ", "[][]['DNASTAR Lasergene', 'GSL Biotech SnapGene', 'Heracle BioSoft DNA Baser', 'Genome Compiler', 'text editor']['DNASTAR Lasergene', 'GSL Biotech SnapGene', 'Genome Compiler', 'text editor']"], "sb2": ["Scratch 2.0 Project File", "An SB2 file is a program created with Scratch, an application development platform created at the Massachusetts Institute of Technology (MIT).  It contains Scratch programming language code used for creating stories, small games, and animations.  SB2 files replace the original Scratch .SB files.", "Windows, Mac, Linux, Web, ", "['MIT Scratch', 'Panther', 'Snap!']['MIT Scratch', 'Snap!']['MIT Scratch', 'Snap!']['MIT Scratch']"], "sb": ["Scratch Project File", "An SB file is a project created by Scratch, an application development platform created at MIT (the Massachusetts Institute of Technology).  It contains all the project information including any imported media such as sprites, sounds, and images.  SB files were replaced by .SB2 files, which are saved in the Scratch 2.0 format.", "Windows, Mac, Linux, Web, Windows, Linux, Windows, Mac, ", "['MIT Scratch', 'Panther', 'Snap!']['MIT Scratch', 'Snap!']['MIT Scratch', 'Snap!']['MIT Scratch']['Microsoft Small Basic', 'Microsoft Notepad', 'text editor']['Slax']['Apple QuickTime Player']['Apple QuickTime Player']"], "saveddeck": ["Nokia Saved Web Page", "Web page saved by a Nokia smartphone, such as the Nokia S60 or 6600; can be opened using the phone's Web browser application.", "Windows, ", "['Nokia PC Suite']"], "savedsearch": ["Spotlight Saved Search", "Search saved using Apple's Spotlight program, included with Mac OS X 10.4 and later; saved as a \"Smart Folder,\" which dynamically updates based on the search parameters saved with the folder.", "Mac, ", "['Apple Finder']"], "sas7bdat": ["SAS Data Set File", "Database storage file created by Statistical Analysis System (SAS) software to store data; contains binary encoded datasets used for advanced analytics, business intelligence, data management, predictive analytics, and more. ", "Windows, Linux, ", "['SAS Institute SAS']['SAS Institute SAS']"], "sas": ["SAS Program File", "Program written for SAS (Statistical Analysis Software), a group of applications developed for data modeling and analysis; contains SAS program code saved in standard ASCII text format; used for executing processes or jobs within SAS programs.", "Windows, Linux, ", "['File Viewer Plus'][]"], "sami": ["Grand Theft Auto San Andres Mod Installer File", "Backup file created by San Andreas Mod Installer, a modification installer for the PC version of the popular open world action-adventure video game Grand Theft Auto San Andreas; file contains the custom modifications the user can create for use in the game, including automatic vehicle replacements (such as replacing a certain make of vehicle with another), or other modifications made to custom vehicles.", "Windows, ", "['San Andreas Mod Installer', 'Rockstar Games Grand Theft Auto: San Andreas']"], "sar": ["Sibelius Arrange Style", "Stores musical arrangements used by Sibelius music notation software; allows songs with similar styles to be composed from the same basic configuration; may include instruments, track configurations, meter, tempo, and other settings.", "Windows, Mac, Mac, Linux, Windows, Mac, Linux, ", "[][]['The Unarchiver'][]['Newera Graphics Converter Pro', 'XnViewMP']['XnViewMP']['XnViewMP']"], "sai": ["PaintTool SAI Image", "Image created by PainTool SAI, a lightweight painting application for Windows; contains a drawing created by the user; supports multiple independent editing layers; can be exported to standard bitmap images or the .PSD format.", "Windows, ", "['SYSTEMAX PaintTool SAI']"], "syw": ["Yamaha SY99/SY85 Audio File", "16-bit audio wave sample saved by the Yamaha SY99 (released in 1991) and SY85 (released in 1992) synthesizers.", "Windows, ", "['FMJ-Software Awave Studio']"], "sap": ["Atari SAP Music File", "Audio file commonly used by older Atari systems that have the POKEY sound chip; contains a \"chiptune,\" which specifies a sound format that allows the sound card chip to synthesize and sequence sounds in real time; used for playing back video game music.", "Windows, Mac, Linux, ", "['Audio Overload', 'SAP Player', 'Nullsoft Winamp with SAP plug-in', 'ASAP']['Audio Overload', 'Cog']['Audio Overload', 'PenguinSAP']"], "syx": ["MIDI System Exclusive Message", "Contains raw MIDI System Exclusive (SysEx) messages; allows a computer to communicate with external MIDI-compatible devices, such as backing up patch data from a synthesizer to a computer's hard drive.", "Windows, Mac, ", "['Cakewalk SONAR X3'][]"], "sys": ["Windows System File", "A SYS file is a system file used by Microsoft DOS and Windows operating systems.  It contains system settings and variables, as well as functions that are used to run the operating system.  SYS files are commonly used to store device drivers and other core Windows functions.", "Windows, Mac, Windows, ", "['Microsoft Windows']['Parallels Desktop for Mac with Windows installed'][]"], "syn": ["SimSynth Document", "Audio document created by SimSynth, a software synthesizer application; contains presets for an audio sample, including oscillator settings, envelopes, filters, and effects; used for creating samples and loops for brass, strings, or other instruments.", "Windows, Windows, Windows, Windows, ", "['SimSynth', 'Image-Line FL Studio']['Adobe RoboHelp']['Helios TextPad']['Clyde Broadcast Synergy On Air']"], "sym": ["Symbols File", "Developer file used by software development applications; saves non-essential information for the actual program binary executable files, but instead contains symbols that can be used for gathering program information while debugging; can include function and variable names and other useful debugging information.", "Windows, Mac, Linux, Mac, Linux, Windows, ", "['Eclipse CDT']['Eclipse CDT', 'GDB']['Eclipse CDT', 'GDB']['gEDA']['gEDA']['TatukGIS Viewer']"], "sxt": ["Propellerhead Reason NN-XT Patch File", "File used by NN-XT, an advanced audio and instrument sampler used for sound design and instrument emulation; saves a \"patch,\" which includes fine-tuned audio settings that tailor the audio to provide a particular sound output.", "Windows, Mac, ", "['Propellerhead Reason']['Propellerhead Reason']"], "syh": ["Synchomatic Instrument", "Software instrument format used by Synchomatic, a software synthesizer with a 32-bit synthesis engine based on a custom algorithm; supports eight waveforms, one oscillator, one LFO, one envelope generator, and a programmable filter.", "Windows, ", "[]"], "sxi": ["StarOffice Impress Presentation", "Presentation originally created by StarOffice Impress, a program used for creating slide shows; generally follows a slide layout template and contains a title slide followed by content slides; supports audio, video, and transition effects.", "Windows, Mac, Linux, ", "['Apache OpenOffice', 'LibreOffice']['Apache OpenOffice', 'Planamesa NeoOffice', 'LibreOffice']['Apache OpenOffice', 'LibreOffice']"], "sxw": ["StarOffice Writer Document", "Word processing document originally created by StarOffice Writer, the word processor included with StarOffice suite; based on the OpenDocument XML format and is compatible with Apache OpenOffice (formerly OpenOffice.org) Writer, the successor to StarOffice Writer.", "Windows, Mac, Linux, ", "['Apache OpenOffice', 'LibreOffice']['Apache OpenOffice', 'Planamesa NeoOffice', 'LibreOffice']['Apache OpenOffice', 'LibreOffice']"], "sxd": ["ArcScene Document", "Document created by ArcScene, an application used for visualizing GIS data in 3D; stores links to the data sources for the scene; also stores the scene's view properties and layers; used for rendering 3D views of the GIS data.", "Windows, Windows, Mac, Linux, ", "['ESRI ArcGIS for Desktop']['Apache OpenOffice']['Apache OpenOffice', 'Planamesa NeoOffice']['Apache OpenOffice']"], "sxc": ["StarOffice Calc Spreadsheet", "Spreadsheet created by StarOffice Calc; supports formulas, functions, charts, and macros; also includes DataPilot tables, which can automatically extract and summarize data from raw data sets.", "Windows, Mac, Linux, ", "['Apache OpenOffice', 'LibreOffice']['Apache OpenOffice', 'Planamesa NeoOffice', 'LibreOffice']['Apache OpenOffice', 'LibreOffice']"], "sx": ["SimplexNumerica Data File", "File created by SimplexNumerica, a program used for object-oriented numerical analysis, plot generation, and presentations; can store raw data, 2D and 3D plots, diagrams, mathematical functions, and other data for presenting data analyses.", "Windows, ", "['SimplexNumerica']"], "swz": ["Adobe Flash Player Cache File", "Cache file introduced with version 9 of Adobe Flash Player; contains data that has been digitally signed by Adobe; allows data to be cached within the Flash Player, similarly to how a browser caches data.", "Windows, Mac, Linux, ", "['Adobe Flash Player', 'Adobe Flash Builder 4.7 Premium', 'Adobe Flash Professional CC', 'Adobe Flex']['Adobe Flash Player', 'Adobe Flash Builder 4.7 Premium', 'Adobe Flash Professional CC', 'Adobe Flex']['Adobe Flash Player']"], "swt": ["Flash Generator Template", "Template used by Adobe Flash, a multimedia authoring program; often used as a starting point for creating a Flash animation; may also be be used for buttons or other items that can be imported into an existing Flash animation.", "Windows, Mac, ", "['Adobe Flash Professional CC']['Adobe Flash Professional CC']"], "swj": ["SolidWorks Journal File", "Log file created by SolidWorks, a CAD modeling program; created when the user starts a session and stores a log, or \"journal,\" of the actions taken during the session; saved in a plain text format and is useful for creating macros.", "Windows, ", "['Dassault Systemes SolidWorks']"], "swp": ["Swap File", "Swap file used by the virtual memory component of an operating system; contains data that has been swapped from memory to the hard disk; helps increase the amount of available memory to a computer; also helps make accessing commonly used data more efficient.", "Windows, Mac, Windows, Mac, Linux, ", "['Microsoft Windows', 'Microsoft MS-DOS']['Apple OS X']['gVim']['MacVim', 'Vim']['Vim']"], "swk": ["StudyWorks Save File", "File saved by Studyworks software, such as Mathematics Complete, a study program for elementary to college math; contains saved answers to problems or questions from StudyWorks software.", "Windows, ", "[]"], "switch": ["Switch Package", "Secure package that contains files encrypted with AES-256 encryption; created with Switch, a secure file management program; also includes information that allows users to see when the package was opened or if unauthorized users have tried to access it.", "Windows, ", "[]"], "swift": ["Swift Source Code File", "A SWIFT file is a source code file written in Swift, a programming language introduced by Apple with iOS 8 and OS X Yosemite.  It is designed for writing and compiling apps and can be used with Xcode beginning with Xcode 6.", "Mac, iOS, ", "['Apple Xcode', 'text editor']['Apple Swift Playgrounds']"], "swi": ["SWiSH Project File", "An SWI file is a Flash project developed with SWiSH, an easy-to-use Flash authoring tool.  It can be used to create basic Flash animations, interactive Flash programs, and web-oriented Flash projects that can access database information.  SWI files may also be used to convert video and PowerPoint files to Flash documents.", "Windows, ", "['SWiSHzone.com SWiSH Max']"], "swf": ["Shockwave Flash Movie", "An SWF file is an animation created with Adobe Flash that can be played by Flash Player or with a web browser that has the Flash plugin installed.  It may contain text, vector and raster graphics, and interactive content written in ActionScript.", "Windows, Mac, Linux, Android, ", "['Adobe Flash Player', 'Adobe Flash Professional CC', 'Adobe Dreamweaver CC 2017', 'Eltima SWF & FLV Player', 'Eltima Flash Decompiler Trillix', 'Xilisoft Video Converter Ultimate', 'GRETECH GOM Player', 'Media Player Classic', 'GlobFX Swiff Player', 'DCOMSOFT SWF Protector', 'Web browser']['Adobe Flash Player', 'Adobe Flash Professional CC', 'Adobe Dreamweaver CC 2017', 'Eltima Elmedia Player', 'Eltima Flash Decompiler Trillix', 'Eltima Flash Optimizer', 'Echo One iSwiff', 'DCOMSOFT SWF Protector', 'Web browser']['Adobe Flash Player', 'DCOMSOFT SWF Protector', 'Web browser']['BIT LABS SWF Player']"], "swd": ["Flash Debug File", "Information file created during the debugging process of a Flash program; allows the Flash debugger to display the current place of execution directly in the ActionScript sources instead of the program bytecode.", "Windows, Mac, ", "['Adobe Flash Professional CC']['Adobe Flash Professional CC']"], "svx": ["Survex Cavern Data File", "ASCII text file created in the Survex format, a raw data format used for capturing cave surveying information; contains \"centreline\" data which includes the logged locations in the cave; used for mapping caves, exploring relationships between cave systems, and creating 3D visualizations.", "Windows, Mac, Linux, Windows, Mac, ", "['Survex', 'text editor']['Survex', 'text editor']['Survex', 'text editor'][][]"], "svn-work": ["Subversion Cache File", "Client-side cache file generated by Subversion, a version control development program; used by a Concurrent Versions System (CVS) to track program changes and updates.", "Windows, Mac, Linux, ", "[][][]"], "swa": ["Shockwave Audio", "Audio file originally created for Macromedia Shockwave (now Adobe Shockwave), the predecessor to Flash; saves audio data in a compressed format similar to an .MP3 file; originally used as the audio portion of Flash (.SWF) animations.", "Windows, Mac, Linux, ", "['Adobe Director', 'Web browser']['Adobe Director', 'Web browser']['Web browser']"], "sw2": ["Softwrap License File", "License control file created by Softwrap, a software DRM program often used for e-commerce applications; stores the software license that authorizes a program to be used by a specific user or group.", "Windows, ", "[]"], "svn-base": ["Subversion Base File", "File created by Subversion, an open source version control system; stores a base copy of a file that is checked out from the Subversion repository; used to compare the working copy of a project file against its latest checked out version.", "Windows, Mac, Linux, ", "['Eclipse IDE for Java Developers', 'Microsoft Visual Studio with VisualSVN plug-in']['Eclipse IDE for Java Developers']['Eclipse IDE for Java Developers']"], "swc": ["Flex Components Archive", "Contains a group of components and other assets used by an Adobe Flex application; includes a .SWF file and a catalog.xml file, which lists the contents of the package and the individual components; generated by the Animate authoring tool and compressed using the PKZIP archive format.", "Windows, Mac, Windows, Mac, Linux, ", "['Adobe Flex', 'Adobe Animate CC 2017', 'Adobe Flash Builder 4.7 Premium']['Adobe Flex', 'Adobe Animate CC 2017', 'Adobe Flash Builder 4.7 Premium']['Snes9x']['Snes9x']['Snes9x']"], "svs": ["Game Boy Advance Saved State File", "Contains saved data from an emulated Game Boy Advance (GBA) video game; allows the game to be saved and resumed from the saved state; may be generated by gpSP (game play SP), a GBA emulation program.", "Windows, Mac, ", "[][]"], "svi": ["Samsung Video File", "Video format used by Samsung portable video players such as the YP-T9, YP-T10, and YP-P2; can be converted from other formats using Samsung Media Studio; similar to an .AVI file, but serves as a container specifically for MPEG-4 video data.", "Windows, Mac, Linux, ", "['Samsung Media Studio', 'GRETECH GOM Player', 'VideoLAN VLC media player']['VideoLAN VLC media player']['VideoLAN VLC media player']"], "sv5": ["BigJig Saved Puzzle", "Saved puzzle for BigJig 5, a jigsaw puzzle game; stores the user's progress in completing the puzzle; automatically launches BigJig when the file is double-clicked (v. 5.03 and later).", "Windows, Windows, ", "[][\"Chris Sawyer's Locomotion\", 'Chris Sawyer RollerCoaster Tycoon']"], "svg": ["Scalable Vector Graphics File", "An SVG file is a graphics file that uses a two-dimensional vector graphic format created by the World Wide Web Consortium (W3C).  It describes images using a text format that is based on XML.  SVG files are developed as a standard format for displaying vector graphics on the web.", "Windows, Mac, Linux, Web, Android, Windows, ", "['File Viewer Plus', 'Microsoft Visio 2016', 'CorelDRAW Graphics Suite X8', 'Corel PaintShop Pro X9', 'GIMP', 'Inkscape', 'CADSoftTools ABViewer', 'Adobe Illustrator CC 2017', 'Adobe InDesign CC 2017', 'Web browser']['Inkscape', 'GIMP', 'Adobe Illustrator CC 2017', 'Adobe InDesign CC 2017', 'Web browser']['GIMP', 'Kolourpaint', 'Inkscape', 'Web browser']['Google Drive']['File Viewer for Android']['GTA2 Saved Game Editor']"], "svf": ["Serial Vector Format File", "File created for testing programmable logic device (PLD) designs; contains instructions for one or more test cases, such as for combinational logic checks; used for debugging printed circuit boards (PCBs), integrated circuits (ICs), and embedded systems.", "Windows, Windows, ", "['Xilinx ISE Design Suite', 'Xilinx ISE WebPACK']['SoftSource Vdraft']"], "svd": ["Scanning Vibrometer Data File", "Data file created by Polytec scanning vibrometer devices, which are used for measuring the durability of objects that are subjected to stresses and strains; contains a log of the data collected during a stress test; provided as input to PSV Software, a program that visualizes the stress results.", "Windows, Windows, Windows, Mac, ", "['Polytec PSV Software']['Solid Concepts SolidView']['Roland XV Editor']['Roland XV Editor']"], "sv2i": ["Symantec System Index File", "System index file created by Backup Exec System Recovery, a program used to backup and recover Windows computers in small business environments; contains an index of system information at the time of the backup; provides fast lookup information that reduces the time required to restore backups.", "Windows, ", "['Symantec Backup Exec 15', 'VMware vCenter Converter']"], "svgz": ["Compressed SVG File", "Scalable Vector Graphics (.SVG) file compressed with GZIP compression; contains graphics data in an XML format; supports graphical elements including transparency, gradients, animations, and filters.", "Windows, Mac, Linux, ", "['File Viewer Plus', 'Adobe Illustrator CC 2017', 'Adobe SVG Viewer', 'Corel PaintShop Pro X9', 'Serif DrawPlus', 'Inkscape']['Adobe Illustrator CC 2017', 'Adobe SVG Viewer', 'Inkscape']['Adobe SVG Viewer', 'Inkscape']"], "sv$": ["AutoCAD Automated Backup File", "Backup file created by AutoCAD 2D and 3D design software; stores a backup of the current working design (.DWG file) and is created automatically by the software; automatically deleted when the software successfully shuts down.", "Windows, Mac, ", "['Autodesk AutoCAD 2017']['Autodesk AutoCAD 2017']"], "sup": ["Super Project Definition File", "Contains a list of Super Project Data (.SUD) files; can be loaded by Super Project Analyzer, a software development analysis and reporting program; contains references to the data files, but does not contain the actual project data itself.", "Windows, Windows, ", "[]['DVDSupTools', 'SupRip', 'SupViewer', 'SubtitleCreator', 'Avisynth', 'IfoEdit', 'VobEdit']"], "suo": ["Visual Studio Solution User Options File", "User information file that stores data in a structured binary format; referenced by VSPackages created with Visual Studio; opened by the LoadUserOptions Method and modified by the WriteUserOptions and SaveUserOptions methods.", "Windows, ", "['Microsoft Visual Studio 2017']"], "sum": ["Scilab Unit Operation Model File", "Model file created and used by Scilab CAPE-OPEN Unit Operation, an application that enables users to enter unit operation calculations in Scilab; contains a Scilab unit operation model and its metadata.", "Windows, Windows, ", "['AmsterCHEM Scilab CAPE-OPEN Unit Operation']['Garmin Connect']"], "suit": ["Macintosh Font Suitcase", "Font format used primarily by Mac OS Classic (Mac OS 9.2.2 and earlier); contains a single TrueType font or collection of fonts; should be stored in the System Folder/Fonts folder.", "Mac, ", "['Apple OS X', 'Apple Font Book']"], "suf": ["Ccrypt Encrypted File", "File encrypted with ccrypt, an open-source encryption utility; uses an asymmetric encryption algorithm based on the Rijndael cipher; requires a password to open.", "Windows, Mac, Linux, ", "[][][]"], "sud": ["Super Project Analyzer File", "Project saved by Super Project Analyzer, a program that analyzes software development projects; contains information about files, procedures, constants, variables, data types and enums.", "Windows, Windows, ", "[][]"], "suck": ["SiteSucker Website File", "Offline website data file created by SiteSucker, a Mac program used to download websites for offline viewing; saves a list of websites that have been used for offline download; enables users to manage downloaded websites and open them on the local computer.", "Mac, ", "['SiteSucker']"], "sublime-project": ["Sublime Text Project File", "Project file created by Sublime Text, a text editor used for code, markup, and prose; contains the project settings; JSON configured; 1 file of 2 that makes up a Sublime Text project, the other file is .SUBLIME-WORKSPACE.", "Windows, Mac, Linux, ", "['Sublime Text 3']['Sublime Text 3']['Sublime Text 3']"], "sublime-workspace": ["Sublime Text Workspace File", "File created by Sublime Text, a text editor; contains folders opened and created by the user; JSON configured; referenced when its counterpart, .SUBLIME-PROJECT, is opened.", "Windows, Mac, Linux, ", "['Sublime Text 3']['Sublime Text 3']['Sublime Text 3']"], "sublime-package": ["Sublime Text Package File", "Package used by Sublime Text, a text editor used primarily to edit source code; contains a collection of resources, which includes plugins, menus, themes, snippets, and syntax highlighting definitions that provide functionality to the application.", "Windows, Mac, Linux, ", "['Sublime Text 3']['Sublime Text 3']['Sublime Text 3']"], "sub": ["Subtitle File", "Text file containing subtitles used by MicroDVD, DivX, and other movie formats; includes subtitle text and cue points for when each subtitle should be displayed; often saved along with a corresponding video file and referenced during playback.", "Windows, Mac, Linux, iOS, Android, Windows, Windows, ", "['CyberLink PowerDVD 16', 'URUWorks Subtitle Workshop', 'MPlayer', 'SoftNI Subtitler Suite', 'Universal Subtitle Viewer', 'text editor']['MPlayer', 'text editor']['MPlayer', 'Gnome Subtitles', 'KSubtile', 'text editor']['olimsoft OPlayer']['J2 Interactive MX Player'][][]"], "styk": ["Stykz Stick Figure", "Stick figure created with Stykz, a simple animation program; also called a \"Stykz figure;\" contains a single stick figure or object designed with Stykz; saved in a standard format that can be shared between Stykz users.", "Windows, Mac, ", "[][]"], "style": ["SketchUp Style", "Sketch style that can be applied to a drawing created with Google SketchUp, a 3D modeling program; examples include wavy pencil lines, graphite stick marks, or quick pen strokes; often used to make a CAD model look hand-drawn.", "Windows, Mac, Windows, ", "['Trimble SketchUp', 'Trimble Style Builder']['Trimble SketchUp', 'Trimble Style Builder']['ESRI ArcGIS for Desktop']"], "stu": ["Pinnacle Studio Project File", "Project file created by Pinnacle Studio, a program used to create and edit videos; stores all project information, including video, audio, effects, and timelines; used to save and load video projects.", "Windows, ", "['Pinnacle Studio 20']"], "stykz": ["Stykz Animation", "Animation created with Stykz, a free multiplatform stick figure animation program similar to Pivot StickFigure Animator; contains lines and shapes that can be animated frame-by-frame.", "Windows, Mac, ", "[][]"], "sty": ["LaTeX Style", "Style definition file used for formatting a LaTeX (.TEX or .LTX) document; defines line styles, labels, how formulas should be aligned, and other information; saved in a text format in which definitions begin with a backslash (\\) and comments begin with a percentage sign (%).", "Windows, Mac, Linux, Windows, Mac, Windows, Mac, Windows, Mac, Linux, Windows, Mac, ", "['File Viewer Plus', 'MiKTeX', 'TeXnicCenter', 'TeXworks', 'Texmaker', 'proTeXt', 'LaTeX Editor']['LyX/Mac', 'TeXworks', 'Texmaker', 'Skim', 'MacroMates TextMate']['Texmaker']['One Man Band Originals', 'One Man Band Essentials']['One Man Band Essentials']['PG Music Band-in-a-Box']['PG Music Band-in-a-Box']['Aegisub']['Aegisub']['Aegisub'][][]"], "stx": ["Pinnacle Studio Project File", "Project file created by Pinnacle Studio video editing software; contains video project settings and references to media and other data files used by the project.", "Windows, Windows, Mac, Linux, ", "['Pinnacle Studio 20']['OpenMPT', 'MikMod']['CocoModX', 'MikMod'][]"], "stt": ["Streets & Trips Map Template", "Map template saved with Microsoft Streets & Maps, a consumer-oriented travel and map program; used as a starting point for creating custom maps (.EST files); may include basic map settings, as well as routes, symbols, legends, and other information.", "Windows, Windows, Mac, Windows, Mac, Linux, ", "['Microsoft Streets & Trips']['Kaspersky Internet Security 2017', 'Kaspersky Anti-Virus 2017']['Kaspersky Internet Security for Mac']['IBM SPSS']['IBM SPSS']['IBM SPSS']"], "strm": ["Stream File", "File created for multimedia applications, such as Kodi and Plex; contains a URL address that is scanned and accessed by the multimedia application in order to stream the audio or video content from the URL address.", "Windows, Mac, Linux, iOS, Android, Windows Phone, ", "['Kodi', 'Plex']['Kodi', 'Plex']['Kodi', 'Plex']['Kodi', 'Plex']['Kodi', 'Plex']['Plex']"], "strings": ["Text Strings File", "Contains text strings referenced by a Mac OS X program; used for alerts, errors, and status messages; often several STRINGS files are stored within the Resources folder of an OS X application package; they are not meant to be opened or edited by the user.", "Mac, ", "['Apple Xcode', 'MacroMates TextMate', 'Apple TextEdit']"], "str": ["dBASE Structure List Object File", "Text file that defines the structure of  a dBASE database; contains a list of all objects that can be included in the database file; includes the number, names, and widths of each field in the database.", "Windows, Windows, Mac, Linux, Windows, Mac, Linux, Windows, Windows, Windows, ", "['dBase']['X-Plane']['X-Plane']['X-Plane']['PsxMC', 'PSMPlay', 'PSXPlay', 'jPSXdec']['jPSXdec']['jPSXdec']['Electronic Arts Lord of the Rings: Battle for Middle Earth 2'][]['Kingsoft WPS Office']"], "stproj": ["Samsung Theme Document", "Project file created by Samsung Theme Designer, a program that allows developers to create custom themes for various Samsung mobile devices; saves the visual layout of the theme and references to .PNG graphic files, which are used for the buttons, background, etc; can be exported to an .SMT theme file, which can then be uploaded to the mobile phone.", "Windows, Mac, ", "['Samsung Theme Designer']['Apple iAd Producer']"], "storyboard": ["Interface Builder Storyboard Document", "Developer file introduced with Xcode 4.2, an IDE used for creating Mac OS X and iOS applications; stores screen layouts for an application as well as the ways the screens interact with each other through application events.", "Mac, ", "['Apple Xcode']"], "storymill": ["StoryMill Project File", "Project file created by StoryMill, an application used to write novels; stores the book's written chapters as well as information for actors, scenes, and locations; also stores tasks and research data used during the writing process.", "Mac, ", "['Mariner StoryMill']"], "stp": ["STEP 3D CAD File", "An STP file is a 3D assembly file supported by various mechanical design programs such as TurboCAD and Fusion 360.  It contains three-dimensional object data saved in the Standard for the Exchange of Product Data (STEP) format.  STP files are saved in a text-based ASCII format that conforms to the STEP Application Protocols ISO 10303-2xx.  ", "Windows, Mac, Linux, Web, iOS, Android, Windows Phone, Windows, Windows, Windows, ", "['IMSI TurboCAD Pro 2017', 'ideaMK STP Viewer', 'Autodesk Fusion 360', 'Dassault Systemes CATIA', 'LKSoft IDA-STEP', 'STEP Tools STEP File Browser', 'FreeCAD', 'CADSoftTools ABViewer']['IMSI TurboCAD Deluxe v10', 'FreeCAD', 'Autodesk Fusion 360']['Dassault Systemes CATIA', 'LKSoft IDA-STEP', 'FreeCAD']['ShareCAD.org', 'Autodesk Fusion 360']['Autodesk Fusion 360']['Autodesk Fusion 360']['Autodesk Fusion 360']['Adobe RoboHelp']['Microsoft Windows SharePoint Services']['Appricon Analysis Studio']"], "sto": ["PRO100 3D Interior Design Project", "Furniture and interior design project file (or scene) created by PRO100, a user-friendly software program for designing room interiors with instant 3D visualization; designs created by the software can be easily printed.", "Windows, ", "[]"], "story": ["Storyist Document", "Document created by Storyist, a story writing tool created for novelists and screenwriters; saves written text as well as layout information, notes, and chapter outline information; helps authors track the plot, characters, and setting information along with the script.", "Mac, ", "['Storyist']"], "stm": ["Exchange Streaming Media File", "Data file saved by Microsoft Exchange Server in conjunction with .EDB files; used by the Exchange information store, which is comprised of:\r\n\r\nPriv1.edb\r\nPriv1.stm\r\nPub1.edb\r\nPub1.stm\r\n\r\nSTM files store streamed native Internet content.  New messages are saved to the STM file on the mail server until they are accessed by a user's mail client.  When messages are accessed by a MAPI client, they are transferred to the EDB file and converted to the native Exchange format.", "Windows, Windows, Mac, Linux, Windows, Mac, ", "['Microsoft Exchange Server', 'Stellar Phoenix Mailbox Exchange Recovery']['OpenMPT', 'Schism Tracker', 'Nullsoft Winamp', 'MikMod']['CocoModX', 'Schism Tracker', 'MikMod']['Schism Tracker']['Web browser']['Web browser']"], "stl": ["Stereolithography File", "Design format used for stereolithography, a rapid prototyping technology used for producing three-dimensional parts; contains a 3D design used as a master model for creating numerous prototypes.", "Windows, Mac, Linux, Windows, Windows, Mac, Linux, Windows, Mac, Windows, Mac, ", "['IMSI TurboCAD Pro 2017', 'GOM Inspect', 'ideaMK STL Viewer', 'Parametric Technology Creo', 'Dassault Systemes CATIA', 'Kubotek USA KeyCreator', 'MeshLab']['IMSI TurboCAD Deluxe v10', 'Cheetah3D', 'MeshLab', 'GLC_Player']['Parametric Technology Creo', 'Dassault Systemes CATIA', 'MeshLab', 'GLC_Player']['Microsoft Internet Information Services (IIS)']['SuperTux']['SuperTux']['SuperTux']['EZTitles', 'Avid Media Composer']['Apple Final Cut Pro X', 'Apple DVD Studio Pro', 'Avid Media Composer']['Adobe Fireworks']['Adobe Fireworks']"], "stk": ["Stickfigure Animator File", "Two-dimensional stick figure model created with Stickfigure Animator, a stick figure animation program; includes a bitmap image with different motion points that can be moved or animated; can be used to create a chain of animation frames that can be saved as an animated .GIF file.", "Windows, ", "['Pivot Stickfigure Animator']"], "sth": ["Lotus Domino Stash File", "Secure file that stores the password for a Lotus Domino key ring (.KYR) file; generated automatically when the server key ring is created; saved with the same name as the key ring file; should be saved in both the Notes data directory of the client machine and the Domino directory of the server.", "Windows, Windows, Mac, ", "['IBM Domino', 'IBM Lotus Notes']['IK Multimedia SampleTank']['IK Multimedia SampleTank']"], "stg": ["ActiveSync Backup File", "Backup created by ActiveSync, a program used to synchronize PCs with mobile devices; contains a backup of all mobile device files, including contacts, notes, and calendar data; typically seen with the filename backup.stg.", "Windows, ", "['Microsoft ActiveSync']"], "step": ["STEP 3D Model", "A STEP file is a 3D model file formatted in STEP (Standard for the Exchange of Product Data), an ISO standard exchange format.  It contains three-dimensional data in a format that can be recognized by multiple programs.", "Windows, Mac, Linux, Web, iOS, Android, Windows Phone, ", "['Dassault Systemes SolidWorks', 'IMSI TurboCAD Pro 2017', 'Autodesk Fusion 360', 'Kubotek USA KeyCreator', 'STEP Tools STEP File Browser', 'Dassault Systemes CATIA', 'Siemens Solid Edge', 'SpaceClaim Engineer', 'FreeCAD', 'CADSoftTools ABViewer']['IMSI TurboCAD Deluxe v10', 'FreeCAD', 'Autodesk Fusion 360']['Dassault Systemes CATIA', 'FreeCAD']['Autodesk Fusion 360']['Autodesk Fusion 360']['Autodesk Fusion 360']['Autodesk Fusion 360']"], "stencyl": ["Stencyl Game File", "Game file created and used by Stencyl, a cross-platform game creation program that supports Windows, OS X, Linux, iOS, Android, and Flash games; contains an exported game and its resources, which includes scenes, backgrounds, tilesets, sounds, actor types, scene behaviors, and actor behaviors.", "Windows, Mac, Linux, ", "['Stencyl']['Stencyl']['Stencyl']"], "ste": ["Dreamweaver Site Settings File", "Site settings file created by Dreamweaver, a program used to create Web sites; contains site publishing information, such as the remote server, login name, encrypted password, remote folder, and local folder; used for backing up and reusing site settings.", "Windows, Mac, Windows, ", "['Adobe Dreamweaver CC 2017', 'text editor']['Adobe Dreamweaver CC 2017', 'text editor'][]"], "stdl": ["Swift To-Do List Database", "Data file created by Swift To-Do List, a personal organization software used for recording to-do lists; saves a backup of the to-do database, and includes one or more to-do lists which can include one or more tasks; stores the description, priority, type, and due date for each task.", "Windows, ", "['Dextronet Swift To-Do List']"], "std": ["Apache OpenOffice Drawing Template", "Template created by Apache OpenOffice Draw, a vector-based drawing program; contains default drawing elements that can be used as the basis for creating new .SXD files; enables users to create multiple drawings with a similar look and feel.", "Windows, Mac, Linux, Windows, Windows, ", "['Apache OpenOffice', 'LibreOffice']['Apache OpenOffice', 'Planamesa NeoOffice', 'LibreOffice']['Apache OpenOffice', 'LibreOffice']['Memorex exPressit Label Design Studio']['PROMT Translator 12']"], "stc": ["Contribute Connection Key File", "Connection file created by Contribute, an Adobe program used for website development and publishing; saves the remote host, the connection protocol (e.g., FTP, SFTP, etc.) and the username; enables users to reuse connection information and distribute it among website developers.", "Windows, Mac, Windows, Mac, Linux, Windows, Mac, Linux, Windows, Mac, Windows, ", "['Adobe Contribute 6.5']['Adobe Contribute 6.5']['Celestia']['Celestia']['Celestia']['Apache OpenOffice', 'LibreOffice']['Apache OpenOffice', 'Planamesa NeoOffice', 'LibreOffice']['Apache OpenOffice', 'LibreOffice']['CELSYS Clip Studio Paint Pro']['CELSYS Clip Studio Paint Pro']['Microsoft Notepad', 'text editor']"], "stap": ["Soundtrack Pro Audio Project File", "File created by Soundtrack Pro, an audio production application used for film and videos; supports both multitrack and waveform editing in the same project and can be synchronized to video; includes references to audio clips as well as any editing decisions.", "Mac, ", "['Apple Soundtrack Pro']"], "stb": ["AutoCAD Plot Style Table File", "File used by AutoCAD, a CAD program used for 2D and 3D drawing; contains plot styles, or mappings of colors and line weights to drawing objects; stores properties such as color, dither, grayscale, pen number, line weight, fill style, and line start and end styles; used to attach reusable display properties to design objects.", "Windows, ", "['Autodesk AutoCAD 2017']"], "sta": ["ABAQUS Status File", "Stores the status of increment summaries written by ABAQUS using the analysis option; ABAQUS is data analysis program used for finite element analysis (FEA); examples of uses for ABAQUS include static and dynamic stress calculation, heat transfer and thermal stress, mass diffusion, and fracture mechanics analysis.", "Windows, Linux, Windows, Mac, Windows, Mac, ", "['text editor']['text editor']['MAME', 'ExtraMAME']['MacMAME', 'MAME OS X']['Adobe Photoshop CC 2017']['Adobe Photoshop CC 2017']"], "st": ["Atari ST Disk Image", "Disk image of an Atari ST program or video game; contains exact data copied from an Atari floppy disk or cartridge; may be opened on a PC using Atari emulation software.", "Windows, Mac, Linux, ", "['File Viewer Plus'][][]"], "ssw": ["Sony Ericsson Firmware File", "Firmware update that updates the system software of a Sony Ericsson mobile phone; used by SETool, a program for \"flashing\" and unlocking Sony Ericsson cell phones; can be transferred to a phone via a USB connection.", "Windows, ", "[]"], "ssv": ["Seavus Secure Project File", "Project file created by Seavus Project Viewer, a program used for viewing Microsoft Project plans (.MPP files); saves a project plan and may hide or lock certain portions of the plan that aren't appropriate for all team members to see; enables project managers to restrict the viewable information in a project plan.", "Windows, ", "['Seavus Project Viewer']"], "sss": ["Coda Style Sheet File", "Style sheet used by Coda, a Web development application; similar to a .CSS file, but contains markup that defines how the Coda source code editor appears; can specify background colors, text colors, fonts, and other information.", "Mac, Windows, ", "['Panic Coda 2']['Stardock WindowBlinds']"], "ssp": ["Scala Server Page", "Web page script created using syntax from HTML and Scala, a general purpose programming language; contains HTML code and embedded \"Ssp\" tags which are evaluated to Web page text; used for generating static Web pages.", "Windows, Windows, Windows, ", "['Scalate']['Bolide Slideshow Creator']['Axialis Screensaver Producer']"], "sslf": ["HLSW Shared Server List File", "List of servers saved in the shared server list format; can be exported and imported by HLSW, a game server browser and administration program; used primarily for keeping track of gaming servers, but can also be used for general server administration on monitoring.\r\n", "Windows, ", "[]"], "ssi": ["Adobe Dreamweaver Server Side Include File", "Developer file used by Adobe Dreamweaver, a Web development application; contains common information that is shared across multiple Web pages; often used for including website templates and shared Web page components.", "Windows, Mac, ", "['Adobe Dreamweaver CC 2017']['Adobe Dreamweaver CC 2017']"], "ssf": ["Trimble Standard Storage Format File", "File used by Trimble GIS mapping software applications, which are used with GPS devices to collect field data; contains GPS position data recorded from a Trimble device; used to log GPS data and create custom coordinate systems.", "Windows, Windows, Mac, Linux, ", "['ESRI ArcGIS for Desktop with Trimble GPS Analyst plug-in']['text editor', 'DirectVobSub']['text editor']['text editor']"], "sseq": ["Nintendo DS Sound File", "Audio file used by games for the Nintendo DS, a portable game system that includes a touch screen; contains sounds and music for the game; used to store audio data for playback during gameplay.", "Windows, Mac, ", "[]['Synclavier Digital SynclavierX']"], "ssd": ["WindowBlinds Skin File List", "Text file that contains a list of skins within a WindowBlinds skin (.WBA) file; includes the number of skins and the title and filename of each skin; serves as a pointer to the corresponding .UIS and .SSS skin files.", "Windows, Mac, ", "['Stardock WindowBlinds']['Simulation Curriculum Starry Night Pro']"], "ssc": ["SourceSafe Status File", "Status file used by Microsoft SourceSafe for source control, which tracks edits and revisions to files; commonly used in business settings, where files may be edited by multiple people; ensures that each file is only edited by one person at a time.", "Windows, Windows, Mac, Linux, Windows, Mac, Linux, Windows, Mac, Linux, ", "['Microsoft Visual SourceSafe', 'Microsoft Visual Studio 2017']['Celestia', 'Microsoft Notepad', 'text editor']['Celestia', 'Apple TextEdit', 'text editor']['Celestia', 'Vim', 'text editor']['StepMania']['StepMania']['StepMania']['Stellarium']['Stellarium']['Stellarium']"], "ssa": ["Sub Station Alpha Subtitle File", "Subtitle format created by a developer named Kotus; used by Sub Station Alpha, an older freeware video subtitle creation program; still supported by some current video editing programs.", "Windows, Mac, Linux, Android, Windows, ", "['MPlayer', 'Mirillis Splash', 'CyberLink PowerDVD 16', 'VirtualDub', 'Aegisub', 'text editor']['MPlayer', 'Aegisub', 'Macgo Mac Media Player']['Aegisub']['J2 Interactive MX Player']['Tilted Mill Entertainment Children of the Nile']"], "ss": ["SilverStripe Source Code File", "Developer file created for SilverStripe, a Web application framework developed in PHP5 using object-oriented techniques; uses the SilverStripe templating language, which allows plain text (such as HTML and XML) to be augmented with loops, conditionals, and other statements; used for producing dynamic page content.", "Windows, Mac, Linux, ", "['File Viewer Plus', 'SilverStripe']['SilverStripe']['SilverStripe']"], "srw": ["Samsung RAW Image", "Digital photo taken by a Samsung digital camera; contains a RAW image captured by the digital camera in a proprietary format; commonly touched up in photo editing software before publishing to the Web or to a digital media publication.", "Windows, Mac, iOS, Android, ", "['File Viewer Plus', 'Samsung RAW Converter', 'Microsoft Windows Photos', 'Adobe Photoshop Elements 15', 'ACD Systems ACDSee 20', 'Adobe Photoshop Lightroom with Camera Raw plug-in', 'CyberLink PhotoDirector 8 Ultra', 'Adobe Photoshop CC 2017']['Samsung RAW Converter', 'Adobe Photoshop Elements 15', 'Adobe Photoshop Lightroom with Camera Raw plug-in', 'Adobe Photoshop CC 2017', 'CyberLink PhotoDirector 8 Ultra']['Adobe Photoshop Express']['Adobe Photoshop Express']"], "srt": ["SubRip Subtitle File", "An SRT file is a subtitle file saved in the SubRip file format.  It is supported by several video formats such as DivX and DVD and used by various video playback programs.  SRT files contain subtitle information, which includes the sequential number of subtitles, start and end timecode, subtitle text.", "Windows, Mac, Linux, iOS, Android, ", "['MPlayer', 'BS.Player', 'CyberLink PowerDirector 15 Ultra', 'CyberLink PowerDVD 16', 'Microsoft Windows Media Player with VobSub plugin', 'VideoLAN VLC media player', 'Media Player Classic', 'Aegisub', 'Jubler', 'text editor']['MPlayer', 'SubCleaner', 'Aegisub', 'Sears', 'VideoLAN VLC media player', 'text editor']['MPlayer', 'Aegisub', 'VideoLAN VLC media player', 'text editor']['olimsoft OPlayer']['J2 Interactive MX Player']"], "srs": ["Outlook Send/Receive Settings File", "Stores send and receive e-mail settings for Microsoft Outlook; can store group settings for users with multiple e-mail accounts; may be modified within Outlook by selecting Options→Mail Setup→Send/Receive Settings.", "Windows, ", "['Microsoft Outlook 2016']"], "srr": ["ReScene Metadata File", "Archive metadata file created by ReScene, a program used to repackage .RAR files released in the Warez scene; contains a backup of all metadata files in the RAR archive; can be combined with the original non-metadata archive files to recreate the original distribution archive.", "Windows, ", "[]"], "srm": ["Super Nintendo ROM Save File", "Game file saved by a Super Nintendo emulation program; created by storing the Saved RAM (SRAM) state in a file so that the game progress can be resumed at a later time; supported by both Snes9x and ZSNES, the two most popular Super Nintendo emulators.", "Windows, Mac, Linux, ", "['Snes9x', 'ZSNES']['Snes9x']['Snes9x', 'ZSNES']"], "srf": ["Server Response File", "File used by Visual Studio .NET applications and processed by the ATL Server engine; may contain both static HTML and script tags that produce dynamically generated content when the page is loaded.", "Windows, Mac, Windows, Mac, Windows, Mac, Android, Windows, Windows, Mac, ", "['Microsoft Visual Studio 2017', 'Web browser']['Web browser']['NewTek LightWave 3D']['NewTek LightWave 3D']['File Viewer Plus', 'Adobe Photoshop CC 2017', 'Adobe Photoshop Elements 15', 'ACD Systems Canvas X 2017', 'CyberLink PhotoDirector 8 Ultra', 'Pholix PhotoPhilia', 'Google Picasa']['Apple Photos', 'Adobe Photoshop CC 2017', 'Adobe Photoshop Elements 15', 'Google Picasa', 'MacPhun ColorStrokes', 'CyberLink PhotoDirector 8 Ultra']['File Viewer for Android']['Golden Software Surfer']['Steinberg Cubase']['Steinberg Cubase']"], "src": ["Source Code", "Source code of a program written in one of many possible programming languages; may be edited with programming software or a basic text editor; can be compiled into an executable program using a software compiler.", "Windows, Mac, ", "['Microsoft Visual Studio 2017', 'Microsoft Notepad', 'Helios TextPad', 'Notepad++']['Apple Xcode', 'Apple TextEdit', 'MacroMates TextMate']"], "sr0": ["SecuROM Analysis File", "File created by SecuROM, a CD/DVD-ROM copy protection technology; created when the \"Launch Analysis\" option is chosen after right-clicking a program executable (.EXE) or related shortcut that is managed by SecuROM; generates an AnalysisLog.sr0 file in the C:\\ directory or on the user's desktop by default.", "Windows, ", "['Sony DADC SecuROM']"], "sqz": ["Squeeze Project File", "Project file created by Squeeze, a program used for transcoding video data; saved in an XML format and contains encoding settings for video files as well as an historical record of conversions; may include options for converting video using remote cloud resources on a Squeeze Server.", "Windows, Mac, ", "['Sorenson Media Squeeze']['Sorenson Media Squeeze']"], "sqx": ["SQX Archive", "File archive compressed using the SQX Archiver, an open-source file compression tool; uses a variation of .LZH as its main compression algorithm; free to download and incorporate into other file compressors.", "Windows, ", "[]"], "sqr": ["SQL Program File", "Program that contains functions and commands written in the Structured Query Language SQL; may be used by various database programs that recognize SQL queries.", "Windows, ", "['Microsoft SQL Server 2016']"], "sqm": ["Service Quality Monitoring File", "Log file created by the Service Quality Monitor program that records events on Windows computers; may include application use, performance, and errors from a program; SQM data can be sent to Microsoft, which helps the company fix and improve software programs.", "Windows, Windows, ", "['Microsoft Windows'][]"], "sqlproj": ["Visual Studio SQL Server Project", "Database development project created by Visual Studio, a Windows software development IDE; stores the schema of the database and can include SQL source code; used for creating databases for SQL Server, Microsoft's relational database management system (RDBMS) software.", "Windows, ", "['Microsoft Visual Studio 2017']"], "sqlitedb": ["SQLite Database", "Database file stored using SQLite, a database engine often used to create embedded SQL-based databases; stores data using records, which contain data types and values; most commonly used for storing contact information on iPhone devices.", "Windows, Mac, Linux, ", "['SQLite', 'Sqliteman', 'SQLite Database Browser']['SQLite', 'Sqliteman', 'SQLite Database Browser']['SQLite', 'Sqliteman', 'SQLite Database Browser']"], "sqf": ["ArmA Script File", "Script created for ArmA, a series of tactical military simulation games; contains functions and commands that can be used to modify the gameplay; processed by the ArmA engine when a mission is loaded.", "Windows, Windows, ", "['Bohemia Interactive ArmA: Armed Assault', 'Bohemia Interactive ArmA 2', 'Bohemia Interactive ArmA 3', 'ArmA Edit']['SourceTec Sothink SWF Quicker']"], "sqfs": ["Squash FS Bootable File", "Bootable disk image for Unix that can mounted like a physical disk; formatted using the Squash FS compressed read-only file system; often used to install operating system files.", "Linux, ", "[]"], "sqd": ["Configuration Settings File", "Settings File created by SP Debugger for SQR, a program that helps you monitor and control SQR programs; contains configuration details that allow SQR to locate and run your programs.", "Windows, Windows, Mac, Linux, ", "['SP Debugger for SQR'][][][]"], "sqlite": ["SQLite Database File", "Database created with SQLite, a self-contained, embedded database management system (DBMS); stores data in tables, which may each contain multiple fields and data types; can be accessed via SQL commands using any system that supports SQLite.", "Windows, Mac, Linux, ", "['SQLite', 'Sqliteman', 'Autodesk AutoCAD Map 3D 2017', 'MapGuide Open Source']['SQLite', 'Sqliteman', 'SQLite Database Browser']['SQLite', 'Sqliteman', 'MapGuide Open Source']"], "sql": ["Structured Query Language Data File", "A SQL file is a file written in SQL (Structured Query Language).  It contains SQL code used to modify the contents of a relational database.  SQL files may also contain statements for creating or modifying database structures, insertions, updates, deletions, and other SQL operations.", "Windows, Mac, Linux, ", "['File Viewer Plus', 'MySQL', 'Richardson RazorSQL', 'Altova DatabaseSpy', 'Microsoft Notepad', 'gVim', 'text editor']['MySQL', 'Richardson RazorSQL', 'MalcolmHardie Solutions SQLEditor', 'MacroMates TextMate', 'Bare Bones BBEdit', 'Apple TextEdit', 'text editor']['MySQL', 'Richardson RazorSQL', 'text editor']"], "sqlite3": ["SQLite 3 Database File", "Database file stored in the SQLite 3 format; contains structured data records, which contain data types and values; often used for storing embedded SQL-based databases for iPhone apps and other mobile applications.", "Windows, Mac, Linux, ", "['SQLite', 'Sqliteman', 'SQLite Database Browser']['SQLite', 'Sqliteman', 'SQLite Database Browser']['SQLite', 'Sqliteman', 'SQLite Database Browser']"], "sqb": ["SQL Backup SQL Server Backup File", "Backup of an MS SQL Server database file created with Red Gate SQL Backup, a SQL database backup tool; may be compressed up to 95% and encrypted using 256-bit AES encryption; can be restored using the Red Gate SQL Backup program.", "Windows, ", "[]"], "sq": ["Sysquake Program", "Interactive simulation created with Sysquake, a software program designed to help understand systems, solve problems, and design products.", "Windows, Mac, Linux, ", "[][][]"], "spv": ["SPSS Output Document", "Data file generated by SPSS statistical analysis software; contains the output generated from data analytics functions run within SPSS; may store datasets, reports, charts, and other visualizations; can be viewed with SPSS versions 16 and later.", "Windows, Mac, Linux, ", "['IBM SPSS']['IBM SPSS']['IBM SPSS']"], "spt": ["SpeedTree Tree Data File", "Contains procedural tree data used by SpeedTreeCAD, a tree modeling program; includes information required to construct the tree geometry, as well as data for LOD implementation, wind animation, and cloning.", "Windows, Windows, Windows, Windows, Windows, ", "['IDV SpeedTreeCAD', 'Autodesk 3ds max with SpeedTreeMAX plugin', 'Autodesk Maya with SpeedTreeMAYA plugin']['Hell Quest']['Ensign Software Ensign'][][]"], "sps": ["SPSS Program File", "Program file used by SPSS, a statistical analysis application; saved in a plain text format and contains instructions written using the SPSS syntax; generally developed with the SPSS Syntax Editor; used for manipulating datasets and automating statistical analyses.", "Windows, Mac, Linux, Windows, Windows, Mac, Linux, Windows, ", "['IBM SPSS']['IBM SPSS']['IBM SPSS']['2BrightSparks SyncBack']['id Software Quake 3', 'Microsoft Notepad']['id Software Quake 3', 'Apple TextEdit']['id Software Quake 3']['mymc']"], "sprite2": ["Scratch 2.0 Sprite File", "Graphics file used by Scratch, an educational program used for developing creative programming skills; contains an image as well as animation settings for the image, such as scripts, costumes, sounds, and custom blocks.", "Windows, Mac, Linux, Web, ", "['MIT Scratch']['MIT Scratch']['MIT Scratch']['MIT Scratch']"], "spr": ["Half-Life Sprite File", "Small image file that represents a character or object in Half-Life, a 3D action game; saved in a proprietary bitmap format and are typically located in the the \"half-life\\valve\\sprites\\\" folder.", "Windows, Windows, ", "['SprView', 'Sprite Explorer', 'Valve Half-Life']['Microsoft Visual FoxPro']"], "spub": ["Disc Cover File", "CD/DVD label or jewel case insert created with Disc Cover software; allows covers and labels for CDs and DVDs to be created easily and accurately printed; SPUB files may also be label or cover templates included with the software program.", "Mac, Mac, ", "[]['BeLight Swift Publisher 4']"], "sprg": ["Synclavier Program File", "Synclavier compiled and executable program file.", "Mac, ", "['Synclavier Digital SynclavierX']"], "sprite": ["Scratch Sprite File", "Graphics file used by Scratch, an educational program used for developing creative programming skills; saves a two-dimensional image as well as animation settings for the image; commonly used for characters and game objects.", "Windows, Mac, Linux, Web, Windows, Mac, Linux, ", "['MIT Scratch', 'Snap!']['MIT Scratch', 'Snap!']['MIT Scratch', 'Snap!']['MIT Scratch']['SuperTux', 'text editor']['SuperTux', 'text editor']['SuperTux', 'text editor']"], "spq": ["SPSS Database Query File", "File created by SPSS data mining and statistical analysis software; saves a query to a database; specifies the ODBC database type (e.g., MS Access, dBASE, Excel file), the data fields to extract, and transformations that write the data to the desired format.", "Windows, Mac, Linux, ", "['IBM SPSS']['IBM SPSS']['IBM SPSS']"], "sppack": ["SPPack Sound Sample", "SPPack sampled audio format used by AT&T and Bell Labs; stores frequency domain and quefrency domain data.", "Windows, Linux, ", "['FMJ-Software Awave Audio'][]"], "splane": ["Simple Planes Plane File", "Plane file used by Simple Planes, a realistic plane building and flying game; contains a plane model, which includes wingspan, length, height, empty weight, loaded weight, paint color, drag points, number of parts, control surfaces, and wing area information that makes up the plane.", "Windows, Mac, iOS, Android, ", "['Jundroo Simple Planes']['Jundroo Simple Planes']['Jundroo Simple Planes']['Jundroo Simple Planes']"], "spp": ["Serif PhotoPlus Picture File", "Picture saved in the native PhotoPlus image format; may include layers, layer effects, transparency, editable text, and QuickShapes; may also include mesh data, which allows parts of the image to be distorted using the Mesh Warp tool.", "Windows, ", "['Serif PhotoPlus']"], "spl": ["FutureSplash Animation", "Animation created with FutureWave FutureSplash Animator; a precursor to Adobe Flash; compatible with Flash Player.", "Windows, Mac, Windows, Windows, ", "['Adobe Flash Player', 'Adobe Flash Professional CC']['Adobe Flash Player', 'Adobe Flash Professional CC']['Microsoft Windows', 'EMF Printer Spool File Viewer']['ABACOM sPlan', 'ABACOM sPlan Viewer']"], "spk": ["Deer Hunter Map File", "Game map used by Deer Hunter, a virtual hunting game; includes the terrain, plants, hunting locations, and animals; can be a preinstalled game map or a custom map created by the player.", "Windows, Windows, Mac, Linux, Web, Windows, ", "['Atari Deer Hunter']['Corel WinZip 21', '7-Zip']['Apple Archive Utility', 'Smith Micro StuffIt Deluxe 16', 'GNU Tar', 'The Unarchiver']['GNU Tar']['Artspeak Interpreter']['New Wave Concepts Bright Spark']"], "spj": ["PhotoStage Slideshow Project", "Project file created by PhotoStage slideshow software; combines pictures, video clips, music, and narration into a sequenced multimedia presentation; also can include effects, transitions, ", "Windows, Windows, Windows, Mac, Linux, ", "['NCH PhotoStage']['Microsoft Image Composite Editor']['IBM SPSS']['IBM SPSS']['IBM SPSS']"], "sph": ["NIST SPHERE Audio File", "Waveform audio file created in the NIST SPHERE format, which is often used in speech recognition research; often contains a recording of a person speaking; can be provided as input to speech recognition systems.", "Windows, Mac, Linux, Windows, ", "['SoX']['SoX']['SoX']['MikuMikuDance']"], "spg": ["TCP Optimizer Backup File", "Contains a backup configuration of network settings created with TCP Optimizer, a utility developed by SpeedGuide.net; may be used to restore a previous system state; can be opened by selecting \"File→Restore backed up settings\" within TCP Optimizer.", "Windows, ", "[]"], "spfx": ["Squeeze Presets File", "Settings file used by Squeeze, a video transcoding application; saves preset values for performing a video conversion; often used for sharing presets with others through the Sorenson Media Presets Exchange website.", "Windows, Mac, ", "['Sorenson Media Squeeze']['Sorenson Media Squeeze']"], "spf": ["Slingplayer Favorites File", "File created by Slingplayer, a program that interfaces with a Slingbox DVR device to record and play TV shows on a computer; contains a collection of favorite TV programs and channels; used to store shortcuts to favorite TV shows.", "Windows, Mac, Windows, ", "['Sling Media Slingplayer']['Sling Media Slingplayer']['StorageCraft Technology ShadowProtect', 'VMware vCenter Converter']"], "spec": ["RPM Specification File", "File used by rpmbuild, a program used for building .RPM (Red Hat Package Manager) packages, which are used for installing Linux programs; includes the package name, version, copyright information, a summary, references to program files, and instructions for creating and installing the package.", "Linux, ", "['rpmbuild', 'text editor']"], "spe": ["WinSpec CCD Capture File", "Contains image data captured on the CCD of a PIXIS camera or other Princeton Instruments device; can be analyzed and modified using Roper Scientific's WinSpec or WinView software.", "Windows, Windows, Mac, Linux, ", "[]['IBM SPSS']['IBM SPSS']['IBM SPSS']"], "spdf": ["Sealed PDF File", "An SPDF file is a protected .PDF file created by Oracle Information Rights Management (IRM) document protection software.  It saves the document in a \"sealed,\" or locked, format and can only be opened by users with sufficient rights.  SPDF files are sometimes used by online textbook vendors for protecting the distribution of purchased digital textbooks.", "Windows, ", "['Oracle IRM Desktop']"], "speccy": ["Speccy Snapshot", "Snapshot created by Speccy, a tool that enables you to explore your PC; stores a set of information about your computer system at a certain point in time.", "Windows, ", "['Piriform Speccy 1']"], "spd": ["Form·Z Suspended Render File", "File created by form·Z, a 3D modeling application often used for creating building and site construction models; stores the state of a scene rendering job and is created when the user pauses a rendering job and saves the progress.", "Windows, Mac, Windows, Mac, Windows, Mac, Linux, ", "['AutoDesSys form•Z']['AutoDesSys form•Z'][][]['IBM SPSS']['IBM SPSS']['IBM SPSS']"], "spc": ["Software Publisher Certificate File", "Digital certificate created by various PKCS (public-key cryptographic standard) programs, such as OpenSSL or Microsoft's .NET Framework File Signing Tool (Signcode.exe); contains a digital signature, which includes a public key that has been encrypted using a private key.", "Windows, Mac, Linux, Windows, Mac, Linux, Windows, Mac, Linux, ", "['OpenSSL', 'Microsoft File Signing Tool', 'Microsoft Pvk2Pfx']['OpenSSL']['OpenSSL']['Nullsoft Winamp with SNESAmp plug-in', 'Audio Overload', 'Foobar2000', 'vspcplay']['Audio Overload', 'Cog']['Audio Overload', 'Audacious', 'vspcplay']['Newera Graphics Converter Pro', 'XnViewMP']['Lemkesoft GraphicConverter', 'XnViewMP']['XnViewMP']"], "spb": ["Flight Simulator Mission File", "Saved game file created by Microsoft ESP, a software toolkit used for flight and vehicle simulation; saves the state of a flight simulator mission, including the state of mission \"triggers\" and \"actions;\" saved with a .FLT file as part of a game save.", "Windows, Windows, ", "['Microsoft Flight Simulator X Gold Edition', 'spb2xml']['Samsung Kies']"], "sparsebundle": ["Mac OS X Sparse Bundle", "Macintosh disk image format introduced in Mac OS X 10.5 Leopard; based off the .SPARSEIMAGE format, but is made up of \"bands\" instead of individual files; contains mountable directories saved in 8MB chunks.", "Mac, ", "['Apple Disk Utility']"], "sparc": ["Skype Plugin Archive", "File used by Extras Manager, a plug-in manager component for Skype Internet voice and video calling software; contains the plugin to be installed with Skype; downloaded from the Skype Extras website and can be installed by double-clicking the file.", "Windows, ", "['Skype']"], "spa": ["MikuMikuDance Sphere Mapping File", "3D model effects file used by MikuMikuDance, a dance and rhythm synchronization game; saved as a .BMP image but uses the \".spa\" extension instead; used for adding a shiny look to 3D model features such as hair or clothes.", "Windows, Windows, ", "['MikuMikuDance']['MKDS Course Modifier']"], "sp": ["Simplexety Parameters File", "Data file created by Simplexety, an advanced calculator program used for creating and evaluating mathematical functions as well as creating graphs; saves the list of functions and data and also supports storage of custom VBScript source code; can be used for storing and sharing mathematical data with others.", "Windows, Windows, ", "['Simplexety'][]"], "sparseimage": ["Mac OS X Sparse Image", "Disk image file type created with Apple's Disk Utility program (included with Mac OS X); similar to a standard Apple Disk Image (.DMG) file, but only takes up the amount of space of the data contained within the disk image.", "Mac, ", "['Apple Disk Utility']"], "sou": ["SBStudio II Sound File", "Audio format used by SBStudio; package file that contains audio data in block format; similar to a .PAC file, but only contains audio data.", "Windows, ", "['FMJ-Software Awave Studio']"], "sol": ["Flash Local Shared Object File", "Contains user data and settings stored by Macromedia Flash Player 6 and later (now Adobe Flash Player); similar to a cookie saved from a Web page, but is used specifically by Flash Player.", "Windows, Mac, ", "['Adobe Flash Player', 'SolVE: Local Shared Object Viewer/Editor', 'Sol Editor', 'SOLReader']['Adobe Flash Player', 'SolVE: Local Shared Object Viewer/Editor']"], "so": ["Shared Library", "Shared library loaded by C and C++ programs when they start; contains functions and other shared program logic; used for loading common libraries into memory so multiple programs can use the same codebase even though they run in separate operating system processes.", "Mac, Linux, ", "['GNU Compiler Collection (GCC)']['GNU Compiler Collection (GCC)']"], "snk": ["Strong Name Key File", "Software key file created by Strong Name Tool (Sn.exe), a cryptographic program included with Microsoft's .NET framework; contains a public key and private key pair; used to digitally sign and authenticate an application.", "Windows, ", "['Microsoft Strong Name Tool', 'Microsoft Visual Studio 2017']"], "snippet": ["Visual Studio IntelliSense Code Snippet", "Section of programming code saved in XML format; code snippets can be saved from Visual Basic, Visual C#, and Visual J projects; they can be edited using the Code Snippet Editor and managed using the Code Snippets Manager.", "Windows, ", "['Microsoft Visual Studio 2017']"], "snt": ["Sticky Notes File", "File created by Sticky Notes, a desktop note-taking program included with Windows Vista and Windows 7; saves one or more sticky notes that float on the desktop; stores each note's text, typeface, color, and position on the desktop; allows opened sticky notes to be saved even if the user logs out of Windows and back in again.", "Windows, ", "['Microsoft Sticky Notes']"], "sns": ["SNS Video Game Audio File", "Audio file used by some Electronics Arts video games, including Burnout Paradise and The Sims 3; may store the audio with different codecs and therefore cannot be easily converted or played with standard audio software; used for game sounds and music.", "Windows, Windows, Mac, Linux, ", "['FFmpeg', 'ealayer3']['Composite Ideas Save-N-Sync']['Composite Ideas Save-N-Sync']['Composite Ideas Save-N-Sync']"], "snp": ["Access Report Snapshot", "Snapshot of a report created in Microsoft Access; preserves the report layout, including the text and graphics; allows the report to be viewed by someone who does not have Access installed on his or her computer.", "Windows, ", "['Microsoft Access 2016', 'Microsoft Snapshot Viewer']"], "sng": ["Korg Trinity Song File", "Song file used by Korg MIDI-compatible devices, such as some synthesizers; stores musical notes and other audio information in a proprietary format; can be used for playing back songs and music loops on Korg electronic devices; may also be converted to other file formats, such as .MID.", "Windows, Mac, Linux, Windows, Mac, ", "['Alchemist']['Alchemist']['Alchemist']['Apple QuickTime Player']['Apple QuickTime Player']"], "snf": ["Starry Night Pro Document", "Document created by Starry Night Pro, an astronomy application used to observe constellations; contains a viewing preference that alters the view of the sky, planets, and galaxies; includes gaze, zoom, viewing location, time and date, and time flow rate data.", "Mac, ", "['Simulation Curriculum Starry Night Pro']"], "snd": ["Sound File", "Generic sound format used by a variety of programs; may be a Macintosh sound resource (from Mac OS Classic), an AKAI MPC audio sample, a generic Amiga sound, or other audio file.", "Windows, Mac, Windows, Mac, Windows, Mac, ", "['File Viewer Plus', 'Microsoft Windows Media Player', 'Apple QuickTime Player', 'Microsoft Windows Movie Maker', 'Nullsoft Winamp', 'JRiver Media Center', 'MAGIX SpectraLayers Pro 4', 'Adobe Audition CC 2017']['Apple QuickTime Player', 'MAGIX SpectraLayers Pro 4', 'Adobe Audition CC 2017']['Apple QuickTime Player']['Apple QuickTime Player'][]['MOTU MachFive']"], "snapshot": ["VMware ThinApp Snapshot File", "File created by VMware ThinApp, a program used for bundling Windows programs into a single executable without any additional dependencies; created by ThinApp's system scanner and contains system information about all files on the local hard drive and registry entries.", "Windows, ", "['VMware ThinApp 5 Suite']"], "snagstyles": ["Snagit Style Archive", "Style file created by Snagit, a screen image and video capture program; contains customized styles such as arrows, talk bubbles, lines, shapes, pen lines, that can be added to images and video.", "Windows, Mac, ", "['TechSmith SnagIt']['TechSmith SnagIt']"], "snapfireshow": ["Corel SnapfireShow File", "File created by Corel multimedia software; contains data for photos, videos, and slide shows created in Corel software; allows users to share content with others through email attachments.", "Windows, ", "['Corel PaintShop Pro X9']"], "sna": ["Drive Snapshot Primary Backup File", "Virtual disk format used by Drive Snapshot, a program for creating differential backups; can be mounted like a physical disk when opened with the Drive Snapshot program.", "Windows, Windows, ", "[]['NO$GBA']"], "snagproj": ["Snagit Project File", "Project file created by Snagit, a screen capture program; consists of a video or image taken from the user's screen; can be opened and edited by user to add effects such as arrows, shadows, and text.", "Windows, Mac, ", "['TechSmith SnagIt']['TechSmith SnagIt']"], "snagitstamps": ["Snagit Stamp Archive", "Archive created by Snagit, a screen image and video capture program; contains customized stamps that can be added to images and video; created to share the stamps with other users.", "Windows, Mac, ", "['TechSmith SnagIt']['TechSmith SnagIt']"], "snag": ["SnagIt Capture File", "File created by SnagIt, a screen capturing and image annotation program; stores a bitmap of the captured image as well as drawn vector objects, such as callouts and arrows; stores the vector graphics as \"unflattened\" objects, meaning they can be moved and edited before being rasterized, or \"flattened,\" into a final raster graphic.", "Windows, Mac, ", "['TechSmith SnagIt']['TechSmith SnagIt']"], "sn2": ["Drive Snapshot Second Differential Backup", "Second differential backup created by Drive Snapshot; created after the primary .SNA backup and the first .SN1 backup files have been saved; contains only files and folders that have been changed since the first differential backup; can be mounted like a physical disk when opened with the Drive Snapshot program.", "Windows, ", "[]"], "sn1": ["Drive Snapshot First Differential Backup", "First differential backup created by Drive Snapshot after creating the primary .SNA backup file; contains only files and folders that have been changed since the initial backup; can be mounted like a physical disk when opened with the Drive Snapshot program.", "Windows, ", "[]"], "smt": ["Samsung Theme File", "Mobile device theme file used by various Samsung mobile phones models; includes graphics (.QMG files) for the background image, buttons, and other user interface items; also includes an XML file that defines the different screen layouts for the theme; saved in the compressed .ZIP format.", "Windows, ", "['Samsung Theme Designer']"], "smzip": ["StepMania Package", "Package format used by StepMania, a free dance and rhythm game that supports dance pads; typically created with the StepMania Package Exporter (smpackage.exe); includes the music, announcers, themes, and other add-ons for a specific song; designed to be a simple format for distributing song data in a single file.", "Windows, Mac, Linux, ", "['StepMania']['StepMania']['StepMania']"], "smx": ["SmartMusic XML File", "Music file used by SmartMusic, a music practice application for band, orchestra, and voice; similar to a .XML file; contains XML formatted music notation data referenced by SmartMusic when users practice vocal or instrumental takes.", "Windows, Mac, ", "['MakeMusic SmartMusic']['MakeMusic SmartMusic']"], "sms": ["Sega Master System ROM", "ROM image of an original Sega Master System (SMS) video game; contains the same data stored on the actual game cartridge; can be played on a Mac or PC using SMS emulation software.", "Windows, Mac, Linux, Windows, Mac, ", "['Fusion', 'FreezeSMS', 'MESS', 'Meka', 'SMSPLUS']['SMS Plus', 'MacMESS', 'MasterGear']['MasterGear']['FJ Software MyPhoneExplorer', 'text editor']['text editor']"], "smpkg": ["SmartMusic Package File", "Music file used by SmartMusic, a music practice application for band, orchestra, and voice; similar to a .PKG file; contains data referenced by SmartMusic; should not be manually opened.", "Windows, Mac, ", "['MakeMusic SmartMusic']['MakeMusic SmartMusic']"], "smrailroadssavedgame": ["Sid Meier's Railroads! Saved Game", "Saved game file created and used by Sid Meier's Railroads!, a real-time strategy train engine game; stores game progress data, which includes train, depots, tracks, cities, game difficulty, and game scenario.", "Windows, Mac, ", "[\"Take-Two Interactive Sid Meier's Railroads!\"][\"Take-Two Interactive Sid Meier's Railroads!\"]"], "smpx": ["SmartMusic Accompaniment File", "File created by Finale, a music notation program; contains music notation data for solos, assessments, or ensembles to accompany music in the SmartMusic program; similar to a .MIDI file but with enhanced features.", "Windows, Mac, ", "['MakeMusic Finale', 'MakeMusic SmartMusic']['MakeMusic Finale', 'MakeMusic SmartMusic']"], "smpf": ["Sprite Monkey Project", "Compressed project file used by Sprite Monkey, a lightweight application that allows users to quickly edit sprite images; contains sprite images and coordinate information specified in the user's project. ", "Mac, ", "['PoseMotion Sprite Monkey']"], "smp": ["SampleVision Audio Sample Format", "Mono, 16-bit audio format that supports loop points; originally used by Turtle Beach SampleVision in the mid-1990s.", "Windows, Windows, Linux, Windows, Mac, Windows, Windows, Mac, Windows, ", "['Adobe Audition CC 2017', 'MAGIX Sound Forge Pro 11', 'FMJ-Software Awave Studio']['Clark Labs IDRISI Selva', 'GDAL']['GDAL']['MakeMusic SmartMusic']['MakeMusic SmartMusic'][]['XnViewMP']['XnViewMP']['Corel PhotoImpact X3']"], "smk": ["Smacker Compressed Movie File", "Video, animation, or sound file compressed using RAD Game Tool's Smacker compressor; supports video clips with 256 colors and transparency; often used for creating movies for video games with reduced file sizes.", "Windows, Mac, ", "[][]"], "smi": ["Self-Mounting Disk Image", "Disk image file created by Aladdin ShrinkWrap or Apple Disk Copy in Mac OS Classic (Mac OS 9 or earlier); mounts as a disk on the Desktop when opened.", "Mac, Windows, Mac, Linux, iOS, Android, Windows, Mac, Linux, ", "['Apple Disk Utility']['Microsoft Windows Media Player', 'VideoLAN VLC media player', 'MPlayer', 'EZTitles', 'URUWorks Subtitle Workshop']['MPlayer', 'VideoLAN VLC media player']['VideoLAN VLC media player']['olimsoft OPlayer']['Bolero33 Soul Movie', 'J2 Interactive MX Player']['ACD Systems ACDSee 20', 'Apple QuickTime Player', 'RealNetworks RealPlayer Cloud', 'Ambulant Player']['Apple QuickTime Player', 'RealNetworks RealPlayer Cloud', 'Ambulant Player']['Ambulant Player', 'RealNetworks RealPlayer Cloud']"], "smf": ["StarMath Formula File", "Math formula created by Apache OpenOffice and other variants of the office suite; stores the syntax and formatting of a mathematical equation or expression; replaced with the newer .ODF format, but is still supported by Apache OpenOffice.", "Windows, Mac, Linux, Windows, Mac, Windows, Windows, ", "['Apache OpenOffice', 'LibreOffice']['Apache OpenOffice', 'Planamesa NeoOffice', 'LibreOffice']['Apache OpenOffice', 'LibreOffice']['Apple QuickTime Player']['Apple QuickTime Player']['Serif DrawPlus', 'Serif PagePlus', 'Serif WebPlus']['Appspeed SkinMagic Toolkit']"], "sme": ["Samsung Mobile Backup File", "An SME file is a backup file created by Samsung backup programs, such as Kies and Smart Switch.  It stores an archive of backup data for your mobile phone, which includes short text (SMS) messages and memos.  SME files are similar to .SBU backup files.", "Windows, Mac, Android, Windows, ", "['Samsung Kies', 'Samsung Smart Switch']['Samsung Kies', 'Samsung Smart Switch']['Samsung Smart Switch Mobile'][]"], "smil": ["SMIL Presentation File", "Multimedia presentation written in the Synchronized Multimedia Integration Language (SMIL), which is similar to HTML; used for developing audiovisual slide shows and presentations; may contain text and references to streaming audio and video files.", "Windows, Mac, Linux, ", "['RealNetworks RealPlayer Cloud', 'ACD Systems ACDSee 20', 'Ambulant Player', 'Apple QuickTime Player', 'Microsoft Internet Explorer']['RealNetworks RealPlayer Cloud', 'Ambulant Player', 'Apple QuickTime Player']['Ambulant Player', 'RealNetworks RealPlayer Cloud']"], "smd": ["Valve Studiomdl Data File", "Three-dimensional model file used by Source Engine, a game engine used to develop games such as Half-Life; stores the model in an ASCII text format; compiled into the resulting .MDL game model using Studiomdl command line utility and a .QC script.", "Windows, Windows, Mac, ", "['chUmbaLum sOft Half-Life Model Viewer', 'Valve Studiomdl', 'Valve Half-Life', 'Microsoft Notepad', 'text editor']['Gens', 'Gens+', 'Fusion', 'HazeMD', 'Code Isle SBWin Converter']['Genesis Plus', 'DGen']"], "smc": ["Super Nintendo Game ROM", "Game ROM used by SNES emulators such as Snes9x and ZSNES; contains a copy of the game data stored on the original Super Nintendo cartridge; allows SNES games to be played on the PC with a supporting emulator.", "Windows, Mac, Linux, ", "['ZSNES', 'Snes9x', 'SNEeSe', 'SnEM']['Snes9x']['ZSNES', 'Snes9x']"], "smali": ["Android Smali Assembly Language File", "Developer file written in Smali, the assembly language used by the Android Dalvik Virtual Machine; usually created by decompiling .DEX (Dalvik Executable) files, which are the executables included in Android apps (.APK files); usually used for low-level inspection of an Android app's contents, or for hacking Android apps.", "Windows, Mac, ", "['Notepad++', 'text editor']['Apple TextEdit', 'text editor']"], "sma": ["AMX Mod Plugin Source File", "Contains the source code of plugin created for AMX Mod or AMX Mod X; used for modifying Valve's Half-Life and similar games; must be compiled into a binary plugin file in order to be used by the program.", "Windows, Linux, Windows, Mac, ", "[][]['MakeMusic SmartMusic']['MakeMusic SmartMusic']"], "sm": ["StepMania Song File", "Song file format used by StepMania, a dance and rhythm game that supports dance pad input; includes song information and references to music and image files; may be used for dance, pump, beat, and guitar songs.", "Windows, Mac, Linux, Windows, Windows, ", "['StepMania']['StepMania']['StepMania']['SMath Studio']['Space Engine']"], "slx": ["MathWorks Simulink Model File", "Simulation model created with Simulink, a block diagram environment for multidomain simulation; stores a list of elements and associated values in a compressed XML format; uses Unicode UTF-8 text encoding by default.", "Windows, Mac, Linux, Windows, Mac, ", "['MathWorks Simulink']['MathWorks Simulink']['MathWorks Simulink']['MAGIX SpectraLayers Pro 4']['MAGIX SpectraLayers Pro 4']"], "slupkg-ms": ["XrML Digital License Package", "Software license file used by Windows; contains a digital license used to verify that a software install or upgrade has been purchased; may also contain software rights and conditions information; often seen when upgrading versions of Windows, such as from Windows Vista Home to Vista Ultimate.", "Windows, ", "['Microsoft Windows']"], "slp": ["SpectraLayers Pro Project", "Project file created by SpectraLayers Pro, an advanced audio spectrum editor; supports multiple audio layers with each layer containing independent edits and filters; enables unmixing of standard audio files, sound isolation, and custom sound shaping; used by sound engineers and audio-video editors.", "Windows, Mac, Windows, ", "['MAGIX SpectraLayers Pro 4']['MAGIX SpectraLayers Pro 4'][]"], "sltng": ["StarLogo TNG Project File", "Project file created by StarLogo TNG, an application used for teaching programming principles in educational environments; saves a model that can be simulated in the software; can include 3D graphics and sound and supports keyboard input.", "Windows, ", "['StarLogo TNG']"], "slt": ["Mozilla User Profile Folder", "Contains user profile data for Mozilla programs such as Firefox and Thunderbird; may include bookmarks, browsing history, and cached data; typically saved with a random filename, followed by the \".slt\" extension.", "Windows, Mac, ", "['Mozilla Firefox', 'Mozilla Thunderbird']['Mozilla Firefox', 'Mozilla Thunderbird']"], "slogo": ["StarLogo Project File", "Programming project created with StarLogo, an programmable modeling environment often used in educational settings; saved in a plain text format and contains instructions for running the program; used for saving projects.", "Windows, ", "['StarLogo', 'OpenStarLogo']"], "sln": ["Visual Studio Solution File", "An SLN file is a structure file used for organizing projects in Microsoft Visual Studio.  It contains text-based information about the project environment and project state.", "Windows, Mac, Linux, ", "['Microsoft Visual Studio 2017', 'VSoft Technologies FinalBuilder', 'MonoDevelop']['MonoDevelop']['MonoDevelop']"], "slk": ["Symbolic Link File", "File format created by Microsoft to transfer data between spreadsheet programs and other databases; contains lines of text delimited by semi-colons that specify the cell row, column, formatting, and content; stored in an ANSI text format.", "Windows, Mac, ", "['Microsoft Excel 2016', 'Corel Quattro Pro X8']['Microsoft Excel 2016']"], "sli": ["OMSI Spline Configuration File", "Spline file created by OMSI The Bus Simulator, an omnibus driving simulation program; similar to other OMSI configuration files like .HUM, .SLI, .SCO, and .BUS files; holds configuration data that guides human and Artificial Intelligence (AI) traffic during gameplay, for e.g., the roads; can be customized.", "Windows, ", "['MR Software OMSI The Bus Simulator 2']"], "slf": ["Symantec License File", "File used by Symantec software to activate software licenses; contains activation codes that are registered with Symantec; allows users to legally use a copy of Symtantec software.", "Windows, ", "[]"], "sle": ["Sisulizer Package File", "Compressed package file saved by Sisulizer, a visual software localization tool; contains the exchange project file and other files needed by the translator; similar to a .SLP file, but is compressed using .ZIP compression.", "Windows, ", "[]"], "sldtm": ["SDL Translation Memory File", "Data file created by SDL Trados Studio language translation software; stores a \"translation memory,\" which is a linguistic database that saves translation data as a user translates written information; includes \"100% matches\" as well as \"fuzzy matches.\"", "Windows, ", "['SDL Trados Studio']"], "sldprt": ["SolidWorks Part File", "3D image format used by SolidWorks CAD software; contains a 3D object or \"part\" that may be combined with other parts into a single assembly (.SLDASM) file.", "Windows, Mac, ", "['Dassault Systemes SolidWorks', 'Dassault Systemes SolidWorks eDrawings Viewer', 'Autodesk Fusion 360', 'Adobe Acrobat DC']['Dassault Systemes SolidWorks', 'Dassault Systemes SolidWorks eDrawings Viewer']"], "slddrw": ["SolidWorks Drawing File", "Two-dimensional drawing created with SolidWorks CAD software; saves image data in vector format using lines instead of pixels; associated with the SolidWorks 3D .SLDPRT and .SLDASM file formats.", "Windows, Mac, ", "['Dassault Systemes SolidWorks', 'Dassault Systemes SolidWorks eDrawings Viewer']['Dassault Systemes SolidWorks', 'Dassault Systemes SolidWorks eDrawings Viewer']"], "sld": ["Styled Layer Descriptor File", "GIS file created in the Styled Layer Descriptor format, an XML format used for specifying the display of map layers; can describe both raster and vector data and may include colors, labels, fonts, legend specifications, and other information.", "Windows, Mac, Linux, Windows, ", "['AtlasStyler SLD editor', 'GeoServer']['AtlasStyler SLD editor', 'GeoServer']['AtlasStyler SLD editor', 'GeoServer']['Autodesk AutoCAD 2017']"], "slddrt": ["SolidWorks Sheet File", "Drawing sheet format used by SolidWorks, a 2D/3D design program; may be a blank sheet or may contain logos, notes, and links to properties; often includes lines used for the border of the drawing.", "Windows, ", "['Dassault Systemes SolidWorks']"], "sla": ["Scribus Document", "Document created by Scribus, a free open source desktop publishing application; saved using XML formatting and contains document text, images, and layout settings; used for saving written work.", "Windows, Mac, Linux, ", "['Scribus']['Scribus']['Scribus']"], "sl": ["Software License File", "Text file containing software license information for a Unix program; usually installed in the /lib/ directory once the software has been registered; similar to a .LIC file used by Macintosh and Windows programs.", "Linux, ", "['text editor']"], "skz": ["SuperKaramba Theme", "Theme file used by SuperKaramba, a program for modifying the look and feel of the KDE desktop; may also include widgets or other interactive \"eye candy\" that can be added to the KDE interface; saved in a compressed package format.", "Linux, ", "[]"], "sldasm": ["SolidWorks Assembly File", "An SLDASM file is a three-dimensional assembly created with SolidWorks CAD software.  It typically contains several SolidWorks Part (.SLDPRT) files organized into a single assembly.", "Windows, Mac, ", "['Dassault Systemes SolidWorks', 'Dassault Systemes SolidWorks eDrawings Viewer', 'Autodesk Fusion 360', 'Adobe Acrobat DC']['Dassault Systemes SolidWorks', 'Dassault Systemes SolidWorks eDrawings Viewer']"], "skx": ["XLANG Schedule File", "Schedule generated from an XLANG schedule drawing (.SKV file) using BizTalk Orchestration Designer; saved in an XML format and contains tasks that can be executed by the XLANG Scheduler Engine.", "Windows, ", "[]"], "skypechatstyle": ["Chat Style File", "Style file created by Skype, a video and text messaging application; provides layout design information for the Skype chat interface; created exclusively for Mac.", "Mac, ", "['Skype']"], "skv": ["Semicolon Separated Values File", "Text-based data format that stores data entries separated by semicolons; similar to a .CSV file, but uses semicolons instead of commas; can be imported into various spreadsheet programs, which organize the data into rows and columns.", "Windows, Mac, Linux, Windows, ", "['Microsoft Excel 2016', 'Apache OpenOffice', 'Dovestones Active Directory Tools', 'text editor']['Microsoft Excel 2016', 'Apache OpenOffice', 'text editor']['Apache OpenOffice', 'text editor'][]"], "skm": ["SketchUp Materials File", "Textures file used by SketchUp, a drawing program developed by Google; saved in a compressed .ZIP format and contains XML texture property files, a thumbnail .PNG image, and a .JPG texture image; stores 2D graphics that can be layered on 3D models.", "Windows, Mac, ", "['Trimble SketchUp']['Trimble SketchUp']"], "skn": ["Avant Browser Skin File", "Skin file used by Avant Browser, a customizable Web browser; saves graphics and setting that are used to configure the appearance of the browser; allows users to change the look and feel of the user interface.", "Windows, Windows, Mac, ", "['Avant Force Avant Browser']['Nokia PC Suite']['Nokia PC Suite']"], "skr": ["PGP Private Keyring", "An SKR file is a private keyring created by PGP Desktop Home, data encryption software used to secure a user's confidential digital information.  It contains ASCII private keys used for decrypting PGP (Pretty Good Privacy) encrypted files.", "Windows, Mac, ", "[][]"], "skl": ["Maya Skeleton File", "Three-dimensional skeleton file used by Maya, a 3D modeling and animation program; defines the basic structure and movements of a 3D character created with Maya.", "Windows, Mac, ", "['Autodesk Maya 2017']['Autodesk Maya 2017']"], "skp": ["SketchUp Document", "An SKP file is a three-dimensional model created by SketchUp software, an easy-to-use 3D design program.  It contains a model which includes wireframes, shades, edge effects, and textures.  SKP files may also store components that can be inserted into your document.", "Windows, Mac, Web, ", "['Trimble SketchUp', 'Trimble SketchUp Viewer', 'IMSI TurboCAD Pro 2017']['Trimble SketchUp', 'Trimble SketchUp Viewer', 'IMSI TurboCAD Deluxe v10']['Trimble 3D Warehouse']"], "skindex": ["Mail Index File", "Stores indexing data that the Mac OS X Mail program uses to make searching faster; usually named mbox.SKindex and has a related file named mbox.SKindex.isValid in the same directory", "Mac, ", "['Apple Mail']"], "skitch": ["Skitch Image", "Image document created by Skitch, a program used to create, edit, and share screen capture images; stores a bitmap image, which may include a screen capture graphic and user edits; used for annotating and sharing images online through social networking websites.", "Mac, ", "['Skitch']"], "ski": ["Motorola Phone Skin File", "Custom theme or skin for a Motorola cell phone, such as the RAZR or ROKR; used to personalize the interface of the phone; saved in a text format that can be edited with a text editor.", "Windows, Mac, ", "['text editor']['text editor']"], "skin": ["InstallShield Skin File", "File used by InstallShield, a program that allows users to create Windows program installers; contains skin data that is used to customize the look and feel of the installer windows; can be generated using a program called InstallShield Skin Customization Kit, which is included with InstallShield products.", "Windows, Windows, ", "['Flexera InstallShield']['Microsoft Visual Web Developer', 'Microsoft Visual Studio 2017']"], "skf": ["AutoSketch Drawing", "CAD drawing created by AutoSketch, a CAD program used for creating 2D conceptual sketches and other technical drawings; can only be created and opened by AutoSketch, but can be converted to the .DWG format in the software.", "Windows, ", "['Autodesk AutoSketch']"], "sketch": ["Sketch Drawing", "A SKETCH file is a vector graphics file created by Sketch, a vector drawing program for Mac OS X.  It contains one or more layers of drawn objects that may include text, shapes, symbols, or images.  SKETCH files are saved in the Sketch image format that is only supported by Sketch.", "Mac, ", "['Bohemian Coding Sketch']"], "skba": ["SketchBook Pro Animation File", "Animation created by SketchBook Pro, a sketching, drawing, and painting application; contains a Flipbook animation, which includes foreground, midground, background, and background color layers with illustrated content; also stores animation presets, pixel dimensions, playback frames per second, and frame numbers.", "Windows, Mac, ", "['Autodesk SketchBook Pro 7']['Autodesk SketchBook Pro 7']"], "skb": ["SketchUp Backup Document", "Backup of a 3D model created with SketchUp (.SKP file); saved automatically using the program's auto-save feature; created as a backup in case the original file becomes corrupted or is accidentally deleted.", "Windows, Mac, ", "['Trimble SketchUp']['Trimble SketchUp']"], "sk2": ["ChemSketch Drawing", "Compact vector-based drawing created with ChemSketch, a advanced chemical drawing program; contains molecular structures and related information.", "Windows, ", "[]"], "sjpg": ["Sealed JPG File", "An SJPG file is an encoded .JPG file created by Oracle Information Rights Management (IRM) document protection software.  It contains a JPG file locked in a \"sealed\" format.  SJPG files are created to secure images that can only be opened by users with the appropriate IRM privileges.", "Windows, ", "['Oracle IRM Desktop']"], "sjd": ["Scrapbook Factory Journal File", "File created by Scrapbook Factory Deluxe, a program used for creating personal scrapbooks; saves a multi-page journal created in the software; can include photos, template layouts, and other design elements; may be printed to a computer or published to a document when complete.", "Windows, ", "['Nova Development Scrapbook Factory Deluxe']"], "siv": ["Silicon Imaging Video File", "Uncompressed video file created by a Silicon Imaging digital camera; stores the video footage in a raw 12-bit uncompressed format; generally converted to a frame sequence (e.g., a collection of .DPX or .DNG files) before proceeding with video editing and production.", "Windows, Mac, ", "['Adobe SpeedGrade CC 2017']['Adobe SpeedGrade CC 2017']"], "sites2": ["iWeb Site Design Project", "Project file created by iWeb, a Web development application that doesn't require users to know HTML; contains Web page layouts, text, and graphics; can be published to a live website when complete.", "Mac, ", "['Apple iWeb']"], "sites": ["iWeb Site Design Project", "File created by iWeb, a Web developer program for beginners; knowledge of HTML is not required; contains pre-designed Web page layouts, text, and graphics; can be published to a live website when complete; similar to .SITES2 files.", "Mac, ", "['Apple iWeb']"], "sitemap": ["ASP.NET Site Map File", "Website file used by ASP.NET Web applications; stores the website's navigational structure in a hierarchy of pages; used for allowing programmatic access to the site map with the ASP.NET API.", "Windows, ", "['Microsoft Visual Web Developer', 'Microsoft Visual Studio 2017']"], "sitx": ["StuffIt X Archive", "A SITX file is a compressed file saved in the Stuffit X archive format, the default format used by StuffIt 7.0 and later.  It features Smith Micro's exclusive ATOM compression technology and offers up to 20% more compression than standard Stuffit (.SIT) archives.", "Windows, Mac, ", "['Smith Micro StuffIt Deluxe for Windows']['Smith Micro StuffIt Deluxe 16', 'Incredible Bee Archiver', 'The Unarchiver']"], "sit": ["StuffIt Archive", "Compressed file \"stuffed\" by Smith Micro StuffIt software; common file compression format used on Macintosh systems; originally Mac-only, now cross-platform, meaning SIT files can be created and opened on both Macintosh and Windows platforms.", "Windows, Mac, ", "['Smith Micro StuffIt Deluxe for Windows', 'ExtractNow']['Smith Micro StuffIt Deluxe 16', 'Incredible Bee Archiver', 'The Unarchiver']"], "sisx": ["Symbian OS Installation File", "Software installer file for devices that use Symbian OS 9.1 or later; includes cell phones that support the Nokia S60 3rd Edition platform and devices that use the UIQ 3 platform; S60 is used in Nokia and Samsung smartphones, while UIQ 3 is mainly used in Sony Ericsson and Motorola phones.", "Windows, ", "['Nokia PC Suite', 'SISContents']"], "sims2pack": ["Downloaded Sims 2 Package File", "Self-installing package file downloaded from the Internet that contains data used to update The Sims 2; typically used for storing Sims (characters), Residential and Community Lots, and texture data; will install itself when opened if The Sims 2 is installed.", "Windows, Mac, ", "['Electronic Arts The Sims 2', 'Sim File Maid 2', 'Ambertation SimPE', 'Sims2Pack Clean Installer']['Electronic Arts The Sims 2']"], "sis": ["Steam Game Backup Information File", "Information file used by Steam, a gaming service that allows users to download and manage Valve games; contains plain text markups, which describe properties of a game backup; used in the process of restoring game backups.", "Windows, Windows, Windows, ", "['Valve Steam']['Nokia Suite', 'Nokia PC Suite', 'UnSIS', 'Easy SIS Creator', 'Palm OS Emulator', 'SISContents']['Digital Conference Sisma']"], "sims3pack": ["The Sims 3 Package File", "Game package file created for The Sims 3, an open-ended life simulation game in which players manipulate a simulated environment with virtual people called \"Sims;\" contains visual data that represents any part of the virtual environment, such as \"Sim\" people, clothing, and buildings. ", "Windows, Mac, ", "['Electronic Arts The Sims 3', 'Sims 3 Package Explorer', 'S3PE']['Electronic Arts The Sims 3']"], "sims3": ["The Sims 3 Game Save File", "Save file created by The Sims 3, a life simulation game that gives you control over simulated persons, or \"Sims;\" contains saved game data from the most recent save; includes game progress like character development, money amount, and new buildings; located in the \"Saves\" folder of the The Sims 3 directory along with .SIMS3.BACKUP files.", "Windows, Mac, ", "['Electronic Arts The Sims 3']['Electronic Arts The Sims 3']"], "sim": ["Steam Game Backup Information File", "Backup information file used by Steam's backup service, which allows users to backup and restore games using DVDs or other external media; contains settings and other information for the backup, along with a corresponding .SIS file.", "Windows, Windows, Windows, Mac, ", "['Valve Steam'][]['XnViewMP']['XnViewMP']"], "simp": ["Software Ideas Modeler Project", "Project created by Software Ideas Modeler, a tool that enables users to create diagrams; stores project data, which includes project properties, diagrams, comments, models, styles, and other resources.", "Windows, ", "['Dušan Rodina Software Ideas Modeler']"], "sii": ["18 Wheels of Steel: Haulin' Truck Definition File", "Data file used by 18 Wheels of Steel: Haulin', a truck driving game; contains properties for a truck, such as the engine class; saved in a plain text format and often altered for creating custom truck configurations.", "Windows, ", "[\"SCS 18 Wheels of Steel: Haulin'\"]"], "sig": ["Signature File", "A SIG file is a small text file that can be automatically attached to the end of e-mail messages.  It contains the sender's name and email address.  SIG files are supported by most email programs and can be selected from within the \"Create New\" message window.", "Windows, Mac, Windows, Mac, Windows, ", "['QUALCOMM Eudora', 'Microsoft Outlook 2016', 'Microsoft Outlook Express']['QUALCOMM Eudora']['Broderbund The Print Shop', 'Broderbund PrintMaster v7 Platinum']['Broderbund The Print Shop for Mac', 'Broderbund PrintMaster v7 Platinum']['Duxbury QuickTac', 'Duxbury Braille Translator', 'Duxbury MegaDots']"], "sif": ["Windows Setup Information File", "Configuration file that contains setup information for Windows NT and XP; contains parameters referenced during the Windows operating system installation process; includes the target path, user data, OEM status, display resolution, network settings, and other information.", "Windows, Windows, Mac, Linux, ", "['Microsoft Windows XP', 'Microsoft Notepad', 'text editor']['Synfig Studio']['Synfig Studio']['Synfig Studio']"], "sidx": ["StuffIt Archive Index File", "Index file created by StuffIt Deluxe, a file compression and decompression utility; contains a list of reference information about files in a separate file archive; enables users to browse the contents of a particular archive without having to process or decompress it first.", "Windows, Mac, ", "['Smith Micro StuffIt Deluxe for Windows']['Smith Micro StuffIt Deluxe 16']"], "sid": ["Steam Game Data Backup File", "Backup file created by Steam, an application used to download and manage Valve video games on desktop computers; contains compressed game data created by the Steam backup feature (steambackup.exe program); used to backup games to DVDs or other external media.", "Windows, Mac, Windows, Mac, Linux, Windows, Mac, Linux, Windows, ", "['Valve Steam']['Valve Steam']['Lizardtech GeoExpress', 'Lizardtech GeoViewer', 'Lizardtech LiDAR Compressor', 'Lizardtech Express Server', 'ESRI ArcGIS for Desktop', 'ERDAS IMAGINE', 'ACD Systems Canvas X 2017', 'Web browser']['Web browser']['Lizardtech Express Server']['ACID 64 Player', 'quadraSID']['SIDPLAY', 'quadraSID']['Audacious', 'SIDPlayer']['AmsterCHEM ScanIt']"], "sib": ["Sibelius Score", "Musical score created with Sibelius music notation software; may be composed using software or a MIDI input device; can be used to play software instruments, but does not contain actual audio data.", "Windows, Mac, ", "['Avid Sibelius']['Avid Sibelius']"], "shy": ["ShyFile Encrypted File", "Encoded file that contains highly secured files or folders encrypted with ShyFile, an encryption program with a proprietary algorithm offering a symmetric depth of encryption of up to 6,144-bit; can be used to encrypt important Word and Excel documents and generate secure Web pages and e-mail attachments.", "Windows, ", "[]"], "shx": ["AutoCAD Compiled Shape File", "Compiled shape file created by AutoCAD, a 2D and 3D design and engineering application; may contain shape definitions as well as font definitions for displaying custom text; supports many Type 1 PostScript fonts; used for storing smaller building blocks and fonts that are frequently inserted in drawings.", "Windows, Windows, Windows, ", "['Autodesk AutoCAD 2017']['ESRI ArcGIS for Desktop'][]"], "shw": ["Corel Presentation", "Slide show or presentation created by Corel Presentations (part of WordPerfect Office); contains slides that may include text, images, and other media; may also be exported as a PowerPoint slideshow (.PPT file) or a self-executing file, which allows the slide show to be viewed by users who do not have Corel Presentations on their computers.", "Windows, Windows, Mac, Linux, ", "['Corel Presentations X8', 'CorelDRAW Graphics Suite X8']['Chamsys MagicQ']['Chamsys MagicQ']['Chamsys MagicQ']"], "shtml": ["Server Side Include HTML File", "Web page written in HTML that contains server side includes; processed (or parsed) by the Web server before being sent to the users browser; can reference other files on the server, i.e. \"header.shtml\" or \"_footer.shtml.\"", "Windows, Mac, Linux, ", "['Adobe Dreamweaver CC 2017', 'Microsoft Visual Studio 2017', 'Oracle NetBeans', 'Web browser', 'text editor']['Adobe Dreamweaver CC 2017', 'Oracle NetBeans', 'Web browser', 'text editor']['Oracle NetBeans']"], "shtm": ["HTML Server Side Include File", "Web page that can reference other files on the Web server; similar to a standard HTML document, but can access other files on the server when loaded; allows a standard HTML file to be somewhat dynamic.", "Windows, Mac, ", "['Adobe Dreamweaver CC 2017', 'Microsoft Internet Explorer', 'Web browser', 'Microsoft Notepad', 'text editor']['Adobe Dreamweaver CC 2017', 'Apple Safari', 'Web browser', 'Apple TextEdit', 'text editor']"], "shsh": ["iPhone/iPod Touch SHSH Blob File", "System file used by iPhone and iPod Touch devices; saves authorization information for device firmware updates; saves information specific to each individual device and disables the ability for devices to downgrade their firmware.", "Windows, Mac, Linux, ", "['Apple iTunes', 'TinyUmbrella']['Apple iTunes', 'TinyUmbrella']['TinyUmbrella']"], "shs": ["Microsoft Scrap File", "An SHS file is a file created by Microsoft Word and Excel when a user drags and drops selected document text onto the desktop.  It contains a copy of the highlighted contents in its native document format.  SHS files are used to copy portions of a document for insertion into another document.", "Windows, ", "['Microsoft Word 2016', 'Microsoft Excel 2016']"], "shr": ["Unix Shell Archive File", "Self-extracting archive created with the Unix shar program; contains a shell script with instructions on how to extract the contents; used on Unix systems with the Bourne shell installed.", "Windows, Linux, ", "[][]"], "show": ["Thinkfree Office NEO Presentation Document", "A SHOW file is a show document created by Presentation, an application included with the Thinkfree Office NEO suite used to create presentations.  It contains a collection of slides, which includes text, shapes, images, themes, and formatting.  SHOW files can be used in various personal and professional contexts such as picture slide shows and business meetings.", "Windows, Mac, Linux, iOS, ", "['Hancom Thinkfree Office NEO Presentation']['Hancom Thinkfree Office NEO Presentation']['Hancom Thinkfree Office NEO Presentation']['Hancom ThinkfreeOffice Viewer']"], "shp": ["Shapes File", "Object created and/or used by various 3D design programs; typically a three-dimensional image represented using polygons that are defined by vertices and lines; may also be a 2D drawing.", "Windows, Mac, Windows, Mac, Linux, Android, ", "['Autodesk AutoCAD 2017', 'Autodesk 3ds Max 2017', 'CorelCAD 2017']['CorelCAD 2017']['ESRI ArcGIS for Desktop', 'ACD Systems Canvas X 2017', 'Pitney Bowes MapInfo', 'Safe Software FME Desktop', 'ERDAS IMAGINE', 'Golden Software Voxler', 'TatukGIS Viewer', 'Merkaartor', 'Quantum GIS', 'gvSIG', 'uDig']['Merkaartor', 'Quantum GIS', 'uDig']['Merkaartor', 'Quantum GIS', 'gvSIG', 'uDig']['Quantum GIS']"], "shn": ["Shorten Compressed Audio File", "Audio file compressed using Shorten lossless compression; compresses CD-quality audio without losing any quality; similar to FLAC (.FLAC) and Monkey's Audio (.APE) compression.", "Windows, Mac, Linux, ", "[\"Trader's Little Helper\", 'Nullsoft Winamp with SnhAmp plugin', 'foobar2000 with foo_shn plugin', 'Microsoft Windows Media Player with SHN DirectShow Filter']['X Lossless Decoder', 'Cog', 'MacAmp Lite X']['XMMS with xmms-shn plugin']"], "shd": ["Windows Print Job Shadow File", "File created by Windows when a user submits a print job; stores header information for a print job, but does not store the actual spooled document data; allows the print job settings to be \"shadowed\" so that the job can be resubmitted again if there is an interruption.", "Windows, ", "['Microsoft Windows']"], "sgp": ["MP3 Audio Mixer Sound Group Project", "Audio project file created by MP3 Audio Mixer, a program that allows user to create multi-track audio mixes with .MP3, .WMA, and .WAV files; stores a reference to each audio file used in the sound group as well as the timeline offsets for each audio file and any effects.", "Windows, ", "['Acoustica MP3 Audio Mixer']"], "sh3d": ["Sweet Home 3D Design File", "Home layout created with Sweet Home 3D, a free interior design application; includes both a 2D and 3D view of the house plan; contains predefined 3D models that can be custom arranged by the user.", "Windows, Mac, Linux, ", "[][][]"], "sh": ["Bash Shell Script", "An SH file is a script programmed for bash, a type of Unix shell (Bourne-Again SHell).  It contains instructions written in the Bash language and can be executed by typing text commands within the shell's command-line interface.", "Windows, Mac, Linux, Windows, Linux, ", "['File Viewer Plus', 'gVim', 'Notepad++', 'GNU Bash', 'Cygwin']['Apple Terminal', 'iTerm', 'MacVim', 'GNU Bash']['GNU Bash', 'Vim'][][]"], "sgpbprj": ["Baltie Project", "Project created by SGP Baltie, an object-oriented tool based on C# language used for teaching adults and children how to create their own computer program; contains a project created by the user; includes numerous aspects of the program such as constants, methods, edited models, tiles, specified distance between two points, customized Balties (little wizards), and more; can be used to generate an .EXE file for your program.", "Windows, ", "['SGP Baltie 4']"], "sgml": ["Standard Generalized Markup Language File", "Document written in Standard Generalized Markup Language (SGML); includes tags that describe the information's structure and content; may contain multiple types of information, such as text, graphics, database information, and even audio and video data.", "Windows, Linux, ", "['Adobe FrameMaker', 'Corel WordPerfect X8', 'epcEdit']['epcEdit', 'jw']"], "sgt": ["SPSS Chart Template", "File created by SPSS, a statistical analysis application; saves a chart template, which can be for a bar chart, line chart, scatter plot, histogram, or another chart type supported by the software; used for generating charts with the same appearance.", "Windows, Mac, Linux, ", "['IBM SPSS']['IBM SPSS']['IBM SPSS']"], "sh3f": ["Sweet Home 3D Model Library", "Collection of 3D models that can be imported into Sweet Home 3D, a free interior design program; may include furniture, windows, doors, shelving, lamps, or other household objects.", "Windows, Mac, Linux, ", "[][][]"], "sgm": ["VisualBoyAdvance Saved Game", "Saved state file created by VisualBoyAdvance, a Game Boy emulator; contains a snapshot of the game state, which can be saved at any time during gameplay; used for saving and loading in-game progress.", "Windows, Windows, Windows, ", "['VisualBoyAdvance']['Adobe FrameMaker', 'Corel WordPerfect X8']['Starpoint Gemini 2']"], "sgb": ["Dawn of War Map File", "File used by Dawn of War, a real-time strategy game; contains a multi-player map with starting and resource locations, terrain, map size, and victory conditions; used to create modifications and new maps for original game content.", "Windows, Windows, Mac, ", "['Relic Entertainment Dawn of War']['VisualBoyAdvance']['VisualBoyAdvance']"], "sfz": ["SFZ Sample Definition File", "Audio sample definition file saved in the SFZ format and used to define instruments; contains opcodes that define audio sample attributes, such as their map location across a standard MIDI keyboard and how notes will respond to velocity; also includes the default path used to locate the collection of samples, most likely .WAV, .AIFF, .MP3, .OGG, or .FLAC files.", "Windows, Mac, ", "['Plogue sforzando']['Plogue sforzando']"], "sga": ["Relic Entertainment Game Archive", "Game archive file used by Relic Entertainment games such as WarHammer 40,000: Dawn of War (DoW), Company of Heroes (CoH), and WarHammer 40,000: Dawn of War II (DoW2); used for game assets and may contain various types of files, including maps, graphics, game scripts (.LUA files), audio (.FDA files), and game unit information.", "Windows, ", "['Mod Studio 2', \"Corsix's Mod Studio\", 'Relic Entertainment Dawn of War', 'Relic Entertainment Dawn of War 2', 'Relic Entertainment Company of Heroes', 'sga4to5']"], "sg0": ["Humongous Entertainment Game Save File", "Game file created and used by Humongous Entertainment games, such as Backyard Baseball and the Pajama Sam series; stores saved progress of your game; referenced by the game when continuing a saved game.", "Windows, Mac, Linux, ", "[\"Humongous Entertainment Pajama Sam's Sock Works\"][\"Humongous Entertainment Pajama Sam's Sock Works\"][\"Humongous Entertainment Pajama Sam's Sock Works\"]"], "sfx": ["Windows Self-Extracting Archive", "Compressed archive containing one or more files; may use one of several different types of compression, such as .7Z, .ZIP, or .RAR compression; runs itself when opened and decompresses and extracts the contents; allows users to open the archive without needing a file decompression program.", "Windows, Mac, ", "['Microsoft Windows', 'WinRAR 5', 'Corel WinZip 21', '7-Zip', 'PeaZip']['Incredible Bee Archiver']"], "sfvidcap": ["Sonic Foundry Video Capture File", "Project file containing video clips captured with or imported into Sonic Foundry Vegas; created by saving \"advanced capture data\" within the Vegas video-editing program.", "Windows, ", "['MAGIX Vegas Pro 14']"], "sfv": ["Simple File Verification File", "Stores plain text checksum data for a file, folder, or disk that indicates what data it contains; can be used to check for corrupt files, missing files, or files of the wrong size.", "Windows, Mac, Linux, ", "['QuickSFV', 'Code Sector TeraCopy', 'Traction SFV Checker', 'MooSFV', 'RapidCRC', 'SlavaSoft FSUM']['SuperSFV', 'MacSFV', 'checkSum+']['QuickSFV', 'Check SFV']"], "sft": ["Microsoft App-V Sequencer File", "File used by Microsoft Application Virtualization (App-V) Sequencer, a program used for deploying and updating applications within a Windows Enterprise environment; contains data required to deploy and configure a virtual application; used by system administrators when configuring virtual desktops for users.", "Windows, ", "['Microsoft App-V Sequencer']"], "sfs": ["Kerbal Space Program Save File", "File created by Kerbal Space Program (KSP), a game where players build and manage a space program; saves the state of the game as a file called persistent.sfs; allows the game to be resumed.", "Windows, Mac, Windows, Linux, Windows, ", "['Squad Kerbal Space Program']['Squad Kerbal Space Program']['7-Zip', 'PeaZip']['Squashfs']['sfxr']"], "sfpack": ["Packed SoundFont File", "File that contains a compressed SoundFont (.SF2) file; contains a set of audio samples that can be used for creating sounds for games and other applications; can be decompressed to the SF2 file using SFPack, a an older Windows utility from Megota Software.", "Windows, ", "['SFPack']"], "sfo": ["PSP Game Parameters File", "Contains information about a Playstation Portable (PSP) game, such as the category, disc version, parental level, region code, titles, and updater version; usually stored within a .PBP file", "Windows, Windows, Mac, ", "['PBP Unpacker'][][]"], "sfl": ["Sound Forge Pro Sound Data File", "Stores regions and markers information about a specific sound file; created automatically by Sound Forge Pro when user edits have been made to a sound file; saved in the same directory as the corresponding audio file with the same name, but with a \"*.sfl\" extension.", "Windows, ", "['MAGIX Sound Forge Pro 11', 'MAGIX Vegas Pro 14']"], "sfar": ["Mass Effect 3 DLC File", "Game data file used by Mass Effect 3, a first person role-playing game set in outer space; stores DLC (downloadable content) used for extending the game with new content and features.", "Windows, ", "['Electronic Arts Mass Effect 3', 'ME3 Explorer']"], "sfk": ["Sound Forge Pro Audio Peak File", "Stores the waveform image of an audio wave (.WAV) file saved by Sound Forge Pro, MAGIX Vegas, or a Sony digital media device; created automatically when an audio file is opened with Sound Forge Pro or Vegas; stored in the same folder with the same name as the audio file, but with \".sfk\" added after the original extension.", "Windows, ", "['MAGIX Sound Forge Pro 11', 'MAGIX ACID Pro 7', 'MAGIX Vegas Pro 14']"], "sff": ["M.U.G.E.N. Sprite File", "Graphics file used by M.U.G.E.N., a freeware 2D fighting game engine; stores sprites, which are graphics that store the animation states for a fighter or other animated object; can store sprites for jumping, kicking, punching, running, or other movements.", "Windows, Windows, Windows, Mac, Linux, ", "['Elecbyte M.U.G.E.N.', 'VirtuallTek Systems Fighter Factory Ultimate']['Heracle BioSoft SFF Workbench', 'The MathWorks MATLAB', '454 Life Sciences GS Data Analysis Software']['LEAD Technologies LEADTOOLS Imaging SDK', 'Newera Graphics Converter Pro', 'IrfanView', 'XnViewMP']['XnViewMP']['XnViewMP']"], "sfd": ["Sofdec Dreamcast Movie", "Video file used by video games made for Sega Dreamcast, Nintendo GameCube, Microsoft Xbox, and other video game console systems; saves video in an uncommon \"Sofdec\" format that is not playable on standard video players; used for playing video game cinematic sequences.", "Windows, Mac, Linux, Mac, Linux, ", "['PES Video & Audio Converter', 'VideoLAN VLC media player', 'Media Player Classic']['VideoLAN VLC media player']['VideoLAN VLC media player']['FontForge']['FontForge']"], "sfc": ["Super Nintendo ROM", "Game ROM used by SNES emulators such as ZSNES and Snes9x; saves a game in the original format used by the SNES system; enables the game to be played by software that emulates the original SNES.", "Windows, Mac, Linux, Windows, Mac, Windows, ", "['ZSNES', 'Snes9x', 'higan', 'SNEeSe', 'SnEM']['Snes9x']['Snes9x']['Motic Images Plus']['Motic Images Plus'][]"], "sf2": ["SoundFont 2 Sound Bank", "Defines a group of audio samples that can be played back using MIDI data; often called a \"patch collection.\"", "Windows, Mac, ", "['Cakewalk SONAR X3', 'Native Instruments Kontakt', 'Mario Paint Composer']['Native Instruments Kontakt']"], "set": ["Document Library Property Set File", "Contains properties used by Xerox Document Library software, which organizes documents into virtual \"cabinets\" on a computer; property sets can be applied to cabinets created by Xerox FreeFlow software.", "Windows, Windows, Windows, Mac, ", "[]['Alpha Software Alpha Anywhere'][][]"], "sesx": ["Adobe Audition Session File", "Session file created by Adobe Audition, an audio production application; saves a multitrack audio project in an XML format but only includes references to the audio files and does not contain the audio data itself; used for saving music projects.", "Windows, Mac, ", "['Adobe Audition CC 2017']['Adobe Audition CC 2017']"], "settings": ["Visual Studio Settings File", "Customized settings file created by Visual Studio, a Windows software development tool created by Microsoft; contains properties for projects and programs that can be accessed in C# program code using the Properties.Settings.* API; used for storing settings that need to be frequently-accessed.", "Windows, Windows, Mac, Linux, ", "['Microsoft Visual Studio 2017']['Mojang Minecraft with iConomy plug-in']['Mojang Minecraft with iConomy plug-in']['Mojang Minecraft with iConomy plug-in']"], "settingcontent-ms": ["Windows Settings File", "File created for the Windows 8.1 operating system; contains setting content for Windows functions, such as how updates are installed or what default apps should be used to open particular file types; contained content is written in XML language.", "Windows, ", "['Microsoft Windows']"], "session": ["CATIA 4 Session File", "Session file created by CATIA version 4, a program used for 3D product design and simulation; contains references to .MODEL files or copies of MODEL files, depending on the save option selected; used to save models from a work session.", "Windows, Mac, Web, ", "['Dassault Systemes CATIA', 'Okino Computer Graphics PolyTrans', 'Adobe Acrobat DC']['Adobe Acrobat DC']['Mozilla Firefox', 'Session Manager']"], "ses": ["Patran Session File", "Session created by MSC Patran, a pre and post-processing program for Finite Element Analysis (FEA); contains a list of directives, such as PCL statements or NOODL commands, that can be executed by Patran; automatically opened when Patran is started and closed when Patran is quit.", "Windows, Linux, Windows, ", "['MSC Patran']['MSC Patran']['Adobe Audition CC 2017', 'Suite Spot Studios Ses2Sesx']"], "seq": ["PowerTracks Pro Audio Project File", "Audio project created with PowerTracks Pro Audio, a digital audio sequencing program; may include both audio and MIDI tracks, which can be played back at the same time; also stores digital mixer settings, such as track volume, panning, and effects.", "Windows, Windows, Windows, Mac, ", "['PG Music PowerTracks Pro Audio']['NorPix StreamPix']['GSL Biotech SnapGene', 'Heracle BioSoft DNA Baser', 'DNASTAR Lasergene', 'Genome Compiler', 'text editor']['GSL Biotech SnapGene', 'DNASTAR Lasergene', 'Genome Compiler', 'text editor']"], "seo": ["SEO Note File", "Notes file created with SEO Note, a freeware personal and business information management program; allows data to be stored in text, rich text, or HTML formats and may include multiple documents in a single file.", "Windows, ", "[]"], "sen": ["SenTest Data File", "Data file created with SenTest, a scientific application used for sensitivity testing and data analysis; contains the results of tests conducted with sensitivity recording equipment.", "Windows, Windows, ", "['Neyer Software SenTest'][]"], "sef": ["Encryptafile Signature File", "Digital signature created by Encryptafile after running the \"Sign a File\" task; used to verify the identity of a Encryptafile .EFL file; may store the signature in a digital envelope if the digital envelope option is selected in the signature options.\r\n", "Windows, Windows, ", "[]['Steganos Password Manager', 'Steganos Privacy Suite']"], "seed": ["Linux Preseed File", "Installer file included on Linux OS disks, such as an Ubuntu Linux installation CD; saved in a text format with four fields per line; each line includes the name of the program that should run the command, and the variable's name, type, and value.", "Linux, ", "[]"], "sea": ["Self-Extracting Archive", "Compressed file archive that uncompresses itself when opened; often created with StuffIt SEA Maker, part of Stuffit Deluxe for Mac OS X; may also be created by various Mac OS Classic utilities, including StuffIt, Disk Doubler, or Compact Pro.", "Windows, Mac, ", "['Smith Micro StuffIt Deluxe for Windows']['Smith Micro StuffIt Deluxe 16', 'The Unarchiver']"], "searchconnector-ms": ["Windows Search Connector File", "Saved search file created by Microsoft Windows; contains connection information for a remote location; used for connecting to Web services and remote storage locations; allows remote files to be browsed using the Windows Explorer user interface.", "Windows, ", "['Microsoft Windows']"], "search-ms": ["Windows Saved Search File", "File created by the Windows operating system; stores Windows Explorer saved search results in an XML format; created when a user selects the Save Search button after performing a search; creates a new window with the search results when opened.", "Windows, ", "['Microsoft Windows']"], "sed": ["IExpress Self Extraction Directive File", "File created by IExpress Wizard, a built-in Windows program used for creating Windows installers; contains options used for building a software installation package (.EXE file); includes the files to build into the package, the output package filename, popup messages for the installation process, and various other options.", "Windows, Linux, ", "['Microsoft IExpress Wizard']['sed']"], "sec": ["PGP Secret Key Ring", "Contains ASCII armored private keys used for decrypting PGP (Pretty Good Privacy) encrypted files", "Windows, Mac, Windows, Mac, Linux, Windows, ", "[][]['Samsung SmartViewer', 'Samsung Net-i Viewer', 'FFmpeg']['FFmpeg']['FFmpeg']['Microsoft Windows with USB connection']"], "se1": ["Swiss Ephemeris Data File", "Data file created and used by Swiss Ephemeris, a high precision ephemeris used to compute complete horoscopes; contains data about planets, moons, or planetoids; used to increase the precision of the built-in default ephemeris. ", "Windows, ", "['Astrodienst Swiss Ephemeris']"], "sdx": ["Kivuto Secure Download Manager File", "An SDX file is a file used by Kivuto Solutions' Secure Download Manager (SDM), a program used for downloading files from web stores such as DreamSpark and OnTheHub.  It saves information required to download the purchased item, but does not contain the actual purchased item itself.", "Windows, Mac, Windows, Mac, ", "['Kivuto Secure Download Manager']['Kivuto Secure Download Manager']['Apple QuickTime Player', 'FMJ-Software Awave Studio']['Apple QuickTime Player']"], "sdz": ["Spring Content Package", "File used by games developed with Spring, a real-time strategy (RTS) game engine; saves game files in a compressed .ZIP format, but uses the \".sdz\" extension; used for maps, graphics, computer artificial intelligence (AI) scripts (.LUA files), and other game content.", "Windows, Mac, Linux, Windows, Mac, Linux, ", "['Spring', 'Corel WinZip 21', '7-Zip']['Spring', 'Apple Archive Utility']['Spring']['Smith Micro StuffIt Deluxe for Windows', 'ConeXware PowerArchiver', 'Corel WinZip 21', '7-Zip']['Apple Archive Utility', 'Smith Micro StuffIt Deluxe 16', 'The Unarchiver']['gzip']"], "sdw": ["MrSID World File", "GIS file created for MrSID .SID raster images; contains georeferencing information that maps the raster image data in the SID file to real-world coordinates; contains the units of measurement for the image pixels as well as the coordinates of the upper-left hand pixel.", "Windows, Windows, Mac, Linux, ", "['ESRI ArcGIS for Desktop', 'Blue Marble Geographics Global Mapper', 'GDAL']['Apache OpenOffice', 'LibreOffice']['Apache OpenOffice', 'Planamesa NeoOffice', 'LibreOffice']['Apache OpenOffice', 'LibreOffice']"], "sdr": ["Dell Support File", "File named dell.sdr and located on Dell computers in the C:\\ directory; contains system information and is used by Dell technical support purposes; should not be manually edited or deleted or any requests for Dell support may not work properly.", "Windows, Windows, ", "['Dell Support Center']['SmartDraw']"], "sdsk": ["SafeHouse Private Storage Volume", "Virtual disk created by SafeHouse, a file privacy program; stores files and folders in an encrypted format that is password protected.", "Windows, ", "['PC Dynamics SafeHouse']"], "sds": ["OpenOffice.org Chart", "Chart format saved by the Chart application within the OpenOffice.org and StarOffice productivity suites; may be opened by either program.", "Windows, Mac, Linux, Windows, Mac, Windows, ", "['Apache OpenOffice']['Apache OpenOffice', 'Planamesa NeoOffice']['Apache OpenOffice']['FMJ-Software Awave Studio', 'Apple QuickTime Player', 'Nullsoft Winamp']['Apple QuickTime Player'][]"], "sdv": ["Studio DV Project File", "Project file created by Studio DV, a video editing program developed by Pinnacle; contains video project settings and references to media and other data files used by the project; some included settings are video and title transitions.\r\n", "Windows, ", "['Pinnacle Studio 20']"], "sdt": ["Siemens Desktop Theme File", "Theme used by some Siemens mobile phones; saved using .ZIP formatting and contains an archive of graphics (.GIF), sounds (.WAV or .MID), and layout (.STC) information for the phone's global theme; can be decompressed manually with any ZIP compatible utility.", "Windows, Windows, Windows, Windows, ", "['Corel WinZip 21', '7-Zip']['Dragon UnPACKer']['SmartDraw']['Rockstar Games Grand Theft Auto 3']"], "sdp": ["Session Description Protocol File", "Informational file created with media broadcasting software; contains the format, timing, and authorship of the streamed media; may be created for live streaming media with a program like Sorenson Broadcaster or for prerecorded media using a program like PlaylistBroadcaster.", "Windows, Mac, Windows, Mac, Linux, ", "['Apple QuickTime Player', 'RealNetworks RealPlayer Cloud', 'VideoLAN VLC media player']['Apple QuickTime Player', 'RealNetworks RealPlayer Cloud', 'Macgo Mac Media Player', 'VideoLAN VLC media player']['Apache OpenOffice', 'LibreOffice']['Apache OpenOffice', 'Planamesa NeoOffice', 'LibreOffice']['Apache OpenOffice', 'LibreOffice']"], "sdlxliff": ["SDL Trados XLIFF Localization File", "File created by SDL Trados, a program used for translation; based on the open XLIFF (XML Localization Interchange File Format) standard, but contains some proprietary extensions; can be converted to the .TTX format in SDL Trados to exchange the data in a more commonly used translation format.", "Windows, ", "['SDL Trados Studio', 'TMServe SDLXliff2Tmx']"], "sdl": ["Scene Description Language File", "File format used by ray tracing, GIS, and mapping programs such as Autodesk MapGuide; specifies the elements required to render a scene, such as models, lights, and animations; may vary in format depending on the specific implementation of the Scene Description Language (SDL), but is generally stored in ASCII text or XML.", "Windows, Windows, ", "['Autodesk Infrastructure Map Server 2017', 'Safe Software FME Desktop with MapGuide SDL Reader/Writer', 'text editor']['Microsoft Visual Studio 2017']"], "sdg": ["Strater Project File", "Project file created by Strater, a borehole plotting program used for creating borehole and well log visualizations; includes data about subsurface materials encountered at different depths underground; can be a design or a plot from real-world data.", "Windows, ", "['Golden Software Strater']"], "sdc": ["Apache OpenOffice Calc Spreadsheet", "Spreadsheet created with the Calc spreadsheet program included with Apache OpenOffice and StarOffice; includes flexible cell formatting options, such as freely rotating contents, backgrounds, borders, and templates.", "Windows, Mac, Linux, Windows, Windows, ", "['Apache OpenOffice', 'LibreOffice']['Apache OpenOffice', 'Planamesa NeoOffice', 'LibreOffice']['Apache OpenOffice', 'LibreOffice']['Stardock Central'][]"], "sdef": ["AppleScript Dictionary Document", "XML dictionary file created for scripts written in the AppleScript language; contains a dictionary of terms, which includes classes (nouns), properties (adjectives), commands (verbs), and parameters (adverbs); stores the terminology used to communicate with the underlying program being controlled by the script.", "Mac, ", "['Apple AppleScript Editor', 'Apple Xcode']"], "sdb": ["Custom Application Compatibility Database", "Database that contains additional Windows registry information; patches the registry to make it compatible with newly installed applications; can be installed on an individual system or on multiple systems over a network.", "Windows, Windows, Windows, Mac, Windows, Windows, Mac, Windows, Mac, Linux, Windows, Mac, Linux, ", "['Microsoft Compatibility Database Installer Tool']['Computers & Structures SAP2000']['Web browser']['Web browser'][][][]['SparkleDB']['SparkleDB']['SparkleDB']['Apache OpenOffice']['Apache OpenOffice']['Apache OpenOffice']"], "sdf": ["SQL Server Compact Database File", "Compact relational database developed by Microsoft, also known the SQL Server Compact (SQL CE) format; designed for applications that run on mobile devices and desktops; contains the complete database contents and can be up to 4GB in size.", "Windows, Windows, Linux, Windows, Windows, Mac, Linux, Windows, ", "['Microsoft SQL Server 2016', 'Microsoft Visual Studio 2017']['Autodesk AutoCAD Map 3D 2017', 'Autodesk AutoCAD Civil 3D 2017', 'Safe Software FME Desktop', 'MapGuide Open Source']['MapGuide Open Source']['Pervasive PSQL', 'dBase']['Avogadro', 'NISS PowerMV', 'Hyleos ChemFileBrowser', 'OpenEye Scientific VIDA', 'Advanced Chemistry Development ACD/ChemFolder', 'CheD']['Avogadro', 'OpenEye Scientific VIDA']['Avogadro', 'OpenEye Scientific VIDA']['Massive Entertainment World in Conflict', 'Massive Entertainment WicEd']"], "sdat": ["Nintendo DS Sound Data File", "Audio data file used by the Nintendo DS, a portable game system; contains sound files for the game, such as .SSEQ audio files; used to store music and sounds that are played back during gameplay.", "Windows, ", "['VGMToolbox']"], "sd7": ["Spring Content Package", "Content package created for the Spring engine, a real-time strategy (RTS) game engine; contains game files stored together in a compressed .7Z format; can contain maps, graphics, AI scripts (.LUA files), and other game content.", "Windows, ", "['Spring']"], "sd2": ["Sound Designer II File", "Audio file created in the Sound Designer II format, which was originally developed by Digidesign for Macintosh audio recording programs; can be both mono or stereo and supports various bit depths and sample rates; used for exchanging audio data between applications.", "Windows, Mac, ", "['Apple QuickTime Player', 'Apple iTunes', 'Avid Pro Tools', 'River Past Audio Converter']['Apple QuickTime Player', 'Apple iTunes', 'Avid Pro Tools']"], "sd": ["ESPS Sampled Data File", "Audio format created by Entropic Research Laboratories and used for the WAVES+ display program, ESPS signal processing library, and the HTK speech recognition toolkit", "Windows, Windows, Mac, ", "['FMJ-Software Awave Studio']['Avid Pro Tools', 'FMJ-Software Awave Studio']['Avid Pro Tools']"], "scz": ["SmartDraw Collection Package File", "File saved by SmartDraw, a professional diagramming program; contains a collection of SmartDraw files; used for saving groups of files together, such as .SDR files and images; also used for maintaining reference links to local files and hyperlinks to remote files.", "Windows, ", "['SmartDraw']"], "scworld": ["Survivalcraft World File", "World file format used by Survivalcraft, a survival game that features gameplay and graphics similar to Minecraft; stores all the data that makes up a playable world, such as location of caves and available resources.", "Windows, Web, iOS, Android, ", "['Candy Rufus Games Survivalcraft for Windows', 'Smart BI Serv Cave View']['Survivalcraft File Explorer']['Candy Rufus Games Survivalcraft', 'Smart BI Serv Cave View']['Candy Rufus Games Survivalcraft']"], "scw": ["Score Writer Document", "Musical score created with Score Writer or Score Writer 2 software; uses a simplified interface for creating arrangements for bands and small orchestras, as well as lead sheets, and choral parts for individual musicians.", "Windows, Mac, Windows, Mac, ", "[][][][]"], "scx": ["Microsoft Game Scenario File", "Scenario file used by Microsoft real-time strategy games; contains level or campaign data for specific missions; typically installed within the same directory as the game itself.", "Windows, Mac, Windows, Mac, Windows, Mac, ", "[][][][]['Microsoft Visual FoxPro']['Solutions Etcetera SuperCard', 'Solutions Etcetera SuperCard Help']"], "scv": ["ScanVec CASmate Sign File", "Sign design created with ScanVec CASmate software; saved in a vector image format that can be scaled to large sizes without losing any quality; also recognized by some cutters, engravers, and routers as machine input.", "Windows, ", "[]"], "scss": ["Sass Cascading Style Sheet", "Style sheet that contains Sass language; similar to a .CSS file but with added capabilities, such as variables, nested rules, and mixins; used to format contents of a Web page.", "Windows, Mac, Linux, ", "['Compass.app', 'Notepad++', 'Adobe Dreamweaver CC 2017', 'text editor']['Compass.app', 'CodeKit', 'Apple TextEdit', 'Adobe Dreamweaver CC 2017', 'text editor']['Compass.app']"], "sct": ["Windows Scriptlet", "Script used to create a Component Object Model (.COM) component; may be written in various scripting languages such as VBScript, JavaScript, or JScript; runs itself in Windows if the Windows Scripting Host is installed.", "Windows, Windows, Windows, Mac, ", "['Microsoft Notepad', 'text editor']['Microsoft Visual FoxPro']['Adobe Photoshop CC 2017', 'Adobe Photoshop Elements 15', 'Adobe InDesign CC 2017', 'CorelDRAW Graphics Suite X8', 'Corel PaintShop Pro X9', 'Corel Presentations X8', 'fCoder Group Image Converter Plus', 'XnViewMP']['Adobe Photoshop CC 2017', 'Adobe Photoshop Elements 15', 'Adobe InDesign CC 2017', 'XnViewMP']"], "scs11": ["Show Cue System Cue File", "XML file created by Show Cue System (SCS) 11, a program used for playing music and sound effect cues during live theatre performances; saves an ordered list of audio files, each of which can be played when triggered by the user.", "Windows, ", "['Show Cue System']"], "scs": ["SimCity Societies Saved Game File", "Saved game file created by SimCity Societies or SimCity Societies Destinations, two related games that allow players to create and simulate their own cities and societies; contains a city created during gameplay; used for saving cities and sharing game states with friends.", "Windows, Windows, Mac, Linux, ", "['EA Simcity Societies']['SCS Prism3D', 'WinRAR 5']['SCS Prism3D']['SCS Prism3D']"], "scrivx": ["Scrivener XML Document", "Document created by Scrivener, a tool used by writers for composing scripts, novels, and other documents; stores the written text as well as document layout and structure information in an XML format; can also include a layout of concepts alongside the written content.", "Windows, Mac, ", "['Literature & Latte Scrivener']['Literature & Latte Scrivener']"], "scriptterminology": ["AppleScript Script Terminology File", "File used by Mac OS X applications that include AppleScript support; contains a mapping between developer-defined class names and the English (or other language) terminology that is used in the implemented AppleScript; allows AppleScript to know what the valid commands are for the developer's scripts.", "Mac, ", "['Apple AppleScript Editor', 'Apple Xcode', 'MacroMates TextMate', 'Apple TextEdit', 'text editor']"], "scriv": ["Scrivener Document", "Document created by Scrivener, a writing studio used for composing novels, research papers, and scripts; saves the written text, layout structure, and outline of the document; also enables writers to save a conceptual layout of ideas alongside the written content.", "Windows, Mac, ", "['Literature & Latte Scrivener']['Literature & Latte Scrivener']"], "script": ["Generic Script File", "Script that may be written in one of many scripting languages; typically contains variables and functions that can be run using the appropriate scripting engine.", "Windows, Mac, Linux, ", "['text editor']['text editor']['text editor']"], "scriptsuite": ["AppleScript Script Suite File", "File used by Mac OS X applications that include AppleScript support; stores a property list that specifies a mapping between developer-defined classes and the underlying Apple event codes; used with a .SCRIPTTERMINOLOGY file that contains valid AppleScript syntax.", "Mac, ", "['Apple AppleScript Editor', 'Apple TextEdit', 'text editor']"], "screenflow": ["ScreenFlow Document", "Screen recording project created by ScreenFlow, a desktop screencasting application for Mac OS X; stores a bundle of project files and includes the captured .SCC video file; used for saving and resuming screencasting projects.", "Mac, ", "['Telestream ScreenFlow']"], "scr": ["Windows Screensaver", "Screensaver file for Windows, typically stored in the main Windows directory; may be run automatically when the computer is inactive for several minutes (custom settings can be configured using the Screen Saver control panel).", "Windows, Windows, Mac, ", "['Microsoft Windows']['text editor', 'Autodesk AutoCAD 2017']['text editor']"], "scptd": ["AppleScript Script Bundle", "Compiled script created by AppleScript Editor; a script editor that uses AppleScript, an automation scripting language; contains a compiled script.", "Mac, ", "['Apple AppleScript Editor']"], "scpt": ["AppleScript Script File", "An SCPT file is a compiled script created with Apple's Script Editor.  It is written in AppleScript, an automation scripting language used by Mac computers.  SCPT files may be written manually or generated by recording actions.", "Mac, ", "['Apple AppleScript Editor', 'MacroMates TextMate']"], "sco": ["TotalRecovery Backup Image", "Backup file created by TotalRecovery, a system backup and recovery application; stores a disk image of a disk partition or the whole hard drive; can be used for restoring the computer system state exactly as it was saved.", "Windows, Windows, ", "['FarStone TotalRecovery']['MR Software OMSI The Bus Simulator 2']"], "scn": ["Age of Mythology Scenario File", "Scenario file used by Age of Mythology, a real-time strategy game where players participate in mythological campaigns by controlling armies and units; contains a campaign map with terrain, units, player starting locations, and victory conditions.", "Windows, Windows, Windows, Mac, Windows, Windows, Windows, Windows, ", "['Microsoft Age of Mythology', 'Microsoft Age of Mythology: The Titans Expansion', 'Microsoft Age of Empires', 'CPNBUILD']['OpenTTD', 'Microprose Transport Tycoon']['Maxis SimCity 2000']['Maxis SimCity 2000']['Pinnacle Studio 20']['Orbiter']['Technology Design TD Scan']['TreePaint Plus']"], "scm": ["GIMP Script-Fu Script", "Script written for the GIMP image editing program; used for automating actions or adding artistic effects to images opened in the GIMP editor; similar to a Photoshop plugin, but saved as a script file.", "Windows, Mac, Linux, Windows, Mac, Windows, Windows, Windows, Mac, Linux, Windows, Mac, Linux, Windows, ", "['GIMP']['GIMP']['GIMP']['Blizzard StarCraft']['Blizzard StarCraft']['SmartGuyz ScreenCam', 'Microsoft PowerPoint 2016']['Sanny Builder', 'Rockstar Games Grand Theft Auto: San Andreas']['SamyGO ChanEdit']['SamyGO ChanEdit']['SamyGO ChanEdit']['text editor']['text editor']['text editor']['Media Player Classic with SCM codec', 'KMPlayer', 'Microsoft Windows Media Player with SCM codec']"], "schematic": ["MCEdit Schematic File", "Template file used by MCEdit, a program used to make levels for Minecraft, a 3D sandbox construction game; stores an arrangement of custom blocks that make up part of a level; can be used for storing any type of level objects, including buildings, bodies of water, and mobs.", "Windows, Mac, Linux, Web, ", "['MCEdit', 'WorldEdit', 'Redstone Simulator', 'Minecraft Note Block Studio', 'NBTExplorer']['MCEdit', 'WorldEdit', 'Redstone Simulator', 'NBTExplorer']['MCEdit', 'WorldEdit', 'Redstone Simulator', 'NBTExplorer']['Javascript Redstone Simulator']"], "sch": ["SuperCard Help Project File", "Project file created by SuperCard, a visual authoring tool for Mac OS X; stores data for a help project, which contains indexable help content; used for extending the SuperCard Help System.", "Mac, Windows, Mac, Linux, Mac, Linux, Windows, Mac, Linux, Windows, ", "['Solutions Etcetera SuperCard', 'Solutions Etcetera SuperCard Help']['CadSoft EAGLE']['CadSoft EAGLE']['CadSoft EAGLE']['gEDA']['gEDA']['KiCad']['KiCad']['KiCad']['Golden Software Strater']"], "scgs": ["myPM SCG Starter Data File", "Data file created by myPM SCG Starter, a program used to generate histograms, S curves, and project statistics from Excel data; contains one or more SCG definitions that can be modified.", "Windows, ", "['Midori Media myPM SCG Starter']"], "scgp": ["myPM SCG Pro Data File", "Data file created by myPM SCG Pro, an application that integrates with Excel to generate histograms, S curves, and project statistics of the Excel data; contains one or more SCG definitions that can be modified.", "Windows, ", "['Midori Media myPM SCG Pro', 'Midori Media myPM SCG Classic']"], "scgc": ["myPM SCG Classic Data File", "Data file created by myPM SCG Classic, a program that integrates with Excel to generate histograms, S curves, and project statistics of the Excel data; contains one or more SCG definitions that can be modified.", "Windows, ", "['Midori Media myPM SCG Classic', 'Midori Media myPM SCG Pro']"], "scg": ["myPM SCG Definition File", "Data file created by myPM SCG, a program used by project managers to generate \"S curves;\" contains SCG definitions, which specify the type of S curve to generate and an input and output file; used for creating outputs that visualize costs, labor hours, or other quantities.", "Windows, Windows, Mac, Linux, ", "['Midori Media myPM SCG Classic']['XnViewMP']['XnViewMP']['XnViewMP']"], "scf": ["Windows Explorer Command", "Command used by Windows Explorer; for example, to move up or down a directory or show the Desktop; run via Internet Explorer.", "Windows, Windows, Mac, Linux, Windows, Mac, ", "['SCF Editor', 'Microsoft Windows']['GSL Biotech SnapGene', 'Heracle BioSoft DNA Baser', 'Technelysium Chromas', 'DNASTAR Lasergene', 'Genome Compiler']['GSL Biotech SnapGene', '4Peaks', 'Genome Compiler']['EMBOSS abiview'][][]"], "scdoc": ["SpaceClaim Document", "SpaceClaim document created and used by SpaceClaim, a solid modeling CAD application; contains a 3D design, which includes IDs for 3D objects such as surfaces, edges, solids, bodies, and faces that appear in your design.", "Windows, ", "['SpaceClaim Engineer']"], "scb": ["Scala Published Script", "Script created with Scala, a digital signage management program; contains instructions used to control digital signs; similar to an .SCA file, but is saved in a published format that cannot be edited.", "Windows, Windows, ", "['Scala Designer', 'Scala Content Manager', 'Scala Ad Manager'][]"], "scd": ["TurboTax Tax Schedule List", "Tax schedule file exported by TurboTax tax preparation software; includes a complete list of tax forms and schedules supported by the version of TurboTax that exported the file; saved in a plain text format that can be viewed in a text editor.", "Windows, Mac, Mac, ", "['Intuit TurboTax Deluxe', 'Intuit Quicken']['Intuit TurboTax Deluxe', 'Intuit Quicken']['ProSoft Engineering Data Rescue 3']"], "scc": ["SourceSafe Source Code Control File", "File used by Microsoft Visual SourceSafe, a version control system that integrates with Visual Studio; contains source code control information used to get and commit developer files; used by the application for managing local copies of projects under source control.", "Windows, Mac, Windows, Mac, ", "['Microsoft Visual SourceSafe', 'Microsoft Visual Studio 2017']['Telestream ScreenFlow']['EZTitles']['Apple DVD Studio Pro']"], "scar": ["SCAR Script", "A SCAR file is a script or macro created with SCAR (Shite Compared to AutoRune), a program used to create macros.  It contains SCAR program code, which is based on the Pascal programming language.  SCAR files are commonly used to automate actions in online video games.", "Windows, ", "[]"], "scad": ["OpenSCAD Script", "CAD file created by OpenSCAD, a free CAD modeling program; saved in a plain text format and contains syntax written in the OpenSCAD language; specifies object geometry and positioning; used for rendering various 2D and 3D CAD designs.", "Windows, Mac, Linux, ", "['OpenSCAD']['OpenSCAD']['OpenSCAD']"], "scala": ["Scala Source Code File", "Source code file written in the Scala (Scalable language) programming language; uses an object-oriented and functional approach with support of higher-order functions and nesting of function definitions.", "Windows, Mac, Linux, ", "['Scala IDE for Eclipse']['Scala IDE for Eclipse']['Scala IDE for Eclipse']"], "sca": ["Norton AntiVirus Scan File", "Data file created by Norton AntiVirus, a program that protects desktop computers from malware; contains a list of files on the hard drive that have been scanned or need to be scanned; used by Norton AntiVirus to tell which files need to be scanned next.", "Windows, Mac, Windows, ", "['Symantec Norton Security 2017']['Symantec Norton Security 2017']['Scala Designer', 'Scala Content Manager', 'Scala Ad Manager', 'text editor']"], "sc4model": ["SimCity 4 Model File", "File used by SimCity 4, a game where players build cities; contains a 3D model of a prop or building; used for adding custom objects to a city; can be described with a .SC4DESC file and placed within a lot using a .SC4LOT file.", "Windows, Mac, ", "['Electronic Arts SimCity 4', 'Electronic Arts Building Architect Tool', 'iLive Reader', 'SC4Tool']['Electronic Arts SimCity 4']"], "sc4lot": ["SimCity 4 Lot File", "File used by SimCity 4, a city simulation game; stores the location of building and props on a city lot; also includes information about animations and the placement of textures on models; used for storing custom lots that can be played in the game.", "Windows, Mac, ", "['Electronic Arts SimCity 4', 'Electronic Arts Building Architect Tool', 'iLive Reader', 'SC4Tool']['Electronic Arts SimCity 4']"], "sc4desc": ["SimCity 4 Description File", "Game description file used by SimCity 4, a city-building and simulation game; describes game properties such as the location and type of buildings and props; also specifies how people in the city interact with the buildings.", "Windows, Mac, ", "['Electronic Arts SimCity 4', 'Electronic Arts Building Architect Tool', 'iLive Reader', 'SC4Tool']['Electronic Arts SimCity 4']"], "sc45": ["SuperCard Project File", "Project file created by SuperCard, a high-level visual authoring tool for Mac OS X; stores a data document for the SuperCard runtime and includes user interface components, scripts, and application resources; may contain multiple windows that execute a \"stack\" in a manner similar to Apple's HyperCard technology.", "Mac, ", "['Solutions Etcetera SuperCard', 'Solutions Etcetera SuperEdit', 'Solutions Etcetera SuperCard Player']"], "sc4": ["SimCity 4 Saved File", "Game file created by SimCity 4, a simulation game where players build cities; stores the terrain, buildings, and roads for a new city that is developed by the player in the game; can be a small, medium, or large size city.", "Windows, Mac, Windows, Mac, ", "['Electronic Arts SimCity 4', 'Electronic Arts The Sims 2']['Electronic Arts SimCity 4', 'Electronic Arts The Sims 2']['Chris Sawyer RollerCoaster Tycoon']['Solutions Etcetera SuperCard', 'Solutions Etcetera SuperEdit']"], "sc2save": ["Blizzard StarCraft 2 Saved Game", "Saved game file created by Starcraft II: Wings of Liberty, a real-time strategy game where players battle in outer space as the Protoss, Zerg, or Terran races; contains the saved progress for a campaign mission or for a custom single player map; includes the state of units and their locations, structures, resources, and other map information.", "Windows, Mac, ", "['Blizzard StarCraft 2']['Blizzard StarCraft 2']"], "sc2replay": ["Blizzard StarCraft 2 Replay File", "Mission replay file saved by StarCraft II: Wings of Liberty (SC2), a real-time strategy (RTS) game where players compete as Terran, Protoss, and Zerg races; contains the sequence of events that are played out during a single player custom game or a multiplayer game; includes the replay name, duration, version of the software, and the date when the replay was captured; used for reviewing strategies, as well as sharing results of competitions with others on Battle.net and other websites.", "Windows, Mac, Linux, ", "['Blizzard StarCraft 2', 'Scelight', 'Sc2gears']['Blizzard StarCraft 2', 'Scelight', 'Sc2gears']['Scelight', 'Sc2gears']"], "sc2map": ["Blizzard StarCraft 2 Map File", "Game map used by StarCraft II: Wings of Liberty, a real-time strategy (RTS) game created as the sequel to StarCraft; contains the map name, author, description, size, terrain, units, triggers, pathing settings, and player starting points, as well as various objects; can be used for single player or multiplayer games.", "Windows, Mac, ", "['Blizzard Starcraft 2', 'Blizzard StarCraft 2 Editor']['Blizzard Starcraft 2', 'Blizzard StarCraft 2 Editor']"], "sc2mod": ["Blizzard StarCraft 2 Modification File", "Modification archive used by StarCraft II: Wings of Liberty, a real-time strategy game where players battle as the Protoss, Terran, and Zerg races; contains information that changes the properties of gameplay; created in Blizzard's proprietary Mo'PaQ format (.MPQ files).", "Windows, Mac, Linux, ", "['Blizzard StarCraft 2', 'Blizzard StarCraft 2 Editor', 'MPQ Editor', 'StormLib Library']['Blizzard StarCraft 2', 'Blizzard StarCraft 2 Editor', 'MPQ Extractor', 'StormLib Library', 'MPQKit']['mpq-tools', 'StormLib Library']"], "sc2ma": ["StarCraft 2 Map Data File", "Map information file used by StarCraft II: Wings of Liberty, a real-time strategy game; contains data for a map being played online; used for downloading and storing map data for Blizzard's Battle.net online gameplay.", "Windows, Mac, Linux, ", "['Blizzard StarCraft 2', 'MPQ Editor', 'StormLib Library']['Blizzard StarCraft 2', 'MPQ Extractor', 'StormLib Library', 'MPQKit']['mpq-tools', 'StormLib Library']"], "sc2data": ["Blizzard StarCraft 2 Data File", "Data file used by StarCraft II: Wings of Liberty, a real-time strategy game that takes place in outer space; stored in the Blizzard Mo'PaQ format (.MPQ files); can contain various types of files, such as XML configurations, fonts, animations, hotkey mappings, UI layouts, and artificial intelligence (AI) instructions.", "Windows, Mac, Linux, ", "['Blizzard StarCraft 2', 'MPQ Editor', 'StormLib Library']['Blizzard StarCraft 2', 'MPQ Extractor', 'StormLib Library', 'MPQKit']['mpq-tools', 'StormLib Library']"], "sc2bank": ["StarCraft 2 Bank File", "Cache file saved by StarCraft II: Wings of Liberty, a real-time strategy game; contains XML-formatted information that stores a user's progress in the game, such as in campaign missions; used for storing the location of units, the structures that are built, and other map save information.", "Windows, Mac, ", "['Blizzard StarCraft 2']['Blizzard StarCraft 2']"], "sc2assets": ["Blizzard StarCraft 2 Assets File", "Mo'PaQ data file (.MPQ file) used by StarCraft II: Wings of Liberty, an outer space real-time strategy game; stores an archive of data files for a game campaign or modification; may be installed with the game, or may be created using a MPQ editor.", "Windows, Mac, Linux, ", "['Blizzard StarCraft 2', 'MPQ Editor', 'StormLib Library']['Blizzard StarCraft 2', 'MPQ Extractor', 'StormLib Library', 'MPQKit']['mpq-tools', 'StormLib Library']"], "sc2archive": ["Blizzard StarCraft 2 Archive File", "Data file used by StarCraft II, a sci-fi real-time strategy game; stores an archive of files in Blizzard's Mo'PaQ format (.MPQ files); may store models, textures, sounds, settings, and other game data; typically used for applying patches, such as bug fixes, to the game.", "Windows, Mac, Linux, ", "['Blizzard StarCraft 2', 'MPQ Editor', 'StormLib Library']['Blizzard StarCraft 2', 'MPQ Extractor', 'StormLib Library', 'MPQKit']['mpq-tools', 'StormLib Library']"], "sc2": ["SimCity 2000 City File", "Game file used by SimCity 2000, a city building simulation game; also used by Streets of SimCity and SimCopter, which enhance the 2D gameplay into 3D; contains specifications for a city's terrain, buildings, roads, water, and other map features; used for map start conditions.", "Windows, Windows, Mac, ", "['Maxis SimCity 2000']['FMJ-Software Awave Studio'][]"], "sc": ["Space Engine Script", "Script written for Space Engine, a 3D space simulation engine; stores instructions and parameters used for loading a simulation; can specify galaxies, clusters, planets, stars, nebulae, and other space objects.", "Windows, Mac, Linux, ", "['Space Engine'][][]"], "sbz": ["ShowBiz Project File", "Video project created and used by ShowBiz, a home movie editor that allows you to add special effects; contains storyboard/timeline edits that have been made to your video.", "Windows, ", "['ArcSoft ShowBiz']"], "sbx": ["GLBasic Shoebox File", "Compressed archive created by Shoebox, a tool included with the GLBasic software development toolkit; can store application resources such as graphics, video, music, or data files; can be decompressed by the application at runtime to extract specific files.", "Windows, Windows, Windows, Mac, Windows, ", "['Dream Design Entertainment GLBasic SDK']['ESRI ArcGIS for Desktop']['Adobe Illustrator CC 2017']['Adobe Illustrator CC 2017']['SBXDec']"], "sbu": ["Samsung Backup File", "File created by Samsung Kies, a desktop program that manages Samsung phone and tablet devices; contains backup data for different personal information items such as Contacts, S Memo, S Planner, Call Log, Music, Photos, User Preferences, and Messages.", "Windows, Mac, ", "['Samsung Kies']['Samsung Kies']"], "sbw": ["US Treasury Savings Bonds Wizard File", "Financial data file created by Savings Bond Wizard, a program used to manage United States savings bonds; contains a collection of financial records, each of which include the purchase date, denomination, interest, serial number, yield, and projected values; used for tracking and calculating personal investments.", "Windows, Linux, ", "['US Treasury Savings Bond Wizard']['GBonds']"], "sbv": ["YouTube Captions File", "File used by YouTube videos to display subtitles or closed captions; contains one or more captions in a plain text format; specifies an ID, start and end time (using an H:MM:SS.000 format), and text for each caption.", "Windows, Mac, Windows, ", "['Microsoft Notepad', 'Microsoft WordPad', 'text editor'][][]"], "sbs": ["SPSS Script", "Script used by SPSS, an application for statistical analysis; stores instructions written using the Sax Basic language; used for automating repetitive tasks, such as opening and saving files and performing data transformations.", "Windows, Windows, ", "['IBM SPSS']['AvailaSoft Secure Backup System']"], "sbproj": ["OpenGL Shader Builder Project", "Project file created by OpenGL Shader Builder, a program used for OpenGL GPU software development; saves settings for OpenGL shaders, including rendering, texture, and symbol information; used for testing OpenGL shaders.", "Mac, ", "['Apple OpenGL Shader Builder']"], "sbp": ["Sketchbook Express iCloud Image", "Image created by Sketchbook Express, a drawing, sketching, and painting iOS program; saves the state of the drawing canvas for storage in iCloud, which is Apple's file storage and sharing service.", "iOS, Windows, ", "['Autodesk SketchBook', 'Autodesk SketchBook Express']['ShopBot Tools PartWorks', 'ShopBot Tools CabinetParts Pro']"], "sbn": ["GT-31 Binary Data File", "Data file saved by a GT-31 or BGT-31 outdoor, waterproof GPS navigation device; contains position and speed data recorded while navigating with the device; used for logging travel paths and reviewing them later.", "Windows, Windows, Windows, ", "[]['ESRI ArcGIS for Desktop']['Cisco Unified Communications Manager']"], "sbk": ["Multimedia ToolBook System Book", "Utility file included with Multimedia ToolBook; includes scripts that extend the functionality of the ToolBook program; may add extra menu items or authoring capabilities.", "Windows, Windows, Windows, Windows, ", "[]['SWiSHzone.com SWiSH Max']['Nova Development Scrapbook Factory Deluxe']['FMJ-Software Awave Studio']"], "sbi": ["Sound Blaster Instrument", "Sound that can be played back by a Sound Blaster sound card or other supported Sound Blaster hardware; contains register values for the FM chip that synthesizes instrument sounds.", "Windows, ", "['FMJ-Software Awave Studio']"], "sbf": ["Android System File", "System file used by Google Android devices, such as Motorola DROID 2 and DROID X mobile phones; contains all phone data as it was originally configured from the factory; enables the phone to be set to the original factory settings.", "Windows, Android, Windows, Mac, Linux, Windows, ", "[]['Google Android'][][][]['SmartBroker Pro']"], "sah": ["SETI@home Data File", "Data file used by SETI@home or other BOINC distributed computing applications; may define user information or work units for performing calculations on the local computer; used for configuring and storing data that is sent back to the SETI@home project.", "Windows, Mac, Linux, ", "['BOINC']['BOINC']['BOINC']"], "safetext": ["SafeText File", "Password-protected text document; encrypted so other people cannot read it; may also use the .SAF extension", "Windows, ", "[]"], "safariextz": ["Apple Safari Extension Package", "Compressed file used by Safari, a Web browser for Mac OS X; contains functionality that adds features to the Web browser, such as a new search bar; also includes a digital signature that verifies the extension developer; may store HTML, CSS, JavaScript, and media files; usually saved within the [user]/Library/Safari/Extensions/ directory.", "Mac, ", "['Apple Safari', 'safariextz2desktopfolder']"], "safe": ["SIGLock Encrypted File", "A SAFE file is an encrypted file created by SIGLock, a file encryption application for Windows used to securely store and transfer files.  It contains an encrypted version of a file, such as a .PDF or .XLSX file, that can only be decrypted by the SIGLock program.  SAFE files also contain locking and unlocking data such as which users can open the file, where they can open it, and when they can open it.", "Windows, ", "[]"], "saf": ["Street Atlas USA Map File", "Map file format used by DeLorme Street Atlas USA, a custom mapping and GPS navigation program; contains a detailed map of a specific region; also stores the map center coordinates, the current zoom level and magnification, user preferences, and custom routes or layers added by the user.", "Windows, Windows, Windows, Windows, ", "['DeLorme Street Atlas USA'][][][]"], "sad": ["Black & White Audio File", "Sound file format used by Black & White, a real-time strategy game; contains sound effects and other audio used within the game; may be opened by various audio playback programs.", "Windows, Mac, ", "['Lionhead Studios Black and White', 'Dragon UnPACKer']['Lionhead Studios Black and White']"], "sab": ["ACIS SAB Model File", "3D model created in the Standard ACIS Binary (SAB) format; saves 3D geometry and structure information for a manufactured component; used for exchanging model information between various CAD programs.", "Windows, Mac, Linux, Windows, Mac, ", "['Spatial 3D ACIS Modeler', 'Autodesk AutoCAD 2017', 'IMSI TurboCAD Pro 2017', 'Ashlar-Vellum Cobalt', 'Adobe Acrobat DC']['Spatial 3D ACIS Modeler', 'Autodesk AutoCAD 2017', 'IMSI TurboCAD Deluxe v10', 'Adobe Acrobat DC']['Spatial 3D ACIS Modeler']['Raven Software Star Wars Jedi Knight: Jedi Academy']['Raven Software Star Wars Jedi Knight: Jedi Academy']"], "s85": ["Sabre Airline Solutions Chart", "Chart or graph created with Sabre Airline Solutions software; may be generated by StaffPlan, a staffing forecasting and planning system, or StaffAdmin, an employee administration, tracking and assignment system; used by airport-based governmental agencies to manage employee staffing and scheduling.", "Windows, ", "[]"], "s7z": ["Mac OS X 7-Zip File", "File Archive compressed by 7zX for the Mac using 7-Zip compression; retains resource forks, Spotlight metadata, owner and group permissions, and other Mac-specific data that would be lost in Windows compression.", "Mac, ", "['Sixty Five 7zX']"], "s3m": ["ScreamTracker 3 Module", "Audio module format used by Scream Tracker 3.0 and later; contains sound samples and music patterns, which define what notes are played back by the samples; similar to a .MOD file, but allows up to 16 tracks.", "Windows, Mac, Linux, ", "['MODPlug Player', 'Myriad Harmony Assistant', 'Nullsoft Winamp with AdPlug plugin', 'VideoLAN VLC media player', 'Schism Tracker', 'MilkyTracker']['CocoModX', 'Myriad Harmony Assistant', 'VideoLAN VLC media player', 'Schism Tracker', 'MilkyTracker']['VideoLAN VLC media player', 'Schism Tracker', 'MilkyTracker']"], "s3i": ["Scream Tracker 3 Instrument", "Instrument format used by Scream Tracker, a popular audio tracker developed for DOS.", "Windows, ", "['OpenMPT']"], "s2z": ["Heroes of Newerth Game Data File", "Compressed game data file used by Heroes of Newerth (HON), a real-time strategy game focused on the control of individual heroes; saved using .ZIP formatting and contains various game data; used as the container format for storing game resources.", "Windows, Mac, Linux, ", "['S2 Games Heroes of Newerth']['S2 Games Heroes of Newerth']['S2 Games Heroes of Newerth']"], "s2mv": ["StarCraft 2 Map Preview File", "Small graphic used by StarCraft II: Wings of Liberty, a real-time strategy game released by Blizzard Entertainment; stores a preview image of a game map (.SC2MAP file) as a small raster graphic; used for displaying a thumbnail-size image to players before they begin playing.", "Windows, Mac, ", "['Blizzard StarCraft 2', 'Microsoft Windows Photo Viewer', 'image viewer']['Blizzard StarCraft 2', 'Apple Preview', 'image viewer']"], "s2ml": ["StarCraft 2 Map Localization File", "Language-specific XML file used by StarCraft II: Wings of Liberty, an outer space strategy game where players compete as the Protoss, Terran, and Zerg races; contains a list of text strings in a specific language; used for localizing StarCraft II maps while playing the game.", "Windows, Mac, ", "['Blizzard StarCraft 2', 'Microsoft Notepad', 'gVim', 'text editor']['Blizzard StarCraft 2', 'Apple TextEdit', 'text editor']"], "s19": ["Motorola S19 File Record", "Contains low-level machine code and addresses of a compiled C or Assembly program; saved in a text format that represents hexadecimal coded binary data; used by the Freescale series of microcontrollers.", "Windows, Mac, ", "[][]"], "s01": ["ZipSplitter Part 2 Archive", "Second part of a split .ZIP archive created with ZipSplitter; saved along with other parts, named .S00, .S02, etc; can be extracted by running the .EXE file included with the split archive files.", "Windows, ", "[]"], "s02": ["ZipSplitter Part 3 Archive", "Third part of a split .ZIP archive created with ZipSplitter; saved along with other parts, named .S00, .S01, etc; can be extracted by running the .EXE file included with the split archive files.", "Windows, ", "[]"], "s00": ["ZipSplitter Part 1 Archive", "First part of a split .ZIP archive created with ZipSplitter, a compressed archive splitting program; saved along with other parts, named .S01, .S02, etc; can be extracted by running the .EXE file included with the split archive files.", "Windows, ", "[]"]}