{"t": ["Turing Source Code File", "File containing source code written in the Turing programming language; used primarily by educational institutions for teaching purposes; can be edited, compiled, and run using Turing software.", "Windows, Mac, ", "['text editor']['text editor']"], "t3x": ["TYPO3 Compressed Extension", "Adds extra functions and capabilities to TYPO3, a Web content management framework; TYPO3 extensions are saved in a compressed \"exchange\" format and can be downloaded from the Internet; they can be enabled and disabled using the Extension Manager (EM) included with TYPO 3.5 and later.", "Windows, ", "[]"], "t3d": ["Unreal Engine 3D Object File", "File used by the Unreal Engine, a program that allows to create multi-player first person shooter games; contains a text list of Unreal map objects, also known as map actors; used to describe different objects and place them in an Unreal map.", "Windows, Mac, Windows, Mac, Windows, Mac, Linux, ", "['Epic Games Unreal Tournament', 'Epic Games UnrealEd']['Epic Games Unreal Tournament'][][]['Microsoft Windows Media Player with TicTacTi plugin', 'Adobe Flash Player with TicTacTi plugin', 'Microsoft Silverlight']['Adobe Flash Player with TicTacTi plugin', 'Microsoft Silverlight']['Adobe Flash Player with TicTacTi plugin']"], "taac": ["Sun TAAC Image File", "Raster graphic stored in the Sun TAAC Image File Format (SUNIFF), which was created by Sun Microsystems; can be converted to more common types using the XnView graphics viewer and converter utility.", "Windows, Mac, Linux, ", "['XnViewMP']['XnViewMP']['XnViewMP']"], "ta4": ["TaxAct 2014 Tax Return File", "2014 tax return created with the 2014 version of TaxAct; contains tax data for the 2014 tax year; includes both federal IRS tax forms and state forms for a specific state. ", "Windows, Web, ", "['TaxAct 2016']['TaxAct Online 2016']"], "t3001": ["TARGET 3001! Circuit Design Project File", "Printed circuit board (PCB) design project created with TARGET 3001! CAD/CAE software; integrates schematic, simulation, layout, and 3D-view data into one user interface; all this data is saved into a single T3001 project file.", "Windows, ", "[]"], "t64": ["Commodore 64 Tape Image File", "Disk image created from a Commodore 64 tape; playable on a Commodore 64 emulator", "Windows, Mac, ", "['WinVICE', 'CCS64']['VICE']"], "ta6": ["TaxAct 2016 Tax Return File", "A TA6 file is a 2016 tax return created with the 2016 version of TaxAct, a tax-preparation program.  It contains tax data for the 2016 tax year, which includes both federal IRS tax forms and state forms for a specific state.  TA6 files also store the user's basic information such as name, date of birth, occupation, marital status, dependents, and social security number. ", "Windows, Web, ", "['TaxAct 2016']['TaxAct Online 2016']"], "t65": ["PageMaker Template File", "File created for PageMaker 6.0, a page layout designing and formatting application; replaced by the .PMT PageMaker file in PageMaker 7.0; contains a character set template for identifying key strokes for ASCII characters available in most fonts; referenced by each version of PageMaker 6.0 and earlier.", "Windows, Mac, ", "['Adobe PageMaker 7', 'Adobe InDesign CC 2017']['Adobe PageMaker 7', 'Adobe InDesign CC 2017']"], "tab": ["Typinator Set File", "File referenced by Typinator, a typing shortcut program; contains typing abbreviations that can be added to these set files by the user. ", "Mac, Windows, Mac, Windows, Windows, Mac, ", "['Ergonis Software Typinator']['text editor']['text editor']['Pitney Bowes MapInfo', 'ESRI ArcGIS for Desktop', 'Golden Software Surfer', 'Golden Software Didger', 'GDAL']['Microsoft Excel 2016', 'text editor']['Microsoft Excel 2016']"], "ta5": ["TaxAct 2015 Tax Return File", "2015 tax return created with the 2015 version of TaxAct; contains tax data for the 2015 tax year; includes both federal IRS tax forms and state forms for a specific state. ", "Windows, Web, ", "['TaxAct 2016']['TaxAct Online 2016']"], "t2kt": ["Teach2000 Exam File", "Exam file created by Teach2000, a memory trainer and student assessment application; saves an exam in an encrypted format and contains questions for students to answer; used for distributing electronic tests to students.", "Windows, ", "['Basement.nl Teach2000']"], "t2ks": ["Teach2000 Exam Results File", "Exam result file created by Teach2000, a memory trainer software; contains the results of a test taken by a student using the software; includes the student's score as well as which questions were answered correctly or incorrectly.", "Windows, ", "['Basement.nl Teach2000']"], "t2d": ["TouchDraw Document", "Drawing document created and used by TouchDraw, a vector diagramming and drawing program; stores a drawing, flow chart, diagram, floor plan, or graph; may include shapes, text, images, and other figures.", "Mac, iOS, Android, ", "['Elevenworks TouchDraw']['Elevenworks TouchDraw']['Elevenworks TouchDraw']"], "t2k": ["Teach2000 Document", "Test document created by Teach2000, a memory training application; saves a list of questions and answers in an XML format; may include free form or multiple choice questions.", "Windows, ", "['Basement.nl Teach2000']"], "tz": ["Zipped Tar Archive", "Unix Tar archive zipped using a basic Unix compression algorithm; combines a .TAR archive and .Z file; used for archiving collections of files on Unix-based systems.", "Windows, Mac, Linux, ", "['Smith Micro StuffIt Deluxe for Windows', 'Corel WinZip 21']['Smith Micro StuffIt Deluxe 16'][]"], "t2b": ["CyBook Thumbnail Image", "Thumbnail image created by the CyBook black and white eBook reader device; stores a 2-bit grayscale image that supports four colors; generated automatically by the CyBook reader when viewing books; used for storing previews of book covers.", "Windows, Mac, ", "['t2b2pgm']['Lemkesoft GraphicConverter']"], "tzx": ["ZX Spectrum Tape Image File", "Exact copy of a cassette for the Sinclair ZX Spectrum, a home computer released in the UK in 1982; used primarily for basic word processing, graphics programs, and video games; can be run on a PC using a Spectrum emulation program.", "Windows, Mac, Linux, ", "[][][]"], "tyset": ["Typinator Set File", "File containing typing abbreviations referenced by Typinator, a typing shortcut program; found under \"Predefined Sets\" in Typinator; abbreviations can be added to these set files by the user. ", "Mac, ", "['Ergonis Software Typinator']"], "typeit4me": ["TypeIt4Me Clippings File", "File used by TypeIt4Me, a program that allows users to create text shortcuts in Mac OS X; contains a collection of clippings, which are abbreviations and their expanded textual representations; also stores keyboard trigger preferences.", "Mac, ", "['Ettore TypeIt4Me']"], "tyimport": ["Typinator Set Import File", "TYSET file accessed by Typinator, an typing abbreviation program; created when TYSET file is imported into the program by the user.", "Mac, ", "['Ergonis Software Typinator']"], "txz": ["XZ Compressed Tar Archive", "Archive created with Tar and XZ utilities; contains one or more files first archived using Tar and then compressed using XZ compression; compressed using a high compression ratio.", "Windows, Mac, Linux, ", "['File Viewer Plus', '7-Zip']['The Unarchiver']['Tukaani XZ Utils']"], "txw": ["Yamaha TX16W Audio File", "12-bit audio wave file created by the Yamaha TX16W sampler; proprietary format created by Yamaha, similar to a .WAV file; supports 16, 33, and 50 kHz samples; samples used for the attack and loop sections must each be smaller than 128K.", "Windows, Mac, ", "['Logipole Konvertor', 'FMJ-Software Awave Studio'][]"], "txtrpt": ["CommScope Teletilt Control System Report", "File generated by ATC Lite, the software bundled with Teletilt Control System antennas (e.g., the ATC200-LITE-USB model); stores a report generated by the antenna and saves it in the Microsoft Word document format so that it can be opened with any Word-compatible software.", "Windows, Mac, Linux, ", "['Microsoft Word 2016', 'LibreOffice', 'Apache OpenOffice']['Microsoft Word 2016', 'LibreOffice', 'Apache OpenOffice']['LibreOffice', 'Apache OpenOffice']"], "txd": ["Game Texture Dictionary", "Archive of textures, or small bitmap image files; can be referenced by games or other programs that support the Renderware 3D engine; may be texture-mapped onto 3D objects to change their appearance.", "Windows, ", "['ViceTXD', 'Magic.TXD']"], "txt": ["Plain Text File", "A TXT file is a standard text document that contains unformatted text.  It is recognized by any text editing or word processing program and can also be processed by most other software programs.", "Windows, Mac, Linux, iOS, Android, ", "['File Viewer Plus', 'Microsoft Notepad', 'Microsoft WordPad', 'Microsoft Word 2016', 'Corel WordPerfect X8', 'Helios TextPad', 'Notepad++', 'Notepad2', 'Geany', 'text editor']['Apple TextEdit', 'Bare Bones BBEdit', 'MacroMates TextMate', 'Microsoft Word 2016', 'Wondershare PDF Editor for Mac 5', 'Geany', 'text editor']['Leafpad', 'gedit', 'KWrite', 'Geany', 'text editor']['MobiSystems OfficeSuite Pro', 'olimsoft OPlayer', 'Infraware Polaris Office']['MobiSystems OfficeSuite Pro', 'Kingsoft WPS Office for Android']"], "txn": ["MySpaceIM Conversation Log File", "Log file created by MySpaceIM, an online chatting program; stores all online conversation messages with a specific user; used to keep a chat record that can be reviewed later.", "Windows, ", "[]"], "txf": ["Transit XV Pack Translation File", "Translation file created by Transit XV, a program used for language translation and localization; contains language terms and segments as well as their translations; stores a translation from a source .PXF file.", "Windows, Windows, Mac, Windows, Mac, Linux, ", "[]['Intuit TurboTax Deluxe', 'Intuit Quicken', 'H&R Block Tax Software', 'Microsoft Money']['Intuit TurboTax Deluxe', 'Intuit Quicken', 'H&R Block Tax Software']['Celestia', 'ttf2txf']['Celestia', 'ttf2txf']['Celestia', 'ttf2txf']"], "txa": ["Midas ViewPoint Text Array List", "Input file used by Midas ViewPoint, a multimedia presentation creation and scheduling program; contains lines of ASCII text that can be loaded by ViewPoint and stored in an array.", "Windows, ", "[]"], "tx_": ["Compressed Text File", "Compressed .TXT file often created by Makecab, a Windows utility used for compressing files and generating .CAB files; sometimes used for saving TXT files to CDs so that they use less disc space; can be decompressed in Windows with this command:", "Windows, ", "['Microsoft Expand']"], "twt": ["Carmageddon 2 Data File", "Game data file used by Carmageddon II: Carpocalypse Now, a 3D car racing/combat game; stores mission data referenced by Carmageddon II; includes a hexadecimal header followed by game data.", "Windows, Mac, ", "[][]"], "twz": ["theWord Compressed Archive Module", "Archive used by theWord Bible software; contain a compressed .TWM module, which is used for installing commentaries, books, and other software modules; used for reducing the file size of modules; may use .ZIP, .RAR, or .7Z compression.", "Windows, ", "['theWord']"], "twzip": ["theWord Compressed Archive Module", "File used by theWord Bible software; stores the compressed version of a .TWM module and allows modules to be distributed with a reduced file size; may use one of several compression formats, including .ZIP, .RAR, and .7Z.", "Windows, ", "['theWord']"], "twc": ["TTWin Configuration File", "Configuration file created for TTWin and TTWin Lite terminal emulator software; contains user settings and preferences such as background color, font size and color, keyboard mappings, and other information.", "Windows, ", "[]"], "twm": ["theWord Module", "Module file created by theWord (also \"The Word\"), a free Bible reading program; acts like a plug-in that adds features to the software, such as a new Bible translation, commentary, image, or map; uses an SQLite database format.", "Windows, ", "['theWord']"], "twh": ["Task Wheel Project File", "Project file created and used by Task Wheel, an application used to organize goals, ideas, and projects; contains a task wheel, which includes tasks, goals, notes, focus importance, and start and end dates. ", "Windows, Mac, ", "['Think Quality Task Wheel']['Think Quality Task Wheel']"], "twig": ["Twig Template", "File created by Twig, a PHP optimizing template engine; contains a template that will be generated into a specific final format, such as a HTML, JavaScript, XML, or CSS based file; the twig extension determines what engine should be used to create the final format whether it's the Twig or PHP engine. ", "Windows, Mac, Linux, ", "['SensioLabs Twig', 'SensioLabs Symfony', 'Adobe Edge Code CC']['SensioLabs Twig', 'SensioLabs Symfony', 'Adobe Edge Code CC']['SensioLabs Twig', 'SensioLabs Symfony']"], "twb": ["Tableau Workbook File", "Workbook file created by Tableau Desktop, a whiteboard data analysis and visualization application; stores data in the categories of \"dimensions\" and \"measures;\" also stores visualizations such as graphs and charts, as well as references to imported data sources.", "Windows, ", "['Tableau Desktop']"], "twbx": ["Tableau Packaged Workbook", "Data file created by Tableau Desktop, a whiteboard data visualization and analysis program; contains the .TWB workbook plus all workbook data, including the external source data; used for packaging all data into a standalone file, which can be shared with others.", "Windows, ", "['Tableau Desktop', 'Tableau Reader']"], "tvvi": ["TitanTV Television Listing File", "File format created for TitanTV, a service that provides television listings over the Web; contains data for one or more television programs, including station, channel, program title, program description, episode title, start date and time, end date and time, duration, and media destination.", "Windows, Mac, ", "[][]"], "tvtemplate": ["mimoLive Template", "A TVTEMPLATE file is a template created by mimoLive, a video editor used to produce broadcasts such as sermons, lectures, podcasts, newscasts, and more.  It contains a template of a show, which includes the video settings and aspects that make up the presentation.", "Mac, ", "['Boinx Software mimoLive']"], "tvshow": ["mimoLive Show", "A TVSHOW file is a show created by mimoLive, a video editor used to produce broadcasts such as sermons, lectures, podcasts, newscasts, and more.  It contains a show project, which includes settings and aspects, such as text content, graphics, transitions, animations, frame rate, show length, and author, that make up the show presentation.", "Mac, ", "['Boinx Software mimoLive']"], "tvs": ["TeamViewer Video Session File", "Video file created by TeamViewer, a program that allows users to remotely control desktop computers; contains video recorded from a remote session; used for creating demonstration videos and recording session histories.", "Windows, Mac, Linux, iOS, Android, Windows Phone, ", "['TeamViewer 11']['TeamViewer 11']['TeamViewer 11']['TeamViewer: Remote Control 12']['TeamViewer for Remote Control 11']['TeamViewer 11']"], "tvrecording": ["BoinxTV TV recording", "Temporary recording file used by BoinxTV, a video editor used to produce broadcasts such as lectures, podcasts, sermons, and more; contains a video recording while BoinxTV finalizes writing the video as a .MOV QuickTime file.", "Mac, ", "[]"], "tvpi": ["TitanTV Television Listing File", "File format used by TitanTV, a Web-based television listings service; contains television program data such as program title, program description, episode title, station, channel, start and end time, duration, and media destination.", "Windows, Mac, ", "[][]"], "tvlayer": ["mimoLive TV Layer", "A TVLAYER file is a layer used by BoinxTV, an application that enables users to produce broadcasts such as lectures, sermons, newscasts, podcasts, and more.  It stores layer information, such as transition duration, that configures how the graphics are displayed on the screen during a broadcast.  TVLAYER files can be exported as .QTZ files.", "Mac, ", "['Boinx Software mimoLive']"], "tvm": ["TV3D Model", "Model format used by TV3D SDK, a 3D game and application development environment; contains a 3D model, which includes lights, materials, alpha blending, stages, and shaders properties. ", "Windows, ", "['Truevision3D TV3D SDK']"], "tvl": ["TurboTax File", "Data file installed with TurboTax; typically a hidden file.", "Windows, Mac, ", "['Intuit TurboTax Deluxe']['Intuit TurboTax Deluxe']"], "tvdownload": ["TeamViewer Download File", "A TVDOWNLOAD file is a download file used by TeamViewer.  It contains a partially downloaded file that was shared by a user through TeamViewer's file box.  The file is created to save the contents of a file as it is being downloaded and marks the download as incomplete.", "Windows, Mac, Linux, ", "['TeamViewer 11']['TeamViewer 11']['TeamViewer 11']"], "tvj": ["TrueView Job Ticket", "Job ticket created with TrueView, a softproofing application developed by basICColor; contains print job information that ensures color accuracy is maintained across different media and platforms.", "Windows, ", "[]"], "tvc": ["Turbo View & Convert Batch Presets File", "A TVC file is a settings file created by Turbo View & Convert, a file viewing and conversion program that supports hundreds of different file formats.  It saves settings for the program's batch converter and includes the list of input files, conversion options, and the output location.", "Windows, Windows, Mac, Linux, iOS, Android, Windows Phone, ", "['IMSI Turbo View & Convert']['TeamViewer 11']['TeamViewer 11']['TeamViewer 11']['TeamViewer: Remote Control 12']['TeamViewer for Remote Control 11']['TeamViewer 11']"], "tut": ["Children of the Nile Tutorial File", "Game file used by Children of the Nile (CotN), a city-building strategy game set in ancient Egypt; saves the data required to run the in-game tutorials, which help players learn how to play the game before entering the real campaign.", "Windows, ", "['Tilted Mill Entertainment Children of the Nile']"], "tur": ["Turing Program Source File", "Development file that contains code written in the Turing programming language; mainly used by educational institutions; can be edited, compiled, and run using Turing software.", "Windows, Mac, ", "['text editor']['text editor']"], "tub": ["PaintShop Pro Picture Tube", "File used by PaintShop Pro, a graphics editing program; contains graphics that can be painted repeatedly without drawing the actual objects; may include fish, plants, butterflies, and other images; painted like a paint brush, but draws images instead of paint.", "Windows, Mac, Linux, ", "['Corel PaintShop Pro X9', 'TubeEx', 'GIMP with Tub loader plugin', 'Chasys Draw IES']['GIMP with Tub loader plugin']['GIMP with Tub loader plugin']"], "tun": ["LEGO Racers Audio File", "Audio file used by LEGO Racers, an older racing game where players drive cars made out of LEGO parts; saved in a .VOX ADPCM format and can be opened with audio editing software such as Audacity; used by the game to play background music tracks.", "Windows, Mac, Linux, ", "['High Voltage Software LEGO Racers', 'Audacity']['Audacity']['Audacity']"], "ttxt": ["MPEG-4 Timed Text Subtitles File", "Movie subtitles file created in the MPEG-4 Timed Text (TTXT) format, which is used for MPEG-4 and 3GP videos and mobile phone movies; uses an XML format and supports textual positioning and styles as well as timing precisions of 1 millisecond.", "Windows, Mac, Linux, ", "['text editor']['text editor']['text editor']"], "ttx": ["Trados TagEditor File", "Translated document generated by Trados translation software; includes tags that define the text formatting and structure of the page; TTX files can be created from .HTML, .JSP, .ASP, .XSL, .XML, .SGML, .RTF, and .DOC documents, as well as several other file types.", "Windows, ", "[]"], "tu": ["Turing Source File", "Program file that contains source code written in the Turing programming language; used primarily for educational purposes; can be edited, compiled, and run using Turing software.", "Windows, Mac, ", "['text editor']['text editor']"], "ttskey": ["Tech Tool Store License File", "A TTSKEY file is a license file used by Tech Tool Store, an application that comes with a large collection of IT tools.  It contains a license, which consists of a string of random letters and numbers.  TTSKEY files are used to activate the Tech Tool Store application.", "Windows, ", "['Carifred Tech Tool Store']"], "tts": ["ToolBook Translation System File", "File used by the ToolBook Translation System (TTS), a localization solution for ToolBook learning management system (LMS) software; similar to an .INI file and saves ToolBook application settings such as the source database format and the supported languages.", "Windows, ", "['SumTotal Systems ToolBook Translation System']"], "ttmd": ["Trail Tracker Trail Map", "A TTMD file is a trail map created by Trail Tracker GPS, an iOS app used for tracing running, hiking, and cycling paths.  It contains a trail, which includes elevation changes, distance, speed, time elapsed, waypoints, and images.  TTMD files are saved in XML format.", "iOS, ", "['TapTools Trail Tracker GPS']"], "ttm": ["Tower Toppler Mission File", "File used by Tower Toppler, a game where players control a small green creature to safety by climbing towers; stores a level pack, including platforms, monsters, and other obstacles for each level; saved in a compressed binary format.", "Windows, Mac, Linux, ", "['Tower Toppler']['Tower Toppler']['Tower Toppler']"], "ttl": ["AGT Game Title File", "File used by Adventure Game Toolkit (AGT) interpreters; contains game title data referenced by AGT games; includes the author's name, name of the game, and copyright statement that are displayed before the game begins. ", "Windows, ", "['AGiliTy']"], "ttkgp": ["TatukGIS Project File", "File created by TatukGIS, a free GIS viewing program; contains a set of map layers, such as shapefiles (.SHP), GeoTIFF images (.TIFF), .DXF files, or .MIF files; also saves the coordinate system and the visual properties that bind the different layers together into a cohesive map.", "Windows, ", "['TatukGIS Viewer']"], "ttk": ["Catalyst Translation Toolkit", "Data file generated by CATALYST, a software localization program; stores translated files in a highly optimized database format capable of storing text or binary objects.", "Windows, ", "[]"], "ttf": ["TrueType Font", "A TTF file is a font file format created by Apple, but used on both Macintosh and Windows platforms.  It can be resized to any size without losing quality and looks the same when printed as it does on the screen.", "Windows, Mac, Linux, ", "['File Viewer Plus', 'CorelDRAW Graphics Suite X8', 'FontForge', 'Microsoft Windows Font Viewer']['Apple Font Book', 'FontForge']['FontForge']"], "tta": ["True Audio File", "Audio file compressed with the Free Lossless True Audio codec (TTA); supports compression of multichannel 8, 16, and 24-bit .WAV data; compresses the original audio data with compression ratios of 30-70 percent.", "Windows, Mac, Linux, ", "['File Viewer Plus', 'VideoLAN VLC media player', 'True Audio Tau Producer', 'KMPlayer', 'jetAudio', 'Foobar2000 with TTA plug-in', 'Nullsoft Winamp with TTA plug-in', 'Microsoft Windows Media Player with TTA DirectShow codecs pack']['X Lossless Decoder', 'VideoLAN VLC media player', 'Macgo Mac Media Player']['VideoLAN VLC media player', 'XMMS']"], "ttarch": ["Telltale Games Archive", "File used by games developed by Telltale Games, such as The Walking Dead, Sam & Max, and Strong Bad; used for storing game assets such as sounds and graphics; referenced by the various games to load content during gameplay.", "Windows, ", "['Quick and Easy Software Telltale Explorer']"], "tte": ["Private Character Editor File", "Font file created by Private Character Editor, a program in Windows that allows users to make their own font characters; saves font information for a character set; can be used in conjunction with the Windows Character Map program to type custom characters.", "Windows, ", "['Microsoft Private Character Editor']"], "ttc": ["TrueType Font Collection", "Collection of fonts saved in the TrueType (.TTF) format; used to deliver multiple fonts in a single file; useful for combining fonts that share many glyphs in common.", "Windows, Mac, Linux, ", "['Microsoft Windows Font Viewer', 'ApoliSoft Font Fitting Room', 'FontForge']['Apple Font Book', 'FontForge']['FontForge']"], "ttbk": ["Canadian TurboTax 2010 Backup File", "Backup of a tax return created with Intuit Canada TurboTax 2010; generated automatically when a .TT10 tax return file is saved; located in the same directory as the original file and has the same filename, except for the file extension.", "Windows, ", "['Intuit Canada TurboTax']"], "tt2016state": ["TurboTax 2016 State Tax Form", "A TT2016STATE file is a state tax form created by the 2016 version of TurboTax tax preparation software.  It contains one or more U.S. state tax forms referenced by TurboTax when completing a tax return.  TT2016STATE files are linked to a .TAX2016 file, which is the default file created by TurboTax to store a user's tax return.", "Windows, Mac, ", "['Intuit TurboTax Deluxe']['Intuit TurboTax Deluxe']"], "tt2013state": ["TurboTax 2013 State Tax Form", "State tax form used by TurboTax 2013, a tax preparation program; contains an official tax form for a specific state; may be filled out by the user within TurboTax and can be printed and mailed or filed electronically.", "Windows, Mac, Web, ", "['Intuit TurboTax Deluxe']['Intuit TurboTax Deluxe']['Intuit TurboTax Online']"], "tt2015state": ["TurboTax 2015 State Tax Form", "A TT2015STATE file is a state tax form created by TurboTax 2015 tax preparation software.  It contains one or more tax forms for a specific U.S. state and is linked to a .TAX2015 tax return document.  TT2015STATE files may be referenced by TurboTax when completing a tax return.", "Windows, Mac, ", "['Intuit TurboTax Deluxe']['Intuit TurboTax Deluxe']"], "tt2014state": ["TurboTax 2014 State Tax Form", "State tax form used by TurboTax 2014 tax preparation software; may include one or more tax forms for a specific U.S. state; linked to a .TAX2014 tax return document and may be referenced by TurboTax when completing a tax return.", "Windows, Mac, Web, ", "['Intuit TurboTax Deluxe']['Intuit TurboTax Deluxe']['Intuit TurboTax Online']"], "tt2012state": ["TurboTax 2012 State Tax Form", "State tax form used by TurboTax, a program used for completing United States tax returns; contains a tax form for an individual state and is used when filing a state tax return.", "Windows, Mac, ", "['Intuit TurboTax Deluxe']['Intuit TurboTax Deluxe']"], "tt16": ["TurboTax Canada 2016 Tax Return", "A TT16 file is a tax return created by the 2016 version of TurboTax Canada.  It contains Canadian federal and province tax information and income and personal data entered by the user.  TT16 files are most commonly created and used in 2016 between January and April.", "Windows, Mac, ", "['Intuit Canada TurboTax']['Intuit Canada TurboTax']"], "tt14": ["TurboTax Canada 2014 Tax Return", "Tax return created with the 2014 version of TurboTax Canada; includes Canadian federal as well as forms specific to an individual Canadian province; also stores data entered by the user.", "Windows, Mac, ", "['Intuit Canada TurboTax']['Intuit Canada TurboTax']"], "tt15": ["TurboTax Canada 2015 Tax Return", "A TT15 is a 2015 tax return created with the 2015 version of TurboTax Canada.  It stores Canadian federal and province tax information for the 2015 tax year.  It also contains data entered by the user.", "Windows, Mac, ", "['Intuit Canada TurboTax']['Intuit Canada TurboTax']"], "tt13": ["TurboTax Canada 2013 Tax Return", "Tax return created with the Canadian version of TurboTax 2013; includes Canadian tax forms and information entered by the user; may also include provincial forms for a specific Canadian province.", "Windows, Mac, ", "['Intuit Canada TurboTax']['Intuit Canada TurboTax']"], "tt": ["Visual Studio Text Template", "Template file created by Visual Studio, a software development tool created by Microsoft; contains both text blocks and control logic used for generating new text files; can be written using Visual C# or Visual Basic code; used for both runtime text generation as well as source code generation.", "Windows, ", "['Microsoft Visual Studio 2017']"], "tt11": ["TurboTax Canada 2011 Tax Return", "Tax return created with the Canadian version of TurboTax 2011; contains tax information for the 2011 tax year; includes the federal T1 form as well as other necessary forms such as the TD1 and T1-ADJ forms; also includes required provincial forms for the user's province.", "Windows, Mac, ", "['Intuit Canada TurboTax']['Intuit Canada TurboTax']"], "tt10": ["TurboTax Canada 2010 Tax Return", "Tax return created by Intuit Canada TurboTax, a program used for preparing and filing Canadian tax returns; contains a tax return created for the 2010 tax year; includes the T1-2010 and all other necessary forms, as well as data filed out by the user.", "Windows, Mac, ", "['Intuit Canada TurboTax']['Intuit Canada TurboTax']"], "tt12": ["TurboTax Canada 2012 Tax Return", "Tax return created by the Canadian version of TurboTax 2012; includes 2012 federal tax forms and other required provincial forms for the user's specific province; also contains data entered by the user.", "Windows, Mac, ", "['Intuit Canada TurboTax']['Intuit Canada TurboTax']"], "tsz": ["Trillian Skin File", "Skin, or theme file, used to customize the interface of Trillian, a popular instant messaging (IM) client; saved in a compressed .ZIP format than can be opened by most file decompression programs.", "Windows, Mac, ", "[][]"], "tsv": ["Tab Separated Values File", "Stores a data table in which columns of data are separated by tabs; TSV files can be imported into most spreadsheet programs, which format the data into cells; they can also be exported by spreadsheet programs, which allows the data to be viewed with a basic text editor or word processing program.", "Windows, Mac, Linux, ", "['Microsoft Excel 2016', 'LibreOffice', 'Apache OpenOffice', 'Microsoft Notepad', 'text editor']['Microsoft Excel 2016', 'LibreOffice', 'Apache OpenOffice', 'MacroMates TextMate', 'text editor']['LibreOffice', 'Apache OpenOffice', 'text editor']"], "tstream": ["SwarmPlayer Streaming Torrent", "File downloaded with SwarmPlayer, a peer-to-peer (P2P) file downloading program developed by the p2p-next consortium; uses the BitTorrent protocol, but also allows for media to be streamed during the download process.", "Windows, Linux, ", "[][]"], "tst": ["TestPoint Test File", "A TST file is a pre-configured test file used by TestPoint, a program for designing testing and measurement applications.  It can be used to test speed, pressure, electrical current, voltage, and other scientific measurements.", "Windows, Windows, ", "['Measurement Computing TestPoint']['TagScanner']"], "tsr": ["Tracker Status Report", "A TSR file is a Tracker Status report used by Subsite Electronics software that specializes in horizontal directional drilling (HDD) guidance systems for installing and maintaining underground pipe and cable.  It contains an as-built report on the status of the HDD of pipes and cable, which includes water lines, gas lines, and other crossings.", "iOS, Android, Windows, ", "['Subsite Electronics TSR Mobile']['Subsite Electronics TSR Mobile'][]"], "tsp": ["Digital TV DVR Recording", "MPEG-2 Transport (TSP) video file created by a DVR such as a DISH Network DVR; contains a recorded TV show or movie saved to the DVR's hard drive; can use different encoding formats for the audio and video streams and therefore may be difficult to decode or play on a standard software video player.", "Windows, Windows, Mac, Linux, ", "['Inmatrix Zoom Player 8']['FFmpeg']['FFmpeg']['FFmpeg']"], "tsm": ["TwinCAT System Manager Configuration File", "Preference file used by TwinCAT System Manager, a PLC (Programmable Logic Controller) management program; stores the configuration for a PLC system, including system relationships, PLC programs, axis control, and connected I/O channels.", "Windows, ", "[]"], "tsl": ["Tracker Status Log", "A TSL file is a Tracker Status log used by Subsite Electronics software such as TMS Plus and TSR Mobile.  It contains horizontal directional drilling (HDD) tracking information for dill pipe locations, which includes the GPS coordinates, depth, and pitch.  ", "Windows, iOS, Android, ", "['Subsite Electronics TMS Plus']['Subsite Electronics TSR Mobile']['Subsite Electronics TSR Mobile']"], "tsk": ["Pocket PC Skin", "Skin, or theme, created for a Pocket PC-based PDA; contains a control file, main background image, and menu background image", "Windows, Android, ", "['Microsoft ActiveSync']['TTPod']"], "tsf": ["Strater Template File", "Design template created by Strater, a program used for developing borehole and well log visualizations; saves presets for the layout of the design, as well as text labels, the legend, and any other design properties; used for creating designs (.SDG files) that inherit the same preset conditions.", "Windows, ", "['Golden Software Strater']"], "tsi": ["Traktor Settings File", "Settings file used by Traktor, a DJ program used for making music mixes; may store audio, effects, keyboard, and layout settings; also can save settings that map a DJ controller device to the software; allows settings to be remembered and the DJ controller and Traktor software to be in sync when creating mixes.", "Windows, Mac, ", "['Native Instruments Traktor']['Native Instruments Traktor']"], "tsc": ["TINA Design File", "Printed circuit board design created by TINA, a CAD program from DesignSoft; saves a schematic of an electrical circuit and includes components such as transistors, resistors, and the connectors; used for storing designs.", "Windows, Windows, ", "['DesignSoft TINA']['Cave Story', 'Cave Editor']"], "ts1": ["VirtualBus Texture Description File", "Vehicle description file used by VirtualBus, a free bus driving simulation game; saves references to textures (2D graphics files) that are overlaid on the 3D vehicle model; also called a \"skin\" description file, since it configures the graphics for how the external surface area of the bus is displayed.", "Windows, ", "['VirtualBus']"], "ts": ["Video Transport Stream File", "Video stream format used for storing video on a DVD; compresses video data using standard MEPG-2 (.MPEG) video compression.", "Windows, Mac, Linux, Windows, Mac, Linux, Windows, Mac, Linux, ", "['File Viewer Plus', 'Roxio Creator NXT Pro 5', 'Corel VideoStudio Pro X10 Ultimate', 'Audials One 2017', 'VideoLAN VLC media player', 'CyberLink PowerProducer 6', 'Squared 5 MPEG Streamclip', 'Pinnacle Studio 20', 'DRD Systems VideoReDo']['Roxio Popcorn', 'Apple DVD Player', 'Squared 5 MPEG Streamclip', 'VideoLAN VLC media player', 'Aiseesoft Video Converter Ultimate']['VideoLAN VLC media player', 'SMPlayer']['TypeScript', 'Microsoft Visual Studio 2017']['TypeScript']['TypeScript']['Digia Qt SDK']['Digia Qt SDK']['Digia Qt SDK']"], "truck": ["Rigs of Rods Truck Definition File", "File used by Rigs of Rods, a program that allows users to simulate cars, trucks, airplanes, and boats; contains all structural, visual, and physical parameters that define a truck, including title, globals, engine, cameras, nodes and beams, wheels, and suspension.", "Windows, Mac, ", "['Rigs of Rods']['Rigs of Rods']"], "trx_dll": ["Windows Startup File", "File used by the Windows operating system that helps run .DLL files; loads files needed to run Microsoft Windows and other Windows programs; if a TRX_DLL file is corrupt or missing, Windows may produce an error or not startup successfully.", "Windows, ", "['Microsoft Windows']"], "trn": ["SQL Server Transaction Log Backup File", "Backup file created by Microsoft SQL Server, a relational database management system (RDBMS) application; contains a transaction log backup, which saves a history of committed and uncommitted database changes since the last checkpoint.", "Windows, ", "['Microsoft SQL Server 2016']"], "trx": ["Visual Studio Test Results File", "Test results file created by Visual Studio, a Microsoft application used to develop Windows software; contains test results stored in an XML format; used to display test results in Visual Studio as well as save historical test case results.", "Windows, Windows, Linux, Windows, Linux, ", "['Microsoft Visual Studio 2017', 'Microsoft MSTest'][][][][]"], "trs": ["WinTrack Railroad Track Text File", "Railroad track design created with the German railway design program, WinTrack; similar to a .TRA file, but saved in a text-based format; includes the train and track layout, as well as other content, such as landscapes, trees, buildings, and cars.", "Windows, Windows, Mac, Windows, ", "[]['Rosetta Stone Language Learning']['Rosetta Stone Language Learning'][]"], "trp": ["HD Video Transport Stream", "High definition video file saved in the MPEG-2 Part 1 transport format; used for multiplexing digital video and audio streams and synchronizing the output; includes features for error correction and is often used in digital video broadcasting (DVB).", "Windows, Mac, Linux, ", "['CyberLink PowerDVD 16', 'Nero 2017', 'HandBrake', 'VideoLAN VLC media player', 'DRD Systems VideoReDo', 'eRightSoft SUPER', 'VSO ConvertXtoDVD', 'Haenlein DVR-Studio', 'Codec Guide K-Lite Codec Pack']['HandBrake', 'VideoLAN VLC media player', 'iSkysoft Video Converter']['SMPlayer', 'HandBrake', 'VideoLAN VLC media player']"], "trm": ["Oracle Trace Map File", "Metadata file format introduced with Oracle Database 11g, an enterprise-level relational database management system (RDBMS); saves structural information about the records stored in a trace (.TRC) file; enables tools to process trace files more easily.", "Windows, Linux, Windows, ", "['Oracle Database']['Oracle Database'][]"], "trk": ["CompeGPS Land Track File", "File created by CompeGPS Land, a program used to to interface with CompeGPS GPS devices; contains a series of locations that are overlaid on a map; used to plan routes and load them into CompeGPS devices.", "Windows, Mac, Linux, Windows, Mac, Windows, Windows, ", "['GPSBabel']['GPSBabel']['GPSBabel']['MakeMusic Finale']['MakeMusic Finale'][][]"], "trif": ["Tiled Raster Interchange Format", "Bitmap image file created in the TRIF format, which was designed by the Tiling Task Group (TTG) and sponsored by the National Bureau of Standards in 1987; supports bitonal images that are tiled with fixed-size squares.", "Windows, ", "[]"], "tri": ["FaceGen Polygonal Model File", "3D model file created by FaceGen, an application used to create 3D human faces; contains a polygonal mesh for a human head; may also contain morphs, which are used for facial animations; often used for creating video game characters.", "Windows, Windows, Mac, Linux, ", "['Singular Inversions FaceGen Modeller', 'Singular Inversions FaceGen Customizer', 'Bethesda Softworks Fallout 3', 'Bethesda Softworks The Elder Scrolls 4: Oblivion']['Microsoft Notepad', 'text editor']['Cart3D', 'Apple TextEdit', 'text editor']['Cart3D', 'GNU Emacs', 'text editor']"], "trf": ["TorrentRover File", "A TRF file is a data file created by TorrentRover, a program used to search and download torrents from trusted sites.  It contains one or more searches conducted in TorrentRover.  TRF files include the site, time it was accessed, category, and status. ", "Windows, ", "['TorrentRover']"], "trelby": ["Trelby File", "Screenplay file created by Trelby, a free screenwriting program; contains a screenplay consisting of locations, scenes, characters, and headers; includes reports based on elements you've inserted into your screenplay, such as characters and scenes.", "Windows, Linux, ", "['Trelby']['Trelby']"], "trc": ["SQL Server Trace File", "File created by SQL Server Profiler, which is included with SQL Server software; contains trace results of the activity of a SQL database; can be used to analyze a sequence of database statements.", "Windows, Windows, ", "['Microsoft SQL Server Profiler']['Oracle Database']"], "trec": ["TechSmith Recording File", "Screen recording captured by Camtasia Studio and Camtasia for Mac; contains audio and video from a user's screen recording session; used for storing content for tutorials and demonstrations; includes metadata, such as cursor effects and transitions; saved as part of a .CAMPROJ (Windows version) and .CMPROJ (Mac version) screen recording project.", "Windows, Mac, ", "['TechSmith Camtasia Studio']['TechSmith Camtasia for Mac']"], "trd": ["TrID Definitions Package", "Database of file type definitions used by TrID, a software utility that can identify file types based on their binary signatures; saved as a separate file and can be updated by downloading new versions of the definitions library.", "Windows, Linux, ", "[][]"], "tray": ["Corel CONNECT Tray File", "File created by Corel CONNECT, a graphics content organizer that is part of CorelDRAW Graphics Suite; stores a user-selected group of graphics and can include both raster and vector samples; used for storing image trays that can be recalled.", "Windows, ", "['CorelDRAW Graphics Suite X8']"], "trak": ["Traktor Content Pack File", "Package created for Traktor, a DJ audio mixing application; stores samples and settings for the digital mixer that comprise a \"remix set,\" or \"content pack;\" used for packaging custom DJ sounds together for making different audio mixes.", "Windows, Mac, ", "['Native Instruments Traktor']['Native Instruments Traktor']"], "trace": ["VMware ThinApp Trace Log File", "File created by VMware ThinApp, a program used for packaging and running Windows applications in a single executable file with no additional dependencies; saves a log of application performance and errors; may be printed to a text report using VMware ThinApp Log Monitor, a program included with VMware ThinApp.", "Windows, ", "['VMware ThinApp 5 Suite']"], "tra": ["WinTrack Railroad Track File", "Railroad track design created with WinTrack, a German railway design program; includes the train and track layout, as well as other content, such as landscapes, trees, buildings, and cars; saved in a binary data format.", "Windows, ", "[]"], "tr3": ["TomeRaider eBook File", "Digital book that can be opened with the TomeRaider ebook reader; saved in a format that allows fast searching, indexing, and text compression; supports Wikipedia and IMDB ebooks.", "Windows, ", "['TomeRaider 3']"], "tr": ["TomeRaider 2 eBook File", "eBook created in the TomeRaider 2 (TR2) format, a software eReader available for PC, Pocket PC, and other mobile devices; supports fast searching and high compression levels; replaced by the .TR3 (TomeRaider 3) format.", "Windows, ", "['TomeRaider 3']"], "tpz": ["Kindle Topaz eBook File", "eBook file used by Amazon Kindle devices and the Amazon Kindle desktop software; contains an eBook that has been saved from an Internet download to the computer; supports advanced embedded fonts as well as auxiliary information such as bookmarks and annotations, which are store in separate metadata files.", "Windows, Mac, Linux, ", "['Amazon Kindle for PC', 'Calibre']['Amazon Kindle for Mac', 'Calibre']['Calibre']"], "tpx": ["DeLorme Topo Project File", "Project file created by DeLorme Topo North America, a mapping software product; saves a map and may include aerial imagery, points of interest, and other mapping information; can be packaged into a .DMT file for sharing with other Topo NA users.", "Windows, Windows, ", "['DeLorme Topo North America'][]"], "tpu": ["Turbo Pascal Unit", "Compiled program file created with Turbo Pascal versions 6 and earlier; built from a Pascal source code (.PAS) file that contains code written in the Pascal programming language; created when the Turbo Pascal compiler is run.", "Windows, ", "[]"], "tpr": ["TMPGEnc Project File", "Video conversion project created with TMPGEnc, a program for converting video files to different formats; includes video file information and encoding settings; supports both PAL and NTSC formats.", "Windows, ", "['Media Player Classic']"], "tpf": ["SPSS Text Wizard Document", "Settings file created by IBM SPSS, a statistical software package used for data mining and predictive analysis; saves the options specified in the Text Import Wizard; can be used for importing data from multiple text files that use the same formatting.", "Windows, Mac, Linux, Windows, Windows, ", "['IBM SPSS']['IBM SPSS']['IBM SPSS']['uMod', 'TexMod'][]"], "tpm": ["Transformation Parameters Model File", "Contains metadata that describes how to transform a UML (Unified Modeling Language) file into EGL (Enterprise Generation Language) code; enables graphical modeling of complex applications with IBM Rational software.", "Windows, Windows, ", "[][]"], "tpl": ["Document Template", "Template file created by various types of applications; saves the default settings for the page layout, written text, and other information for a document; used for generating documents with a similar style and structure.", "Windows, Mac, Windows, Windows, Mac, Linux, Windows, Mac, Windows, ", "[][]['ACD Systems Canvas X 2017']['Wiimms SZS Tools', 'SZS Modifier']['Wiimms SZS Tools']['Wiimms SZS Tools']['Adobe Photoshop CC 2017']['Adobe Photoshop CC 2017']['TatukGIS Editor']"], "tpkey": ["TexturePacker License Key File", "Software license file used by TexturePacker, a program used for creating sprite sheets and for optimizing images; contains a key that registers a valid copy of the software; provided to the user after the software has been purchased.", "Windows, Mac, Linux, ", "[\"Code'n'Web TexturePacker\"][\"Code'n'Web TexturePacker\"][\"Code'n'Web TexturePacker\"]"], "tps": ["Multi Channel Measurement File", "Format used to store data recorded with TiePie Multi Channel software; saves data logged by the program as well as instrument settings for the measurement tools; each measurement is stored in a separate file.", "Windows, Windows, Windows, Mac, Linux, Windows, Mac, ", "['TiePie Multi Channel software']['SoftVelocity Clarion'][\"Code'n'Web TexturePacker\"][\"Code'n'Web TexturePacker\"][\"Code'n'Web TexturePacker\"]['DAZ 3D Bryce 7 Pro']['DAZ 3D Bryce 7 Pro']"], "tpk": ["Gear Watchface Design Build File", "A TPK file is a watchface design build created by Gear Watch Designer, an application used by developers to generate faces for Samsung watches such as Gear S, Gear S2, Gear S3, and Gear Fit2.  It contains a build of a .GWD watchface design project which includes the background, index, images, animation, and watch hands.  TPK files are designed to be uploaded to the Gear store for distribution.", "Windows, Mac, ", "['Samsung Gear Watch Designer']['Samsung Gear Watch Designer']"], "tpi": ["EDIUS Plugin File", "Plugin file used by EDIUS, a video editing program; contains a plugin, which adds video editing functionality; commonly created to importing new file formats or apply video color adjustments, lighting effects, motion blurs, and other visual effects.", "Windows, Windows, ", "[]['IvanView']"], "tpd": ["Cyberlink TOD Video File", "High-definition JVC camcorder video edited using Cyberlink video-editing software; stores video data in the MPEG-2 transport stream format; used to preserve the high-definition format recorded by the JVC camcorder.", "Windows, Windows, ", "['CyberLink PowerDVD 16', 'CyberLink PowerProducer 6', 'CyberLink PowerDirector 15 Ultra']['Freebyte.com TreePad']"], "tpb": ["GROMACS Binary Input File", "Input file for GROMACS, a software package for performing molecular dynamics functions; contains the simulation's starting structure, the molecular topology, and the simulation data.", "Mac, Linux, ", "['Gromacs']['Gromacs']"], "tp4": ["RollerCoaster Tycoon Track Picture File", "Game file used by RollerCoaster Tycoon, an amusement park creation and simulation game; saves a snap shot picture of a roller coaster ride and allows players to preview the roller coaster in the game before including it in the theme park.", "Windows, ", "['Chris Sawyer RollerCoaster Tycoon']"], "tpark": ["ThemePark Project File", "Project file created by ThemePark, a tool used for customizing the look and feel of Mac OS X; saves colors, fonts, and other appearance settings; can change the look of titlebars, menus, buttons, and other visual elements.", "Mac, ", "['Geekspiff ThemePark']"], "tpc": ["Topic Connection Placeholder", "Placeholder file produced when an inter-Topicscape topic-link file is exported to Windows; allows a Topicscape to be opened at a specific topic from another Topicscape file.", "Windows, ", "['3D Topicscape']"], "tp3": ["Harvard Graphics DOS Template File", "Template file used by Harvard Graphics presentation software; contains a slide, or chart, template with header, footer, background image, and font preferences; used for establishing a common theme for all slides within a presentation or across presentations.", "Windows, ", "['Corel Presentations X8']"], "tp0": ["Mascom PVR Video File", "Video file created by Mascom PVR devices; contains a video recording that is saved on the internal disk of a PVR device; saved in a proprietary format and can be converted to more common video file types.", "Windows, Mac, ", "['Squared 5 MPEG Streamclip']['Squared 5 MPEG Streamclip']"], "tp": ["Beyond TV Transport Stream File", "Video recording captured using Beyond TV digital video recording software; recorded using a compatible TV tuner card and a television source such as analog or digital cable, satellite, or antenna.", "Windows, ", "['File Viewer Plus', 'CyberLink PowerDVD 16', 'Roxio Creator NXT Pro 5', 'GRETECH GOM Player', 'DRD Systems VideoReDo']"], "totalslayout": ["Totals Invoice Layout File", "Page layout file used by Totals, an invoice preparation program; saves a document layout for generating an invoice and contains template fields (business name, address, client information, etc.) that are filled in by the software when creating a report.", "Mac, ", "['Kedisoft Totals']"], "totalssyncdb": ["Totals Synchronized Database File", "File created by Totals, a program used for making business invoices; similar to a .TOTALSDB file, but supports access from multiple computers when stored on a synchronized cloud drive such as Google Drive or Dropbox; enables users to work on their invoices from distributed locations.", "Mac, ", "['Kedisoft Totals']"], "totalsdb": ["Totals Database File", "File created by Totals, a program used for making invoices; saves a database of client information, invoices, and reports; allows personal consultants and small business owners to track invoice information.", "Mac, ", "['Kedisoft Totals']"], "totalsbackup": ["Totals Database Backup File", "Backup file created by Totals, a program used for preparing invoices; saves a backup of the invoice information in a .TOTALSDB file; used for creating archives of invoice data, which can be sent to an external drive, online backup storage location, or other safe location.", "Mac, ", "['Kedisoft Totals']"], "torrent": ["BitTorrent File", "A TORRENT file is a file used by BitTorrent, a peer-to-peer (P2P) file sharing program, for downloading a file (often from multiple locations at one time).  It does not contain the content being distributed, only the metadata, which includes information about the file or group of files to be downloaded, such as their names, sizes, and folder structure.", "Windows, Mac, Linux, Android, ", "['BitTorrent', 'uTorrent', 'Vuze', 'BitComet', 'FlashGet', 'Shareaza', 'Headlight GetRight', 'BitLord', 'Ares', 'Deluge', 'Opera', 'Torch']['BitTorrent', 'uTorrent', 'XTorrent', 'Vuze', 'BitRocket', 'Transmission', 'Opera', 'Eltima Folx 5', 'Torch']['Vuze', 'Deluge', 'Transmission', 'Tribler', 'Opera']['Delphi Softwares Flud']"], "tor": ["Star Wars: The Old Republic Asset File", "Archive used by Star Wars: The Old Republic (SWTOR); contains game data, such as maps, characters, weapons, and music; saved in the MYP archive format.", "Windows, ", "['LucasArts Star Wars: The Old Republic', 'EasyMYP']"], "topviw": ["TopSolid'Viewer Document", "CAD document created by TopSolid, a CAD design and product data management (PDM) application; stores a CAD drawing exported from TopSolid, but does not include all design information such as the complete models and Bill of Materials (BoM) data; can be opened with the free TopSolid'Viewer program.", "Windows, ", "['Missler TopSolid', \"Missler TopSolid'Viewer\"]"], "topprj": ["TopSolid Project File", "CAD design package file used by TopSolid, a software solution for managing CAD projects; may store references to part and assembly design documents, bill of materials documents, drawing drafts, and exploded part design documents; used for consolidating and organizing CAD project documents.", "Windows, ", "['Missler TopSolid']"], "topc": ["TopicCrunch Project File", "Text file storing keywords and domain and search engine settings; allows for quickly setting up a search engine optimization check using TopicCrunch; referenced by TopicCrunch, but can be viewed and edited in a text editor.", "Windows, ", "['text editor']"], "toc": ["PSP Audio File", "Audio format used by the Sony PlayStation Portable (PSP); required for creating custom tracks for games such as Grand Theft Auto: Liberty City Stories.", "Windows, Windows, Mac, Linux, Windows, Mac, ", "[]['QUALCOMM Eudora']['QUALCOMM Eudora']['Brasero']['Blizzard World of Warcraft', 'Blizzard World of Warcraft Interface AddOn Kit', 'Addon Studio for World of Warcraft']['Blizzard World of Warcraft', 'Blizzard World of Warcraft Interface AddOn Kit']"], "top": ["Gromacs Topology File", "Data file created by Gromacs, a molecular data analysis application; contains a molecular topology, which formally describes the structure of a molecule; created by pdb2gmx, a program that generates topologies from Protein Data Bank (.PDB) and Residue Topology Parameter (.RTP) files.", "Linux, Windows, ", "['Gromacs']['Missler TopSolid', \"Missler TopSolid'Viewer\"]"], "tod": ["JVC Everio Video Capture File", "Video file captured by a JVC Everio video camera, such as the GZ-HD3 and GZ-HD7; saved in a proprietary format that can be viewed using the Cyberlink software included with JVC video cameras.", "Windows, Mac, Linux, ", "['Adobe Flash Professional CC', 'CyberLink PowerDirector 15 Ultra', 'CyberLink PowerDVD 16', 'Nero 2017', 'Squared 5 MPEG Streamclip', 'Serif MoviePlus', 'MAGIX Vegas Pro 14', 'VideoLAN VLC media player']['Apple iMovie 10', 'Adobe Flash Professional CC', 'Squared 5 MPEG Streamclip', 'VideoLAN VLC media player']['VideoLAN VLC media player']"], "tol": ["AOL Tool File", "Data file referenced by America Online (AOL); similar to a .DLL file used by other applications; saved in the \\Program Files\\AOL directory by default.", "Windows, Mac, ", "[][]"], "toast": ["Toast Disc Image", "A TOAST file is a CD or DVD disc image created with Roxio Toast, a popular disc authoring program for Mac OS X.  It is similar to a standard .ISO disc image, but contains specific Toast formatting information.", "Mac, ", "['Roxio Toast 15', 'Roxio Popcorn']"], "tny": ["Atari Tiny Image", "Animated image sequence used by Atari ST systems, which were discontinued in 1993; includes multiple bitmap animation frames, as well as the duration and speed for the sequence; used for creating animated images with various resolutions.", "Windows, Mac, Linux, ", "['XnViewMP', 'Newera Graphics Converter Pro']['XnViewMP']['XnViewMP']"], "tnsp": ["TI-Nspire PublishView Document", "Calculator program created by TI-Nspire, a desktop application used for creating programs for TI-Nspire graphing calculators; saves a program published in a format that can be run in a Web browser by the TI-Nspire Document Player, which is available at the Texas Instruments website.", "Windows, Mac, ", "['Texas Instruments TI-Nspire Software']['Texas Instruments TI-Nspire Software']"], "tns": ["TI-Nspire Document", "Calculator program created for TI-Nspire handheld graphing calculators; can include graphs, statistical data, or other application components runnable by the calculator; created by the TI-Nspire desktop software and can be uploaded to the TI-Nspire device and executed after the program is complete.", "Windows, Mac, ", "['Texas Instruments TI-Nspire Software']['Texas Instruments TI-Nspire Software']"], "tn3": ["Tiny High Resolution Image", "Animated bitmap image used by the Atari ST systems, which were developed in the late 1980s and early 1990s; stores multiple bitmap frames and the animation sequence's speed and duration; used to play high resolution animated graphics.", "Windows, Mac, Linux, ", "['XnViewMP', 'Newera Graphics Converter Pro']['XnViewMP']['XnViewMP']"], "tnef": ["Transport Neutral Encapsulation Format", "File generated by Microsoft Exchange email programs such as Outlook; appears as an email attachment for email clients that don't recognize Microsoft's proprietary TNEF format; may cause the text \"application/ms-tnef\" to appear in the email if the email client does not recognize Microsoft Exchange formatting.", "Windows, Mac, ", "['Microsoft Outlook 2016', 'Microsoft Outlook Express']['Apple Mail', 'Microsoft Outlook 2016']"], "tne": ["Manga Studio Tone File", "Graphic file used by Manga Studio, an application used for creating comic books; stores a pattern that can texturize a fill area, such as clothing, shadows, hair, or other drawn objects; can be applied to a Tone layer in a manga drawing.", "Windows, Mac, ", "['CELSYS Clip Studio Paint Pro']['CELSYS Clip Studio Paint Pro']"], "tn2": ["Tiny Medium Resolution Image", "Animated graphic used by Atari ST systems, which were used in the late 1980s and early 1990s; contains one or more image frames, as well as the animation sequence's speed and duration; used for storing medium resolution animated images.", "Windows, Mac, Linux, ", "['XnViewMP', 'Newera Graphics Converter Pro']['XnViewMP']['XnViewMP']"], "tn1": ["Tiny Low Resolution Image", "Animated bitmap image used by Atari ST systems, which were discontinued in 1993; stores one or more bitmap frames as well as the speed and duration for the animation sequence; used for creating low resolution animated images.", "Windows, Mac, Linux, ", "['Newera Graphics Converter Pro', 'XnViewMP']['XnViewMP']['XnViewMP']"], "tn": ["LG Phone Image", "Image format used by some LG mobile phones, including the LG Env3 and LG EnV Touch; saves a picture taken by the phone and is saved to the memory card (MicroSD) on the device; cannot be viewed with traditional image viewers, but instead should be sent from the phone to the user's email address to view on a computer as a .JPG file (Media Center → Picture & Video → My Pictures → Select Picture → Send → Picture Message).", "Windows, ", "['IrfanView']"], "tmzip": ["Theme Manager Zip File", "File created by Theme Manager, a program used for altering the appearance of the Windows 7 desktop environment and login screen; saves images and appearance settings; can be installed through the Theme Manager interface.", "Windows, ", "['Theme Manager']"], "tmx": ["Translation Memory Exchange File", "File created in the Translation Memory Exchange (TMX) format, an open XML standard used for exchanging translation memory (TM) data created by Computer Aided Translation (CAT) and localization applications; may save words or phrases that have been translated from one language to another; used for transferring the translation memory between different tools and vendors.", "Windows, Mac, Linux, ", "['SDL Trados Studio', 'Maxprograms Swordfish', 'OmegaT']['Maxprograms Swordfish', 'OmegaT']['Maxprograms Swordfish', 'OmegaT']"], "tmw": ["Translation Memory Data File", "Data file that contains linguistic and translation units for a translation memory used by Trados document translation software; continually grows and learns from the translator; can be opened directly with Trados Translator's Workbench.", "Windows, ", "['SDL Trados Studio']"], "tmvt": ["TimeMap Template", "Template created by TimeMap, a timeline graphing application; contains a customized or predefined timeline template; predefined templates include fact flag styles, backgrounds, title styles, and time scale styles.", "Windows, ", "['LexisNexis TimeMap']"], "tmv": ["TextMaker Template", "Document template created by TextMaker, the word processor included with SoftMaker Office; can be used for making TextMaker documents (.TMD files) from the same template; uses a proprietary format but can be converted to the Microsoft Word .DOTX format in TextMaker.", "Windows, Windows, ", "['SoftMaker Office']['LexisNexis TimeMap']"], "tmtheme": ["TextMate Theme File", "Settings file used by source code editors MacroMates TextMate and Sublime Text; saved in an XML format and contains appearance properties for the application's window; includes the font type, size, and colors, as well as foreground and background color settings.", "Windows, Mac, Linux, ", "['Sublime Text 3']['MacroMates TextMate', 'Sublime Text 3']['Sublime Text 3']"], "tms": ["Telemate Script", "Script that runs commands in Telemate, an older DOS communications program; often used as a connection script for connecting to a bulletin board system via a dial-up modem.", "Windows, ", "[]"], "tmr": ["Apimac Timer Document", "File created by Timer, a stopwatch and clock utility for Mac OS X; contains saved timer settings for the stopwatch, countdown, alarm clock, and standard clock features; used for saving and reusing the settings created in the program.", "Mac, Windows, ", "['Apimac Timer']['Comfort Software Group Free Countdown Timer']"], "tmproject": ["TextMate Project", "Project file created by TextMate, a text editing program with support for many programming languages; saved in an XML format and stores references to project directories and files; used for organizing source code files together in a project.", "Mac, ", "['MacroMates TextMate']"], "tmproj": ["TextMate Project File", "Project file created by TextMate, a Mac text editor that supports editing and syntax highlighting in many programming languages; saved in an XML format and contains references to project files; also stores the currently opened file, preferences, and editor window settings.", "Mac, ", "['MacroMates TextMate']"], "tmo": ["3DCG Animation and Pose File", "File created by 3D Custom Girl (3DCG), a program often used for creating virtual dancing characters for MikuMikuDance; saves pose (bone position) or animation information for a character and can be converted to a .VPD file, which is the format required by MikiMikuDance.", "Windows, ", "['tmo2vpd']"], "tmp": ["Finale Temporary File", "File created by Finale, a music notation program for instruments, vocals, and more; contains backup data for the document you're working on; acts similar to a cache file; exists only while you're working in Finale and deleted when the program is closed; cannot be opened manually.", "Windows, Mac, Windows, Mac, ", "['MakeMusic Finale']['MakeMusic Finale']['Microsoft Word 2016', 'Microsoft Internet Explorer']['Microsoft Word 2016', 'Apple Safari', 'Mozilla Firefox']"], "tmod": ["Terraria Mod File", "A TMOD file is a mod created by tModLoader, a program used to create and distribute mods for Terraria, a 2D sandbox construction action and adventure game.  It contains a mod compiled from mod source files, such as .CS and .PNG files.  TMOD files are used to add or alter content in Terraria that modifies gameplay.", "Windows, ", "['Re-Logic Terraria', 'tModLoader']"], "tmpl": ["BlueJ Default Template", "Template file created for BlueJ, a Java development program; contains a default template with the source text of different classes accessible in BlueJ, some examples include: standard Java class, interface, Applet source, and project note; appears in different languages such as English, Chinese, and German.", "Windows, Mac, Linux, Windows, ", "['BlueJ']['BlueJ']['BlueJ'][]"], "tmlanguage": ["TextMate Language Grammar File", "Language grammar file used by TextMate, a Mac OS X source code editor; contains a specification for the syntax of a programming language; used for adding syntax highlighting support for additional languages.", "Mac, ", "['MacroMates TextMate']"], "tmd": ["TextMaker Document", "Document created by TextMaker, a word processing application that is part of SoftMaker Office; supports text, images, drawn objects, and page formatting properties; used to store authored documents.", "Windows, Linux, Android, Windows, Windows, Mac, Linux, ", "['SoftMaker Office']['SoftMaker Office']['SoftMaker Office: TextMaker Mobile']['chUmbaLum sOft MilkShape 3D']['MySQL']['MySQL']['MySQL']"], "tme": ["Bryce Time File", "Animation file used by Bryce, a 3D modeling program; contains motion settings for the animation of a 3D model; used for storing default or user-defined custom time curves.", "Windows, Mac, ", "['DAZ 3D Bryce 7 Pro']['DAZ 3D Bryce 7 Pro']"], "tmc": ["Theta Music Composer 1.x Audio File", "Audio file created by Theta Music Composer (TMC), a music editor for Atari; supports mono and stereo audio; allows users to experiment with stereo Atari music; differs from the similar .TM8 format, which supports 8 channels.", "Windows, ", "['Another Slight Atari Player', 'Theta Music Composer']"], "tmbundle": ["TextMate Bundle File", "Add-on file used by TextMate, a source code text editor for Mac OS X; contains a bundle of resources that add new features to the software; commonly used for adding source code editing support for new programming languages.", "Mac, ", "['MacroMates TextMate']"], "tmb": ["Timbuktu Pro Connection Document", "Remote access control file used by Timbuktu, a program that allows multiple computer systems to be controlled remotely; stores the connection settings for a remote connection, including the computer name, remote IP address, and security settings.", "Windows, Mac, ", "[][]"], "tm8": ["Theta Music Composer 1.x Audio File", "Audio file created by Theta Music Composer (TMC), an Atari music editor; used as a format for users wanting to fully utilize the possibilities of a stereo Atari; supports 8 channels and differs from the similar .TMC format, which only supports mono and stereo.", "Windows, ", "['Another Slight Atari Player', 'Theta Music Composer']"], "tm2": ["PlayStation 2 Graphic", "Image file used by some games for the Sony PlayStation 2 console system; saved on the game disc and often used for storing textures; can be viewed with the free XnView program.", "Windows, Mac, Linux, Windows, ", "['XnViewMP']['XnViewMP']['XnViewMP']['Another Slight Atari Player', 'Theta Music Composer']"], "tm": ["TeXmacs Document", "Structured text document created with TeXmacs, a graphical LaTeX editor developed for Unix systems; may include text, graphics, mathematical formulas, graphs, and interactive content.", "Windows, Linux, ", "[][]"], "tlz": ["Tar LZMA Compressed File", "Tar (.TAR) archive that has been compressed with Lzip (.LZ) file compression; uses the Lempel-Ziv-Markov chain-Algorithm (LZMA); most commonly used on Unix systems, but supported by Lzip on Windows and Macintosh systems as well.", "Windows, Mac, Linux, ", "['Lzip', '7-Zip']['Lzip', 'Sixty Five 7zX']['Lzip', 'Tukaani LZMA Utils']"], "tlzma": ["LZMA Compressed Tar Archive", "File archive created using the Tar archiver and compressed with the LZMA compression algorithm; combines a .TAR archive and an .LZMA file into a single archive; typically created on Unix systems.", "Windows, Mac, ", "['Smith Micro StuffIt Deluxe for Windows']['Smith Micro StuffIt Deluxe 16']"], "tlx": ["Standard Dictionary File", "Dictionary file used by various programs; contains a word list for a particular language, such as American English, British English, or Spanish; sometimes distributed alongside a .CLX file, which contains a more comprehensive word list.", "Windows, ", "['Wintertree WSpell', 'Inspiration Software Inspiration']"], "tls": ["TuneUp Utilities Logon Screen", "Custom Windows logon screen used by Tune Styler, a desktop customization program included with TuneUp Utilities; may include a background image as well as custom fonts and buttons; overrides the default Windows startup screen when applied.", "Windows, ", "['AVG PC TuneUp Unlimited']"], "tlp": ["Tulip Software Graph Format File", "File created by Tulip, an information visualization and analysis tool; contains graph definitions, such as the version of the format, the date, author name, and definitions of nodes, edges, clusters, and other properties. ", "Windows, Mac, Linux, ", "['Tulip']['Tulip']['Tulip']"], "tlk": ["BioWare Aurora Engine Talk Table File", "Language dialog file used by BioWare first-person shooter games; contains strings of dialog that are displayed during gameplay and allows the game to have multiple localizations for different languages; supported by BioWare's Aurora Engine and Infinity Engine technologies.", "Windows, ", "['Infinity Engine Talk Table Editor', 'Talk table editor']"], "tlo": ["SPSS TableLooks File", "Table definition file created by SPSS version 15 or earlier; saves the properties that define the appearance of an output data table; used for outputting analysis results with the same formatting.", "Windows, Mac, Linux, ", "['IBM SPSS']['IBM SPSS']['IBM SPSS']"], "tlg": ["QuickBooks Transaction Log File", "Log file created by QuickBooks, a program used to track personal and company finances; contains a log of all pending uncommitted transactions to a .QBW file; tracks data changes since the last time a proper backup has been created.", "Windows, Mac, ", "['Intuit QuickBooks Pro 2016']['Intuit QuickBooks for Mac 2016']"], "tll": ["LG TV Link-Loader File", "Configuration file that contains settings for an LG television; may include options such as the start channel, start volume, minimum and maximum volume settings, and the default channel list.", "Windows, ", "['ChanSort']"], "tli": ["Typelib Generated C/C++ Inline File", "Source code header file generated by a C/C++ compiler; contains inline wrapper functions generated by the #import directive; used in combination with a .TLH file to reconstruct type library contents in C/C++ source code.", "Windows, ", "['Microsoft Visual Studio 2017']"], "tlh": ["Typelib Generated C/C++ Header File", "Header file generated by a Microsoft C/C++ compiler; contains definitions of interfaces and identifiers generated by the #import directive; used in conjunction with a .TLI file to reconstruct compiled type library contents for use in C/C++ source code.", "Windows, ", "['Microsoft Visual Studio 2017']"], "tld": ["Tag Library Descriptor File", "Developer file used for Java Server Page (JSP) development projects; saved using XML formatting and contains descriptions of tags, which are used to markup JSP documents; describes the supported tags in a corresponding tag library.", "Windows, Mac, Linux, ", "['Eclipse IDE for Java Developers', 'Oracle NetBeans', 'Microsoft XML Notepad', 'text editor']['Eclipse IDE for Java Developers', 'Oracle NetBeans', 'MacroMates TextMate', 'text editor']['Eclipse IDE for Java Developers', 'Oracle NetBeans', 'Vim', 'text editor']"], "tlc": ["The Logo Creator File", "Logo created with The Logo Creator, a graphics program designed for creating and editing logos; typically contains vector graphics and text; may also include textures, 2D and 3D effects, and a transparent or colored background.", "Windows, Mac, ", "['Laughingbird The Logo Creator']['Laughingbird The Logo Creator']"], "tla": ["TuneUp Utilities Startup Logo", "Image file that serves as a custom Windows startup logo; can be applied to a Windows PC using Tune Styler, a desktop customization program included with TuneUp Utilities; replaces the default logo that appears when Windows is starting up.", "Windows, ", "['AVG PC TuneUp Unlimited']"], "tl5": ["Timeliner 5 File", "Project file created by Timeliner 5, an educational tool that allows students to create timelines and other visual representations of information; may contain pictures, text, dates, and charts created by the student.", "Windows, Mac, ", "['Tom Snyder Productions Timeliner']['Tom Snyder Productions Timeliner']"], "tkr": ["Tinker Custom Level File", "File used by Tinker, a free robot puzzle game developed by Microsoft Games; contains a level in which players control Tinker, the robot, through puzzles and contraptions; used for saving pre-installed levels and custom levels.", "Windows, ", "['Microsoft Tinker']"], "tlb": ["VAX Text Library", "Contains a text-based library of information used by a VAX / VMS system", "Windows, Windows, Mac, ", "['HP OpenVMS', 'text editor']['Microsoft Excel 2016']['Microsoft Excel 2016']"], "tkfl": ["TKLinks Saver Favorite Links File", "File saved by TKLinks Saver that opens all the data saved in the list", "Windows, ", "[]"], "tko": ["AMX Software Module File", "File used by AMX or Netlinx software, which is used for developing and controlling museum exhibit displays; contains a module that can be added to the software; used for updating or upgrading components.", "Windows, Windows, ", "['AMX TakeNote', 'AMX TPDesign4'][]"], "tk": ["Tk Script", "Script written in the Tool Command Language; similar to a .TCL file, but run through Wish", "Windows, Mac, Linux, ", "[][][]"], "tk3": ["TK3 Multimedia eBook", "Electronic book format that supports text, images, sounds, and video; can be used to create interactive documents and educational projects, such as reference guides, catalogs, and presentations.", "Windows, Mac, ", "[][]"], "tjc": ["Taikojiro Song Map Sequence File", "Game file used by Taikojiro, a Japanese rhythm synchronization game; references multiple song map .TJA files in a sequence; supports the continuous play mode in the game.", "Windows, ", "['Taikojiro']"], "tjp": ["TaskJuggler Project File", "Project file created with TaskJuggler, an open source project management tool; used for managing and analyzing tasks, resources, costs, productivity, etc.", "Linux, Linux, ", "[][]"], "tja": ["Taikojiro Song Map File", "File used by Taikojiro, a Japanese rhythm game where players synchronize drum hits with music; saved in a plain text format and contains a map of drum hit timings; also stores the song name, tempo, and volume.", "Windows, ", "['Taikojiro']"], "tix": ["DivX Video Download Activation File", "File used by DivX player, a video player program; does not contain data, but exists as an empty file that triggers video download from a DivX partner site; served to users upon payment for a video and deleted immediately after the video starts to download.", "Windows, Mac, ", "['DivX 7 for Windows']['DivX 7 for Mac']"], "tivo": ["TiVo Video File", "Video file recorded by a TiVo DVR device; stores the video using MPEG-2 compression and includes copyright protection; used for saving TV shows and movies to watch later.", "Windows, Mac, ", "['TiVo Desktop', 'Roxio Creator NXT Pro 5', 'CyberLink PowerDVD 16', 'VSO ConvertXtoDVD', 'DRD Systems VideoReDo', 'JRiver Media Center']['TiVo Desktop', 'Roxio Toast 15']"], "tip": ["TuneUp Utilities Icon Package", "Collection of custom icons used by TuneUp Styler, a desktop customization program included with TuneUp Utilities; can be used to replace the default Windows icons with custom icons; packages typically contain a group of icons designed around a specific theme.", "Windows, ", "['AVG PC TuneUp Unlimited']"], "tiprogram": ["TI-Basic Program File", "File used by Texas Instruments graphing calculators; contains source code written in the TI-Basic programming language; used to store and execute programs on a calculator.", "Windows, Mac, ", "['Texas Instruments TI Connect']['Texas Instruments TI Connect']"], "tis": ["True Image Script", "Backup script used by Acronis Windows backup software including True Image and Backup & Recovery; saves a series of commands used for automating backup tasks; often used by system administrators for scheduling backups in enterprise environments.", "Windows, ", "['Acronis True Image 2017']"], "time": ["LIGHT File", "File created by LIGHT, the Web System that helps users record, organize, and share their lives; contains a group of posts and represents a folder on the user's life page.", "Mac, iOS, ", "[][]"], "tim": ["The Incredible Machine Level", "Level file for The Incredible Machine; includes objects that must be arranged into a contraption that will perform a specific task; may be included with the game or created by the user as a homemade puzzle.", "Windows, Mac, ", "[][]"], "tiger": ["Tomb Raider Game Data Archive", "Archive file consisting of game data used by the 2013 release of Tomb Raider, an action adventure game developed by Crystal Dynamics; contains the sound effects, music, models, textures, and other files used by the game.", "Windows, ", "['Crystal Dynamics Tomb Raider', 'Gibbed Tiger Unpacker']"], "tif": ["Tagged Image File", "A TIF file is an image file saved in a high-quality graphics format.  It is often used for storing images with many colors, such as digital photos and includes support for layers and multiple pages.", "Windows, Mac, Linux, Web, iOS, Android, Windows, ", "['File Viewer Plus', 'Microsoft Windows Photos', 'Microsoft Windows Photo Viewer', 'CorelDRAW Graphics Suite X8', 'Corel PaintShop Pro X9', 'Adobe Photoshop CC 2017', 'Adobe Photoshop Elements 15', 'Adobe Illustrator CC 2017', 'ACD Systems ACDSee 20', 'ACD Systems Canvas X 2017', 'Nuance PaperPort 14', 'Nuance OmniPage Ultimate', 'Roxio Creator NXT Pro 5', 'image viewer']['Apple Preview', 'Adobe Photoshop CC 2017', 'Adobe Photoshop Elements 15', 'Adobe Illustrator CC 2017', 'ACD Systems ACDSee Mac Pro 3', 'Roxio Toast 15', 'MacPhun ColorStrokes', 'image viewer']['GIMP', 'image viewer']['Google Drive']['Google Drive']['File Viewer for Android', 'Google Drive']['Geosoft Oasis montaj', 'ESRI ArcGIS for Desktop', 'The MathWorks MATLAB', 'ERDAS IMAGINE', 'GDAL']"], "tig": ["TI Connect Backup File", "Backup file created by TI Connect, an application used to manage data on Texas Instruments (TI) calculators; stores a full backup of the data on the calculator, including the applications and settings; used for restoring a calculator's state when connected via TI Connect.", "Windows, Mac, ", "['Texas Instruments TI Connect', 'Smith Micro StuffIt Expander']['Texas Instruments TI Connect', 'Smith Micro StuffIt Expander']"], "tiff": ["Tagged Image File Format", "A TIFF file is a graphics container that stores raster images.  It may contain high-quality graphics that support color depths from 1 to 24-bit and supports both lossy and lossless compression.  TIFF files also support multiple layers and pages.", "Windows, Mac, Web, Android, ", "['File Viewer Plus', 'Microsoft Windows Photos', 'Microsoft Windows Photo Viewer', 'CorelDRAW Graphics Suite X8', 'Adobe Photoshop CC 2017', 'Adobe Photoshop Elements 15', 'Adobe Illustrator CC 2017', 'ACD Systems ACDSee 20', 'Nuance PaperPort 14', 'Nuance OmniPage Ultimate', 'image viewer']['Apple Preview', 'Adobe Photoshop CC 2017', 'Adobe Photoshop Elements 15', 'Adobe Illustrator CC 2017', 'Roxio Toast 15', 'MacPhun ColorStrokes', 'image viewer']['Google Drive']['File Viewer for Android']"], "tie": ["CrossTie Installer File", "File used by CrossOver, a program used for running Windows programs on Mac and Linux; saved in an XML format and contains parameters that specify how to download and install a Windows software application.", "Mac, Linux, ", "['CodeWeavers CrossOver']['CodeWeavers CrossOver']"], "tid": ["AVCHD Thumbnail File", "File created by Sony and Panasonic digital camcorders; contains thumbnail stills of recorded video in the AVCHD (Advanced Video Coding High Definition) format; similar to .TDT files; appears in folder when connecting camcorder to computer; not meant to be manually opened.", "Windows, Mac, ", "[][]"], "tibkp": ["Titanium Backup File", "Backup file created by Titanium Backup, an application used to back up files on Android devices; contains a backup of an app with related data or just the data itself; stored locally and can be exported to other devices.", "Android, ", "['Titanium Track Titanium Backup']"], "thumb": ["JAlbum Thumbnail File", "Small thumbnail image generated by JAlbum, a free photo gallery software program; created from the full size image and represents the original image in an album; allows many photos to be browsed at one time.", "Windows, Mac, Linux, ", "[][][]"], "thp": ["Wii/GameCube Video File", "Video file used by some games for the Nintendo Wii and GameCube consoles; may store various cinematics or cutscene videos used by the game; can be played with thpplay and can be created with WiiFlow THP Video Converter.", "Windows, Windows, Mac, ", "['File Viewer Plus', 'thpplay']['Intuit TurboTax Deluxe']['Intuit TurboTax Deluxe']"], "tib": ["Acronis True Image File", "Disk image created by Acronis True Image; contains an exact copy of a hard disk, which allows the complete hard disk to be restored in case of a system crash; may be a single backup or one of many incremental backups.", "Windows, Linux, ", "['Acronis True Image 2017', 'Acronis Backup 12', 'VMware vCenter Converter']['Acronis Backup 12']"], "thx": ["Amiga THX Tracker Music File", "Audio file or song created with THX Tracker program on an Amiga system; similar to a MIDI file, but also includes audio samples.", "Windows, Mac, ", "['Cloanto Amiga Forever', 'WinTHX', 'WinAHX']['CocoModX', 'Cloanto Amiga Forever']"], "thm": ["Sony Ericsson Theme File", "A THM file is a theme file used by Sony Ericsson mobile phones.  It stores settings used to customize the user interface of the cell phone and includes custom window and text colors, icons, wallpaper, and other images.  THM files can be created and edited using the free Themes Creator from Sony Ericsson.", "Windows, Mac, Windows, Mac, Windows, Windows, Mac, ", "['Sony Ericsson Themes Creator']['Sony Ericsson Themes Creator']['Microsoft Windows Photo Viewer', 'Microsoft Paint', 'Adobe Photoshop CC 2017', 'Sony Picture Motion Browser', 'Canon ZoomBrowser EX', 'picture viewer']['Apple Preview', 'Adobe Photoshop CC 2017', 'picture viewer'][]['Microsoft Windows Photos', 'Microsoft Windows Photo Viewer', 'ACD Systems ACDSee 20', 'image viewer']['Apple Preview', 'image viewer']"], "thing": ["MakerBot Thing File", "3D model file used by MakerBot Desktop, an application that allows users to send 3D models to 3D printers; stores multiple .STL files arranged to be printed together; includes an XML manifest.", "Windows, Mac, ", "['MakerBot Desktop']['MakerBot Desktop']"], "thl": ["Total 3D Home Design File", "File created by Total 3D Home Design, a home planning and modeling program; contains the blueprint model of the customized house design; model data held in the file includes house levels, room layout, wall sections, measurements, and fence height. ", "Windows, ", "['Individual Software Total 3D Home Design Deluxe']"], "thmx": ["Office 2007 Theme File", "Theme that can be applied to a document or presentation created with Microsoft Office 2007 or later; contains pre-defined colors, fonts, and formatting; typically used as a template for creating multiple files with a similar look and feel.", "Windows, Mac, ", "['Microsoft Word 2016', 'Microsoft Excel 2016', 'Microsoft PowerPoint 2016', 'Microsoft SharePoint']['Microsoft Word 2016', 'Microsoft Excel 2016', 'Microsoft PowerPoint 2016']"], "themepack": ["Windows 7 Theme Pack", "System theme created for the Windows 7 operating system; saved in the .CAB format and includes desktop background images and interface customizations for window appearance, icons, cursors, sounds, screen savers, etc; can be saved and loaded using the Personalization Control Panel in Windows 7.", "Windows, ", "['Microsoft Windows Personalization Control Panel']"], "theater": ["iMovie Theater File", "Archive created by iMovie 10 and later, a video editing application; contains files that make up a user's iMovie theater, which includes .MP4 files of the user's videos and a .PLIST file containing a list of the seen movies.", "Mac, ", "['Apple iMovie 10']"], "the": ["Microsoft Plus! Theme File", "Theme or Plus Pack used by Microsoft Plus!, an operating system enhancement program for Windows; contains settings and other data that can change the look and feel of the Windows interface; may also include additional programs, utilities, and games.", "Windows, ", "['Microsoft Plus!']"], "theme": ["Microsoft Plus! Desktop Theme", "Theme file for Microsoft Plus!, a software enhancement to the Windows operating system; contains settings used to customize the Windows desktop; saved in Microsoft's .INI text-based format and includes colors, styles, and references to image and sound files used by the theme; may be included with the Microsoft Plus! software or may be custom made by the user.", "Windows, Linux, Windows, Linux, ", "['Microsoft Windows', 'Microsoft Plus!']['Wine']['Comodo Internet Security', 'Comodo Antivirus']['GNOME Desktop']"], "th": ["Therion Data File", "Data file used by Therion, a cave system visualization application; contains \"centreline\" data, which represents the path of the logged locations in the cave; used for mapping underground cave systems and visualizing them in the software.", "Windows, ", "['Therion']"], "tha": ["Windows Thai Noise-Words List File", "System file used by used by Index Server, a component of the Microsoft Windows operating system (OS) used for search indexing; saves a list of words to be excluded from the OS's search index; enables unwanted words, such as \"of,\" and \"it,\" to be excluded from file, folder, and other searches.", "Windows, ", "['Microsoft Windows', 'Microsoft Notepad', 'text editor']"], "tgz": ["Gzipped Tar File", "Unix .TAR file archive compressed with Gnu Zip (.GZIP) compression; uses a TAR archive to bundle the files together and Gzip compression to reduce the file size; commonly used on Unix and Linux systems; originally created as the shorthand version of the compound extension .TAR.GZ.", "Windows, Mac, Linux, Android, ", "['File Viewer Plus', 'Smith Micro StuffIt Deluxe for Windows', 'WinRAR 5', 'Corel WinZip 21', '7-Zip', 'Zipeg']['Apple Archive Utility', 'Smith Micro StuffIt Deluxe 16', 'Incredible Bee Archiver', 'Zipeg'][]['File Viewer for Android', 'ZDevs ZArchiver']"], "tgw": ["Terragen World File", "Settings file created by Terragen Classic, a natural scenery generation application; contains world data such as atmosphere, lighting, and surface settings; discontinued in later versions of Terragen.  ", "Windows, ", "['Planetside Software Terragen Classic']"], "tgp": ["Terragen Plugin", "A TGP file is a plugin used by Terragen Classic, a photorealistic natural scenery generation program.  It contains a plugin, which includes information that extends the capabilities of Terragen when installed.  TGP files are used to add a variety of features to Terragen, such as camera effects and new landscapes. ", "Windows, ", "['Planetside Software Terragen Classic']"], "tgo": ["Terragen Object File", "Object created by Terragen, a landscape generation program; contains a three dimensional object and any attached nodes; similar to the .OBJ file but in the Terragen native format; objects built into Terragen include grass clumps, landmarks, rocks, and spheres.", "Windows, Mac, ", "['Planetside Software Terragen']['Planetside Software Terragen']"], "tgf": ["Trivial Graph Format File", "File created in the Trivial Graph Format (TGF), a plain text format used for describing simple graph structures; includes nodes and edges but does not support nested graphs or visual layout information.", "Windows, Mac, Linux, ", "['yWorks yEd Graph Editor', 'Wolfram Research Mathematica']['yWorks yEd Graph Editor', 'Wolfram Research Mathematica']['yWorks yEd Graph Editor', 'Wolfram Research Mathematica']"], "tgd": ["Terragen Project File", "Project created by Terragen, a landscape and animation generation program; contains objects, terrain, shaders, water, atmosphere, lighting, camera angles, and node network elements that make up the landscape scenes created by Terragen.", "Windows, Mac, ", "['Planetside Software Terragen']['Planetside Software Terragen']"], "tgc": ["Terragen Node Clip File", "Clip created by Terragen, a landscape and animation generation program; contains nodes, which are like pieces of your scene, saved separately from the entire scene that can be inserted easily into a project; includes functions like surface shaders and complex terrains that can be inserted into the scene.", "Windows, Mac, ", "['Planetside Software Terragen']['Planetside Software Terragen']"], "tga": ["Targa Graphic", "A TGA file is a file saved in the raster graphic format designed by Truevision.  It supports 8, 16, 24, or 32 bits per pixel at a maximum of 24 bits for RGB colors and and 8-bit alpha channel.  TGA files are often used to store texture files referenced by 3D video games.", "Windows, Mac, Linux, Android, ", "['File Viewer Plus', 'Apple QuickTime Player', 'ACD Systems Canvas X 2017', 'ACD Systems ACDSee 20', 'Adobe Photoshop CC 2017', 'Adobe Photoshop Elements 15', 'Adobe Illustrator CC 2017', 'Corel PaintShop Pro X9', 'dotPDN paint.net', 'GIMP']['Apple Preview', 'Apple QuickTime Player', 'Adobe Photoshop CC 2017', 'Adobe Photoshop Elements 15', 'Adobe Illustrator CC 2017', 'Snap Converter', 'GIMP']['GIMP']['File Viewer for Android']"], "tfrd": ["Tape Image Format Requirements Document", "Imaging data format used by the National Geospatial-Intelligence Agency (NGA) for storing geospatial data; can contain both image and text data; used for rendering geolocational data within GIS applications.", "Windows, Linux, ", "['ITT Visual Information Solutions ENVI', 'ERDAS IMAGINE'][]"], "tfr": ["TIE Fighter Pilot File", "Game file created by Star Wars: TIE Fighter, an older PC game released in 1994; used as a saved game format for storing game progress and the player's pilot information.", "Windows, ", "['LucasArts Star Wars: TIE Fighter']"], "tfw": ["World File for TIFF", "TIFF world file used by GIS applications; contains the location, scale, and rotation of a map that is stored as a TIFF image; often used for saving the world location of an aerial satellite photograph; uses the same format as JPEG World files (.JPW).", "Windows, Linux, ", "['ESRI ArcReader', 'ESRI ArcGIS for Desktop', 'Blue Marble Geographics Global Mapper', 'D&L OziExplorer']['ESRI ArcReader']"], "tfmx": ["Final Music System Tracker Module", "Sound tracker file created in the The Final Music System Extended (TFMX) format; created for emulating the Atari ST system and was first ported to Unix, then Windows and Macintosh platforms.", "Windows, Mac, Linux, ", "['Nullsoft Winamp with TFMXPlug plug-in']['CocoModX'][]"], "tg4": ["Tiled Group 4 Raster Image File", "Raster image format used by Bentley Systems software, also known as a \"Type 24\" file; saved as a 1-bit tiled image file compressed with RLE compression; supports multiple resolutions.", "Windows, ", "[]"], "tg": ["TuxGuitar Document", "Guitar tablature file created by TuxGuitar, an free, cross-platform guitar tablature editor and score viewer; contains a musical score, which may have multiple tracks; used for storing personal compositions.", "Windows, Mac, Linux, Windows, Mac, Linux, ", "['TuxGuitar']['TuxGuitar']['TuxGuitar']['Smith Micro StuffIt Deluxe for Windows', 'Corel WinZip 21', 'WinRAR 5', 'Zipeg']['Smith Micro StuffIt Deluxe 16', 'Zipeg'][]"], "tfm": ["TeX Font Metric File", "Font file created for typesetting fonts in TeX and LaTeX documents; does not contain the font glyphs (characters) themselves, but contains information about a font, such as the height and width of the glyphs; required by TeX typesetting and allows a font in a separate file to be typeset in a TeX document.", "Windows, Mac, ", "['MiKTeX', 'TeXworks']['TeXworks']"], "tfil": ["Blizzard Software Update File", "Update file used by Blizzard games such as World of Warcraft and Diablo III; contains information used for patching the game software and required for the game to patch and update properly; saved in a binary format in the root directory of the game installation.", "Windows, ", "['Blizzard World of Warcraft', 'Blizzard Diablo 3']"], "tfd": ["Tape Format Requirements Document", "Stores geolocational data in a standard format that can be read by various NITFS applications; similar to a .NITF file, but uses greater compression.", "Windows, Linux, ", "[][]"], "tfc": ["Unreal Engine 3 Texture File Cache", "3D model file used by games developed with the Unreal Engine 3 technology; contains streamed textures used for applying the surface appearance to 3D models, such as characters or other game objects.", "Windows, ", "['Epic Games Unreal Engine', 'Rocksteady Studios Batman: Arkham City']"], "tfa": ["TreeSoft CashFlow Analysis Data File", "Data file saved by treeSoft CashFlow Analysis, a property cash flow projection and valuations program; offers complete financial analysis with detailed input options; can also create quality reports that can be used for presentations.", "Windows, ", "[]"], "textfactory": ["BBEdit Text Factory", "Developer file created by BBEdit, a Mac OS X source code editor; contains rules for automatic processing of text; may contain text replacements, sorting instructions, or other manipulations; used for saving and reusing text factory settings.", "Mac, ", "['Bare Bones BBEdit', 'Bare Bones TextWrangler']"], "textexpandersettings": ["TextExpander Settings File", "A TEXTEXPANDERSETTINGS file is a settings file created by TextExpander, a program that allows users to save snippets of often used text and call them by typing shortcuts.  It contains all of a user's snippets and is used to transfer snippets from one device to another.", "Windows, Mac, iOS, ", "['Smile TextExpander']['Smile TextExpander']['Smile TextExpander 3']"], "textexpander": ["TextExpander Settings File", "A TEXTEXPANDER file is a settings file created by TextExpander, a utility that allows users to save snippets of text such as addresses and phone numbers, and call them by typing shortcuts.  It contains all of a user's snippets and can be used to manually transfer snippets from one device to another.", "Windows, Mac, ", "['Smile TextExpander']['Smile TextExpander']"], "textclipping": ["Mac OS X Text Clipping File", "Text file created in Mac OS X by dragging highlighted text to the desktop; stores the selected text as well as the formatting information, including font styles, tables, and bullets and numbering; often used for saving text fragments from Web pages and other documents.", "Mac, ", "['Apple Finder', 'Nisus Writer Pro']"], "tet": ["Textease CT Template", "Template for creating a new page (.TE file) with Textease, and educational ICT (Information and Communications Technology) program; may include page size, paper color, and text style information; allows multiple pages to be created with as similar look and feel.", "Windows, ", "['Lightbox Education Textease Studio CT']"], "text": ["Plain Text File", "Document containing unformatted ASCII text; used for documents that do not require formatting, which helps reduce the file size; for example, log files and readme files are often plain text documents; they can be opened in both basic text editors and advanced word processing programs.", "Windows, Mac, ", "['text editor']['text editor']"], "tex0": ["Wii Texture File", "Texture file used by Nintendo Wii games such as Mario Kart Wii; typically found within a resource package file (.BRRES) and contains textures that are used to display the surface appearance of 3D models.", "Windows, ", "['BrawlBox']"], "tex": ["LaTeX Source Document", "A TEX file is a source document prepared by LaTeX, a high-quality typesetting system.  It can include text, symbols, mathematical expressions, and graphics.  TEX files are commonly used in computer science, electrical engineering, statistics, economics, and physics for typesetting articles, books, and other publications.", "Windows, Mac, Linux, Windows, ", "['File Viewer Plus', 'TeXworks', 'BaKoMa TeX', 'TeXnicCenter', 'Texmaker', 'LaTeX Editor', 'proTeXt', 'gVim']['LyX/Mac', 'TeXworks', 'Texmaker', 'TeXShop', 'Skim', 'MacVim']['TeXworks', 'Texmaker']['alaplaya Avalon Heroes', 'Capcom Dead Rising 2', \"Gibbed's DeadRising2 Tools\", 'Croteam Serious Sam', 'Hover!']"], "terrn2": ["Rigs of Rods Terrain 2 File", "Terrain file used by Rigs of Rods (RoR), a soft-body physics vehicle simulator; contains information that describes the playable terrain in RoR, which includes the map name, the name of the associated file with geometry coordinates, height of the water surface, color of the ambient light, and starting position of the player, gravity power, and terrain version.", "Windows, Mac, ", "['Rigs of Rods']['Rigs of Rods']"], "testsettings": ["Visual Studio Test Settings File", "File created by Microsoft Visual Studio, a program used by software developers to create Windows applications and other software; contains configuration information for a test project, including the set of roles required for the application being tested, the role used to run the tests, and diagnostic data adapters for each role.", "Windows, ", "['Microsoft Visual Studio 2017']"], "testrunconfig": ["Visual Studio Test Run Configuration File", "Test settings file used by Microsoft Visual Studio 2008 and earlier; contains configuration information for running a suite of tests; used for defining the test parameters when running collections of test cases, such as unit tests.", "Windows, ", "['Microsoft Visual Studio 2017']"], "terrn": ["Rigs of Rods Terrain File", "Terrain file used by Rigs of Rods (RoR), a vehicle simulator based on soft-body physics; contains information that describes the terrain, which includes the terrain name, the associated .CFG file name, whether there is water, color of the sky, placement of objects or trucks, and spawning positions.", "Windows, Mac, ", "['Rigs of Rods']['Rigs of Rods']"], "terminal": ["Terminal Settings File", "Settings file created by Apple Terminal, the command-line utility included with Mac OS X (Terminal.app); saves window appearance settings such as the font, text and background colors, window size, and shell startup commands; can also be used for saving a Window Group, which is an arrangement of multiple open windows (Window → Save Windows as Group....", "Mac, ", "['Apple Terminal']"], "ter": ["Terragen Terrain File", "Terrain file created by Terragen, a natural scenery generation program; contains terrain data referenced by Terragen to determine altitude of the terrain; includes integer values along y, z, and x-axes specifying the length, height, depth, etc. in Terragen's heightfield format for easy terrain transfer.", "Windows, Mac, ", "['Planetside Software Terragen']['Planetside Software Terragen']"], "temp": ["Temporary (Temp) File", "Temporary file that may be created by various software programs; typically generated while the program is running and automatically deleted when the program is closed.", "Windows, Mac, ", "[][]"], "template": ["Apple Pages Template", "Document template created by Pages, a word processing application for Mac OS X; contains pre-defined page elements and styles used for creating a new document; enables users to author .PAGES documents with the same properties.", "Mac, ", "['Apple Pages']"], "tee": ["TeeChart Template", "A TEE file is a template created by TeeChart, a charting library used by programmers to visualize large sets of data.  It contains chart settings, which are used to reproduce a chart when imported.  TEE files include plot axis settings, background gradient color, and mouse zooming configuration.", "Windows, Mac, Linux, ", "['Steema TeeChart']['Steema TeeChart']['Steema TeeChart']"], "ted": ["Alamo Map File", "Map used by games that use the Alamo gaming engine, which was developed by Petroglyph Games; contains a single or multiplayer level and includes terrain, weather, props, faction units, starting locations, and triggers; can be used to store and edit custom game maps.", "Windows, Mac, Windows, Windows, ", "[]['LucasArts Star Wars: Empire at War'][]['TouchMagix Media TouchMagix Creative Suite']"], "tef": ["TablEdit Tablature", "Contains tablatures (tabs) and sheet music for the guitar and other fretted, stringed instruments, including mandolin and bass; also supports the harmonica, mountain dulcimer, diatonic accordion, drums, violin, tin whistle, recorder, Xaphoon, autoharp, pedal steel guitar, and banjo.", "Windows, Mac, Linux, ", "['TablEdit', 'TEFview', 'TuxGuitar']['TablEdit', 'TEFview', 'TuxGuitar']['TuxGuitar']"], "tec": ["TECkit Compiled Mapping File", "File created by TECkit (Text Encoding Conversion toolkit), a program used for conducting text conversions; saves the compiled version of a text mapping that was specified in a plain text .MAP file; sometimes used in conjunction with LaTeX technologies to convert characters on the fly when generating LaTeX documents in different languages.", "Windows, Mac, Linux, ", "['TECkit', 'pyTecKit']['TECkit', 'pyTecKit']['TECkit', 'pyTecKit']"], "teacher": ["SMART Response Teacher Database File", "File created by SMART Response software, which is used in educational settings to help teachers and students manage classroom information; contains class lists, student profiles, and assessment results; used to generate student reports as well as transfer classroom data between school computers.", "Windows, Mac, ", "['SMART Technologies Response']['SMART Technologies Response']"], "te3": ["WinTrack Object File", "Extra object that can be added to a railroad design created with WinTrack; may be a building, automobile, tree, or other 3D object; saved in a non-binary, text-based format that can be viewed with a text editor.", "Windows, ", "[]"], "te": ["Textease CT Database File", "Database created with Textease, an ICT (Information and Communications Technology) program designed for educational purposes; may include multiple fields that contain forms, text, images, and other data.", "Windows, ", "['Lightbox Education Textease Studio CT']"], "tdz": ["Drobo Firmware File", "Firmware file used by Drobo external storage and backup devices; most often used for updating the low-level functionality of the device with patches and other updates; can be applied to a Drobo device on Windows or Mac OS X using the Drobo Dashboard, which is also called \"DroboPro.\"", "Windows, Mac, ", "['Drobo Dashboard']['Drobo Dashboard']"], "tdms": ["Technical Data Management Streaming File", "A TDMS file is a data file saved in the National Instruments (NI) Technical Data Management Streaming (TDMS) format.  It contains simulation or measurement data recorded by National Instruments software, such as LabVIEW and DIAdem.  TDMS files also store descriptive information, which includes the procedure, test fixture, sensor information, and author.", "Windows, Mac, Linux, ", "['National Instruments LabVIEW', 'National Instruments DIAdem', 'The MathWorks MATLAB', 'Apache OpenOffice']['National Instruments LabVIEW', 'The MathWorks MATLAB', 'Apache OpenOffice']['National Instruments LabVIEW', 'The MathWorks MATLAB', 'Apache OpenOffice']"], "tdx": ["D-TEG CCTV Video Information File", "Video information file created by D-TEG CCTV (closed-circuit television) DVRs (digital video recorders); saved with other information files as well as the video recording file itself; must be present with the original video file for video playback.", "Windows, ", "[]"], "tdt": ["FirstBreak Concrete Test File", "File used by FirstBreak, a program that tests the strengths of concrete mixes; contains the test results of concrete batches, including the batch reference, date, test specimen strengths, slump, air content, and temperature.", "Windows, Windows, Mac, Linux, Windows, Mac, Windows, ", "[]['Maxis Sim Tower: The Vertical Empire']['Maxis Sim Tower: The Vertical Empire']['Maxis Sim Tower: The Vertical Empire'][][][]"], "tds": ["Turbo Debugger Symbols File", "Contains a table of symbols used by the Borland Turbo Debugger program; created by the Borland linker and includes data referenced during the software debugging process.", "Windows, ", "['Embarcadero C++Builder']"], "tdm": ["LabVIEW Binary Measurement File", "Measurement file used by LabVIEW, a program used to interact with hardware instruments; contains binary data either saved using the \"Write To Measurement File\" operation, or read using the \"Read From Measurement File\" function.", "Windows, Mac, Linux, ", "['National Instruments LabVIEW']['National Instruments LabVIEW']['National Instruments LabVIEW']"], "tdl": ["MathType Translator Definition Language", "Translates characters in certain fonts to mathematical symbols", "Windows, Mac, Windows, Windows, Mac, ", "['Design Science MathType']['Design Science MathType']['AbstractSpoon ToDoList']['Microsoft Excel 2016', 'IBM Collaboration Solutions']['Apple Numbers 4', 'Microsoft Excel 2016']"], "tddd": ["3D Data Description File", "Three-dimensional image data file created by Imagine, a an older 3D modeling and raytracing program; stores 3D objects and optionally observer data; can be used for for rendering 3D images from various observer perspectives.", "Windows, ", "[]"], "tdf": ["Title Definition Format File", "Contains setup instructions for backing up DVD movies; used by DVD X software such as DVD-X Copy, DVD X Platinum, and DVD X Copy Express; may be used to modify and fix DVD authoring problems and incorrect titleset selections made by the DVD X software.", "Windows, Windows, Mac, ", "[][][]"], "td6": ["RollerCoaster Tycoon Track Design File", "Game file used by RollerCoaster Tycoon 2, an amusement park management game; contains a track design and is used for building roller coasters in the game's theme parks; includes information such as the track parts, number of cars per train, and colors.", "Windows, ", "['Chris Sawyer RollerCoaster Tycoon 2']"], "tdb": ["Android Thumbnail Cache", "Cache file generated on SD cards used in Android phones and tablets; contains small versions or \"thumbnails\" of images saved on the card; provides a more efficient way to browse through the images on the card since the device does not have to load each full size image.", "Windows, Android, Windows, Windows, ", "[]['Google Android'][]['neurohack Transcendence']"], "tde": ["Tableau Data Extract File", "Data file used by Tablaeu Desktop, a whiteboard visualization and analysis application; contains data extracted from an external data source, such as a Microsoft Excel workbook, Microsoft Access database, or a .CSV file; can also be extracted from a remotely connected data source.", "Windows, Mac, ", "['Tableau Desktop']['Tableau Desktop']"], "tda3mt": ["DivX Author Template File", "Template for creating a new DVD-like DivX movie with DivX Author; includes a background image, pre-formatted text, full-motion menus, and other animations; can be customized by adding other media and saved as a .DIVX video file.", "Windows, ", "[]"], "tda": ["Palm To-Do File", "To-do list created with a Palm PDA; stored in a database format that contains several different fields for each entry; used for creating a list of tasks or \"to-do\" items; can be opened using Palm Desktop software.", "Windows, Mac, Windows, Mac, Linux, ", "['Palm Desktop']['Palm Desktop']['text editor']['text editor']['text editor']"], "td4": ["RollerCoaster Tycoon Track File", "Game file used by RollerCoaster Tycoon, an amusement park management game; saves the design for a roller coaster track and includes the ride type, vehicle type, number of cars per train, and other information; used for constructing roller coasters in the theme park.", "Windows, ", "['Chris Sawyer RollerCoaster Tycoon']"], "td0": ["Teledisk Archive", "Disk archive created by the Teledisk archival tool; originally used for backing up files onto 3.5 inch floppy disks; first developed by Sydex, then by New Technologies, and later discontinued.", "Windows, Windows, ", "[][]"], "tcw": ["TurboCAD Drawing File", "Proprietary 2D/3D vector graphics format used by TurboCAD, a professional 2D and 3D design program; may contain a 2D layout, a single 3D model, or an entire 3D scene.", "Windows, ", "['IMSI TurboCAD Pro 2017']"], "td": ["Thunder Incomplete Download File", "Partially downloaded file created by Thunder, an Internet download manager localized in Chinese; appends the \".td\" file extension to a file being downloaded until the download is complete, at which point the \".td\" extension is removed.", "Windows, Mac, ", "['Thunder']['Thunder']"], "tcz": ["Tiny Core File", "File created solely by Tiny Core, a Linux operating system; loaded by scripts during the Tiny Core start-up; contains packages of information needed to run the core.", "Linux, ", "['Tiny Core Linux']"], "tcx": ["Training Center Database File", "XML file used to transport fitness data between Garmin products; supported by various Garmin GPS devices; may include data such as type of sport, lap time, distance, calories, intensity, and other information.", "Windows, Mac, Web, Windows, Mac, ", "['Garmin Training Center']['Garmin Training Center']['Garmin Connect']['IMSI TurboCAD Pro 2017']['IMSI TurboCAD Deluxe v10']"], "tcp": ["Tally Compiled Program File", "Program compiled with Tally.Developer, a Tally Definition Language (TDL) programming environment; contains a program that can be run within Tally.ERP; also contains product information included by the developers.", "Windows, Mac, ", "[]['IMSI TurboCAD Deluxe v10']"], "tct": ["TurboCAD Drawing Template", "Drawing template for creating a 2D layout or 3D model with TurboCAD; may contain a single object or a complex design (such as an entire house), that can be modified by the user; provides a useful starting point when creating a new design rather than starting from scratch.", "Windows, Mac, ", "['IMSI TurboCAD Pro 2017']['IMSI TurboCAD Deluxe v10']"], "tcr": ["Psion Series 3 eBook File", "eBook created in the TCR format, which was originally used by the older Psion Series 3 palmtop devices developed in the 1990s; stores the eBook text and formatting in a proprietary format used internally by the Psion device.", "Windows, Mac, Linux, Windows, ", "['Calibre']['Calibre']['Calibre']['TouchMagix Media TouchMagix Creative Suite']"], "tcnet": ["TestComplete Configuration Reference File", "Configuration reference file created by TestComplete, an application that enables users to test applications; contains references to configuration files for a project or project suite that is being used in shared mode.", "Windows, ", "['SmartBear TestComplete']"], "tcls": ["TestComplete Configuration File", "Configuration file created by TestComplete, an application that enables users to test applications; contains settings for individual testers of a project or project suite; includes local information such as what paths to tested applications or values of project variables.", "Windows, ", "['SmartBear TestComplete']"], "tcn": ["Techne Model File", "Model created by Techne and Techne Online, a Windows and web program used to design models used in Minecraft; contains data that describes the model, which includes dimensions, position, and texture; can be edited in Techne.", "Windows, Web, ", "['ZeuX Techne']['ZeuX Techne Online']"], "tcm": ["TurboCAD Mac Drawing", "2D or 3D design draft created by Mac editions of the TurboCAD computer-aided design (CAD) software; stores a drawing, including the geometry and display properties; can be rotated and viewed with lighting effects and different camera angles using the software.", "Mac, ", "['IMSI TurboCAD Deluxe v10']"], "tclogs": ["TestComplete Log Configuration File", "Log configuration file created by TestComplete, an application that enables users to test applications; contains the paths and names of log files that hold testing results for projects or project suites; includes information that describes the duration of the script and who (username) ran it.", "Windows, ", "['SmartBear TestComplete']"], "tcl": ["Tcl Script", "Script written in the Tool Command Language (pronounced \"tickle\"), a simple textual language used for sending commands to text editors, debuggers, and shells.", "Windows, Mac, Linux, ", "['File Viewer Plus', 'PSPad']['MacroMates TextMate', 'Bare Bones BBEdit'][]"], "tccfgextender": ["TestComplete Project Suite Settings File", "Settings file created by TestComplete, a platform used for testing desktop, mobile, and web applications; contains settings for specific testing of a project suite.", "Windows, ", "['SmartBear TestComplete']"], "tcc": ["TimeCalc Classic Data File", "File created by TimeCalc, a time card tracking program; stores an employee time sheet, including task start and stop times, employee ID, and pay period information; used for totaling hours and disbursing payroll in small business environments.", "Windows, Windows, ", "[]['Embarcadero C++Builder', 'Borland C++Builder']"], "tc3": ["TurboCAD 2D/3D Mac Drawing", "Drawing created by the Mac version of TurboCAD, a CAD application used for drafting architectural and manufacturing designs; stores a 2D or 3D drawing, including drawn objects, measurements, and display properties; often used for storing mechanical and manufacturing component designs.", "Mac, ", "['IMSI TurboCAD Deluxe v10']"], "tbz": ["Bzip Compressed Tar Archive", "Unix .TAR archive compressed with .BZIP compression; contains a group of files that are first archived with the Unix Tar program, then compressed with Bzip.", "Windows, Mac, Linux, ", "['File Viewer Plus', 'Smith Micro StuffIt Deluxe for Windows', 'Corel WinZip 21']['Smith Micro StuffIt Deluxe 16', 'Apple Archive Utility', 'Incredible Bee Archiver']['7-zip']"], "tc2": ["TurboCAD 2D Mac Drawing", "Two-dimensional drawing created by the Mac version of TurboCAD, a CAD program used for drafting mechanical and architectural designs; stores drawn shapes, styles, text, and other graphics; commonly used for drafting building floor plans.", "Mac, ", "['IMSI TurboCAD Deluxe v10']"], "tc": ["TrueCrypt Volume", "Virtual encrypted disk created by TrueCrypt, an open-source disk encryption program that creates real-time (on-the-fly) encrypted volumes.", "Windows, Linux, ", "['TrueCrypt']['Tellico']"], "tbz2": ["Tar BZip 2 Compressed File", "File archive compressed with both .TAR and .BZ2 compression; often found on Unix systems; must first be decompressed (using Bzip 2 decompression), then the files must be extracted from the tar archive.", "Windows, Mac, Linux, ", "['File Viewer Plus', 'Smith Micro StuffIt Deluxe for Windows', 'Corel WinZip 21', 'WinRAR 5', 'PeaZip']['Smith Micro StuffIt Deluxe 16', 'Apple Archive Utility', 'RARLAB RAR for Mac OS X']['RARLAB RAR for Linux']"], "tbs": ["TuneUp Utilities Boot Screen", "Image used for customizing the Windows boot screen with TuneUp Utilities; compressed using .ZIP compression to save disk space; may be modified using the TuneUp Styler (previously WinStyler) program included with TuneUp Utilities.", "Windows, ", "['AVG PC TuneUp Unlimited']"], "tbp": ["Tekla BIMsight Project", "CAD project file created by Tekla BIMsight, a construction project management application; saves imported CAD files (e.g., .DWG files), annotations, and viewing angles; used for saving building project models in collaborative work environments.", "Windows, Windows, ", "['Tekla BIMsight']['Autodesk Topobase']"], "tbn": ["Kodi Thumbnail Image", "Image file used by Kodi, a software media player for Mac, Windows, and Linux; saves a thumbnail image of a video clip, audio clip, or a playlist; used as the preview image when browsing the computer's digital media collection.", "Windows, Mac, Linux, iOS, Android, ", "['Kodi', 'image viewer']['Kodi', 'image viewer']['Kodi', 'image viewer']['Kodi']['Kodi']"], "tbm": ["Toribash Mod File", "Modification or \"mod\" file used for adding weapons, armor, or other extras to a Toribash character; may also contain buildings, vehicles, and other custom objects.", "Windows, Mac, Linux, ", "['Nabi Studios Toribash']['Nabi Studios Toribash']['Nabi Studios Toribash']"], "tbl": ["StarCraft Information Table", "Table file used by StarCraft, a real-time strategy game where players control units as Terran, Zerg, or Protoss races; contains text descriptions for in-game labels, such as names of units; used as a lookup table to display text during gameplay.", "Windows, Mac, ", "['Blizzard StarCraft']['Blizzard StarCraft']"], "tbk": ["FoxPro Memo Backup", "Backup of a FoxPro table memo; corresponding table backup file uses a .BAK extension", "Windows, Windows, Mac, Linux, ", "['Microsoft Visual FoxPro']['SumTotal Systems ToolBook', 'Microsoft Internet Explorer with SumTotal Neuron plug-in', 'Mozilla Firefox with SumTotal Neuron plug-in']['Mozilla Firefox with SumTotal Neuron plug-in']['Mozilla Firefox with SumTotal Neuron plug-in']"], "tbd": ["Visual Studio Toolbox Data File", "File created by Microsoft Visual Studio, a Windows software development application; cache referenced by Visual Studio's tool function to optimize the load time; contains metadata for the current visual appearance and the original visual appearance, for when you select Reset Toolbox; not meant to be manually opened.", "Windows, ", "['Microsoft Visual Studio 2017']"], "tb0": ["Adobe Photoshop Thumbnail Cache File", "Cache file created by older versions of Adobe Photoshop image-editing software; contains a thumbnail image of a file that was browsed with the File Browser tool; used for creating smaller image previews that can quickly be scanned.", "Windows, Mac, ", "['Adobe Photoshop CC 2017']['Adobe Photoshop CC 2017']"], "tb": ["Tabbery Tab File", "Configuration file that contains instructions used by Tabbery to launch a virtual tab on the user's desktop; includes the name of each window, as well as each window's screen coordinates, size, and order; also includes bitmap thumbnails for previewing the file contents.", "Windows, ", "[]"], "taz": ["Tar Zipped File", "Unix TAR archive compressed using a standard Unix compression algorithm; short for \".tar.z,\" which is a combination of a .TAR and .Z file; typically used for archiving groups of files on Unix-based systems.", "Windows, Mac, Linux, ", "['File Viewer Plus', 'Smith Micro StuffIt Deluxe for Windows', 'Corel WinZip 21']['Smith Micro StuffIt Deluxe 16', 'The Unarchiver'][]"], "tax2014": ["TurboTax 2014 Tax Return", "U.S. tax return created with the 2014 version of Intuit TurboTax; contains tax data for the 2014 tax year; may include both federal IRS tax forms and state forms for a specific state; most often created during 2015 since annual tax returns are filed for the previous year.", "Windows, Mac, Web, ", "['Intuit TurboTax Deluxe']['Intuit TurboTax Deluxe']['Intuit TurboTax Online']"], "tax2016": ["TurboTax 2016 Tax Return", "A TAX2016 file is a United States tax return created with the 2016 version of Intuit TurboTax.  It contains a user's personal information and federal IRS tax forms.  It may also include one or more state forms for the 2016 tax year.  TAX2016 files may be encrypted if saved with password protection since they store sensitive personal and financial data. ", "Windows, Mac, Web, ", "['Intuit TurboTax Deluxe']['Intuit TurboTax Deluxe']['Intuit TurboTax Online']"], "tax2011": ["TurboTax 2011 Tax Return", "Tax return created with TurboTax 2011, a U.S. tax preparation program for the 2011 tax year; contains user data and tax forms filled out using TurboTax 2011; may be filed electronically via e-file or printed and mailed when completed.", "Windows, Mac, ", "['Intuit TurboTax Deluxe']['Intuit TurboTax Deluxe']"], "tax2013": ["TurboTax 2013 Tax Return", "Tax return saved with TurboTax 2013, a U.S. tax preparation program; contains federal tax forms for the 2013 tax year along with data entered by the user; may also include state tax forms if a specific state version has been downloaded within TurboTax.", "Windows, Mac, Web, ", "['Intuit TurboTax Deluxe']['Intuit TurboTax Deluxe']['Intuit TurboTax Online']"], "tax2015": ["TurboTax 2015 Tax Return", "A TAX2015 file is a United States tax return created with the 2015 version of Intuit TurboTax.  It contains federal IRS tax forms and may also include state forms for one or more states.  The forms include personal and financial data entered for the 2015 tax year and may be encrypted if the file was saved with password protection.", "Windows, Mac, Web, ", "['Intuit TurboTax Deluxe']['Intuit TurboTax Deluxe']['Intuit TurboTax Online']"], "tax2012": ["TurboTax 2012 Tax Return", "Tax return created with TurboTax 2012, a United States tax preparation program; contains federal and often state tax forms, along with user data entered through TurboTax; stores your progress when completing a tax return and allows you to pause and resume your tax return at a later time.", "Windows, Mac, Web, ", "['Intuit TurboTax Deluxe']['Intuit TurboTax Deluxe']['Intuit TurboTax Online']"], "tcd": ["TurboCAD Mac Deluxe Drawing", "2D or 3D Drawing created by the Mac Deluxe version of TurboCAD, a CAD application that allows users to draft architectural and manufacturing designs; contains a drawing, which includes objects, text, lighting properties, and measurements.", "Mac, Windows, ", "['IMSI TurboCAD Deluxe v10'][]"], "tax2010": ["TurboTax 2010 Tax Return", "Electronic tax return document created by TurboTax 2010, a United States tax preparation and filing application; contains 2010 tax forms and data entered by the user; can be validated and e-filed using the software once the tax data is complete.", "Windows, Mac, ", "['Intuit TurboTax Deluxe']['Intuit TurboTax Deluxe']"], "tax16": ["TurboTax 2016 Tax Return File", "A TAX16 file is a tax return created by Intuit TurboTax 2016.  It contains federal and state tax forms and personal information entered by the user.  TAX16 files are an alternative to the more popular .TAX2016 files that are saved by default by TurboTax 2016.", "Windows, Mac, Web, ", "['Intuit TurboTax Deluxe']['Intuit TurboTax Deluxe']['Intuit TurboTax Online']"], "tax2008": ["TurboTax 2008 Tax Return", "Tax return created with TurboTax 2008, a program for preparing Federal and State taxes for the 2008 tax year; includes user data entered through the \"Easy-Step\" interface as well as official tax forms, which are automatically filled in by the program.", "Windows, Mac, ", "['Intuit TurboTax Deluxe', 'H&R Block Tax Software']['Intuit TurboTax Deluxe', 'H&R Block Tax Software']"], "tax2009": ["TurboTax 2009 Tax Return", "Tax return created with TurboTax 2009, a United States tax preparation and filing tool; contains 2009 tax forms and data entered by the user; typically edited using the TurboTax's \"Interview\" mode, but may also be edited by manually entering data into tax forms.", "Windows, Mac, ", "['Intuit TurboTax Deluxe']['Intuit TurboTax Deluxe']"], "tax15": ["TurboTax 2015 Tax Return File", "A TAX15 file is a tax return created by the 2015 version of Intuit TurboTax.  It contains personal information entered by the user and includes federal and state tax forms.", "Windows, Mac, ", "['Intuit TurboTax Deluxe']['Intuit TurboTax Deluxe']"], "tax13": ["TurboTax 2013 Tax Return File", "Alternate file extension used by TurboTax for 2013 tax returns; contains federal and state tax forms as well as data entered by the user; can be electronically submitted to the IRS and state tax authorities when completed.", "Windows, Mac, Web, ", "['Intuit TurboTax Deluxe']['Intuit TurboTax Deluxe']['Intuit TurboTax Online']"], "tax11": ["TurboTax 2011 Tax Return File", "Tax return created with TurboTax 2011, a U.S. tax preparation program; contains federal tax forms for the 2011 tax year; may also include state tax forms if a state version has been downloaded; can be saved in an encrypted, password-protected format that requires a password to open.", "Windows, Mac, ", "['Intuit TurboTax Deluxe']['Intuit TurboTax Deluxe']"], "tax12": ["TurboTax 2012 Tax Return File", "Tax return created with TurboTax 2012 tax preparation software; contains United States tax forms for the 2012 tax year along with data entered by the user; may be encrypted, which requires a password to open.", "Windows, Mac, Web, ", "['Intuit TurboTax Deluxe']['Intuit TurboTax Deluxe']['Intuit TurboTax Online']"], "tax10": ["TurboTax 2010 Tax Return File", "Tax return file created with TurboTax 2010 tax preparation software; contains U.S. federal tax forms for the 2010 tax year and data entered by the user; may also include state tax forms and related data if a state version has been downloaded.", "Windows, Mac, ", "['Intuit TurboTax Deluxe']['Intuit TurboTax Deluxe']"], "tax09": ["TurboTax 2009 Tax Return File", "Tax return created by TurboTax 2009, a U.S. tax preparation and filing tool; contains 2009 tax forms and tax data entered by the user; used for filing taxes during the 2010 calendar year for the 2009 tax year.", "Windows, Mac, ", "['Intuit TurboTax Deluxe']['Intuit TurboTax Deluxe']"], "tax08": ["TurboTax 2008 Tax Return File", "Tax return created by TurboTax 2008, a tool used to prepare and file taxes for the 2008 tax year; stores 2008 tax forms and tax data entered by the user; used for filing taxes during the 2009 calendar year for the 2008 tax year.", "Windows, Mac, ", "['Intuit TurboTax Deluxe']['Intuit TurboTax Deluxe']"], "tax": ["TurboTax Tax Return", "Tax return file created by TurboTax, a U.S. federal and state tax preparation program; saves data for filling the electronic forms required to file individual or small business taxes.", "Windows, Mac, ", "['Intuit TurboTax Deluxe']['Intuit TurboTax Deluxe']"], "targets": ["MSBuild Targets File", "Development file included with MSBuild, the project build platform for Microsoft Visual Studio; contains items, properties, tasks, and targets for common programming scenarios; may be referenced and imported by Visual Studio projects.", "Windows, ", "['Microsoft Visual Studio 2017']"], "tardist": ["TAR Distribution Archive", "Archive created for distributing and installing software on Unix-based IRIX systems sold by SGI; often referenced on a webpage and used for installing the software when the link to the file is clicked; similar to the .TAR format and can be opened by some TAR utilities.", "Linux, ", "['GNU Tar']"], "targa": ["Targa Graphic", "A TARGA file is a raster graphic file format designed by Truevision.  The format supports 8, 16, 24, or 32 bits per pixel at a maximum of 24 bits for RGB colors as well as an 8-bit alpha channel.  The file is often used in video games to store textures.", "Windows, Mac, Linux, ", "['File Viewer Plus', 'ACD Systems Canvas X 2017', 'ACD Systems ACDSee 20', 'Adobe Photoshop CC 2017', 'Adobe Photoshop Elements 15', 'Adobe Illustrator CC 2017', 'Corel PaintShop Pro X9', 'dotPDN paint.net', 'GIMP']['Apple Preview', 'Apple QuickTime Player', 'Adobe Photoshop CC 2017', 'Adobe Photoshop Elements 15', 'Adobe Illustrator CC 2017', 'Snap Converter', 'GIMP']['GIMP']"], "tap": ["Commodore 64 Cassette Tape Image", "Disk image created from a data storage tape formatted for the Commodore 64 (C64) or ZX Spectrum systems; contains an exact copy of the data from the tape in a single file; typically used for games or other types of applications.", "Windows, Mac, Linux, Windows, Mac, ", "['Fuse']['Fuse', 'VICE']['Fuse'][][]"], "tar": ["Consolidated Unix File Archive", "Tar archive created by tar, a Unix-based utility used to package files together; contains multiple files stored in an uncompressed format; commonly compressed into a .GZ file using GNU Zip compression.", "Windows, Mac, Linux, Android, ", "['File Viewer Plus', 'Smith Micro StuffIt Deluxe for Windows', 'Corel WinZip 21', 'WinRAR 5', 'PeaZip', 'Acubix PicoZip', 'E-merge WinAce', 'ESTSoft AlZip', '7-Zip', 'Zipeg']['Apple Archive Utility', 'Smith Micro StuffIt Deluxe 16', 'Incredible Bee Archiver', 'The Unarchiver', 'GNU Tar', 'Zipeg']['GNU Tar']['File Viewer for Android', 'RARLAB RAR']"], "tak": ["Tom's Lossless Audio Kompressor File", "Audio file created in the Tom's lossless Audio Kompressor (TAK) format; uses an adaptive linear forward prediction technique to reduce the size of an audio file without losing audio quality; also supports non-audio data such as CD cover images or cue sheets.", "Windows, Mac, Linux, Windows, Windows, ", "['Nullsoft Winamp with TAK plug-in', 'Foobar2000 with TAK Decoder plug-in', 'Tak', 'AIMP', 'VideoLAN VLC media player']['VideoLAN VLC media player']['VideoLAN VLC media player']['K&K Associates TAK 2000', 'Microsoft Notepad', 'text editor']['MAGIX Music Maker 2016']"], "tao": ["Track at Once CD/DVD Image", "Copy of a disc created with CD/DVD Duplicator software; used by CD and DVD duplicator systems that can duplicate several discs at a time", "Windows, ", "['Smart Projects IsoBuster', 'EZB Systems UltraISO']"], "tag": ["DataFlex Data File", "A TAG file is a data file used by DataFlex and SQL Connectivity Kit.  It contains a line delimited list of the names of fields defined in the table of a .DAT DataFlex data file.", "Windows, ", "['Data Access DataFlex', 'SQL Connectivity Kit']"], "taf": ["ADRIFT Text Adventure File", "Game file created by ADRIFT Generator, a program used to build text-based adventure games; contains all game assets, including the display text, commands, and music; stores the rooms, characters, objects, tasks, and events for the game.", "Windows, ", "['ADRIFT Runner', 'ADRIFT Generator']"], "tac": ["ActiCalc Data File", "File created by ActiCalc, an advanced desktop calculator for Windows 98, 2000, and XP; saves a visual tape that stores a history of calculations; allows the history to be updated and imported into Microsoft Excel spreadsheets.", "Windows, ", "['ActiCalc']"], "tablecontent": ["SMART Table Activity Pack File", "Activity pack file created and used by SMART Table Toolkit, an application used to customize activities for the SMART Table collaborative learning center; stores one or more applications and activities; may include saved customizations to activities.", "Windows, Mac, ", "['SMART Table Toolkit']['SMART Table Toolkit']"], "t2": ["Textease 2000 File", "Database created with Textease 2000, an older version of the Textease ICT (Information and Communications Technology) program; may contain custom pages, forms, text, and image data.", "Windows, ", "[]"], "t16": ["H&R Block 2016 Tax Return", "A T16 file is a tax return created by the 2016 version of H&R Block Tax Software.  It contains U.S. federal tax forms, any necessary state tax forms for 2016, and personal tax information entered by the user.", "Windows, Mac, ", "['H&R Block Tax Software 2016']['H&R Block Tax Software 2016']"], "t15": ["H&R Block 2015 Tax Return", "Tax return created and used by the 2015 version of H&R Block Tax Software and H&R Block Online; contains U.S. federal tax forms, any necessary state tax forms for 2015, and personal tax information entered by the user. ", "Windows, Mac, Web, ", "['H&R Block Tax Software 2016']['H&R Block Tax Software 2016']['H&R Block Online 2016']"], "t14": ["H&R Block 2014 Tax Return", "Tax return created and used by H&R Block 2014 tax software or exported from H&R Block online; contains U.S. federal tax forms, along with any necessary state tax forms for 2014; stores personal data and tax information entered by the user that can be worked on at a different time.", "Windows, Mac, Web, ", "['H&R Block Tax Software 2016']['H&R Block Tax Software 2016']['H&R Block Online 2016']"], "t13": ["H&R Block 2013 Tax Return", "Tax return created with H&R Block 2013 tax software or exported from H&R Block online; contains U.S. federal tax forms for 2013; may also include state tax forms for a specific state; stores personal data and tax information entered by the user.", "Windows, Mac, Web, ", "['H&R Block Tax Software 2016']['H&R Block Tax Software 2016']['H&R Block Online 2016']"], "t12": ["At Home 2012 Tax Return", "Tax return created with the 2012 version of H&R Block At Home tax preparation software; includes United States federal tax forms for the 2012 tax year; may also contain state tax forms if a state return has been selected; stores data entered by the user so the tax return can be saved and continued at a later time.", "Windows, Mac, ", "['H&R Block Tax Software']['H&R Block Tax Software']"], "t11": ["At Home 2011 Tax Return", "Tax return created with H&R Block At Home 2011, a tax preparation program designed for home use; contains U.S tax forms and tax data for the 2011 tax year; may also include data for an individual state return; can be printed and mailed or filed electronically when completed.", "Windows, Mac, ", "['H&R Block Tax Software']['H&R Block Tax Software']"], "t10": ["At Home 2010 Tax Return", "Tax return created with H&R Block At Home 2010 tax software; contains a U.S. federal tax return for the 2010 tax year; may also include an individual state return if the user downloaded an At Home state edition.", "Windows, Mac, ", "['H&R Block Tax Software']['H&R Block Tax Software']"], "t09": ["At Home 2009 Tax Return", "Tax return created using At Home 2009, an H&R Block program used to create U.S. state and federal tax returns for the 2009 tax year; includes tax forms and filled in fields by the user; may be e-filed and printed using At Home 2009.", "Windows, Mac, ", "['H&R Block Tax Software']['H&R Block Tax Software']"], "t08": ["TaxCut 2008 Tax Return", "Tax return file created by TaxCut 2008, a program that allows users to create U.S. federal and state tax returns for the 2008 tax year; contains tax forms and their fields that have been filled in by the user; can be printed or e-filed using TaxCut 2008.", "Windows, Mac, ", "['H&R Block Tax Software']['H&R Block Tax Software']"], "t07": ["TaxCut 2007 Tax Return", "United States tax return for the 2007 tax year; created with the TaxCut 2007 software program; includes tax forms with fields that are filled in by the user.", "Windows, Mac, ", "[][]"], "t06": ["TaxCut 2006 Tax Return", "Tax return for the 2006 tax year; created using TaxCut 2006, a U.S. tax preparation program; includes tax forms in which fields and numeric values are filled in by the user.", "Windows, Mac, ", "[][]"], "t05": ["TaxCut 2005 Tax Return", "U.S. tax return for the 2005 tax year; created with TaxCut 2005 a tax preparation program; includes tax forms with fields that contain values filled in by the user.", "Windows, Mac, ", "[][]"], "t04": ["TaxCut 2004 File", "Tax return created by TaxCut 2004 tax preparation software.", "Windows, Mac, ", "[][]"], "t03": ["TaxCut 2003 File", "Tax return created by TaxCut 2003 tax preparation software.", "Windows, Mac, ", "[][]"], "t02": ["TaxCut 2002 File", "Tax return created by TaxCut 2002 tax preparation software.", "Windows, Mac, ", "[][]"], "t01": ["TaxCut 2001 File", "Tax return created by TaxCut 2001 tax preparation software.", "Windows, Mac, ", "['H&R Block TaxCut 2001']['H&R Block TaxCut 2001']"], "t$m": ["AVG Internet Security Temporary File", "Temporary file generated during a security scan performed with AVG anti-virus software; created when the program scan detects a locked or corrupted file and saves a copy of it in the \\Windows\\Temp\\ directory.", "Windows, ", "['AVG Internet Security Unlimited']"]}