{"u": ["Unreal Tournament Class Package", "Contains settings used by Unreal Tournament; stored within the Unreal System directory, i.e. \"\\Unreal\\System\\Engine.u;\" may be replaced with custom class packages.", "Windows, Mac, Windows, Mac, Windows, Mac, Linux, ", "['Epic Games Unreal Tournament', 'Epic Games UnrealEd', 'Dragon UnPACKer', 'Unreal Tournament Package Tool']['Epic Games Unreal Tournament']['Apple QuickTime Player', 'Microsoft Windows Media Player', 'RealNetworks RealPlayer Cloud']['Apple QuickTime Player', 'RealNetworks RealPlayer Cloud']['Microsoft Windows Media Player with YUV Genius package', 'Apple QuickTime Player with QuickTime YUV codec']['Apple QuickTime Player with QuickTime YUV codec'][]"], "udc": ["Adobe InDesign User Dictionary", "File used by InDesign, a desktop publishing and page design application; contains a word list used by the software's spell checker; can store exceptions and user-defined words, as well as words from a dictionary.", "Windows, Mac, ", "['Adobe InDesign CC 2017']['Adobe InDesign CC 2017']"], "udb": ["Dynamics AX User Database File", "Database file used by Microsoft AX business management software; contains a list of users, the Component Object Model (COM), and the Application Object Server (AOS); also includes database connections and the types of connections.", "Windows, ", "['Microsoft Dynamics AX']"], "udl": ["Microsoft Universal Data Link File", "Universal Data Link (UDL) file used by Windows applications for specifying connection information to a data provider; defines the data provider type, the connection string, user name and password, and other properties, such as connection timeouts; can also be used for testing a connection to a data source.", "Windows, ", "['Microsoft Data Link Properties', 'Microsoft Visual Studio 2017']"], "udcx": ["Universal Data Connection File", "Data source connection file originally used by Microsoft FrontPage, but now adapted for various Microsoft programs, including Excel and InfoPath; contains properties to connect to one or more data sources; includes a connection string and authentication information.", "Windows, Mac, ", "['Microsoft Excel 2016', 'Microsoft InfoPath']['Microsoft Excel 2016']"], "uds": ["NetBackup UNIX Domain Socket File", "Socket file created by NetBackup, an application used to create backups using networked drives; created when NetBackup launches and used for TCP/IP communication; may be reported to error log files if a remote device is not accessible due to firewall or other network limitations.", "Windows, Linux, Windows, Windows, ", "['Veritas NetBackup']['Veritas NetBackup'][][]"], "uea": ["Protector Suite QL Encrypted Archive", "Archive created by Protector Suite QL (PSQL), a program that secures personal files using fingerprint technology; stores user files and encrypts them with the user's fingerprint, which is collected from a sensor device attached to the computer.", "Windows, ", "['AuthenTec Protector Suite QL']"], "ud": ["OmniPage User Dictionary", "User dictionary created for OmniPage, an optical character recognition (OCR) program; contains custom words, such as proper nouns, technical terms, and abbreviations that have been added by the user; supplements the program's built-in dictionary, which assists in the text recognition process.", "Windows, Mac, ", "['Nuance OmniPage Ultimate']['Nuance OmniPage Pro X']"], "udf": ["Universal Disk Format File", "File created in the Universal Disk Format (UDF), a disc imaging format used for storing files on optical media; stores a collection of files using the directory structure specified in the UDF standard; can be used for burning DVDs, CDs, and other optical media; allows files to be deleted and modified on the target disc even after they have been written.", "Windows, Mac, Windows, Mac, ", "['Nero 2017', 'MagicISO', '7-Zip']['Roxio Toast 15', 'Roxio Popcorn']['Microsoft Excel 2016']['Microsoft Excel 2016']"], "udk": ["Unreal Engine Map File", "Game map design created by the Unreal Engine Development Kit (UDK), a popular free game engine developed by Epic Games; saves the layout, 3D objects, and textures used for a game map; used for creating the 3D worlds that games are played in.", "Windows, ", "['Epic Games Unreal Development Kit']"], "udeb": ["Debian Package File", "Package format used by Debian, an open source computer operating system based on the Linux kernel; contains a minimal amount of essential software files; commonly used in bootstrapping Debian; saved in the same format as .DEB files, but cannot be installed on a traditional Debian system.", "Linux, ", "['Synaptic Package Manager']"], "uct": ["UC Browser Theme File", "Theme file used by UC Browser, a Web browser for Android, Windows Mobile, and other mobile platforms; saves graphics and layout settings that modify the appearance of the browser; allows users to customize the look and feel.", "Android, Windows Phone, ", "['UC Mobile UC Browser']['UC Mobile UC Browser']"], "ucm": ["Crazy Machines Model File", "Game model file created by Crazy Machines, an puzzle game that utilizes physics-based contraptions; saves a model for the game, which is used for displaying one of the game objects or contraptions; becomes animated when an experiment is run.", "Windows, ", "['Viva Media Crazy Machines']"], "uci": ["UFS Explorer Backup File", "Compressed disk image file created by UFS Explorer, a backup program compatible with multiple file systems; saves an exact copy of a hard drive in a disk image format that can be used to restore data in case of a hard drive failure.", "Windows, ", "[]"], "ucf": ["WebEx Media File", "File used by WebEx, an online phone and video conferencing program; contains video, audio, Flash files, Web pages, and WebEx .WRF recordings; used for communicating rich media content during online conferences; stands for \"Universal Communications Format\".", "Windows, Mac, ", "['Cisco WebEx Universal Communications Toolkit']['Cisco WebEx Universal Communications Toolkit']"], "uzip": ["FreeBSD Compressed Disk Image", "Compressed disk image created by mkuzip, a FreeBSD compression utility; compresses a disk image, such as a .UFS file, so that it can be read during runtime by the FreeBSD geom_uzip utility; used to reduce the disk image file size at the expense of additional CPU time when reading the image.", "Linux, ", "[]"], "uwl": ["User Word List File", "File used by spell checker programs in Corel WordPerfect and Novell GroupWise word processor programs; contains a list of user-added words that are recognized and validated by the spell checker in document text.", "Windows, Mac, Linux, ", "['Corel WordPerfect X8', 'Novell GroupWise']['Novell GroupWise']['Novell GroupWise']"], "ucl": ["Killing Floor System File", "Game file used by Killing Floor, a first-person survival horror game; may be part of the original game or a \"mutator,\" which contains a game modification for playing altered content.", "Windows, Mac, ", "['Tripwire Interactive Killing Floor']['Tripwire Interactive Killing Floor']"], "uxx": ["Unreal Tournament Cache", "Cache of a data file recently used by Unreal Tournament", "Windows, Mac, ", "['Epic Games Unreal Tournament']['Epic Games Unreal Tournament']"], "uwrf": ["Universal Web Radio File", "File used by Universal Web Radio, a program used to access web radio stations to listen to music; contains radio station information, such as the station link, that is referenced by Universal Web Radio in order to play the station.", "Windows, ", "[]"], "uwf": ["UltraTracker Wave File", "Audio waveform file used to store audio samples for the UltraTracker audio tracking program.", "Windows, Mac, ", "[]['CocoModX']"], "uvf": ["Uncertain Value Format", "Extension to the .CSV (comma separated value) file format; used for handling uncertain values by Netica, a Bayesian network development software program that manages uncertainty in business, engineering, medicine, or ecology", "Windows, ", "['Norsys Netica']"], "uw": ["Unsigned Word Audio File", "Raw, unsigned 16-bit (word) audio data encoded using Pulse Code Modulation (PCM), a standard method of encoding analog audio signals in digital form", "Windows, Mac, ", "['Apple QuickTime Player']['Apple QuickTime Player']"], "uvx": ["Unreal Tournament 2003 Saved Game", "Game saved in Unreal Tournament 2003 (UT2003), a 3D first-person shooter; saves game progress, which allows the player to resume the game at a later time from the point at which the game was saved.", "Windows, ", "[]"], "uvw": ["UVW Coordinates File", "File created for Autodesk 3ds Max, a 3D modeling, rendering, and animation program; contains mapping coordinates to indicate to the Autodesk 3ds Max program where to cut the .BMP texture map and place it on the object.", "Windows, ", "['Autodesk 3ds Max 2017']"], "uud": ["UUDecoded File", "Decoded file that has been converted back to its original binary form; originally encoded by Unix UUEncode (into a .UUE file), which converts binary data into a text format.", "Windows, Linux, ", "[][]"], "uue": ["Uuencoded File", "A UUE file is a file encoded with uuencode, a Unix program that converts binary files to a text format.  It stores the encoded textual representation of a binary file and must first be decoded to open the original file.  UUE files are commonly used for emailing documents so the file does not become corrupted. ", "Windows, Mac, Linux, ", "['Corel WinZip 21', 'Smith Micro StuffIt Deluxe for Windows']['Apple Archive Utility', 'Smith Micro StuffIt Deluxe 16']['uuencode', 'uudecode']"], "uu": ["Uuencoded File", "File created by uuencode, a Unix program used for converting binary data to text; contains the textual encoding of an original binary file; often used to email a binary file in a text format so that the file does not become corrupted.", "Windows, Mac, Linux, ", "['Corel WinZip 21', 'Smith Micro StuffIt Deluxe for Windows']['Apple Archive Utility', 'Smith Micro StuffIt Deluxe 16']['uuencode', 'uudecode']"], "utxt": ["Unicode Text File", "Text file in encoded in Unicode format; used by various programs to store resources or settings in text format", "Windows, Mac, ", "['text editor']['text editor']"], "utz": ["UIQ Theme Package", "Theme package used by UIQ-based mobile phones, which include some phones created by Sony Ericsson and Motorola; contains a theme, including graphics and sounds; used to change the look and feel of mobile phone interfaces.", "Windows, Mac, ", "['Sony Ericsson Themes Creator', 'VITO ThemeEditor']['Sony Ericsson Themes Creator']"], "utx": ["Unreal Texture Package", "Contains textures used for creating characters and arenas for Unreal Tournament.", "Windows, ", "['Epic Games UnrealEd', 'Dragon UnPACKer', 'Unreal Tournament Package Tool']"], "utw": ["Unity Whirld File", "World file created in the Whirld Project format, an open file format created for games developed with the Unity engine; contains a 3D world and related game assets; differs from the standard Unity package format so that other tools can create and edit game content.", "Windows, Mac, Linux, ", "['Unity Technologies Unity', 'Syn3h']['Unity Technologies Unity', 'Syn3h']['Syn3h']"], "utf8": ["Unicode UTF8-Encoded Text Document", "Text document that uses Unicode UTF-8 (8-bit Unicode Transformation Format) encoding; can be used for English and many other languages, including support for Asian characters; backwards compatible with ASCII.", "Windows, Mac, Linux, ", "['Microsoft Notepad', 'Microsoft Wordpad', 'Microsoft Word 2016', 'gVim', 'text editor']['Apple TextEdit', 'MacroMates TextMate', 'MacVim', 'Bare Bones TextWrangler', 'text editor']['Vim', 'GNU Emacs', 'text editor']"], "utc": ["Bioware Creature File", "Creature created using Bioware's Aurora 3D rendering engine; can interact with objects and other creatures; may be controlled by artificial intelligence or a human player.", "Windows, ", "[]"], "ut8": ["Ghost Master Language File", "Language support file used by Ghost Master, a strategy game where players act the role of ghosts and scare humans; saves strings for the game and allows the game to be localized for different languages.", "Windows, ", "['Sick Puppies Ghost Master', 'Microsoft Notepad', 'text editor']"], "ut4mod": ["Unreal Tournament 2004 Module", "Module used by Unreal Tournament 2004 (UT2004), a multi-player first-person shooter game; extends UT2004 gameplay with new maps, characters, spawn points, weapon modifications, and graphics; may be loaded into UT2004 by double-clicking the module file. ", "Windows, Mac, Linux, ", "[][][]"], "ut3": ["Unreal Tournament 3 Map File", "Level map used by Unreal Tournament III (UT3), a 3D first-person shooter game; contains the map layout as well as the location of objects and characters in the map; may be included with the game or custom designed by UT3 players.", "Windows, ", "['Epic Games Unreal Tournament 3', 'Epic Games UnrealEd']"], "ut2mod": ["Unreal Tournament 2003/2004 Module File", "Self-extracting installer archive known as a \"UMOD installer;\" contains modification data for Unreal Tournament 2003 or 2004; contains compressed files that can be installed to modify the look and feel of the gameplay.", "Windows, Mac, Linux, ", "[][][]"], "ust": ["UTAU Sequence Text File", "File created by UTAU, a vocal synthesizer similar to YAMAHA's VOCALOID and VOCALOID2 software; supports musical notes as well as dynamics, vibrato, pitch, and lyrics; often used for storing music for Japanese vocaloids, which are virtual characters used by sing and dance games.", "Windows, ", "['UTAU']"], "ustar": ["Uniform Standard Tape Archive Format File", "Archive file created using USTAR formatting, which defines a small extension to the .TAR format; stores a collection of files in an uncompressed format; extends the TAR specification with a longer header definition, support for longer archived filenames, and support for more information about each file in the archive.", "Windows, Mac, ", "['Smith Micro StuffIt Deluxe for Windows', 'Corel WinZip 21']['Smith Micro StuffIt Deluxe 16']"], "ut2": ["Unreal Tournament Map", "Unreal level map created with Unreal Engine v2; contains the layout the level as well as characters and objects included in the map; used by Unreal Tournament 2003 and 2004.", "Windows, Mac, ", "[][]"], "usr": ["SmartMusic Custom File", "Music file used by SmartMusic, a band, orchestra, and vocal music practice application; contains a customization of a SmartMusic Title; custom changes include altering tempos and cutting measures.", "Windows, Mac, Windows, Mac, Windows, Mac, Linux, ", "['MakeMusic SmartMusic']['MakeMusic SmartMusic']['FileMaker Pro']['FileMaker Pro']['GPSBabel']['GPSBabel']['GPSBabel']"], "usx": ["Unreal Static Meshes", "3D models used for creating arenas for Unreal games; model shape is static but position, orientation and size can change; created and edited using the Unreal level editor \"UnrealEd.\"", "Windows, ", "['Epic Games UnrealEd', 'Dragon UnPACKer', 'Unreal Tournament Package Tool']"], "usm": ["USM Game Video File", "Video file used by various video games, often console games; similar to Bink video files (.BIK extension) and commonly stores cutscene video that is played back during gameplay; sometimes converted to other video formats by VGM collectors.", "Windows, ", "['VGMToolbox', 'utf_tab suite']"], "usflib": ["Nintendo 64 Song Library", "Library of Nintendo 64 song (.MINIUSF) files; contains a list of music from a Nintendo 64 game; must be located in the same directory as the miniUSF song files in order to load correctly.", "Windows, ", "['Nullsoft Winamp with 64th Note plugin']"], "usf": ["EVGA Precision X Skin File", "Skin file used by EVGA Precision X, a program used for overclocking GPUs; stores graphics and layout information that alter the appearance of the application's GUI; allows users to customize the look and feel of the interface.", "Windows, Windows, Windows, Mac, Linux, ", "['EVGA Precision X']['Nullsoft Winamp with 64th Note plugin']['VideoLAN VLC media player', 'text editor']['VideoLAN VLC media player', 'text editor']['VideoLAN VLC media player', 'text editor']"], "userprofile": ["Norton AntiVirus User Profile File", "File used by Norton AntiVirus, a program used to protect computers from viruses; contains subscription information that may reside on a computer even after Norton AntiVirus has been deleted.", "Windows, ", "['Symantec Norton Security 2017']"], "usertile-ms": ["Windows 8 User Tile File", "File used by the developer preview and release preview of Windows 8, and replaced by the .ACCOUNTPICTURE-MS format in the final Windows 8 release; saves the \"user tile,\" which is the user's image that appears on the Start screen; often contains a stock image or a picture taken with the computer's webcam.", "Windows, ", "['Microsoft Windows']"], "useq": ["USeq Genome Data File", "Data file created in the USeq format, which is used in science and health research; contains genomic data and includes chromosome, strand, and slice observation data; compressed with Zip compression and used for distributing large genome datasets.", "Windows, Mac, Linux, ", "['Integrated Genome Browser']['Integrated Genome Browser']['Integrated Genome Browser']"], "user": ["Visual Studio Project User Options File", "User settings file created by Visual Studio, a software development tool used to develop Windows programs and Web applications; contains user preferences, such as debugging and deployment settings; used for saving and loading project preferences for a specific user.", "Windows, ", "['Microsoft Visual Studio 2017']"], "usa": ["Unreal Saved Game File", "Game saved in Unreal or Unreal 2 first-person shooter games; saves the progress of the player and allows the game to be loaded from the point when the game was saved.", "Windows, Mac, ", "[][]"], "urt": ["Utah Raster Toolkit File", "Image data file created by the Utah Raster Toolkit, a Unix-based graphics package; stores images using a Run-length encoding (RLE) compression algorithm; used for storing images in an independent format so they can be manipulated and then exported to other image formats.", "Windows, Mac, Linux, ", "['XnViewMP']['XnViewMP']['XnViewMP']"], "urr": ["Uniface Signatures File", "File used by Uniface, a fourth generation programming language relational database management program; contains signatures for the application; used to activate software program features.", "Windows, ", "[]"], "url": ["Internet Shortcut", "A URL file is a shortcut file referenced by web browsers, such as Microsoft Internet Explorer (MSIE), Apple Safari, and Google Chrome.  It contains a web URL and may also store a reference to the favicon.ico icon file, which is displayed as the icon for the shortcut file.", "Windows, Mac, ", "['Microsoft internet Explorer', 'Google Chrome', 'Apple Safari', 'Mozilla Firefox', 'Microsoft Notepad', 'text editor']['Microsoft internet Explorer', 'Google Chrome', 'Apple Safari', 'Mozilla Firefox', 'Apple TextEdit', 'text editor']"], "ups": ["UPS Patch File", "Patch for game ROMs that can contain graphics, models, and other data; used for small and large patches; can be modified and applied to games using various UPS software utilities.", "Windows, Mac, Linux, ", "['tsukuyomi']['MultiPatch']['tsukuyomi']"], "upr": ["Fractal Parameters File", "Data file used by fractal math and art programs such as Apophysis and Ultra Fractal; saved in a plain text format and contains the parameters used to generate a fractal image; often used for flame fractals; also used for sharing fractal sets with others.", "Windows, Windows, Mac, ", "['Ultra Fractal', 'Apophysis']['FileMaker Pro']['FileMaker Pro']"], "upoi": ["iGO Points of Interest File", "Contains points of interest (POIs) that can be saved along with a GPS navigation map; used by iGO 2008 for marking and saving locations within a map.", "Windows, ", "[]"], "uqm": ["The Ur-Quan Masters Game Data File", "File used by The Ur-Quan Masters, a port of the sci-fi game Star Control 2, which was released for the 3DO game console; can contain various game data, including but not limited to sprite images and audio files; used for loading game data.", "Windows, Mac, ", "['The Ur-Quan Masters']['The Ur-Quan Masters']"], "upx": ["Ultimate Packer for eXecutables File", "File created by Ultimate Packer for eXecutables (UPX), a program used to compress executable files; contains a packed executable file, such as an .EXE file, that has compressed at a high ratio; used to reduce the file size of executables for transport via email or external media.", "Windows, Linux, ", "['PeaZip'][]"], "upk": ["Unreal Engine 3 Package", "File used by Unreal Engine 3, a free gaming engine used to develop popular games such as Unreal Tournament 3, Mass Effect, Mirror's Edge, and BioShock; serves as a file container which includes various types of game files; may contain 3D models, textures, maps, music files, game settings, and other files.", "Windows, ", "['Epic Games Unreal Tournament 3', 'Epic Games Unreal Development Kit']"], "upg": ["Upgrade File", "Firmware or software upgrade file used by hardware devices, such as routers and TVs, and software programs; used for applying bug fixes and new features to a product.", "Windows, ", "[]"], "upf": ["MicroStation User Preferences File", "Settings file created by MicroStation, a 3D CAD modeling tool; saves user preferences such as hotkeys, workspace settings, and the settings specified in the Workspace → Preferences dialog; enables preferences to be remembered.", "Windows, Windows, ", "['Bentley Systems MicroStation'][]"], "uot": ["Uniform Office Document", "Document created in the Uniform Office Format (UOF), an open standard developed for Chinese office productivity applications; uses an XML format to describe the document and is compressed to reduce the file size; can be opened by OpenOffice.org (OOO) and OOO variants.", "Windows, Mac, Linux, ", "['Apache OpenOffice', 'LibreOffice']['Apache OpenOffice', 'LibreOffice']['Apache OpenOffice', 'LibreOffice']"], "updatr": ["iConomy Update File", "Update file used by iConomy, a Minecraft \"mod\" used for creating a virtual in-game economy; contains information used for patching the current plug-in; includes the name, version, file URL, and notes.", "Windows, Mac, Linux, ", "['Mojang Minecraft with iConomy plug-in']['Mojang Minecraft with iConomy plug-in']['Mojang Minecraft with iConomy plug-in']"], "update": ["ISAPI Update File", "File used by ISAPI Loader, a program that allows DLLs to be \"hot-swapped\" on a Microsoft IIS web server during execution; contains updated DLL file contents for the Web server; automatically recognized and updated by ISAPI Loader.", "Windows, ", "[]"], "upd": ["Program Update Information", "Text file containing information about a specific program update; sometimes included with a software update installer; similar to a README file or other basic text (.TXT) file.", "Windows, Mac, ", "['text editor']['text editor']"], "uos": ["Uniform Office Spreadsheet", "Spreadsheet file created in the Uniform Office Format (UOF), a Chinese-developed file format for office productivity applications; saves the spreadsheet using XML and compression and therefore is similar to but not compatible with the Microsoft Office Open XML (.XLSX) and OASIS OpenDocument (.ODS) standards.", "Windows, Mac, Linux, ", "['Apache OpenOffice', 'LibreOffice']['Apache OpenOffice', 'LibreOffice']['Apache OpenOffice', 'LibreOffice']"], "uop": ["Uniform Office Presentation", "Presentation file created in the Uniform Office Format (UOF), an open document format created for Chinese office productivity applications; uses XML to describe the presentation and stores the presentation as a compressed archive.", "Windows, Mac, Linux, Windows, Mac, ", "['Apache OpenOffice', 'LibreOffice']['Apache OpenOffice', 'LibreOffice']['Apache OpenOffice', 'LibreOffice'][][]"], "uof": ["Uniform Office Document", "Document created in the Uniform Office Format (UOF), a file format developed for Chinese office productivity applications; uses XML formatting and compresses all document contents in a file container with the \".uof\" extension.", "Windows, Mac, Linux, ", "['Apache OpenOffice', 'LibreOffice']['Apache OpenOffice', 'LibreOffice']['Apache OpenOffice', 'LibreOffice']"], "unx": ["Unix Text File", "Text file associated with Unix, i.e. \"readme.unx;\" generally found on Unix systems and may be installed with Unix programs; can be opened by a standard text editor on Unix, Windows, and Macintosh computers.", "Windows, Mac, Linux, ", "['text editor']['text editor']['Pico', 'text editor']"], "unt": ["AutoCAD Unit Definition File", "Settings file used by AutoCAD, a CAD productivity application used for drafting 2D and 3D designs; contains unit definitions and scales, such as conversions between miles and kilometers or Fahrenheit and Celsius; ensures that the proper units, scales, and unit conversions are used within a drawing.", "Windows, ", "['Autodesk AutoCAD 2017']"], "unk": ["Unknown File", "Unknown file that does not have a file association; may contain file contents from an original file that was unrecognized by any program; created typically as a default extension for a corrupted or unknown file that is found in email attachments or downloads from the Web.", "Windows, ", "[]"], "unitypackage": ["Unity Package File", "Compressed package created by Unity, a 3D game development application; contains project asset and library files used for building a game; used for transferring project files from one project to another; can be included in new Unity projects to create a starting point for developing a game.", "Windows, Mac, ", "['Unity Technologies Unity']['Unity Technologies Unity']"], "unity3d": ["Unity Web Player File", "Scene Web player file created by Unity, an application used to develop 3D games; contains all assets and other game data in a single archive; used to enable gameplay within a Web browser that has the Unity Web Player plug-in installed; can be published from a .UNITY scene file.", "Windows, Mac, ", "['Unity Technologies Unity', 'Unity Technologies Unity Web Player Plug-in']['Unity Technologies Unity', 'Unity Technologies Unity Web Player Plug-in']"], "unr": ["Unreal Level Map", "Contains the map and other required information for one level of Unreal or Unreal Tournament", "Windows, ", "['Epic Games UnrealEd']"], "unl": ["Garmin Unlock File", "Backup file created by MapSource, a program used to manage maps for Garmin navigational devices; contains unlock codes for maps; used as a backup copy so that the codes can be restored back to the Garmin device.", "Windows, ", "['Garmin MapSource']"], "unknown": ["Unknown File Type", "Unknown Windows file that does not have a file association; may have an \".unknown\" extension to serve as a placeholder for the file's correct extension.", "Windows, ", "[]"], "unityproj": ["Unity 3D Project", "Project created by Unity, a 3D game engine IDE;  contains Unity project data in XML format;  includes project properties, a list of .JS files, and configuration data; regenerated from the contents in the Assets folder every time the Unity project is opened; located in the root folder of your project. ", "Windows, Mac, Linux, ", "['Unity Technologies Unity', 'MonoDevelop']['Unity Technologies Unity', 'MonoDevelop']['MonoDevelop']"], "unity": ["Unity Scene File", "File created by Unity, a 3D engine primarily used to create video games; contains a unique level within a 3D game that includes objects, environments, decorations, cameras, lighting, and obstacles; used with other scenes to build a virtual world when editing.", "Windows, Mac, ", "['Unity Technologies Unity', 'Unity Technologies Unity iPhone']['Unity Technologies Unity', 'Unity Technologies Unity iPhone']"], "unif": ["UNIF ROM File", "Game ROM used by the Nestopia emulator to play Nintendo Entertainment System (NES) video games; also used to play Famicom video games, which was the Japanese version of the NES.", "Windows, ", "['Nestopia']"], "uni": ["MikMod UniMOD Module", "MikMod audio tracker module format; created by the MikMod module player, an audio tracker available for multiple platforms.", "Windows, Mac, Linux, ", "['MikMod']['MikMod', 'CocoModX']['MikMod']"], "unf": ["UNIF ROM File", "Game ROM created from Nintendo Entertainment System (NES) or Famicom video games; opened and played on a computer using the Nestopia emulator.", "Windows, ", "['Nestopia']"], "unauth": ["SiteMinder Unauthorized Message File", "Error message file used by Netegrity SiteMinder; contains text displayed to users who exceed the maximum number of failed login attempts defined by the authentication scheme.", "Windows, ", "[]"], "umx": ["Unreal Music Package", "Music module format that contains background music for Unreal Tournament, a 3D first-person shooter; similar to an .XM or .S3M file, but is saved in the proprietary Unreal music format; can be opened using various audio trackers and Unreal utilities.", "Windows, Mac, ", "['Epic Games Unreal Tournament', 'Epic Games UnrealEd', 'KMPlayer', 'MODPlug Player', 'OpenMPT', 'VideoLAN VLC media player', 'Nullsoft Winamp with UMX Decoder']['Epic Games Unreal Tournament', 'CocoModX', 'XimpleMOD']"], "ums": ["Rune 3D Mesh File", "File used by Rune, a a third-person action game where players control a mythological character named Ragnarok; stores the 3D geometry for a game character or object; used for providing the skeletal structure to 3D world entities.", "Windows, Mac, ", "['Human Head Studios Rune']['Human Head Studios Rune']"], "umod": ["Unreal Tournament Module File", "Self-extracting Unreal module installer archive; contains modifications and add-ons for the original Unreal Tournament 3D multiplayer game; includes compressed mod files and a \"Manifest.ini\" file that defines the locations where the files are to be installed.", "Windows, Mac, ", "['Epic Games Unreal Tournament']['Epic Games Unreal Tournament']"], "uml": ["UML Data Object Model", "Object model description created using the Unified Modeling Language (UML), a standard way of describing objects in an XML format; used in software development and may include a list of elements and classes associated with a program object.", "Windows, Mac, Linux, ", "['No Magic MagicDraw', 'Eclipse IDE for Java Developers']['No Magic MagicDraw', 'Eclipse IDE for Java Developers']['No Magic MagicDraw', 'Eclipse IDE for Java Developers']"], "umf": ["MediaHolder Universal Media Format File", "Container file used by MediaHolder, an application used to download multimedia files and eBooks; stores metadata in addition to the multimedia content; may store information for the author, included file types, and hyperlink references; used as the format for downloading OnRead.com eBooks, but can be used for other types of data as well.", "Windows, ", "[]"], "umd": ["Splinter Cell Blacklist Game Data File", "Compressed file created for Splinter Cell Blacklist, a third-person shooter stealth adventure game; contains game configuration data, such as object textures, referenced by the game for each level in Splinter Cell; not meant to be opened.", "Windows, ", "['Ubisoft Splinter Cell Blacklist']"], "ulz": ["USBlyzer Data Capture File", "Contains data captured by USBlyzer, a USB protocol analysis program; contains a hierarchy of connected USB devices with descriptive information about each device.", "Windows, ", "[]"], "umap": ["Unreal Engine Map File", "A UMAP file is an Unreal Engine map created for games developed with the Unreal Engine, a free gaming engine used todevelop games such as BioShock, Mass Effect, and Unreal Tournament 3.  It contains references to map properties that are stored in the .UPK Unreal Package such as objects, light brightness and direction, fog density and color, and shadow colors.", "Windows, ", "['Epic Games UnrealEd']"], "ulx": ["Glulx Game File", "Game file used for Interactive Fiction (IF) games and played by \"Interpreters,\" such as Zoom or Frotz; similar to the .Z8 file extension used by Z-machine; contains a game where you navigate through a story by typing commands; includes code written in Glulx format to expand past limitations of the Z-code format such as the limit on file size.", "Windows, Mac, Linux, Web, Android, ", "['Windows Frotz']['Zoom', 'Spatterlight']['Zoom']['Parchment']['Twisty']"], "ulw": ["u-Law Audio File", "Uncompressed audio file format used in US telephony applications; contains raw CCITT G.711 u-law (pronounced \"myoo-law\") audio data that has not been encoded or compressed.", "Windows, Mac, ", "['NCH Switch', 'FMJ-Software Awave Audio']['NCH Switch']"], "uls": ["NetMeeting User Location Service File", "Contains information about an Internet location; used by Microsoft NetMeeting to connect users to each other; the Internet Locator Server (ILS) sends a file called \"Ulserver.uls\" to clients with IP address and port information.", "Windows, ", "[]"], "uld": ["Unified Luminaire Data File", "Data file used by DIALux, a professional light planning software for indoor and outdoor lighting; contains data about the lighting specifications of a luminaire, such as the fixture description, fixture image, luminous flux, power consumption, and a 3D model for viewing; cannot be created by the user, only used for viewing.", "Windows, ", "['DIAL DIALux']"], "ulf": ["Universal List File", "Data file formatted in Universal List Format (ULF); contains a list of elements similar to an .XML document; often used by Geographic Information Systems (GIS) applications to store coordinates and vertexes.", "Windows, ", "[]"], "ulaw": ["Raw u-Law Audio File", "Standard format used in US telephony that contains raw CCITT G.711 u-law (pronounced \"myoo-law\") audio data; saved in an uncompressed format that can be played back by various audio programs.", "Windows, Mac, ", "['NCH Switch', 'FMJ-Software Awave Audio']['NCH Switch']"], "ult": ["UltraTracker Module", "Audio module format used by the UltraTracker audio tracking program; supported by several newer trackers.", "Windows, Mac, Linux, ", "['Nullsoft Winamp', 'OpenMPT', 'Schism Tracker', 'MikMod']['MikMod', 'CocoModX', 'Schism Tracker']['Schism Tracker', 'MikMod']"], "ukx": ["Unreal Animation Package", "3D character animation created for action games that use the Unreal 3D rendering engine; contains 3D meshes, materials, and animation data; can be built and edited using the Animation Browser included with the Unreal Editor (UnrealEd).", "Windows, ", "['Epic Games UnrealEd', 'Dragon UnPACKer', 'Unreal Tournament Package Tool']"], "uis": ["WindowBlinds User Interface Specification", "Contains instructions for processing skins (.WBA files) for Stardock SkinStudio or WindowBlinds; defines skin parameters, such as the appearance, visibility, positioning, and actions.", "Windows, ", "['Stardock WindowBlinds']"], "uif": ["Universal Image Format Disc Image", "Compressed disc image format created by MagicISO, a program for creating, editing, and extracting disc image files; can be encrypted and password-protected; also supports backing up multi-session CD/DVD, Audio-CD, VCD, SVCD, and DVD-Video formats.", "Windows, Mac, ", "['MagicISO', 'PowerISO', 'UIF2ISO']['UIF2ISO for Mac']"], "uibak": ["UltraISO Backup Disk Image", "Backup of an .ISO disk image saved with UltraISO; may be used to recover a disk image if the original file becomes corrupted or is deleted; typically named \"[filename].iso.uibak\" and can be opened by removing the \"uibak\" part of the extension.", "Windows, ", "['EZB Systems UltraISO']"], "ui": ["User Interface File", "Stores the user interface configuration for a program; saved in an XML format and contains definitions of Qt widgets with slots and signals; can be viewed in a basic text editor or opened with a UI designer program.", "Windows, Mac, Linux, ", "['Digia Qt SDK', 'text editor']['Digia Qt SDK', 'text editor']['Digia Qt SDK', 'KDevelop', 'text editor']"], "uhtml": ["UC Browser Saved Webpage", "Saved webpage created by UC Browser, a mobile device Web browser available for Android, Windows Mobile, Symbian OS, and other mobile platforms; includes the webpage HTML source code and images; used for saving webpage snapshots and can be viewed in UC Browser while offline.", "Android, Windows Phone, ", "['UC Mobile UC Browser']['UC Mobile UC Browser']"], "uha": ["UHarc Compressed Archive", "Windows file archive compressed using UHarc compression; may create smaller archives than .RAR compression, but decompression typically takes longer.", "Windows, ", "[]"], "umlclass": ["UML Class Model", "Java class description created using the Unified Modeling Language UML; similar to a .UML file, but used specifically for defining Java classes; may include elements, attributes, and operations associated with the class.", "Windows, Mac, Linux, ", "['Eclipse IDE for Java Developers']['Eclipse IDE for Java Developers']['Eclipse IDE for Java Developers']"], "ugr": ["Apophysis Ultra Fractal Gradient File", "File used by Apophysis, a fractal flame editor; contains one or more gradients that can be applied to a fractal frame; includes custom settings such as color reversal and gradient inversion.", "Windows, ", "['Apophysis']"], "ugoira": ["Ugoira Animated Image File", "A UGOIRA file is an animated image file created by pixiv, a Japanese online community of artists.  It contains multiple illustrated .JPG or .PNG frames that are displayed in succession as an animation.  ", "Windows, ", "['Bandisoft Honeyview']"], "uga": ["Ulead GIF Animator File", "Project file created by Ulead GIF Animator, a GIF animation tool for web pages, presentations, etc.; contains a GIF animation project; project features held within the file include objects, text, and shape insertion; creates .GIF files.", "Windows, ", "['Ulead GIF Animator']"], "uft": ["Torque Font Cache File", "A UFT file is a font cache file created by Torque, a game engine used to create two and three-dimensional video games.  It contains font graphics used for displaying in-game text.  UFT files are generated by Torque 2D or 3D SDKs from a font that is chosen by the developer (e.g., Arial 12, Times 14, etc.).", "Windows, Mac, Linux, ", "['GarageGames Torque2D', 'GarageGames Torque3D']['GarageGames Torque2D']['GarageGames Torque3D']"], "ufs": ["FreeBSD Unix File System File", "Unix file system file created for PC-BSD, a Unix operating system based on FreeBSD; stores the entire disk or a portion of a disk, including files, directories, and the file system structure; used to clone file systems for PC-BSD network installations.", "Linux, ", "[]"], "ulp": ["EAGLE User Language Program", "Program run by CadSoft EAGLE, a PCB (printed circuit board) design program; contains a program in C-like EAGLE User Language; includes a description of what the program performs and author info.", "Windows, Mac, Linux, ", "['CadSoft EAGLE']['CadSoft EAGLE']['CadSoft EAGLE']"], "ufo": ["Ulead File Object", "Raster image primarily created by Ulead PhotoImpact (now Corel PhotoImpact), but also recognized by other photo and video editing applications developed by Ulead; may include multiple editing layers, similar to a Photoshop (.PSD) document.", "Windows, ", "['Corel PhotoImpact X3', 'Ulead Photo Explorer', 'Binary Soft UniView']"], "ufr": ["Ultra Fractal File", "Fractal image created by Ultra Fractal, a program used for creating fractal art; saves parameters used to generated a fractal image; includes color settings and the user's zoomed perspective within the image; can include fluorescent color overlays, gradients, and other color settings; used for desktop backgrounds as well as printed art.", "Windows, ", "['Ultra Fractal']"], "uce": ["Windows UCE System File", "System file used by Microsoft Windows operating system; stored in the C:\\Windows\\System32\\ directory and is not meant to be opened manually by the user; uses filenames such as kanji_1.uce, korean.uce, and ShiftJIS.uce.", "Windows, ", "['Microsoft Windows']"], "uccapilog": ["Microsoft UCC API Log File", "Log file created by Microsoft programs that use the Microsoft Unified Communications Client API (UCCAPI); contains troubleshooting and debugging information that logs the performance of a UCCAPI program; may be appended with new data during program execution.", "Windows, ", "['Microsoft Windows Live Messenger']"], "uc2": ["UltraCompressor 2 Archive", "Compressed archive format that supports OS/2 extended attributes and Windows 95 long filenames.", "Windows, ", "[]"], "uc": ["UnrealScript Class", "Contains classes referenced by the main Unreal class package (.U file)", "Windows, ", "['Epic Games UnrealEd']"], "ubox": ["Universe Sandbox Data File", "Saved data file created by Universe Sandbox, an interactive astronomy application; saves a simulation through space and can include planets, stars, moons, man-made objects, orbital motions, and other simulated data; used for sharing and playing back universe explorations.", "Windows, ", "['Universe Sandbox']"], "ubj": ["Universal Binary JSON File", "File created in the Universal Binary JSON (UBJ) format, a data interchange format developed by The Buzz Media; stores .JSON data using a binary representation rather than its native text format; allows data to be transferred in a more compact format.", "Windows, Mac, Linux, ", "['Universal Binary JSON Java Library', 'Ubjson.NET', 'node-ubjson', 'simpleubjson']['Universal Binary JSON Java Library', 'node-ubjson', 'simpleubjson']['Universal Binary JSON Java Library', 'node-ubjson', 'simpleubjson']"], "ub": ["Unsigned Byte Audio File", "Uncompressed audio file format used by Amiga and Q40 systems; contains raw, unsigned 8-bit (1 byte) audio data; encoded using Pulse Code Modulation (PCM), a standard method of encoding analog audio signals in digital form.", "Windows, Mac, Linux, ", "['Apple QuickTime Player', 'SoX']['SoX', 'Apple QuickTime Player']['SoX']"], "uax": ["Unreal Audio Package", "Audio file used by Unreal Tournament and other first-person shooter games that use the first Unreal Engine; may save audio clips for background music or sound effects such as weapon shots, player jumps, and ambient map noises; used as a container for game sounds.", "Windows, ", "['Epic Games UnrealEd', 'FMJ-Software Awave Studio', 'Epic Games Unreal Tournament', 'Dragon UnPACKer', 'Unreal Tournament Package Tool', 'Eidos Interactive Deus Ex']"], "u3i": ["U3 Application Information File", "Contains information about a U3 smart application (.U3P file) in an XML format; includes the application's version, download path, and working parameters.", "Windows, ", "['text editor']"], "u8": ["3D Lemmings Audio File", "Audio file used by 3D Lemmings, an older puzzle game where the objective is to guide lemmings to safety; contains sounds that are played when certain game events happen, such as when a lemming falls or uses a digging tool.", "Windows, ", "[]"], "u3p": ["U3 Smart Application", "A U3P file is a portable application stored on a U3 Smart Drive, a special type of USB flash drive that includes the U3 Launchpad platform.  It contains program executables and configuration data.  U3P files enable a program to be run from the flash drive on any Windows computer and may install some files on the local computer if needed.", "Windows, ", "['Corel WinZip 21', '7-zip']"], "u3d": ["Universal 3D File", "3D CAD file saved in the Universal 3D File Format; standardized by Ecma International as the ECMA-363 standard; contains 3D model information, including shapes, textures, lighting, shading, and motion data; supported by many CAD and 3D graphics programs.", "Windows, Mac, Linux, ", "['Blender', 'DAZ 3D DAZ Studio 4', 'Smith Micro Poser 11', 'Adobe Photoshop CC 2017', 'Adobe Acrobat DC', 'RealWorld Icon Editor', 'Kubotek USA KeyCreator']['Blender', 'DAZ 3D DAZ Studio 4', 'Smith Micro Poser 11', 'Adobe Photoshop CC 2017', 'Adobe Acrobat DC']['Blender']"], "uasset": ["Unreal Asset File", "Asset file used by UnrealEd, an Unreal level editor that comes with Unreal Engine; contains an asset, such as a level, material, animation, sound, or particle system used in the Unreal Engine game.", "Windows, ", "['Epic Games UnrealEd']"], "u11": ["UFile 2011 Tax Return", "Canadian tax return created with UFile 2011, a tax preparation program for Canada residents; contains federal Canada tax forms and the associated data entered by the user; may be printed and mailed or filed electronically using the program's NETFILE feature.", "Windows, Mac, Web, ", "['Intuit Canada TurboTax']['Intuit Canada TurboTax']['Dr Tax UFile Online']"], "u12": ["UFile 2012 Tax Return", "Canadian federal tax return created with UFile 2012, a tax preparation program for Canadian residents; contains Canada income tax forms and data entered by the user; may be printed and mailed or filed electronically with the Canada Revenue Agency using the program's NETFILE feature.", "Windows, Mac, Web, ", "['Dr Tax UFile', 'Intuit Canada TurboTax']['Intuit Canada TurboTax']['Dr Tax UFile Online']"], "u10": ["UFile 2010 Tax Return", "Tax return created with UFile 2010, a Canadian tax preparation program; contains federal Canada tax forms as well as data entered by the user; when completed, the tax return can be printed and mailed or filed electronically using the program's NETFILE feature.", "Windows, Mac, Web, ", "['Dr Tax UFile', 'Intuit Canada TurboTax']['Intuit Canada TurboTax']['Dr Tax UFile Online']"]}