{"v": ["Verilog Source Code File", "Source code file written in the Verilog hardware description language (HDL); most commonly contains Verilog 2005 source code, but may also use one of the other Verilog standards, which include Verilog-95, Verilog 2001, and SystemVerilog; used for specifying models of electronic systems.", "Windows, Linux, Windows, Mac, Linux, Windows, Mac, Linux, ", "['File Viewer Plus', 'Xilinx ISE Design Suite', 'Xilinx ISE WebPACK', 'Icarus Verilog', 'Cadence Design Systems Incisive', 'SYNAPTICAD VeriLogger Extreme', 'Mentor Graphics ModelSim', 'Verilog 2005 parser']['Xilinx ISE Design Suite', 'Xilinx ISE WebPACK', 'Verilog 2005 parser']['Microsoft Windows Media Player with YUV Genius package', 'Apple QuickTime Player with QuickTime YUV codec']['Apple QuickTime Player with QuickTime YUV codec'][]['CoqIDE']['CoqIDE']['CoqIDE']"], "vbf": ["City Interactive Game Data File", "Game data format used by City Interactive games; contains game data, such as objects, characters, and game audio in a single archive; similar to the .BF format used by Cryo Interactive games.", "Windows, ", "[\"XpoZed's Unpakke\"]"], "vbe": ["VBScript Encoded Script File", "Script written in VBScript, a programming language that is a reduced version of Visual Basic; stores the source code in an encoded format so that it is not recognizable; run natively in Windows by the Windows Script Host (wscript.exe or cscript.exe).", "Windows, ", "['Microsoft WScript', 'Microsoft CScript']"], "vbm": ["Veeam Backup Metadata File", "Backup file created by Veeam's virtual machine backup and recovery software; contains metadata describing a backup that was performed and stored in a .VBK full backup file (and also in .VRB incremental backup files).", "Windows, ", "['Veeam Backup & Replication']"], "vbox-prev": ["Oracle VM VirtualBox Settings Backup File", "Backup file created by Oracle VM VirtualBox, a program used for virtualizing guest operating systems; stores a backup of the previous state of a .VBOX file; created in the same directory as the VBOX file and can be used to restore previous settings.", "Windows, Mac, Linux, ", "['Oracle VM VirtualBox']['Oracle VM VirtualBox']['Oracle VM VirtualBox']"], "vbg": ["Visual Basic Project Group File", "Contains multiple, source-code controlled Visual Basic Projects (.VBP files); allows individual projects to be source-controlled using Microsoft Visual SourceSafe.", "Windows, ", "['Microsoft Visual Studio']"], "vbox": ["Oracle VM VirtualBox Settings File", "Settings file used by Oracle VM VirtualBox, a program used for running virtualized operating systems (OSs); saved in an XML format and contains settings such as the virtual machine name, OS type, system memory; used for launching a VM.", "Windows, Mac, Linux, ", "['Oracle VM VirtualBox']['Oracle VM VirtualBox']['Oracle VM VirtualBox']"], "vbhtml": ["ASP.NET Razor Web Page", "Visual Basic HTML Web file used by Razor, an ASP.NET view engine that generates webpages on a Microsoft IIS Web server; similar to a standard ASP.NET webpage (.ASP or .ASPX file), but uses slightly different syntax that offers new HTML templating features.", "Windows, ", "['Microsoft Visual Studio 2017', 'text editor']"], "vbox-extpack": ["Oracle VM VirtualBox Extension Pack", "Extension package file used by Oracle VM VirtualBox, a virtualization program for running guest operating systems; contains data that extends the base functionality of the software; can be installed by double-clicking the file.", "Windows, Mac, Linux, ", "['Oracle VM VirtualBox']['Oracle VM VirtualBox']['Oracle VM VirtualBox']"], "vbk": ["Veeam Backup File", "Backup file created by Veeam virtual machine (VM) backup and recovery software; contains a full recovery backup of the VM and is the largest of the files created for any backup; allows a full restore of the state of the machine when it was last backed up.", "Windows, Windows, Mac, iOS, Android, ", "['Veeam Backup & Replication']['VitalSource Bookshelf']['VitalSource Bookshelf']['VitalSource Bookshelf']['VitalSource Bookshelf']"], "vbd": ["Visual Basic ActiveX Document", "ActiveX file, also called an \"Active Document,\" created with Microsoft Visual Basic; often hosted on Web servers and can be accessed with a Web browser.", "Windows, Mac, ", "['Web browser']['Web browser']"], "vbc": ["VodBurner Crude Video File", "Video created by VodBurner, a program that allows you to record Skype conversations; contains raw video of a Skype conversation that is not directly playable but can be generated as an .MP4. .WMV, or .ASF file.", "Windows, Mac, ", "['Netralia VodBurner']['Netralia VodBurner']"], "vb": ["Visual Basic Project Item File", "A VB file is a project item file written in the Visual Basic language, an object-oriented programming language created by Microsoft for use with the .NET Framework.  It contains Visual Basic instructions in ASCII text format.", "Windows, Mac, Linux, Windows, Windows, ", "['File Viewer Plus', 'Microsoft Visual Studio 2017', 'Adobe Dreamweaver CC 2017', 'Microsoft WScript', 'text editor']['Adobe Dreamweaver CC 2017', 'text editor']['text editor']['MFAudio', 'TinyTed Vice City Radio'][]"], "vault": ["Fontcase Vault File", "Data file created by Fontcase, a font manager for Mac OS X; saves the list of imported user, shared, or system level fonts; also saves the activation or deactivation status of each font as well as other metadata such as ratings.", "Mac, ", "['Bohemian Coding Fontcase']"], "var": ["Variable Data", "Contains variables definitions used by various software development programs", "Windows, ", "[]"], "vxp": ["Mobile Application File", "File used by the Maui Runtime Environment (MRE) SDK, a phone application development platform; contains an application (commonly games) and all of its resources; similar to a .JAR file; used by mobile phones, such as those made by Cherry Mobile.", "Windows, ", "[]"], "vaporcd": ["Norum Vapor CD", "CD-ROM disc image created using Norum Vapor disc imaging software", "Windows, ", "['EZB Systems UltraISO', 'MagicISO']"], "vym": ["VYM Mind Map File", "File created by VYM (View Your Mind), a multiplatform mind mapping program; can store ideas, tasks, topics, keywords, and other information; used for visually representing concepts and ideas in a creative way.", "Windows, Mac, Linux, ", "['VYM']['VYM']['VYM']"], "vyf": ["Samsung Digital Voice Recorder File", "Proprietary audio file format used by Samsung digital voice recorders, such as the Samsung YV-120; optimized for vocal recordings; typically named \"V001.VYF,\" \"V002.VYF,\" \"V003.VYF,\" etc.", "Windows, ", "[]"], "vxml": ["VoiceXML File", "Text file containing code written in VoiceXML, an XML based language used for vocal interaction between a human and computer; typically contains speech recognition and speech synthesis functions that allow a computer to interact with a human via voice commands.", "Windows, Mac, Linux, ", "['Voxeo Evolution', 'Cisco Audium Studio', 'Genesys Voice Platform', 'SyncRO Soft oXygen XML Editor', 'text editor']['SyncRO Soft oXygen XML Editor', 'text editor']['SyncRO Soft oXygen XML Editor', 'text editor']"], "vxd": ["Virtual Device Driver", "Helper file for a specific program; adds additional capabilities and support for the program; typically installed with the Windows operating system and with other software programs.", "Windows, ", "['Microsoft Windows']"], "vx_": ["Compressed Virtual Device Driver File", "Compressed .VXD file used for distributing device drivers in a compact format; sometimes found in device driver downloads or on installation CDs; not meant to be opened or edited manually and should be used or handled automatically by a software or driver installer.", "Windows, ", "['Microsoft Windows']"], "vwp": ["Vehicle Weapon File", "Weapon file used by Star Wars Jedi Knight: Jedi Academy, a Jedi game where the player chooses to follow the light or dark side; contains data for vehicle weapons that are accessed throughout the game; includes speed, damage, and ammo per shot specifications for the weapon; also contains links to shot, muzzle, and impact sound effects for the weapon.", "Windows, Mac, ", "['Raven Software Star Wars Jedi Knight: Jedi Academy']['Raven Software Star Wars Jedi Knight: Jedi Academy']"], "vwx": ["Vectorworks Design File", "2D or 3D design created with Vectorworks CAD software; created by Vectorworks 2008 and later; may contain two-dimensional drafting images or three-dimensional models.", "Windows, Mac, ", "['Nemetschek Vectorworks']['Nemetschek Vectorworks']"], "vw": ["Volkswriter Text File", "File created by Volkswriter, a once-popular word processing program for the IBM PC in the 1980s; contains document text created in Volkswriter; can be opened in Corel WordPerfect.", "Windows, ", "['Corel WordPerfect X8']"], "vvf": ["Voc Vocabulary File", "Data file used by Voc, a command-line program used to create vocabularies and administer multi-lingual vocabulary quizzes; contains plain text vocabulary words in a comma separated format, which is the format of .CSV files; stores words and their translation in another language; used for loading vocabulary questions to the user in Voc.", "Mac, Linux, ", "['Voc']['Voc']"], "vvvvvv": ["VVVVVV Game Level File", "Game file used by VVVVVV, a \"platformer\" game where players navigate through levels by alternating between walking on the floor and ceiling; stores a game level that can be shared with other VVVVVV players; can be created and edited with the VVVVVV Level Editor.", "Windows, ", "['VVVVVV', 'VVVVVV Level Editor']"], "vvv": ["Virtual Volumes View Catalog", "A VVV file contains a catalog created by VVV (Virtual Volumes View), a program used to catalog content of removable volumes, such as DVDs and CDs, and files and folders in a directory.  It stores an index of files and folders scanned from a removable disc or directory.  VVV files also include metadata about the folders and files, which allows them to be searched by a user. ", "Windows, Mac, Linux, ", "['VVV (Virtual Volumes View)']['VVV (Virtual Volumes View)']['VVV (Virtual Volumes View)']"], "vvd": ["Vivid 3D Scanner Element File", "3D image created using Minolta's Vivid 3D Scanner; generated from multiple scans that are combined into a single 3D mesh; can be opened and edited with Minolta's Polygon Editing Tool (PET) as well as various other third-party programs.", "Windows, ", "['Okino Computer Graphics PolyTrans with Minolta Geometry Import Converter']"], "vud": ["Virtual Machine Undo Drive File", "Data file used by Windows Virtual PC, an emulation program used to run Windows virtual machines (VMs); stores the changes made to the virtual machine's virtual disk (.VHD file) since the VHD file was last loaded; tracks the files that were created, deleted, and modified.", "Windows, ", "['Microsoft Windows Virtual PC', 'Microsoft Virtual Server']"], "vue": ["Vue Scene File", "Three-dimensional scene created with E-on Vue 3D environment modeling software; used to create 3D worlds that include various terrains, water, mountains, clouds, and different types of atmospheres; supports the SolidGrowth plant system and Ecosystem technology.", "Windows, Mac, Windows, ", "['E-on Vue']['E-on Vue']['Microsoft Visual FoxPro']"], "vtx": ["Anim8or 3D Model", "Three-dimension model created with Anim8or, a 3D modeling and animation program; saved in a basic 3D \"vertex\" format than is recognized by several other 3D design programs; also supported by Game Maker, a game development program.", "Windows, Windows, Mac, Windows, Mac, Linux, ", "['Anim8or', 'YoYo Games Game Maker']['File Viewer Plus', 'Microsoft Visio 2016']['The Omni Group OmniGraffle']['Audio Overload', 'Ay_Emul']['Audio Overload']['Audio Overload', 'Audacious']"], "vtv": ["Adobe Dreamweaver Validator Configuration File", "Code validation file used by Adobe Dreamweaver, an application used to build Web applications; contains XML data that specifies valid uses of source code tags; used for reporting programming errors during development.", "Windows, Mac, ", "['Adobe Dreamweaver CC 2017']['Adobe Dreamweaver CC 2017']"], "vtt": ["Web Video Text Tracks File", "Text data file saved in the Web Video Text Tracks (WebVTT) format; contains information about a web video, such as subtitles, captions, descriptions, chapters, and metadata; does not contain any video data.", "Windows, Mac, Linux, Android, ", "['Google Chrome', 'Microsoft Internet Explorer', 'Mozilla Firefox', 'Opera']['Google Chrome', 'Mozilla Firefox', 'Apple Safari', 'Opera']['Google Chrome', 'Mozilla Firefox', 'Opera']['J2 Interactive MX Player']"], "vtml": ["Visual Tool Markup Language File", "File created in the Visual Took Markup Language (VTML) format; allows developers to extend an application user interface with new language tags; often used for defining code hinting, code completion, and tag formatting functions.", "Windows, Mac, ", "['Adobe Dreamweaver CC 2017']['Adobe Dreamweaver CC 2017']"], "vtm": ["Visual Tool Markup Language Document", "File created in the Visual Took Markup Language (VTML) format; enables developers to extend a program's user interface with new components; often used for defining functions for code hinting, completion, and formatting; also used for creating new language tags.", "Windows, Mac, ", "['Adobe Dreamweaver CC 2017']['Adobe Dreamweaver CC 2017']"], "vtf": ["Valve Texture File", "Texture file format used by Valve Corporation's Steam Source Engine; commonly used by video games.", "Windows, Windows, Mac, Linux, ", "['VTF Explorer', 'VTFEdit'][][][]"], "vsz": ["Visual Studio Wizard File", "File used by Visual Studio, a software development program; saves specifications for a wizard, which guides the user through a series of questions to complete a task; used for building custom wizards that add functionality to Visual Studio and the software development process.", "Windows, ", "['Microsoft Visual Studio 2017']"], "vsv": ["Virtual Machine Saved State File", "Data file created by Windows Virtual PC and Virtual Server emulation applications; saves the state of the virtual machine's memory, which includes the running applications and opened data; enables users to save VM snapshots and revert back to the exact state as they were saved.", "Windows, ", "['Microsoft Windows Virtual PC', 'Microsoft Virtual Server']"], "vstx": ["Visio Drawing Template", "Drawing template created by Visio, a technical drawing program; provides a starting point for making other drawings (.VSDX files) from the same starting conditions and with the same look and feel.", "Windows, ", "['File Viewer Plus', 'Microsoft Visio 2016']"], "vstm": ["Visio Macro-Enabled Drawing Template", "Macro-enabled drawing template created by Visio, a program used for making business diagrams; contains both a drawing template and macros, which are written in VBA (Visual Basic for Applications) source code.", "Windows, ", "['File Viewer Plus', 'Microsoft Visio 2016']"], "vsx": ["Visio Stencil XML File", "Collection of basic drawings and shapes used for creating diagrams in Visio, a business flowcharting program; similar to a standard .VSS file, but saved in an XML format.", "Windows, Mac, ", "['File Viewer Plus', 'Microsoft Visio 2016']['The Omni Group OmniGraffle']"], "vsw": ["Visio Workspace File", "Settings file saved by versions 2003-2010 of Microsoft Visio, a technical drawing program; saves the locations of windows, panels, and the drawing canvas; deprecated by later versions of the software, which now includes settings as part of the .VSD or .VSDX file.", "Windows, ", "['Microsoft Visio 2016']"], "vstpreset": ["VST Preset File", "File used by Steinberg Cubase, an audio production application; contains one or more presets for VST plugin audio effects; may store \"tags,\" such as Acoustic, Clean, and Percussive, that help users organize and search for their presets.", "Windows, Mac, ", "['Steinberg Cubase']['Steinberg Cubase']"], "vst": ["VST Audio Plugin", "File or folder containing a VST (Virtual Studio Technology) plugin; used for creating or modeling audio effects; typically used by digital audio programs to modify recorded sounds.", "Windows, Mac, Linux, Windows, Mac, Windows, Mac, ", "['Steinberg Cubase', 'Audacity with VST Enabler', 'Image-Line FL Studio']['Steinberg Cubase', 'Audacity with VST Enabler']['Audacity with VST Enabler']['File Viewer Plus', 'Microsoft Visio 2016']['The Omni Group OmniGraffle']['Adobe Photoshop CC 2017', 'Adobe Photoshop Elements 15', 'Adobe Illustrator CC 2017', 'ACD Systems Canvas X 2017', 'Corel Painter 2017']['Adobe Photoshop CC 2017', 'Adobe Photoshop Elements 15', 'Adobe Illustrator CC 2017', 'Corel Painter 2017']"], "vssx": ["Visio Stencil File", "File used by Visio, a technical drawing program; saves a collection of shapes, connectors, or other objects that can be used within a drawing; often used by organizations for distributing logos and other standard design elements that can be included in technical drawings.", "Windows, ", "['Microsoft Visio 2016']"], "vssm": ["Visio Macro-Enabled Stencil File", "File used by Visio, a program used for making business diagrams; stores a collection of shapes that can be used for constructing diagrams; serves the same purpose as a .VSSX file, except it enables macros as part of the package.", "Windows, ", "['Microsoft Visio 2016']"], "vssscc": ["Visual Studio Solution Source Control File", "Source Code Control (SCC) file for software developed with Microsoft Visual Studio; contains metadata that tracks revisions of source code files developed with Visual Studio; includes information such as the version number, file path, and the number of nested projects.", "Windows, ", "['Microsoft Visual Studio 2017']"], "vssettings": ["Visual Studio Settings File", "Settings file created by Visual Studio, a software development tool used to build Windows programs and other software; contains configuration information for the Visual Studio IDE, including settings for the editor, projects, debugging, fonts, colors, window layouts, and other display preferences.", "Windows, ", "['Microsoft Visual Studio 2017']"], "vsqx": ["VOCALOID3 Project File", "Project file created by VOCALOID3, an application used to create synthesized vocals; stores notes and lyrics for each note that are emulated by the synthesized voice. ", "Windows, ", "['YAMAHA VOCALOID3']"], "vspx": ["Visual Studio Performance Report Data File", "Developer file introduced with Visual Studio 2011; contains application performance metrics collected during a performance analysis test; generated into a report summary, which helps developers identify bottlenecks and optimize performance.", "Windows, ", "['Microsoft Visual Studio 2017']"], "vss": ["Visio Stencil File", "File used by Microsoft Visio, a program used to create flowcharts, drawings, and other technical diagrams; contains a group of shapes, objects, or connectors; provides additional pre-drawn objects that can be included into a .VSD Visio drawing.", "Windows, Mac, ", "['File Viewer Plus', 'Microsoft Visio 2016', 'Microsoft Word 2016', 'Microsoft PowerPoint 2016']['The Omni Group OmniGraffle']"], "vsq": ["VOCALOID2 Project File", "Project file created by VOCALOID2, a program used for creating synthesized vocals; contains both notes and lyrics for each note that are emulated by the synthesized voice; often used for synchronizing vocals with 3D virtual dancing characters known as \"vocaloids.\"", "Windows, ", "['YAMAHA VOCALOID2', 'MikuMikuDance']"], "vspscc": ["Visual Studio Project Source Control File", "Source Code Control (SCC) file for projects created with Microsoft Visual Studio; contains metadata used for tracking revisions of Visual Studio software development projects; includes information such as the version number, file path, and the number of nested projects.", "Windows, ", "['Microsoft Visual Studio 2017']"], "vsps": ["Visual Studio Serialized Performance Report", "Developer file created by Visual Studio, a software development IDE; saves summary data collected from analyzing a performance report (.VSP file); enables the data to be saved without having to re-generate it again from the VSP file.", "Windows, ", "['Microsoft Visual Studio 2017']"], "vsprops": ["Visual Studio Project Property File", "Property sheet file created by Microsoft Visual Studio 2008 and earlier; stored in an XML format and contains build properties and user-defined macros for a project; used for exporting and importing common settings between projects.", "Windows, ", "['Microsoft Visual Studio 2017']"], "vspf": ["Visual Studio Performance Filter File", "Developer file created by Visual Studio, a software development IDE; contains one or more rules that filter the results for a performance report (.VSP or .VSPX file); used for fine-tuning the analysis to identify specific performance bottlenecks.", "Windows, ", "['Microsoft Visual Studio 2017']"], "vsp": ["VideoStudio Project File", "Project file created by VideoStudio, a program used to create slideshows and movies; contains video project data, including references to video, audio, and image files, and movie timeline settings and effects; used to save and load movie projects.", "Windows, Windows, ", "['Corel VideoStudio Pro X10 Ultimate']['Microsoft Visual Studio 2017']"], "vso": ["Compiled Vertex Shader File", "File used by the vertex shader tool included in the Microsoft DirectX SDK; compiled version of the .VSH file; contains transformation and lighting operations state information for objects; also contains data variables based on x, y, and z coordinates.", "Windows, ", "['Microsoft DirectX SDK']"], "vsmproj": ["Visual Studio Text Macro Project", "Text-based version of a macro project created with Visual Studio, a software tool that allows developers to create Windows applications; contains actions that automate behaviors in the Visual Studio IDE; used for boosting productivity for repetitive development tasks.", "Windows, ", "['Microsoft Visual Studio 2017']"], "vsmdi": ["Visual Studio Test Metadata File", "File created by Visual Studio, a program used by developers to create Windows applications; contains metadata for a testing project, including a list of tests and run configurations; used for running a suite of test cases, such as a collection of unit tests.", "Windows, ", "['Microsoft Visual Studio 2017']"], "vsmacros": ["Visual Studio Binary Macro Project", "Binary version of a macro project created by Visual Studio, a Windows application development tool created by Microsoft; contains a sequence of actions either recorded by the user in capture mode, or manually programmed in a Visual Studio editor; used for automating repetitive tasks needed during software development.", "Windows, ", "['Microsoft Visual Studio 2017']"], "vsl": ["Visio Add-on", "Addon, or library, file used by Microsoft Visio, a business diagramming application; saves software components that extend the functionality of the program; typically created and distributed by third-party developers.", "Windows, Windows, Mac, Linux, ", "['Microsoft Visio 2016']['Apache Velocity']['Apache Velocity']['Apache Velocity']"], "vsixmanifest": ["VSIX Manifest", "File created by Microsoft Visual Studio, a SDK for the Windows system; contains metadata about the .VSIX file it resides in.", "Windows, ", "['Microsoft Visual Studio 2017']"], "vsix": ["Visual Studio Extension", "Software add-on created for Microsoft Visual Studio, a software development IDE for Windows; saved in a .ZIP format and contains files that extend the functionality of the Visual Studio software; stores a package description as well as binaries and other resources that comprise the extension.", "Windows, ", "['Microsoft Visual Studio 2017']"], "vsh": ["Vertex Shader File", "3D shading file used by applications that use the OpenGL graphics library; contains a graphics function used for shading a vertex, which is a point in 3D space; executed by a GPU in order to show 3D shading effects on an object.", "Windows, Mac, Linux, ", "['AMD GPU ShaderAnalyzer', 'OpenGL SDK']['Apple OpenGL Shader Builder', 'OpenGL SDK']['OpenGL SDK']"], "vsi": ["Visual Studio Content Installer File", "Visual Studio installation package that may contain starter kits, item templates, controls, code snippets, add-ins, or other types of files; used for exchanging Visual Studio content within the developer community; also referred to as a \"community component.\"", "Windows, ", "['Microsoft Visual Studio 2017']"], "vse": ["AVTECH CCTV Video", "Video recording file created by an AVTECH closed circuit television (CCTV) or digital video recorder (DVR); contains video saved in a proprietary format that can only be played back by the AVTECH software; used for saving and reviewing security videos.", "Windows, ", "[]"], "vsdx": ["Visio Drawing", "A VSDX file is a drawing saved in the VSDX file format introduced with Visio 2013, a program used for making drawings and technical illustrations.  It stores shapes, lines, text, and other objects arranged together on a free-form canvas.  VSDX files are used for saving flowcharts, process diagrams, organizational charts, and other types of drawings.", "Windows, Mac, Linux, iOS, ", "['File Viewer Plus', 'Microsoft Visio 2016', 'LibreOffice', 'CS Odessa ConceptDraw PRO']['LibreOffice', 'CS Odessa ConceptDraw PRO', 'Nektony VSD Viewer']['LibreOffice']['Nektony VSD Viewer']"], "vsdm": ["Visio Macro-Enabled Drawing", "Macro-enabled drawing created with Visio, a technical drawing program; serves the same purpose as a .VSDX file, except it allows VBA (Visual Basic for Applications) macros to be stored and executed when the drawing is opened.", "Windows, ", "['File Viewer Plus', 'Microsoft Visio 2016']"], "vsdisco": ["DISCO Dynamic Discovery Document", "Discovery file used by Microsoft's Directory of Web Services (DISCO) technology; provides current information about Web service files available on a server; uses the same syntax as a .DISCO file, but is generated dynamically and stored in the Web service application.", "Windows, ", "['Microsoft Visual Studio 2017']"], "vsd": ["Visio Drawing File", "A VSD file is a drawing project saved by Visio, a program used to create business diagrams.  It may contain visual objects, information flows, text, and other data.  VSD files may also store connection information for imported data sources.", "Windows, Mac, Linux, iOS, ", "['File Viewer Plus', 'Microsoft Visio 2016', 'iGrafx FlowCharter', 'CorelDRAW Graphics Suite X8', 'LibreOffice']['The Omni Group OmniGraffle', 'Nektony VSD Viewer', 'LibreOffice']['LibreOffice']['Nektony VSD Viewer']"], "vsct": ["Visual Studio Command Table", "File created by Microsoft Visual Studio, a Microsoft SDK; contains metadata about the isolated shell application in Visual Studio; organized by XML tags representing commands, command groups, menus, command placement, and bitmaps.", "Windows, ", "['Microsoft Visual Studio 2017']"], "vscontent": ["Visual Studio Content File", "Text file that describes the content of a Visual Studio package; includes the filename, display name, description, file type, and content version of each file; used for describing Visual Studio items shared as community components.", "Windows, ", "['Microsoft Visual Studio 2017']"], "vsch": ["Windows Vault Schema File", "File created by Windows Vault (also called the Credential Manager), a program introduced with Windows 7 that allows users to securely store personal information such as user names and passwords; contains a schema, or data description, for the data stored in the vault.", "Windows, ", "['Microsoft Windows Vault', 'Passcape Password Recovery']"], "vs4": ["AVTECH CCTV Video Surveillance File", "Video surveillance file recorded by an AVTECH digital video recorder (DVR) or closed circuit television (CCTV) system; saves the recording in a proprietary format that can only be played by AVTECH software; used for archiving and reviewing security system videos.", "Windows, ", "[]"], "vs": ["Vertex Shader File", "File used by OpenGL and DirectX applications and games; saves lighting properties for vertices, which are points in 3D space; enables a 3D model to have shading effects; saved in a plain text format.", "Windows, Mac, Linux, Windows, Mac, Linux, Windows, ", "['OpenGL SDK', 'Microsoft DirectX SDK']['OpenGL SDK']['OpenGL SDK']['GreekToMe']['GreekToMe']['GreekToMe'][]"], "vrt": ["Virtual World", "3D format for creating interactive three-dimensional worlds that can be viewed by web browsers with the Viscape SVR plugin; stores data, such as textures, sounds, dimensions, and behaviors, that make up the 3D world.", "Windows, ", "['Web browser']"], "vrphoto": ["VR Photo Image", "Image created by VR Photo, an iOS app used for making 3D rotating images; supports 4 to 32 frames, each of which can be imported from a JPEG image; can be accessed from the Stored Files view in the app and can be exported as HTML and shared over email or FTP from within the app.", "iOS, ", "[]"], "vro": ["DVD Video Recording Format", "Video format used for streaming (real-time) recording of DVD discs; contains actual audio and video recordings; works with .IFO files, which tell the DVD player where the VRO files are located.", "Windows, Mac, Linux, ", "['Corel WinDVD 11', 'CyberLink PowerDVD 16', 'Serif MoviePlus', 'VideoLAN VLC media player', 'Online Media Technologies AVS Video Editor', 'Apple QuickTime Player with MPEG-2 Playback Component', 'DRD Systems VideoReDo', 'NVIDIA NVDVD']['MPlayerX', 'Squared 5 MPEG Streamclip', 'VideoLAN VLC media player', 'Apple QuickTime Player with MPEG-2 Playback Component']['VideoLAN VLC media player']"], "vrml": ["VRML File", "Three-dimensional world, scene, or object based on the Virtual Reality Modeling Language (VRML); may be a standalone 3D file or may be integrated into a Web page; most VRML files let the user navigate the 3D world using the keyboard and/or mouse.", "Windows, Mac, Linux, ", "['FreeWRL', 'OpenVRML', 'Web browser']['FreeWRL', 'OpenVRML']['OpenVRML', 'VRweb']"], "vrd": ["Visio Report Definition File", "Defines the parameters of a report created with Microsoft Visio; saved in an XML format; divided into five sections including 1) the title and description, 2) the fields and column headers, 3) information selection filters, 4) record groupings, and 5) a description of how the information is sorted.", "Windows, ", "['Microsoft Visio 2016']"], "vrl": ["VRML Virtual World", "3D virtual world formatted in VRML, the Virtual Reality Markup Language; contains 3D objects and scenery data; simulates what a real-life building or landscape looks like.", "Windows, Mac, ", "['IMSI TurboCAD Pro 2017']['IMSI TurboCAD Deluxe v10']"], "vrimg": ["V-Ray Image File", "Image format developed by Chaos Group and created by V-Ray, a rendering engine plugin used with other design-oriented applications, such as 3DS Max and Maya, to render scenes quicker; stores image data as it is being rendered by the engine.", "Windows, Mac, Linux, ", "['V-Ray for 3ds Max', 'V-Ray for Maya', 'Chaos Group Pdplayer']['Chaos Group Pdplayer']['Chaos Group Pdplayer']"], "vrf": ["Ventrilo Audio Recording", "Compressed audio format used by Ventrilo for voice communication over the Internet; may involve multiple people and multiple channels; proprietary format that is difficult to convert to more popular formats such as .WAV and .MP3", "Windows, Mac, Linux, ", "['Flagship Industries Ventrilo']['Flagship Industries Ventrilo']['Flagship Industries Ventrilo']"], "vrb": ["Veeam Incremental Backup File", "Backup file created by Veeam Software's backup and recovery software for virtual machines (VMs); stores incremental backup data since the initial full backup was performed (and stored in a .VBK file); may be saved with several other VRB files, which contain the sequence of incremental backups since the full backup.", "Windows, ", "['Veeam Backup & Replication']"], "vr": ["VR Studio Project File", "A VR file is a project created by VR Studio, a program used to create, edit, and publish virtual reality (VR) videos and photos.  It contains a project, which includes video and audio files and metadata.  VR files are created from video captured by the Vuze VR camera developed by HumanEyes. ", "Windows, ", "['HumanEyes VR Studio']"], "vqf": ["TwinVQ Audio File", "Audio format developed by the Nippon Telegraph and Telephone Corporation (NNT Labs); uses transform-domain weighted interleaved vector quantization to compress audio data; can be encoded in 80, 96, 112, 128, 160, and 192 kbps bitrates.", "Windows, Mac, Linux, ", "['File Viewer Plus', 'Nero 2017', 'VideoLAN VLC media player', 'Nullsoft Winamp with VQF Decoder plugin']['VideoLAN VLC media player']['VideoLAN VLC media player']"], "vqc": ["Virtual CD Quick Copy File", "File created by Virtual CD, a program used for virtualizing physical discs as disc images on the hard drive; saves all the settings required to copy data from a physical disc to a virtual CD file on the hard drive; allows settings to be shared between computers.", "Windows, ", "['H+H Software Virtual CD']"], "vpx": ["Avast! Virus Update File", "Data file used by avast!, an antivirus and Internet security application; may contain virus definitions and software update information; used for keeping the software up-to-date with the latest protection signatures.", "Windows, ", "['avast! Pro Antivirus', 'avast! Internet Security']"], "vpw": ["VoxPro Wave File", "Audio file created by VoxPro, an audio recording and editing application; contains an audio file in the WAVE format with an exclusive Resource Interchange File Format (RIFF) chunk (a set of data) used to render the file according to the user-applied effects and edits.", "Windows, ", "['Wheatstone VoxPro']"], "vps": ["Virtual CD Copy Template", "Disc copy settings file created by Virtual CD, a disc authoring application; saves settings that specify how to copy a CD to a virtual CD file on the hard drive; enables settings to be reused with the same types of source CDs.", "Windows, ", "['H+H Software Virtual CD']"], "vpol": ["Windows Vault Policy File", "File created by Windows Vault (also referred to as Credential Manager), a program introduced with Windows 7 that enables Windows users to safely store personal information such as user names and passwords; stores a set of encryption keys that are used to protect user information.", "Windows, ", "['Microsoft Windows Vault', 'Passcape Password Recovery']"], "vpp": ["Visual Paradigm Project File", "Project file created by Visual Paradigm for UML, a diagramming application included in the Visual Paradigm Suite; can save multiple kinds of diagrams for a single project, including UML diagrams, business process diagrams, entity relationship diagrams, and others.", "Windows, Mac, Linux, ", "['Visual Paradigm Suite']['Visual Paradigm Suite']['Visual Paradigm Suite']"], "vpl": ["Karaoke Player Playlist", "Contains a list of songs to be played with vanBasco's Karaoke Player; includes references to song files, such as Karaoke (.KAR) and MIDI (.MID) files, but does not include actual MIDI or karaoke data.", "Windows, ", "[\"vanBasco's Karaoke Player\"]"], "vpm": ["Vox Proxy Macro File", "File used by Vox Proxy, a program used to create talking animated characters in presentations; contains scripted program instructions to invoke Vox Proxy functions; can be used to drive slide shows or animate talking characters.", "Windows, Windows, ", "[]['TurboCCC TTSVoiceEditor', 'TurboCCC NonTTSVoiceEditor', 'Garmin Voice Utility']"], "vpk": ["Valve Pak", "A VPK file is a Valve Pak file used by some games developed with the Source Engine, which include Half-Life, Left 4 Dead, DOTA 2, and Portal 2.  It may be a master directory file for a collection of VPK files or may be one of the raw VPK data files.  VPK files are used for storing maps, models, materials, choreography scenes, and other original game content, but can can be used for making game mods as well.", "Windows, Mac, ", "['GCFScape', \"Gibbed's VPK Extractor\", 'Valve Left 4 Dead', 'Valve Portal 2', 'Valve Half-Life', 'Valve Half-Life 2', 'Valve Team Fortress 2']['GridMount', 'Valve Left 4 Dead', 'Valve Portal 2', 'Valve Half-Life 2']"], "vpj": ["VideoPad Video Editor Project File", "Project file saved by VideoPad Video Editor, an application used for creating digital videos; stores references to video files and can include transitions, effects, and audio; used for saving the user's editing progress.", "Windows, ", "['NCH VideoPad Video Editor']"], "vpd": ["MikuMikuDance Vocaloid Pose Data File", "3D model file used by MikuMikuDance, a dance and rhythm synchronization game; saves bone positions for a character's model, which give it a pose; can be used in a series of poses that make up a dance animation (.VMD file).", "Windows, Windows, ", "['MikuMikuDance']['Wheatstone VoxPro']"], "vpcbackup": ["Windows Virtual PC Backup File", "Backup file created by Windows Virtual PC, a software emulation program used to run different versions of Windows; stores a backup copy of a .VMC virtual machine (VM) configuration file; used for restoring a VM configuration file to a previous state.", "Windows, ", "['Microsoft Windows Virtual PC']"], "vph": ["VirtualPhotographer Custom Settings", "Preference file that stores user settings for the virtualPhotographer Photoshop plug-in; can be loaded within the plug-in to recall previously saved settings.", "Windows, ", "['Adobe Photoshop with OptikVerve Labs virtualPhotographer plugin']"], "vpe": ["Photoshop Vanishing Point Export File", "File created by the Extended version of Adobe Photoshop, a professional graphics editing application; saves vanishing point planes that have been specified by a designer on a 2D image; can be imported into After Effects, which splices the 2D image into different images represented by the planes.", "Windows, Mac, ", "['Adobe After Effects CC 2017']['Adobe After Effects CC 2017']"], "vpc7": ["Virtual Machine Package", "Mac OS X Package that contains the necessary files to load an emulated Windows operating system using Virtual PC.", "Windows, Mac, ", "['Microsoft Virtual PC']['VMware Fusion 8.5', 'Parallels Desktop 12 for Mac']"], "vpc6": ["Virtual Machine Package", "Mac OS X Package created for emulation purposes; contains files to load an emulated Windows operating system using Virtual PC.", "Windows, Mac, ", "['Microsoft Virtual PC']['VMware Fusion 8.5', 'Parallels Desktop 12 for Mac']"], "vpc": ["ViziGen Configuration File", "Project configuration file used by ViziGen HC, a software development tool; contains information that relates a model to a set of ViziGen templates (.VGC files) and controls the code generation process.", "Windows, ", "[]"], "vp7": ["TrueMotion VP7 Video File", "Encoded video format developed by On2 Technologies; designed to encode video quickly and decode video in fewer cycles than other compression schemes; optimized for playback on low-power devices and includes advanced buffering and latency features.", "Windows, ", "['Media Player Classic with K-Lite Mega Codec Pack', 'Microsoft Windows Media Player with Storm Codec']"], "vpa": ["VPchat Chat Gestures File", "Gesture file used by VPchat (Virtual Places Chat) and the older Excite Super Chat Alpha program; contains animations with sound that can be displayed in a user's chat bubble; allows for more expressive emotions than static emoticons.", "Windows, ", "[]"], "vp6": ["TrueMotion VP6 Video File", "Encoded video format developed by On2 Technologies; used primarily for Internet video and Flash video files; supports multi-pass encoding, constant or variable data rates, and advanced error recovery; can be used to encode high resolution video, including 1920x1080 HD video streams.", "Windows, Mac, Linux, ", "['VideoLAN VLC media player', 'Media Player Classic with K-Lite Mega Codec Pack', 'Microsoft Windows Media Player with Storm Codec']['Eltima Elmedia Player', 'VideoLAN VLC media player']['VideoLAN VLC media player']"], "vp3": ["On2 Streaming Video File", "Streaming video file compressed on-demand using the VP3 video codec; contains compressed video at variable compression rates; used to send the highest video quality possible given bandwidth adjustments and fluctuations.", "Windows, Mac, ", "['Microsoft Windows Media Player']['Apple QuickTime Player']"], "vp": ["Verilog Encrypted Source Code File", "Encrypted file originally written in Verilog, a hardware description language (HDL) used to specify electronic system designs; stores the encrypted version of a Verilog source code file, which uses the .V extension; used for protecting intellectual property stored in plain text source code files.", "Windows, Linux, Windows, Windows, Mac, Linux, Windows, ", "['Xilinx ISE Design Suite', 'Xilinx ISE WebPACK']['Xilinx ISE Design Suite', 'Xilinx ISE WebPACK']['VpView32', 'Maja Express', 'QuickVP', 'VPMage']['Celestia', 'text editor']['Apple OpenGL Shader Builder', 'Celestia', 'text editor']['Celestia', 'text editor'][]"], "voxal": ["Voxal Project File", "Audio project created by Voxal, a voice changing program used for altering the sound of a person's voice; adds effects such as echo, pitch bending, reverb, chorus, distortion, and flangers to a recorded audio file; used for creating voice overs and video game character sounds.", "Windows, ", "['NCH Voxal']"], "voxb": ["Voxler Network File", "File created by Voxler, a 2D and 3D visualization application; stores a network (specified on an open-ended canvas) that describes how data is visualized; may include data sources, transforms, and other operations; also specifies appearance parameters such as colors, axis labels, and scale.", "Windows, ", "['Golden Software Voxler']"], "vox": ["Dialogic Voice Audio File", "Audio file encoded in Dialogic's ADPCM (VOX) format, a format used for saving human speech audio; saves digitized voice data sampled at a low rate; enables the audio data size to be small while still maintaining clarity; used by computer telephony systems.", "Windows, Mac, Windows, Mac, ", "['Adobe Audition CC 2017', 'FMJ-Software Awave Studio', 'Xentec Vox Studio', 'Dekorte.com SoundConverter']['Adobe Audition CC 2017', 'Dekorte.com SoundConverter']['Slab6', 'Voxlap engine', 'MagicaVoxel']['MagicaVoxel']"], "vor": ["StarOffice Template", "Template for creating a new StarOffice or OpenOffice.org document; used by multiple StarOffice/OpenOffice.org programs, including Writer (word processing), Calc (spreadsheets), and Impress (presentations).", "Windows, Mac, Linux, ", "['Apache OpenOffice']['Apache OpenOffice', 'Planamesa NeoOffice']['Apache OpenOffice']"], "volarchive": ["CopyCatX Volume Archive", "Disk image file created by CopyCatX, a hard drive duplication program for Mac OS X; saves a copy of the hard drive but doesn't save empty sectors so that the file doesn't become unecessarily large; used for backup and restore operations and for duplicating boot drives.", "Mac, ", "['SubRosaSoft.com CopyCatX']"], "vol": ["Video Game Archive", "Packed (or compressed) archive used to store data used by various video games including Tribes, Giants: Citizen Kabuto, and Earth Siege 2.", "Windows, Mac, ", "['Dragon UnPACKer'][]"], "vok": ["PocketVok Vocabulary File", "List of words recognized by PocketVok, a PDA-based vocabulary training program for Pocket PC; used for learning words and building a vocabulary as well as learning foreign words, countries and their capitals, etc.", "Windows, ", "[]"], "voi": ["VOI Group File", "Group of Volume of Interest (VOI) drawings used by the medical program BrainMaker; defines 3D regions of interest (ROIs) on MRI and PET brain scans; VOIs are saved as groups using the VOIGroup Manager, which is a component of BrainMaker.", "Windows, Mac, Linux, Windows, ", "['The MathWorks MATLAB']['The MathWorks MATLAB']['The MathWorks MATLAB', 'SPAMALIZE BrainMaker'][]"], "voca": ["PhotoVOCA Communication Board File", "A VOCA file is a digital communication board created by PhotoVOCA, an iOS app used to create digital communication boards.  It is compressed with .ZIP compression and contains data which includes audio and .PNG image assets with an .XML manifest.  VOCA files are saved in the PhotoVOCA 3.0 format, which is an extension of the original VOCA format released in 2010 by PhotoVOCA.  ", "iOS, ", "['Cognable PhotoVOCA']"], "voc": ["Creative Labs Audio File", "Audio file format used by Creative Labs hardware, such as SoundBlaster sound cards; may be audio clips, sound effects, or instrument sounds, which are also referred to as voices; VOC files are compressed to reduce file size.", "Windows, Mac, Linux, ", "['File Viewer Plus', 'Adobe Audition CC 2017', 'Nullsoft Winamp', 'VideoLAN VLC media player', 'FairStars Soft Audio Converter', 'Voc2wav', 'AGiliTy']['Adobe Audition CC 2017', 'VideoLAN VLC media player']['VideoLAN VLC media player']"], "vob": ["DVD Video Object File", "A VOB file is a movie data file from a DVD disc, typically stored in the VIDEO_TS folder at the root of the DVD.  It contains a majority of the data stored on the disc which includes video, audio, subtitles, DVD menus and other navigation contents.  VOB files are usually formatted as MPEG-2 system streams and can be opened by various video playback programs.", "Windows, Mac, Linux, iOS, Windows, Mac, Windows, ", "['File Viewer Plus', 'CyberLink PowerDVD 16', 'CyberLink PowerDirector 15 Ultra', 'CyberLink PowerProducer 6', 'Media Player Classic', 'Microsoft Windows Media Player', 'Roxio Creator NXT Pro 5', 'VideoLAN VLC media player', 'GRETECH GOM Player', 'VobEdit']['Apple DVD Player', 'ShedWorx Smart Converter', 'VideoLAN VLC media player', 'Roxio Toast 15', 'Roxio Popcorn', 'MPlayerX', 'Eltima Elmedia Player']['VideoLAN VLC media player']['VideoLAN VLC for iOS 2', 'olimsoft OPlayer']['E-on Vue']['E-on Vue'][]"], "vnt": ["Mobile Phone vNote File", "Text note format used by various cell phones, such as the S Memo app on Samsung Android devices or the Notes application on Sony Ericsson mobile phones; saved in a text format with a header that starts with \"BEGIN:VNOTE\" and ends with \"END:VNOTE.\"", "Windows, Mac, Android, ", "['Microsoft Notepad', 'text editor']['Apple TextEdit', 'text editor']['Samsung S Memo']"], "vni": ["Dell Webcam Central Application Configuration File", "Settings file used by Dell Webcam Central, a program used for video chatting; saved in plain text and contains application configuration settings; specifies plugins, as well as video chatting effects and bit rate recording settings.", "Windows, ", "['Dell Webcam Central']"], "vnc": ["VNC Configuration File", "Contains settings for a Virtual Network Computing (VNC) connection from one computer to another; enables remote access to a system at a different location.", "Windows, Mac, Linux, ", "[][][]"], "vnd": ["Type3 Design File", "Native design format of the Type3 Artistic Software family; used by Vision Numeric's TypeEdit and the Type3 CATIA add-on; contains CAD/CAM designs that may include text, shapes, and other types of paths.", "Windows, ", "['Dassault Systemes CATIA with Type3 add-on']"], "vncloc": ["Screen Sharing VNC Internet Location", "Connection file created by Screen Sharing, a remote desktop control program included with Mac OS X; saved in an XML format and contains the connection URL for the remote computer; used as a shortcut for re-opening a screen sharing session; created by selecting Connection → Save As... in the Screen Sharing application menu while a sharing session is open.", "Mac, ", "['Apple Screen Sharing']"], "vmxf": ["VMware Team Member File", "Additional configuration file used by virtual machines (VMs) created with VMware virtualization software; contains team member data for VMs created in a team group environment, a setup that allows administrators to manually control multiple VMs together; created in addition to the primary .VMX configuration file; saved in a plain text format and uses XML formatting.", "Windows, Mac, Linux, ", "['VMware Workstation 12.5 Pro']['VMware Fusion 8.5']['VMware Workstation 12.5 Pro']"], "vmx": ["VMware Configuration File", "Configuration file used by VMware virtualization software such as VMware Workstation and VMware Fusion; stores settings for a virtual machine created with the New Virtual Machine Wizard; includes the memory, hard disk, and processor limit settings; enables a virtual machine to be started in the software.", "Windows, Mac, Linux, Windows, Mac, Windows, ", "['VMware Workstation 12.5 Pro']['VMware Fusion 8.5']['VMware Workstation 12.5 Pro']['Steinberg Cubase']['Steinberg Cubase']['Valve Source SDK']"], "vnf": ["Vision Numeric Font", "Single line font format used by Type3 software for direct engravings; also known as a \"stroke line\" font, which is directly machinable with the adequate equipment; developed for the Type3 Artistic Software family range in 1990.", "Windows, ", "[]"], "vmwarevm": ["VMware Fusion Virtual Machine", "Virtual machine file used by VMware Fusion, a program that allows Windows to run on a Macintosh computer; saved in a \"package\" format and includes all files saved within the Windows virtual hard drive; may also include VMware configuration (.VMX) files.", "Mac, ", "['VMware Fusion 8.5']"], "vmv": ["VisualBoyAdvance Recording", "Game recording created by VisualBoyAdvance, a Gameboy Advance emulator; saves keystrokes and other information that allows the recording to be played back in the emulator; saved in a proprietary format and cannot be played by standard video players.", "Windows, Windows, ", "['VisualBoyAdvance']['VirtuaNES']"], "vmt": ["Valve Material File", "Material that can be applied to a two-dimensional surface of an object created with Valve's Source engine; contains information that the Source engine uses to visually, physically, and aurally simulate the surface.", "Windows, Windows, ", "['Valve Source SDK', 'VTFEdit', 'QuArK', 'text editor']['VMware Workstation 12.5 Pro']"], "vmsd": ["VMware Snapshot Metadata File", "File created by VMware Workstation, an application used for virtualization; contains metadata used for storing information about a snapshot, which is a frozen saved state of a virtual machine at a point in time; used as part of a snapshot save and enables the snapshot to be loaded.", "Windows, Linux, ", "['VMware Workstation 12.5 Pro']['VMware Workstation 12.5 Pro']"], "vmsn": ["VMware Snapshot State File", "File created by VMware virtualization software; saves the virtual machine (VM) data for a snapshot, which is a frozen state of the VM saved at a particular point in time; can be one of several different snapshots used by the virtual machine; saved with a .VMSD file, which contains the metadata for the snapshot.", "Windows, Mac, Linux, ", "['VMware Workstation 12.5 Pro']['VMware Fusion 8.5']['VMware Workstation 12.5 Pro']"], "vmtm": ["VMware Team Data File", "Configuration file used by VMware virtualization software; contains settings for a \"team,\" which is a group of virtual machines that can interoperate in a VMware virtual lab environment and share the same virtual network resources.", "Windows, Mac, Linux, ", "['VMware Workstation 12.5 Pro']['VMware Fusion 8.5']['VMware Workstation 12.5 Pro']"], "vmss": ["VMware Suspended State File", "File created by VMware virtualization software; saves the state of the virtual machine (VM) when it is in a suspended state, meaning that it has been stopped temporarily; used for resuming the VM from where it was stopped; created automatically by the software when the VM is suspended.", "Windows, Linux, ", "['VMware Workstation 12.5 Pro']['VMware Workstation 12.5 Pro']"], "vmsg": ["VMware Application Message File", "Application support file used by VMware virtualization software; saved in a plain text format and contains a list of text strings that are displayed through the application user interface; allows the software to be localized into different languages.", "Windows, Linux, ", "['VMware Workstation 12.5 Pro']['VMware Workstation 12.5 Pro']"], "vmlf": ["VAIO Video File", "Video format used by the Picture Motion Browser (PMB) or Windows Movie Maker (WMM) utilities on Sony VAIO computers; contains video data converted from other video formats, such as MPEG and .AVI.", "Windows, ", "['GSpot']"], "vmo": ["Siemens Voice Memo File", "Audio file created by the voice recorder on some Siemens mobile phones; stores the audio in a proprietary format that can be played back on the device but not by standard audio players on the desktop computer; can be converted to the .WAV format using vmo2wav.", "Windows, Windows, Mac, Linux, ", "[]['Dassault Systems 3DVIA Player', 'Dassault Systems 3DVIA Virtools']['Dassault Systems 3DVIA Player']['Dassault Systems 3DVIA Player']"], "vmlt": ["VAIO Video File", "Video format used by the Picture Motion Browser (PMB) or Windows Movie Maker (WMM) utilities on Sony VAIO computers; stores video data converted from other video formats, such as .AVI and MPEG.", "Windows, ", "['GSpot']"], "vmpl": ["VMware Policy File", "File used by VMware, an application used for running Windows, Linux, and other operating systems as virtual machines; defines authorizations and restrictions for the virtual machine; specifies access control to resources such as DVD-ROM drives, the company network, and the Internet.", "Windows, ", "['VMware ACE', 'VMware Workstation 12.5 Pro']"], "vmhr": ["VMware Hot Fix Request File", "File used by VMware ACE, an administration software used for managing VMware virtual machines; contains information for a technical support request generated by an end user for an issue with a virtual machine; can be processed by an administrator and responded to with a .VMHF hot fix file, which fixes the problem.", "Windows, ", "['VMware ACE']"], "vml": ["Vector Markup Language File", "File created in the XML-based Vector Markup Language (VML) format; contains XML code that describes a vector image; commonly embedded within published HTML pages to display vector images.", "Windows, ", "['Microsoft Word 2016', 'Microsoft Visio 2016', 'Microsoft PowerPoint 2016', 'Microsoft Internet Explorer', 'Apache OpenOffice']"], "vmhf": ["VMware Hot Fix File", "File used by VMware ACE, an application used for managing groups of virtual machines; contains information that fixes a problem that an end user has with a virtual machine instance; generated by the adminstrator after receiving a hot fix request (.VMHR file) from the end user; sent to the end user and can be double-clicked to apply the hot fix.", "Windows, ", "['VMware ACE']"], "vmg": ["Nokia Text Message", "Plain text format used for storing SMS text messages on Nokia cell phones; contains header information such as the sender, date, and time, as well as the actual message; saved in a null-separated text format, which makes it easy to parse.", "Windows, ", "['Nokia PC Suite']"], "vmf_autosave": ["Valve Hammer Editor Autosave File", "Auto-generated file created by Hammer Editor, a program used to build maps for Valve games such as Half-Life; stores an autosaved, backup copy of the currently opened .VMF file.", "Windows, ", "['Valve Hammer Editor']"], "vmf": ["Valve Map File", "Game level or map file created with the Valve Hammer Editor version 4 or later; used for creating custom levels for Half-Life, a first-person shooter game; stores level information in an XML-style format.", "Windows, Windows, Windows, ", "['Valve Hammer Editor', 'QuArK'][][]"], "vmdk-converttmp": ["VMWare Fusion Temporary File", "File created by VMWare Fusion, a program used for running software virtual machines; saved within a .VMWAREVM package and contains temporary information for the virtual machine.", "Windows, Mac, ", "['VMware Fusion 8.5']['VMware Fusion 8.5']"], "vna": ["JVC JLIP Image", "Still frame image captured by JLIP (Joint Level Interface Protocol) Video Capture, a program that is part of JVC's Multimedia Navigator software; contains an image captured from a video clip; used for storing an image from a JVC digital video camera recording.", "Windows, ", "[]"], "vmd": ["Covox Raw Sample", "Raw 8-bit audio sample format used by Covox Speech Thing and other audio products; an unformatted version of a Covox .VMF file.", "Windows, Windows, Mac, Linux, ", "[]['MikuMikuDance', 'PMD Editor', 'Blender with VMDMotionImporter']['Blender with VMDMotionImporter']['Blender with VMDMotionImporter']"], "vmdk": ["Virtual Machine Disk File", "Virtual disk that stores the contents of a VMware virtual machine hard disk; can be accessed as a physical hard disk with VMware software; typically named \"[vmname].vmdk;\" may be set at a fixed size or configured to grow over time using VMware's Virtual Disk Manager.", "Windows, Mac, Linux, ", "['VMware Workstation 12.5 Pro', 'WinMount International WinMount', 'Oracle VirtualBox', 'Gilles Vollant WinImage']['VMware Fusion 8.5', 'Oracle VirtualBox']['VMware Workstation 12.5 Pro', 'Oracle VirtualBox']"], "vmcx": ["Virtual Machine Shell Information File", "Virtual Machine (VM) shortcut file used by Windows Virtual PC, an emulation program used to run different versions of Windows; saved in an XML format and contains VM configuration parameters, such as the VM name, which .VMC file to load, and .VHD hard disk files.", "Windows, ", "['Microsoft Windows Virtual PC']"], "vmc": ["Windows Virtual Machine Configuration File", "Configuration file used by Windows Virtual PC, a component of Windows 7 that allows users to emulate different versions of Windows as virtual machines (VMs); saved in an XML format and includes parameters that describe the VM; loads the specified VM when opened.", "Windows, ", "['Microsoft Windows Virtual PC', 'Microsoft Virtual Server', 'VMware Workstation 12.5 Pro', 'VMware vCenter Converter']"], "vlx": ["Compiled AutoLISP File", "Compiled AutoLISP script written in the Virtual LISP language; used for creating macros that can be run within AutoCAD; similar to a .FAS file, but contains a multiple AutoLISP routines.", "Windows, ", "['Autodesk AutoCAD 2017']"], "vm": ["Velocity Template", "Developer file used by Velocity, a Java-based template engine; written using the Velocity Template Language (VTL); contains VTL statements inserted in a normal text document; often used for auto-generating Web source code and class skeletons.", "Windows, Mac, Linux, ", "['Apache Velocity']['Apache Velocity']['Apache Velocity']"], "vlw": ["Processing Font File", "Font file created by Processing, a program used for making images and animations; saves a collection of glyphs that were converted from another system font (Tools → Create Font in Processing); can be inserted into sketches and animations.", "Windows, Mac, Linux, ", "['Processing']['Processing']['Processing']"], "vmba": ["VMware Configuration File", "Settings file used by VMware virtualization software; saves the configuration settings that are used for starting and running the VM; may be used as an alternative extension to .VMX, but \".vmx\" is the default and recommended extension.", "Linux, ", "['VMware Workstation 12.5 Pro']"], "vmac": ["VMware Configuration File", "Virtual machine configuration file used by VMware virtualization software; can be used as an alternative extension to .VMX, although \".vmx\" is the default and recommended extension for VMs.", "Windows, ", "['VMware Workstation 12.5 Pro']"], "vlt": ["WinVault File Archive", "Secure container format (referred to as a \"vault\") that stores data encrypted with AES encryption; after files have been added to the vault, the file is secured with a password; may be opened by using WinVault's File→Extract option and providing the correct password.", "Windows, Windows, Linux, ", "[]['VideoLAN VLC media player', 'VideoLAN VLC Skin Editor']['VideoLAN VLC media player', 'VideoLAN VLC Skin Editor']"], "vlp": ["LiveSite Project", "Website project created with Valadeo LiveSite, an early Web development program; includes HTML pages, images, site settings, and other contents.", "Windows, ", "[]"], "vlg": ["VentaFax Logbook File", "File used by VentaFax, a program that allows users to send and receive faxes on a computer; contains a log of faxes that have been sent and received; used to maintain a history of faxes.", "Windows, ", "[]"], "vle": ["Virtual Labs Electricity Circuit File", "File created by Virtual Labs: Electricity, a program used for teaching and learning electricity principles through simulation; contains an electrical circuit design; used for storing electrical projects and simulating circuits in educational environments.", "Windows, Mac, ", "[][]"], "vlcl": ["VMware Localization File", "Application support file used by VMware virtualization software; saved in a plain text format and contains lists of localization information configurating the application for a particular language.", "Windows, Linux, ", "['VMware Workstation 12.5 Pro']['VMware Workstation 12.5 Pro']"], "vlc": ["VLC Playlist", "Media playlist used by VLC media player, a free, cross-platform audio and video playback program; saves a playlist in the exact same format as .M3U and .PLS files, but uses the \".vlc\" file extension so that it is natively recognized by VLC media player.", "Windows, Mac, Linux, ", "['VideoLAN VLC media player']['VideoLAN VLC media player', 'Macgo Mac Media Player']['VideoLAN VLC media player']"], "vlab": ["VisionLab Studio Project File", "Project file saved with Vision Lab Studio, a video compositing program used to add special effects to movies; includes effects, settings, and edits made by the user; saved in a proprietary format that can only be opened with VisionLab software.", "Windows, Mac, ", "[][]"], "vjsproj": ["Visual Studio J# Project", "A VJSPROJ file is a project created by Visual J# development software.  It contains project settings and references to source files used by the project.  VJSPROJ files are saved in the MSBuild format, which can be compiled into an executable program using the MSBuild platform.", "Windows, ", "['Microsoft Visual Studio 2017']"], "vjp": ["Visual Studio J++ Project", "A VJP file is a project created by Visual J++ development software.  It contains references to source files used by the project and project settings.  VJP files are saved in the MSBuild format, which can be compiled into an executable program using the MSBuild platform.", "Windows, ", "['Microsoft Visual Studio 2017']"], "vix": ["Lightworks Video Index File", "File created by Lightworks, a video editing application; similar to the .MXF file; contains video and audio data that describes AVCHD media files with the .MTS extension used by Lightworks; referenced by Lightworks to streamline the editing workflow.", "Windows, ", "['EditShare Lightworks']"], "vivo": ["VivoActive Video File", "Video format typically used for adult videos; VivoActive products were discontinued in 1997, but are still supported by RealPlayer.", "Windows, Mac, ", "['RealNetworks RealPlayer Cloud']['RealNetworks RealPlayer Cloud']"], "viv": ["Need for Speed Car Data File", "Data file used by Need for Speed 1-3 car racing games; contains vehicle data such as 3D models and sounds; used by the game to load racing cars; sometimes edited by game modders.", "Windows, Windows, Mac, Windows, Mac, ", "['VIV Editor', 'CAR3TO4', 'Electronic Arts Need for Speed'][][]['RealNetworks RealPlayer Cloud']['RealNetworks RealPlayer Cloud']"], "visual_processed": ["World of Tanks 3D Model Surface File", "3D model surface file format used by World of Tanks (WoT), a war game featuring battles between tanks and other armored vehicles; contains texture information about the surface of a tank 3D model; replaced the .VISUAL format with the release of WoT 0.9.10.", "Windows, ", "['Wargaming.net World of Tanks', 'World of Tanks Model Converter']"], "visual": ["World of Tanks 3D Model Surface File", "3D model surface file used by World of Tanks (WoT), a war game that features battles between tanks; stores texture and material information that covers 3D models used in the game.", "Windows, ", "['Wargaming.net World of Tanks']"], "vis": ["Visual Importer Script", "Script created by Visual Importer, a data conversion application; saves in a plain text format and stores data conversion settings recorded from the software's wizard walkthrough process; transforms data between source and destination formats when run in the software.", "Windows, Windows, ", "['DB Software Laboratory Visual Importer']['Microsoft Flight Simulator X Gold Edition']"], "vir": ["Virus-Infected File", "A VIR file is any type of file that has been infected with a computer virus and has been renamed by an antivirus software program, such as Symantec's Norton AntiVirus or Avira AntiVir.  The \".vir\" extension is typically appended to the filename (i.e. program.exe → program.exe.vir) to indicate the file is a virus and to prevent it from being executed.", "Windows, Mac, ", "['Symantec Norton Security 2017', 'Avira Antivirus Pro 2016', 'AdwCleaner']['Symantec Norton Security 2017']"], "vip": ["Virtual Instrument Package", "A VIP file is a virtual instrument (VI) package used by VI Package Manager (VIPM) to install add-ons to LabVIEW software.  It contains an add-on, which includes all the .VI files and resources used by VIPM software to install, remove, and manage the add-on.", "Windows, Mac, Linux, Windows, Windows, ", "['JKI VIPM']['JKI VIPM']['JKI VIPM'][]['MAGIX Samplitude Music Studio 2016']"], "vimrc": ["Vim Runtime Configuration File", "Settings file used by Vim, a text editing program often used by source code developers and system administrators; saves the default settings for the editor when it is opened; allows users to customize options for the editor.", "Windows, Mac, Linux, ", "['gVim']['MacVim', 'Vim']['Vim']"], "viivo": ["Viivo Encrypted File", "Encrypted file created by Viivo, a program that enables users to secure file before syncing them to cloud services; contains a file encrypted using AES-256.", "Windows, Mac, iOS, Android, ", "['PKWARE Viivo']['PKWARE Viivo']['PKWARE Viivo']['PKWARE Viivo']"], "vim": ["Vim Settings File", "Settings file used by Vim, a text editing program often used by source code developers; commonly used to save settings, such as syntax highlighting rules, for the text editor when it is opened; can be referenced within the .VIMRC settings file.", "Windows, Mac, Linux, ", "['gVim']['MacVim', 'Vim']['Vim']"], "viff": ["Visualization Image File Format", "Image file used by VisiQuest Khoros, an software development kit (SDK) used to develop imaging software and other visualization tools; stores a bitmap image using color \"bands;\" may optionally store one or more color maps.", "Windows, Mac, Linux, ", "['Newera Graphics Converter Pro', 'GraphicRegion.com Able Batch Converter', 'XnViewMP']['XnViewMP']['XnViewMP']"], "viewlet": ["Qarbon Viewlet", "Interactive Flash presentation created by Qarbon presentation software; contains the Flash .SWF file, an .HTML file, and the .QVP source file, which stores images, audio files, and other resources; used for storing project assets together.", "Windows, Mac, Linux, ", "['Qarbon ViewletBuilder', 'Adobe Flash Player']['Qarbon ViewletBuilder', 'Adobe Flash Player']['Qarbon ViewletBuilder', 'Adobe Flash Player']"], "video": ["aTube Catcher Video File", "Video file created by aTube Catcher, a program used for downloading YouTube videos to the local computer; saves the raw video downloaded from YouTube; can be converted to various video formats such as .WMV, .AVI, .3G2, and .MP4.", "Windows, ", "['DsNET aTube Catcher']"], "vid": ["Generic Video File", "Video file that may be saved in one of many formats; often the file extension has been changed from the original extension to \".VID;\" for example, if the file \"clip1.mov\" was changed to \"clip1.vid,\" it could be played by Apple QuickTime Player.", "Windows, Mac, ", "['Apple QuickTime Player', 'Microsoft Windows Media Player', 'video player']['Apple QuickTime Player', 'video player']"], "vicar": ["VICAR Image File", "Raster image format developed by NASA's Jet Propulsion Laboratory; stores an image that has been taken on a mission by NASA's spacecraft; also contains information that describes the structure and type of data along with a history of processing that has been done to the image.", "Windows, ", "['XnView']"], "vhv": ["Valve Source Lighting File", "File used by the Valve Source 3D game engine; stores lighting information for a map and often can be found with .VTF, .VTM, and other Valve 3D files; used for providing realistic lighting and shadows in the 3D environment.", "Windows, ", "['Valve Source']"], "vi": ["LabVIEW Virtual Instrument File", "Program created with LabVIEW, a scientific testing and measurement application; referred to as a \"virtual instrument\" because it imitates the appearance and operation of a physical instrument, such as a multimeter or oscilloscope.", "Windows, Mac, Linux, ", "['National Instruments LabVIEW']['National Instruments LabVIEW']['National Instruments LabVIEW']"], "vic": ["ViziGen Code Import Mappings File", "Contains import mappings used by ViziGen, a software development program for generating source code files for any programming language; controls how information from a UML modeling tool is imported into ViziGen.", "Windows, Windows, Mac, Linux, ", "[]['Newera Graphics Converter Pro', 'XnViewMP']['XnViewMP']['XnViewMP']"], "vgz": ["DigitalVDO Compressed Video File", "Video file recorded using a VGuard digital video card or a DigitalVDO security camera (CCTV) system; compressed using Super Motion Image Compression Technology (SMICT); can be played back using VG Player.", "Windows, Windows, Mac, Linux, ", "[]['Audio Overload', 'Nullsoft Winamp with Chipamp plug-in']['Audio Overload', 'Cog']['Audio Overload']"], "vhdl": ["VHDL Source File", "A VHDL file is a source file written in the VHDL language, which stands for Very High Speed Integrated Circuits (VHSIC) Hardware Description Language (HDL).  It may be used to specify how a circuit and its components operate and are implemented.  It is similar to the .VHD file but less common.", "Windows, Mac, Linux, ", "['File Viewer Plus', 'Xilinx ISE Design Suite', 'Mentor Graphics ModelSim', 'Green Mountain DirectVHDL', 'text editor']['Green Mountain DirectVHDL', 'text editor']['Xilinx ISE Design Suite', 'Mentor Graphics ModelSim', 'text editor']"], "vhdx": ["Windows 8 Virtual Hard Drive File", "Disk image supported by the Windows 8 and Windows Server 8 operating systems; extends the .VHD format with new capabilities, such as performance improvements, data corruption prevention mechanisms, and a 16TB maximum allowable size.", "Windows, ", "['Microsoft Windows', 'Microsoft Windows Server 2016']"], "vgm": ["Video Game Music File", "Audio file used by some Yamaha and Texas Instruments sound chips that were included with older video game systems; contains video game audio that can be synthesized by the sound chip; can be played with computer software that emulates the sound chip.", "Windows, Mac, Linux, ", "['Audio Overload', 'Nullsoft Winamp with Chipamp plug-in', 'Foobar2000 with vgmstream decoder plug-in']['Audio Overload']['Audio Overload', 'Audacious']"], "vhd": ["VHDL Source File", "Source file written in VHDL, which stands for Very High Speed Integrated Circuits (VHSIC) Hardware Description Language (HDL); often used for automating the design of electrical circuits and components.", "Windows, Mac, Linux, Windows, Mac, Linux, ", "['File Viewer Plus', 'Xilinx ISE Design Suite', 'Mentor Graphics ModelSim', 'Green Mountain DirectVHDL', 'text editor']['Green Mountain DirectVHDL', 'text editor']['Xilinx ISE Design Suite', 'Mentor Graphics ModelSim', 'text editor']['Microsoft Windows Virtual PC', 'Microsoft Virtual Server', 'Oracle VM VirtualBox', 'VMware Workstation 12.5 Pro', '7-Zip']['Oracle VM VirtualBox', 'VMware Fusion 8.5']['Oracle VM VirtualBox', 'VMware Workstation 12.5 Pro']"], "vgi": ["Vista Game Explorer Editor Game File", "File created by Vista Game Explorer Editor (VGEE), a program that alters Windows Vista's Games window to handle more games; saves game information exported from the program; allows the data to be transferred between versions of the program and when installing Windows Service Packs.", "Windows, ", "['Vista Game Explorer Editor']"], "vgd": ["Generic CADD VGA Driver", "Driver for a generic Computer-Aided Drafting and Design VGA monitor; used by the Windows operating system to communicate display settings, such as screen resolution and color depth; similar to a .VGA driver file, but only used by special CADD displays.", "Windows, ", "[]"], "vgc": ["ViziGen Code Generation Template", "Template used by ViziGen, a software development tool for generating source code files; provides a starting point for generating new source code in a specific programming language.", "Windows, ", "[]"], "vga": ["VGA Display Driver", "Windows driver that supports VGA monitors; allows the user to adjust the resolution and color depth of the display using the Monitors control panel; used in early versions of Windows when VGA monitors were commonly used.", "Windows, ", "[]"], "vfz": ["Creative Webcam Video Effects File", "File used by Live! Cam, a program that allows users to chat online using Creative webcams; contains effects that morph or overlay video feeds; used to enhance social online chatting with fun and creative effects.", "Windows, Mac, Linux, ", "[][][]"], "vfs0": ["Metro 2033 Sound File", "Game file used by Metro 2033 and Metro: Last Light, a post-apocalyptic video game that takes place in Moscow; contains .OGG sound files used by the game for music and sound effects.", "Windows, Mac, Linux, ", "['4A Games Metro 2033', '4A Games Metro: Last Light', 'Metro 2033 Mod Tools']['4A Games Metro 2033', '4A Games Metro: Last Light', 'Metro 2033 Mod Tools']['4A Games Metro 2033', '4A Games Metro: Last Light', 'Metro 2033 Mod Tools']"], "vfw": ["Video for Windows", "Video format similar to the .AVI format.", "Windows, Mac, ", "['Apple QuickTime Player', 'Microsoft Windows Media Player']['MPlayerX', 'Eltima Elmedia Player', 'Apple QuickTime Player']"], "vft": ["VideoStudio Filter File", "Video filter used by VideoStudio, a video-editing application developed by Corel (developed formerly by Ulead); stores settings for an effect that modifies the look of a video; can apply effects such as cartoonizers and black and white color.", "Windows, ", "['Corel VideoStudio Pro X10 Ultimate']"], "vfs": ["Virtual File System Index", "File containing an index of directories and files stored on a hard drive or other media device; used for creating a virtual file system, which can speed up browsing and searching for files.", "Windows, Mac, Linux, Windows, ", "[][]['mount'][]"], "vff": ["Sun TAAC Graphic File", "Sun Microsystems standard raster image file format; used on Sun workstations and supported by the TAAC-1 Application Accelerator; exported by the Xilch program in Sun's XIL Test Suite.", "Windows, Mac, ", "['XnViewMP']['Lemkesoft GraphicConverter', 'XnViewMP']"], "vfd": ["Virtual Floppy Disk", "Disk image file used by Microsoft Virtual PC, an emulation software for Windows operating systems; saves the data for a 1.44MB floppy disk in its raw format; enables a \"virtual\" disk to be mounted and recognized as if it were a physical disk.", "Windows, ", "['Microsoft Virtual PC', 'Microsoft Virtual Server', 'Gilles Vollant WinImage']"], "vep": ["AVS Video Editor Project File", "Video editing project created by AVS Video Editor, a program used for making movies and home videos; saves the movie timeline and references to audio and video clips, which are stored in a \\Content\\ folder alongside the project.", "Windows, ", "['Online Media Technologies AVS Video Editor']"], "vfb": ["FontLab Studio Font File", "Font file created by FontLab Studio, a font authoring program; contains a designed font, which includes the glyphs that make up the alphabet and other symbols; stores the font in a vector format so that the glyphs can be scaled without losing quality.", "Windows, ", "['FontLab Studio', 'FontLab Fontographer', 'FontLab TypeTool', 'FontLab TransType Pro']"], "vfc": ["VentaFax Cover Page File", "File used by VentaFax, a program used to send and receive faxes with a computer; contains a page layout to send with a fax; used as the cover page of a fax sent in VentaFax.", "Windows, ", "[]"], "vexe": ["Virus Executable File", "Executable file that contains a virus; renamed from .EXE to \".vexe,\" where \"v\" stands for virus; may have been renamed manually or by an antivirus program; may have been distributed through malware programs on infected computers.", "Windows, ", "[]"], "ver": ["Version Record", "Defines the version of a certain software program, such as TurboTax or RealPlayer; saved along with the application and is not meant to be opened or edited by the user.", "Windows, Mac, ", "['Intuit TurboTax Deluxe', 'RealNetworks RealPlayer Cloud']['Intuit TurboTax Deluxe', 'RealNetworks RealPlayer Cloud', 'ESET Cybersecurity for Mac']"], "vf": ["Vegas Movie Studio Project File", "Video editing project created with MAGIX Vegas Movie Studio; saves the project timeline, effects, transitions, and references to the video and audio clips used by the project; can be exported to a DVD using Vegas Movie Studio+DVD or Vegas+DVD software.", "Windows, ", "['MAGIX Vegas Pro 14']"], "vet": ["Lectra Cutter's Must File", "CAD file used by Lectra Modaris, a clothing design application; includes the \"cutter's must\" information, which describes the apparel style and the list of pieces to be cut; used with a corresponding .IBA file, which contains the geometry for the garment's pieces.", "Windows, ", "['Lectra Modaris', 'SoftFashion StyleCAD', 'PAD Pattern Design']"], "vem": ["Meta Media Video E-Mail File", "Video file created with Meta Media software; may be exported from digital recording devices, such as video conferencing, video entertainment, video surveillance equipment, and web cams.", "Windows, Windows, ", "[][]"], "veh": ["Vehicle File", "Vehicle file used by Star Wars Jedi Knight: Jedi Academy, a Star Wars game where the player chooses to have their Jedi character choose the light or dark side path; contains data for vehicles that are accessed throughout the game, such as the different driving capabilities of the vehicle.", "Windows, Mac, ", "['Raven Software Star Wars Jedi Knight: Jedi Academy']['Raven Software Star Wars Jedi Knight: Jedi Academy']"], "vdx": ["Visio Drawing XML File", "Drawing or chart created with Microsoft Visio, a program for creating business diagrams and flowcharts; similar to a standard .VSD file, but saved in an XML format.", "Windows, Mac, iOS, Windows, ", "['File Viewer Plus', 'Microsoft Visio 2016', 'CS Odessa ConceptDraw PRO']['CS Odessa ConceptDraw PRO', 'The Omni Group OmniGraffle', 'Nektony VSD Viewer']['Nektony VSD Viewer']['Trilobyte The 7th Guest', 'The 7th Guest Toolset']"], "vec": ["CX-Designer Shape File", "Vector shape used by CX-Designer, a program used for designing the screen interface for OMRON's Programmable Terminals (PTs); saves a shape that can act as a graphic on the screen.", "Windows, Windows, Windows, ", "['OMRON CX-Designer']['Orbiter', 'text editor']['SuperMap Desktop GIS']"], "veg": ["Vegas Video Project", "Video project created with MAGIX Vegas, a professional video editing and disc authoring application.  It contains a timeline with audio and video tracks, transitions, text content, special effects, and references to project media, such as video and audio files used by the project.", "Windows, Windows, Mac, ", "['MAGIX Vegas Pro 14']['E-on Vue']['E-on Vue']"], "vegaswindowlayout": ["MAGIX Vegas Window Layout File", "Settings file created by MAGIX Vegas, a video editing application; stores the locations and sizes of user interface panels; allows users to save different arrangements of the user interface for different editing needs.", "Windows, ", "['MAGIX Vegas Pro 14']"], "vdw": ["Visio Web Drawing", "Drawing created by Visio, a technical drawing and illustration program; saves a chart, diagram, or other illustration, but is saved specifically for use on the Web rather than for opening in Visio.", "Windows, ", "['File Viewer Plus', 'Microsoft Visio 2016']"], "vdr": ["VirtualDub Signpost File", "File created by VirtualDub, a program primarily used for editing .AVI movie clips in Windows; hosts frame by frame video data that can be converted and served to programs using specific properties set in VirtualDub; used to supply compatible video formats to video editing programs.", "Windows, ", "['VirtualDub']"], "vdo": ["VDOLive Media File", "Video or audio file format used for broadcasting live media from websites; known for its broadcast quality that adapts to individual user connections; discontinued in 1998.", "Windows, Mac, Windows, ", "['Web browser'][][]"], "vdp": ["Visual Studio Deployment Project", "Setup and deployment project created by Visual Studio, a Microsoft application used to develop Windows programs; contains settings for building and packaging a project; commonly used for deploying installer files, such as .MSI files.", "Windows, ", "['Microsoft Visual Studio 2017']"], "vdproj": ["Visual Studio Setup and Deployment Project", "Software development project created by Visual Studio, an application that allows developers to create Windows programs; stores project build settings and file references; often used for building and packaging Windows installation programs.", "Windows, ", "['Microsoft Visual Studio 2017']"], "vdm": ["VDM Specification File", "Source code of a program based on VDM (the Vienna Development Method), a set of techniques for modeling computing systems; contains code written in VDM-SL (the VDM Specification Language) or VDM++.", "Windows, Mac, Linux, Windows, ", "['text editor']['text editor']['text editor']['Microsoft Notepad', 'text editor']"], "vdjsend": ["VirtualDJ Send File", "Data file used by VirtualDJ, an audio and video mixing software featuring the BeatLock engine, which provides automatic loop and beat synchronization; saved in a plain text format and contains audio information; saved to the [user]\\My Documents\\VirtualDJ\\ directory in Windows.", "Windows, Mac, ", "['Atomix Productions VirtualDJ']['Atomix Productions VirtualDJ']"], "vdb": ["Symantec Virus Database File", "Virus database file used by Symantec AntiVirus, a program that protects company computers against viruses; contains virus definition updates; used to distribute virus definitions from an AntiVirus server to clients when new viruses are discovered.", "Windows, ", "['Symantec EndPoint Protection 12']"], "vdj": ["VirtualDJ Audio Sample File", "Audio file used by VirtualDJ, a disc jockey digital mixing application; similar to an .OGG file and contains an audio sample that can be included into song mixes; can be shared on the VirtualDJ website, but only if you have a purchased a software license.", "Windows, Mac, ", "['Atomix Productions VirtualDJ']['Atomix Productions VirtualDJ']"], "vdi": ["VirtualBox Virtual Disk Image", "Virtual drive format used by Oracle VM VirtualBox, an open-source desktop virtualization program; can be mounted as a hard disk on Mac, Windows, and Unix platforms; allows users to run programs written for different operating systems in a high-speed virtual environment.", "Windows, Mac, Linux, Windows, Windows, ", "['Oracle VM VirtualBox']['Oracle VM VirtualBox']['Oracle VM VirtualBox']['EZB Systems UltraISO', 'WinMount International WinMount', 'MagicISO']['StepMania']"], "vda": ["Targa Bitmap Image File", "Raster image formatted in the Targa Truevision format; stores image data using 1 to 32 bits per pixel, with 24 bits possible for the RGB data and 8 bits for the alpha (opacity)channel.", "Windows, Mac, ", "['Adobe Photoshop CC 2017', 'Adobe Photoshop Elements 15', 'Adobe Illustrator CC 2017', 'ACD Systems Canvas X 2017', 'fCoder Group Image Converter Plus']['Adobe Photoshop CC 2017', 'Adobe Photoshop Elements 15', 'Adobe Illustrator CC 2017']"], "vdf": ["Valve Data File", "A VDF file is a data file format used by Valve's Source game engine.  It contains various kinds of game metadata, including data for resources, installation scripts, configuration scripts, and visualization elements.", "Windows, Windows, Windows, Windows, ", "['Valve Source SDK', 'Microsoft Notepad', 'text editor']['Avira Antivirus Pro 2016']['VirtualDub'][]"], "vdc": ["IDRISI Vector Documentation File", "GIS image metadata file created by IDRISI Taiga, a GIS imaging application; describes the data stored in a .VCT vector image file; can include coordinate information as well as a reference to geographic projection data that is used to draw the image according to measurement units.", "Windows, ", "['Clark Labs IDRISI Selva', 'Clark Labs Land Change Modeler', 'Safe Software FME Desktop', 'ESRI ArcGIS for Desktop', 'Blue Marble Geographics Global Mapper']"], "vdata": ["Vaulty Vault File", "File created by Vaulty, an Android application used to hide and keep secret images and videos on Android devices; contains an encoded picture or video file, such as a .PNG, .JPG, or .3GP file.", "Android, ", "['Squid Tooth Vaulty']"], "vcxproj": ["Visual C++ Project", "A VCXPROJ file is a software development project created by Visual C++, a component of Microsoft Visual Studio used to develop programs in C++.  It stores project information in an XML format, including references to source code files and application assets.  The file is used for developing and building executable programs.", "Windows, ", "['Microsoft Visual Studio 2017']"], "vcx": ["Virtual Disc Definition File", "File created by Virtual CD Editor, a disc editing program included with the Virtual CD software; saves the list of files that will be burned to the disc; used for creating the disc image, which is comprised of a .VC4 file and .000, \".001,\" \".002,\" etc. data files.", "Windows, Windows, ", "['H+H Software Virtual CD']['Microsoft Visual FoxPro']"], "vct": ["IDRISI Vector Image", "GIS image created by IDRISI Taiga, a GIS application used for analyzing and visualizing geospatial images; stores vector data using connected points rather than raster data used by IDRISI's .RST files.", "Windows, Windows, Windows, Mac, ", "['Clark Labs IDRISI Selva', 'Clark Labs Land Change Modeler', 'Safe Software FME Desktop', 'ESRI ArcGIS for Desktop', 'Blue Marble Geographics Global Mapper']['Microsoft Visual FoxPro']['MindVision Installer VISE for Windows']['MindVision VISE X', 'MindVision Installer VISE for Macintosh']"], "vcw": ["eMbedded Visual C++ Workspace File", "Saved workspace file created by eMbedded Visual C++ (eVC), a software development tool used to create Windows CE (Compact Edition) programs for .NET powered devices; contains layout settings for eVC's IDE; used for storing a customized project workspace during development.", "Windows, ", "['Microsoft eMbedded Visual C++', 'Microsoft Visual Studio 2017']"], "vcv": ["ViewCave Video File", "Proprietary video format developed by ViewCave International; used for distributing free-to-view legal content monetized by unobtrusive overlay ads; can be viewed with ViewCave's VCV Player.", "Windows, Mac, Linux, ", "['ViewCave VCV Player']['ViewCave VCV Player']['ViewCave VCV Player']"], "vcs": ["vCalendar Event File", "Contains information about an event or appointment, which can be imported into a calender or scheduling program; saved in the vCalendar \"Electronic Calendaring and Scheduling Exchange\" format; includes the event date and time and other information about the event.", "Windows, Mac, Linux, Android, ", "['Microsoft Outlook 2016']['Apple Calendar', 'Microsoft Outlook 2016']['Calligra Suite', 'Evolution'][]"], "vcrd": ["Windows Vault Credentials File", "File created by Windows Vault, a security program introduced with Windows 7 that can store user names and passwords for Windows users; contains the users credentials (passwords, etc.) in an encrypted format; requires an associated schema file (.VSCH) and policy file (.VPOL) in order for user credentials to be verified.", "Windows, ", "['Microsoft Windows Vault', 'Passcape Password Recovery']"], "vcr": ["ATI Video Card Recording", "Video file recorded by ATI video cards through the ATI Multimedia Center, a program bundled with ATI video card purchases; contains video data recorded from the computer's screen while running programs; used to capture video game replays or TV on the computer.", "Windows, ", "['ATI Multimedia Center']"], "vcproj": ["Visual C++ Project File", "Programming project created with Visual C++, a component of Microsoft Visual Studio; includes project settings and references to files used by the project; serves as a central file that organizes the project files; formatted in XML.", "Windows, ", "['Microsoft Visual Studio 2017']"], "vcpref": ["Norton Antivirus Preferences File", "File used by Norton AntiVirus, an antivirus program for personal computers; contains preferences for Norton AntiVirus; may reside on a computer even after Norton AntiVirus has been deleted.", "Windows, ", "['Symantec Norton Security 2017']"], "vcpf": ["VideoConvert Project File", "Project file created by Roxio Video Copy & Convert, a program included with Roxio Creator; stores settings for converting a video file from one format to another; enables users to save reusable conversion settings.", "Windows, ", "['Roxio Creator NXT Pro 5']"], "vcp": ["eMbedded Visual C++ Project File", "Software development project created by eMbedded Visual C++ (eVC), a Microsoft application used to develop programs for the Windows CE (Compact Edition) platform; contains project settings as well as references to source code files and project assets.", "Windows, ", "['Microsoft eMbedded Visual C++', 'Microsoft Visual Studio 2017']"], "vcomps": ["V-Comp Setup File", "Setup file used by V-Comp, an automated fluorescence compensation utility; contains settings such as the name of single-color controls, which parameters are compensated, and one or more unstained controls; also includes the crossover matrix created by V-Comp.", "Windows, Mac, ", "['Verity Software House V-Comp']['Verity Software House V-Comp']"], "vce": ["Visual CertExam Exam File", "Test or exam created with Visual CertExam Suite (which includes both Visual CertExam Designer and Visual CertExam Manager); used for creating tests for IT certification; contains a list of questions and answer possibilities that can be compiled into a certification exam.", "Windows, Windows, Mac, Linux, ", "['Visual CertExam Suite']['Audacity', 'Steinberg Cubase']['Audacity', 'Steinberg Cubase']['Audacity']"], "vco": ["Virtual CD Collection File", "Disc image file created by Virtual CD, a program used for virtualizing physical discs as files on the hard drive; created by the software's Collection Wizard and contains a grouping of virtual CDs; allows up to 255 virtual CDs to be inserted together as a single disc.", "Windows, ", "['H+H Software Virtual CD']"], "vcm": ["Vice City Mod Manager File", "Mod file created with Vice City Mod Manager; contains modifications that can be applied to the video game Grand Theft Auto: Vice City (GTAVC); may contain custom vehicles and other information.", "Windows, ", "[]"], "vcf": ["vCard File", "A VCF file is a standard file format for storing contact information for a person or business.  It typically includes a name, address, phone number, e-mail address, and other contact information.  VCF files also support custom fields, images, and other types of media.", "Windows, Mac, Web, ", "['Microsoft Windows Contacts', 'Microsoft Outlook 2016', 'Microsoft Outlook Express', 'Palm Desktop', 'Beiley Handy Address Book', 'Fonlow IT Open Contacts', 'vCardOrganizer', 'Nokia PC Suite']['Apple Contacts', 'Microsoft Outlook 2016', 'Palm Desktop', 'vCardExplorer']['FreshBooks']"], "vcd": ["Virtual CD", "A VCD file is a disc image of a CD or DVD and is recognized by Windows as an actual disc, even though the data is on the hard drive.  VCD files allow CDs and DVDs to be used without requiring physical drives and is useful for mounting discs on network computers.", "Windows, Mac, Windows, Linux, Windows, Windows, ", "['H+H Software Virtual CD', 'Roxio Creator NXT Pro 5', 'WinMount International WinMount']['Roxio Toast 15', 'Roxio Popcorn', 'MPlayer']['Altera Quartus II'][]['FarStone VirtualDrive 16 Pro', 'EZB Systems UltraISO']['Valve Source SDK']"], "vc8": ["Virtual CD 8 Disc Image", "Disc image created by Virtual CD 8 disc authoring software; specific to version 8 of the software and stores disc data; enables the raw contents of a disc to be stored as an exact copy on the hard disk.", "Windows, ", "['H+H Software Virtual CD']"], "vc6": ["Virtual CD 6 CD Image", "Disc image format used by Virtual CD 6, a disc authoring application; specific to version 6 of the software only and contains data for a disc; used for storing the contents of CDs on the hard drive.", "Windows, ", "['H+H Software Virtual CD']"], "vc3": ["VSampler Soundbank File", "Collection of compressed sound samples for VSampler, a 255 voice polyphonic software sampler; can be loaded into the sampler and played back via software or a MIDI controller input.", "Windows, Mac, ", "[][]"], "vc1": ["VC-1 Video File", "High definition video format that uses the SMPTE 421M video codec developed by Microsoft; one of multiple possible video formats used for Blu-ray and HD DVD discs; supports both interlaced and progressive encoding.", "Windows, Mac, ", "['Microsoft Windows Media Player', 'Media Player Classic', 'CyberLink PowerDVD 16']['MPlayerX']"], "vc": ["Verge Code File", "Verge source code file; contains code written in Verge (Vecna's Extraordinary Roleplaying Game Engine); designed for programming RPGs (Role Playing Games), but can be used to create other types of games as well.", "Windows, ", "[]"], "vbx6settings": ["VirusBarrier X6 Settings File", "File used by VirusBarrier, an anti-virus program for Mac OS X; saves application settings such as when virus scans are executed; allows settings to be saved and imported into another copy of VirusBarrier.", "Mac, ", "['Intego VirusBarrier X9']"], "vc4": ["Virtual CD Disc Image", "File created by H+H Software Virtual CD disc imaging software; stores an exact copy of a disc and can be mounted without requiring the physical CD to be inserted; recognized by several disc authoring programs.", "Windows, Windows, ", "['H+H Software Virtual CD', 'Smart Projects IsoBuster', 'EZB Systems UltraISO', 'MagicISO']['text editor']"], "vbz": ["Visual Basic Project Template", "Project template for a Visual Basic software development project; contains a standard interface and settings for creating similar projects; used by the Visual Basic Application Setup Wizard.", "Windows, ", "['Microsoft Visual Studio']"], "vbx": ["Visual Basic Custom Control", "Extension that expands the capabilities of Visual Basic scripts and programs; included with the Microsoft Visual Basic Control Development Kit (CDK); can be debugged using the Windbg debugger (WinDbg.exe) or CodeView for Windows (Cvw.exe).", "Windows, ", "['Microsoft Windbg']"], "vbw": ["Visual Basic Workspace File", "Project file created by Visual Basic, a Microsoft programming environment that has been discontinued; generated automatically by the application and contains references to forms and other files used for the project; created when saving development projects.", "Windows, ", "['Microsoft Visual Studio']"], "vbproj": ["Visual Studio Visual Basic Project", "Visual Basic project file created with Microsoft Visual Studio; saved in an XML format and contains information about the project, such as the application platform, version, and related files.", "Windows, ", "['Microsoft Visual Studio 2017']"], "vbt": ["Spyware Doctor Temporary Scan File", "Temporary file created by Spyware Doctor, a virus, spyware, and threat scanning program; contains sections of files and archives that include possibly malicious code; generated during each virus scan and saved in the C:\\Program Files\\Spyware Doctor\\avdb\\temp\\ directory; AVDB stands for AntiVirusDatabase.", "Windows, Mac, ", "['PC Tools Spyware Doctor']['PC Tools iAntiVirus']"], "vbscript": ["Visual Basic Script", "Executable script written in Visual Basic; commonly used to automate tasks in Windows.", "Windows, ", "['Microsoft Visual Studio 2017', 'Microsoft WScript', 'text editor']"], "vbs": ["VBScript File", "Virtual Basic script written in the VBScript scripting language; contains code that can be executed within Windows or Internet Explorer via the Windows-based script host (Wscript.exe); may also use the .VB file extension.", "Windows, Mac, ", "['Microsoft Visual Studio 2017', 'Adobe Dreamweaver CC 2017', 'Microsoft WScript', 'text editor']['Adobe Dreamweaver CC 2017', 'text editor']"], "vbr": ["GIMP Parametric Brush File", "Parametric brush used by GIMP, a cross-platform image editing program that runs on the X Windows System; contains a shape that can be painted on a canvas; can be resized for drawing with larger or smaller-scale brushes.", "Windows, Mac, Linux, ", "['GIMP']['GIMP']['GIMP']"], "vbpf1": ["Virtual Business - Personal Finance Data File", "Data file saved by Virtual Business - Personal Finance, a financial education program that helps students learn and practice key financial skills; contains saved simulation data such as game bank accounts, bills, credit and debit cards, taxes, insurance, credit scores, and investing information.", "Windows, ", "[]"], "vbp": ["Visual Basic Project File", "Project file created by Visual Basic, a software development tool for Windows; stores project information in a plain text format; includes references to project resources such as forms (.FRM files), source code files (.BAS extension), and class modules (.CLS files); can be built into a Windows program executable (.EXE).", "Windows, ", "['Microsoft Visual Studio']"], "vap": ["Dialogic Indexed Voice Audio File", "Voice recording file created in Dialogic's VAP file format; contains an indexed, or annotated, collection of .VOX or .WAV files, which use ADPCM (Adaptive Differential Pulse Code Modulation) encoding and specific sampling frequencies.", "Windows, Mac, ", "['Syntellect VoiceXML Studio', 'FMJ-Software Awave Studio']['Audio Ease BarbaBatch']"], "vala": ["Vala Source Code File", "Developer file written in Vala, a programming language used for developing GNOME applications using the GObject system; uses a syntax similar to C# and can be compiled into C code using valac the Vala compiler.", "Linux, ", "['valac', 'text editor']"], "val": ["Valodas Dictionary File", "Dictionary of words used by \"valodas,\" a free language learning software program; features word learning, repetition, and spelling help; the dictionary file can be edited and updated by the user.", "Windows, Mac, Linux, Windows, Windows, ", "[][][]['dBase']['Olympus DSS Player Lite']"], "vag": ["PlayStation Compressed Sound File", "4-bit compressed sound format used by PlayStation and PlayStation Portable games; compressed using ADPCM (Adaptive Differential Pulse Code Modulation) encoding.", "Windows, ", "['MFAudio', 'Nullsoft Winamp with in_cube plugin']"], "vac": ["Oc2.316s Cakit File", "Computer Algebra kit; contains a large set of classes for polynomial computing and arbitrary precision integer arithmetic.", "Windows, Mac, Windows, ", "[][]['MikuMikuDance']"], "v64": ["Nintendo 64 ROM Dump", "Data \"dumped\" to a file from a Nintendo 64 ROM cartridge using Doctor V64; also called a \"byteswapped\" ROM image; can be played on Mac and Windows computers using N64 emulation software.", "Windows, Mac, ", "['Project64', 'Nemu64', 'Daedalus', 'UltraHLE']['Mupen64Plus', 'sixtyforce']"], "v3o": ["Emergency 3 and 4 Model File", "Three-dimensional model used by Emergency, a game where players manage emergency situations and rescue scenarios; contains a 3D mesh, which is made up of vertices and connections in a 3D space; may be painted with raster graphic textures.", "Windows, ", "['Sixteen Tons Entertainment Emergency 4', 'Zanoza ZModeler']"], "v2m": ["V2 Synthesizer Audio File", "Audio file used by 64k and 96k demos developed by Farbrausch including fr-08: .the .product and .kkrieger; created with the V2 synthesizer system which encodes the audio as a series of instructions that are played by a synthesizer, similarly to the .MOD, .XM, and .S3M formats.", "Windows, ", "['V2M Synthesizer System', 'Nullsoft Winamp with Farbrausch v2m plugin']"], "v2i": ["Norton Ghost Virtual Volume Image", "Disk image backed up from a current volume using Norton Ghost; contains a base backup of everything on the hard disk; may be mounted as a new volume or restored to another disk using Norton Ghost.", "Windows, ", "['Symantec Ghost Solution Suite']"], "v264": ["v264 IPROBOT3 Video File", "A V264 file is a video created by IPROBOT3, a Internet protocol camera used for surveillance.  It stores a video saved in the v264 format which is a modified version of the H.264 video compression standard.", "Windows, ", "['V264Player']"], "v3d": ["Visual3D.NET Data File", "Contains data used by Visual3D.NET, a shader-based 3D engine and design toolset built on Microsoft .NET and XNA; also named \".v3d[type],\" such as \".v3dMedia,\" for media data, \".v3dScene\" for 3D scenes, and \".v3dAssets\" for 3D assets.", "Windows, ", "[]"], "v12": ["All The Right Type Database File", "Database file used by All The Right Type, an educational program used to teach students keyboard typing skills; stores teacher and student performance records; enables teachers to track progress and create reports; generally handled in the background by the software and not manually opened or edited by the user.", "Windows, Mac, ", "['Ingenuity Works All The Right Type']['Ingenuity Works All The Right Type']"]}