{"w": ["OpenEdge Architect Source Code File", "Source code file used by OpenEdge Architect, an IDE used to develop software programs; contains program code, procedures, and forms that are used to compile an application; can be opened and edited in the AppBuilder perspective.", "Windows, Windows, ", "[]['Microsoft Internet Explorer with Google Toolbar plug-in']"], "wallet": ["MultiBit Wallet File", "A WALLET file is a file created by Multibit, an international Bitcoin wallet used to perform Bitcoin transactions.  It contains private keys and transactions referenced in the transactions of the BitCoin currency.", "Windows, Mac, Linux, Windows, ", "['Bitcoin Solutions MultiBit']['Bitcoin Solutions MultiBit']['Bitcoin Solutions MultiBit'][]"], "wal": ["Winamp Modern Skin", "Custom modern skin used to modify the interface of Winamp, a music-playing program for Windows", "Windows, Windows, Mac, ", "['Nullsoft Winamp']['id Software Quake 2']['id Software Quake 2']"], "wav": ["WAVE Audio File", "A WAV file is an audio file that uses a standard digital audio file format utilized for storing waveform data.  It allows audio recordings to be saved with different sampling rates and bitrates and are often saved in a 44.1 KHz, 16-bit, stereo format, which is the standard format used for CD audio.", "Windows, Mac, Linux, Web, iOS, Android, Windows, Mac, ", "['File Viewer Plus', 'Microsoft Windows Music', 'Microsoft Windows Media Player', 'Microsoft Groove Music', 'Apple iTunes', 'Apple QuickTime Player', 'Roxio Creator NXT Pro 5', 'Nullsoft Winamp', 'Xilisoft Video Converter Ultimate', 'RealNetworks RealPlayer Cloud', 'VideoLAN VLC media player', 'Adobe Audition CC 2017', 'Clementine', 'music player']['Apple iTunes', 'Apple QuickTime Player', 'Roxio Toast 15', 'Eltima Elmedia Player', 'RealNetworks RealPlayer Cloud', 'VideoLAN VLC media player', 'Adobe Audition CC 2017', 'Clementine', 'music player']['XMMS', 'VideoLAN VLC media player', 'Clementine', 'music player']['Google Drive']['olimsoft OPlayer']['File Viewer for Android', 'antvplayer Media Converter']['Foobar2000'][]"], "wax": ["Windows Media Audio Redirect", "Audio shortcut file used by Windows Media Player, the default Windows multimedia playback program; saves a shortcut to a Windows Media audio (.WMA) file on the Internet; saved in a plain text format and contains the URL location of the audio file, but not the audio data itself.", "Windows, ", "['Microsoft Windows Media Player', 'VideoLAN VLC media player']"], "wagame": ["Worms Armageddon Game Recording", "Recorded Worms Armageddon game; records all the action from the beginning to the end of a Worms battle; enabled by installing the Worms Armageddon update and running the game at least once.", "Windows, ", "['Team17 Worms Armageddon']"], "wand": ["GarageBand Magic Template", "Template containing settings for specific genres of music available in GarageBand; enables the user to play instruments specific to the selected genre; some variations of this template file are Latin, Blues, Jazz, Country, Funk, and Reggae; referenced by program, user is typically unaware of its presence.", "Mac, ", "['Apple GarageBand 10']"], "wam": ["Worms Armageddon Mission File", "Mission file used by Worms Armageddon, a turn-based game that revolves around defeating opposing worms; stores settings that make up a mission, such as weapon options, environment behavior, available ammunition, and enemy team difficulty.", "Windows, ", "['Team17 Worms Armageddon']"], "wave": ["WAVE Sound File", "CD-quality audio file, similar to a .AIFF file; stores an uncompressed audio waveform in a standardized format; WAVE files are more common on Windows systems, while AIFF files are more common on Macintosh computers.", "Windows, Mac, ", "['Microsoft Windows Media Player', 'Apple QuickTime Player', 'Apple iTunes', 'Roxio Creator NXT Pro 5', 'audio player']['Apple QuickTime Player', 'Apple iTunes', 'Roxio Toast 15', 'audio player']"], "walletx": ["Enpass Data File", "Data file created by Enpass, an application used to manage passwords and other confidential information; stores an encrypted backup of your information that can only be opened by Enpass software.", "Windows, Mac, Linux, ", "['Sinew Enpass']['Sinew Enpass']['Sinew Enpass']"], "waff": ["Internet Explorer for Mac Web Archive", "Web archive file format (WAFF) used by Internet Explorer for Mac to store a collection of webpages, along with associated images and linked pages up to 5 levels deep.", "Mac, ", "['WebArchivConverter', 'WAFInspec']"], "wad": ["Doom WAD File", "Game data file used by Doom and Doom II, as well as other first-person shooter games that use the original Doom engine; contains data such as sprites (graphics), level information, and items; used for storing original game content as well as game modifications.", "Windows, Windows, Mac, Linux, ", "['id Software Doom', 'id Software Doom 2', 'Doom Builder', 'Slade', 'eXtendable WAD Editor', 'New WAD Tool', 'WadAuthor', 'DeuTex', 'Wally']['Dolphin', 'Wad Studio']['Dolphin']['Dolphin']"], "wac": ["Inkling Sketch XML File", "Sketch file created by Inkling, a package made up of a pen, receiver, and Inkling Sketch Manager that captures paper sketches and converts them to digital sketches; contains a sketch, which consists of layers and pen strokes that can be manipulated, merged, and removed.", "Windows, Mac, ", "['Wacom Inkling Sketch Manager', 'Adobe Photoshop CC 2017', 'Adobe Illustrator CC 2017', 'Autodesk SketchBook Pro 7']['Wacom Inkling Sketch Manager', 'Adobe Photoshop CC 2017', 'Adobe Illustrator CC 2017', 'Autodesk SketchBook Pro 7']"], "war": ["Java Web Archive", "Compressed package containing Java-based Web components and applications that are run on a Web server; formatted the same way as a .JAR file, but includes additional information that tells the application server which Java servlet class to run.", "Windows, Mac, Linux, ", "['File Viewer Plus', 'Smith Micro StuffIt Deluxe for Windows', 'WinRAR 5', 'ESTsoft ALZip', 'Apache Tomcat']['Corel WinZip Mac 5', 'Smith Micro StuffIt Deluxe 16', 'Apache Tomcat']['Apache Tomcat']"], "wab": ["Windows Address Book", "Address book file that contains contact information, such as names and e-mail addresses; used by Microsoft Outlook Express, a popular free email program; similar to the .PAB file used by the full version of Microsoft Outlook.", "Windows, ", "['Microsoft Windows Contacts', 'Microsoft Outlook Express', 'Microsoft Outlook 2016', 'Stellar DBX to PST Converter']"], "wz": ["MapleStory Game Data File", "Game archive used by MapleStore, a two-dimensional MMORPG (massively multiplayer online role-playing game); can store several types of game data, including audio, maps, and character information; used for both the original MapleStory installation files and for game patch updates.", "Windows, Windows, Mac, Linux, ", "['NEXON MapleStory']['Warzone 2100']['Warzone 2100']['Warzone 2100']"], "wxs": ["WiX Source File", "Source file created by Windows Installer XML (WiX) toolset, a Windows installer developing program; XML document containing one root element (<Wix>); a collection of strings for localizing a product into a specific culture; similar to .CPP files.", "Windows, ", "['WiX Toolset']"], "wyz": ["WYZTracker File", "File used by WYZTracker, a program used to create chiptune audio files in a format used by older Amstrad CPC AY sound chips; stores a pattern of notes and effects; often used for creating video game music.", "Windows, ", "['WYZTracker']"], "wxn": ["Waixing Famicom Game ROM", "Encrypted file used to secure Famicom and Nintendo Entertainment System (NES) Game ROMS that can be played through emulators such as Nestopia; contains an encrypted copy of the game data that was stored on the original Famicom or NES cartridge.", "Windows, ", "['WXNDecrypt']"], "wxp": ["Wax 2.0 Project", "Project created and used by Wax, a video compositing and special effects program; stores project settings, such as video resolution and frame rate, and any edits made by the user; can be saved and edited at different times.", "Windows, ", "['DebugMode Wax 2']"], "wzconfig": ["WinZip Configuration File", "Settings file used by WinZip, a file compression and decompression program; saved using XML formatting and contains configuration parameters for the program, such as email account information for the \"Zip and E-mail\" option; used for saving and loading application settings.", "Windows, ", "['Corel WinZip 21']"], "wxl": ["WiX Localization File", "File created by the Windows Installer XML (WiX) toolset, a Windows installer development program; contains a collection of strings for localizing a product for a specific culture; includes translated user interface text for several languages.", "Windows, ", "['WiX Toolset']"], "wxi": ["WiX Include File", "File created by the WiX toolset, a Windows installer developing program; contains a top-level container element called, <Include>, which is the root element of the file; similar to header (.H) files used by C++ code.", "Windows, ", "['WiX Toolset']"], "wwu": ["Wwise Work Unit", "XML file that represents a \"Work Unit\" in Wwise, a complete audio authoring tool designed for sound designers and audio programmers; an example of a Work Unit is a search query which finds sound objects that match the parameters of the query.", "Windows, ", "['Audiokinetic Wwise']"], "wx": ["Wanam Xposed Backup File", "A WX file is a backup file created by Wanam Xposed, a module for the Xposed Framework featured in Samsung devices that run Android 4.2 or later.  The file contains a backup of the app's theme profile, which can be imported into the app.", "Android, Windows, Mac, ", "['Wanam Xposed']['Microsoft Flight Simulator X Gold Edition']['Microsoft Flight Simulator X Gold Edition']"], "wwf": ["World Wide Fund Non-Printable Document", "Document created by SAVE AS WWF, a program used to create .PDF documents that cannot be printed; may contain the contents of any electronically printable document; used for distributing \"green-friendly\" documents; created using the print dialog option \"SAVE AS WWF.\"", "Windows, Mac, Linux, ", "['WWF International SAVE AS WWF', 'Adobe Acrobat DC']['WWF International SAVE AS WWF', 'Adobe Acrobat DC', 'Apple Preview', 'Skim']['Adobe Acrobat DC', 'KDE Okular']"], "wwd": ["Works Wizard File", "Wizard that guides the user through a series of steps to create a customized Works document; may be a text document, flyer, spreadsheet, calendar, or other type of file.", "Windows, ", "['Microsoft Works']"], "wzmul": ["WinZip Registration File", "Registration file used to register WinZip, a popular compression utility for Windows; may be downloaded from the WinZip website after purchasing a WinZip license; opening the WinZip.wzmul file initiates the WinZip registration process.", "Windows, ", "['Corel WinZip 21']"], "wvx": ["Windows Media Video Redirector", "File used by Windows Media Player, Microsoft's default player for Windows; saves a link to a .WMV video file, but doesn't contain the audio data itself; used as a video file shortcut.", "Windows, ", "['Microsoft Windows Media Player', 'GRETECH GOM Player']"], "wvp": ["MagicHTML Web Video Player Project", "Project file created by Web Video Player, a program used for deploying video content to the Web; saves settings for a video player as well as a video file that will be published with the player; can be inserted into a webpage when complete.", "Windows, ", "['MagicHTML Web Video Player']"], "wvm": ["Google Play Video File", "A WVM file is a video file used by Google Play Movies & TV, an Android app used to watch purchased or rented movies and TV shows. It contains video downloaded from Google Play that is saved in a proprietary format similar to MPEG-4.  WVM files are encrypted with Widevine, a DRM platform for protecting copyrighted content.", "Windows, Mac, Linux, Android, ", "['HandBrake', 'Brorsoft Video Converter']['HandBrake']['HandBrake']['Google Play Movies & TV']"], "wve": ["Wondershare Filmora Project File", "Video project created by Wondershare Filmora, a program used for making personal videos; supports audio and video tracks as well as text, effects, transitions, and sound effects; allows a project to be saved and resumed later.", "Windows, Windows, ", "['Wondershare Filmora 6']['CyberLink Media Suite 14 Ultimate']"], "wvl": ["Wavelet Image", "Image file that is compressed using wavelet image compression, a algorithm that uses high compression while maintaining most of the quality of the original image.", "Windows, Mac, ", "['CorelDRAW Graphics Suite X8', 'Corel Presentations X8'][]"], "wvc": ["WavPack Correction File", "Contains compression information that allows a lossy WavPack (.WV) file to be restored to the full-quality lossless version; typically saved in the same folder with the same name as the WV file.", "Windows, Mac, Linux, ", "['WavPack Win32'][]['WavPack for Linux']"], "wut": ["WUTG Tag File", "WUTG tag without wrapped audio; includes ID3v1 tags, such as Artist, Album, Composer, etc, plus other WUTG tags; does not contain actual audio data", "Windows, ", "[]"], "wus": ["WUTG Tagged Audio File", "Audio file wrapped with WUTG Tags, a tag system developed by WUSSoft; contains metadata that describes the contents of the file; supports .MP3, .OGG (Ogg Vorbis), and .AC3 audio file formats.", "Windows, ", "[]"], "wv": ["WavPack Audio File", "Audio file compressed using WavPack Hybrid Lossless Compression; supports both lossy and lossless compression, which produces high-quality compressed files; the compression ratio is typically between 30% and 70%.", "Windows, Mac, Linux, ", "['WavPack Win32', 'Foobar2000', 'VUPlayer', 'Cockos REAPER', 'Image-Line FL Studio', 'Lightning UK! ImgBurn', 'Adobe Audition with WavPack plugin', 'Nullsoft Winamp with WavPack plugin', 'Steinberg WaveLab', 'Media Player Classic', 'VideoLAN VLC media player']['X Lossless Decoder', 'VideoLAN VLC media player', 'Max']['WavPack for Linux', 'Aqualung', 'Audacious', 'XMMS with WavPack plugin', 'VideoLAN VLC media player']"], "wa2": ["Wonderland Adventures Custom Adventure File", "Custom adventure file used by Wonderland Adventures (WA), a 3D puzzle adventure game; stores data for a user-created adventure compiled in Wonderland Adventures Editor.", "Windows, ", "['Midnight Synergy Wonderland Adventures Editor']"], "wul": ["WinUHA Language File", "Application support file used by WinUHA, a file archiving utility that is now discontinued; used for localizing the user interface into different languages and contains strings for menus, toolbars, and other user interface components.", "Windows, ", "[]"], "wtv": ["Windows Recorded TV Show File", "Video file recorded by Windows Media Center, a program used to play multimedia content and record TV shows; encodes video using MPEG-2 compression and audio using MPEG-1 Layer II or Dolby Digital AC-3 compression; may also include descriptive metadata and digital rights management (DRM) information.", "Windows, Mac, Linux, ", "['File Viewer Plus', 'Microsoft Windows Media Center', 'CyberLink PowerDVD 16', 'CyberLink PowerDirector 15 Ultra', 'Nero 2017', 'Bigasoft WTV Converter', 'DRD Systems VideoReDo', 'DVRSoft WTV to AVI Converter', 'VideoLAN VLC media player']['VideoLAN VLC media player']['VideoLAN VLC media player']"], "wtx": ["Text Document", "File created in a plain text format, similar to a .TXT file; set as a default file association in Windows 7; can be opened with any text viewer.", "Windows, ", "['Microsoft Notepad', 'Microsoft Wordpad', 'text editor']"], "wtr": ["Encarta File", "Data file used by the Encarta encyclopedia program; contains resources referenced by encyclopedia entries; accessed by the Encarta software and should not be opened manually.", "Windows, Mac, ", "['Microsoft Encarta']['Microsoft Encarta']"], "wtt": ["Write! Document", "Text document format created and used by Write!, a free Windows text editor; supports rich text; includes several types of text formatting, such as italics and bold type; can be exported as a .PDF, .ODT, .TXT, and .MDOWN file.", "Windows, ", "['Write!']"], "wtpt": ["WireTap Studio Packaged Track", "Audio package saved by WireTap Studio, a system and application audio recording utility; includes one or more audio files as well as information about edits made by the user.", "Mac, ", "['Ambrosia Software WireTap Studio']"], "wtpl": ["WireTap Studio Library", "Library of audio tracks saved by WireTap Studio, a utility used for recording system and application audio; may include one or more playlists that appear in the primary WireTap Studio window.", "Mac, ", "['Ambrosia Software WireTap Studio']"], "wtml": ["WorldWide Telescope Data File", "A WTML file is a data file used by WorldWide Telescope, a 3D program used to explore earth, planetary, and astronomical data.  It contains simple or complex sets of data in XML format referenced by WorldWide Telescope.", "Windows, ", "['WorldWide Telescope']"], "wtf": ["World of Warcraft Text File", "Text file used by World of Warcraft (WoW) to save various game settings; for example, Config.wtf saves audio and display settings; Realmlist.wtf stores realms in which players can play on different private servers.", "Windows, Mac, ", "['Blizzard World of Warcraft', 'text editor']['Blizzard World of Warcraft', 'text editor']"], "wtb": ["Win-Test Binary Log File", "Log file generated by Win-Test, an international contest logging application; stores test data and saves user window layouts and text from CW messages received by the program.", "Windows, ", "[]"], "wtd": ["Grand Theft Auto IV Textures File", "Texture file used by Grand Theft Auto IV (GTA4), an action/adventure game; used for texture mapping and contains a two-dimensional graphic that gives the surface appearance to a 3D object in the game; saved in the \\Rockstar\\Games\\Grand Theft Auto IV\\pc\\textures\\ directory.", "Windows, ", "['Rockstar Games Grand Theft Auto 4', 'SparkIV', 'OpenIV']"], "wsve": ["Wondershare Filmora for Mac Project File", "Video project format used by the Mac OS X version of Wondershare Filmora, an application used to make personal videos; contains a video project that supports audio tracks; may also include transitions, filters, overlays, text, sound effects, and elements; allows a project to be saved and modified at a later time.", "Mac, ", "['Wondershare Filmora 6']"], "wspak": ["WebsitePanel Backup File", "Backup file created by WebsitePanel, a portal application used for managing Windows Server applications such as IIS, SQL Server, Exchange, and Hyper-V; saves a backup of databases, settings, and other files on the server; can be used for migrating files to a new server; most often used by system administrators.", "Windows, ", "['WebsitePanel']"], "wsz": ["Winamp Classic Skin", "Custom classic skin used to modify the interface of Winamp, a music-playing program for Windows", "Windows, ", "['Nullsoft Winamp']"], "wtc": ["Logitech Webcam File", "File named watch.wtc and used by Logitech Webcam Software, an application used for interacting with Logitech webcams; created as an empty file and sometimes saved to the desktop and other times to the My Pictures directory; can be deleted.", "Windows, ", "['Logitech Webcam Software']"], "wsp": ["SharePoint Solution Package", "Package used by SharePoint, an enterprise-level document and content management system; saves a Windows SharePoint Services solution, which is a custom component, such as a website, that can be added to a company's SharePoint site.", "Windows, ", "['Microsoft SharePoint', 'Microsoft Visual Studio 2017']"], "wsm": ["Wise Package Studio Merge Module", "Installer merge module created with Wise Package Studio, an installer creation utility; stores files and installation settings in a single package, which can be installed on Windows systems.", "Windows, ", "[]"], "wsi": ["Wise Package Studio Installer Package", "Package created with Wise Package Studio, an installer creation utility; contains a collection of files that have been packaged into a single archive; can be installed on a Windows system using Wise Package Studio.", "Windows, ", "[]"], "ws": ["Windows Script", "Executable script for Windows that can incorporate JScript and VBScript routines and may include XML elements; runs when opened if Windows Scripting Host (WSH) 2.0 or later is installed.", "Windows, Windows, ", "['Microsoft WScript', 'text editor']['Variety Games 1-2-3 Word Search Maker']"], "wsh": ["Windows Script Host Settings", "Text document that contains properties and parameters for a certain script, i.e. a .VB or .VBS file; used for customizing the execution of certain scripts; requires WScript or CScript to run, both of which are included with the Windows operating system.", "Windows, ", "['Microsoft WScript', 'Microsoft CScript', 'text editor']"], "wsf": ["Windows Script File", "A WSF file is an executable script for Windows that can incorporate JScript and VBScript routines and may include XML elements.  WSF files run themselves if WScript or CScript is installed.", "Windows, ", "['Microsoft WScript', 'Microsoft CScript', 'Microsoft Visual Studio 2017', 'text editor']"], "wsdl": ["Web Services Description Language File", "Information file written in the WSDL XML format, which is maintained by W3C.org; provides descriptions of \"ports,\" or network endpoints, on the Internet or another network; often used for publishing data feeds and specifications for remote application access.", "Windows, Mac, Linux, ", "['Microsoft Visual Studio 2017', 'SyncRO Soft oXygen XML Editor', 'Liquid Technologies Liquid XML Studio', 'Progress Stylus Studio']['SyncRO Soft oXygen XML Editor']['SyncRO Soft oXygen XML Editor']"], "wsd": ["WordStar Document", "Document created by WordStar, a word processing program for DOS used heavily in the 1980s; contains document data and page layout formatting; used to store text using the WYSIWYG DOS-based editor.", "Windows, ", "['Corel WordPerfect X8']"], "wsc": ["WonderSwan Color Game ROM", "Game file used by emulators for the WonderSwan Japanese handheld console system, which is similar to the Game Boy Color; contains a game ROM, which stores the same information as the original game cartridge; can be used to play games on the PC with emulation software such as Oswan or Cygne.", "Windows, Mac, Windows, ", "['Oswan', 'Cygne']['Oswan']['Microsoft Visual Studio 2017', 'Microsoft Notepad', 'text editor']"], "wrypt": ["Panwrypter Depleted Storage Volume File", "A WRYPT file is a depleted storage volume file created by Panwrypter, a program used to secure digital files and protect them from unauthorized users, including cyber criminals.  It contains depleted data for a file or folder located at a specific site that has been protected with Panwrypter.", "Mac, ", "['Entropic Panwrypter']"], "wrz": ["Compressed VRML World File", "3D image file written in the VRML (Virtual Reality Modeling Language) language; describes a world that can be navigated in three dimensions; saved using Gzip (.GZ) compression, and is the compressed version of a plain text .WRL file.", "Windows, Mac, Linux, iOS, ", "['IMSI TurboCAD Pro 2017', 'Parallel Graphics Cortona3D Viewer', 'FreeWRL']['FreeWRL']['FreeWRL']['Parallel Graphics Cortona3D Viewer']"], "wrts": ["Wrts File", "File created and used by Wrts, a Dutch web program that allows users to test their knowledge and pronunciation of words; contains a list of words in plain text.", "Web, ", "['Wrts']"], "wrk": ["Cakewalk Music Project", "Project file created by Cakewalk, an audio production application; may split the production across multiple tracks and can include MIDI data, references to audio files, fader settings, tempos, audio effects, and other settings.", "Windows, Windows, ", "['Cakewalk SONAR X3']['Microsoft SQL Server 2016']"], "wrpl": ["Widelands Saved Game File", "Saved game created by Widelands, an open source strategy game; contains all player moves since the initial starting condition, which is stored in a separate .WGF file (also seen with the .WRPL.WGF extension); used to save and load in-game progress.", "Windows, Mac, Linux, ", "[][][]"], "wrp": ["Geomagic 3D Wrap File", "Proprietary 3D modeling format used by Geomagic DSSP (digital shape sampling and processing) software; may contain point clouds, polygonal models, mesh models, CAD models, curves, datums, NURBS data, and other features.", "Windows, ", "['Geomagic Studio']"], "wrl": ["VRML World", "Virtual world created in VRML - the Virtual Reality Modeling Language; can be navigated in three dimensions; contains coordinates and colors that define each object and shape; also includes the viewpoint coordinates for the initial view of the 3D scene.", "Windows, Mac, Linux, iOS, ", "['IMSI TurboCAD Pro 2017', 'Parallel Graphics Cortona3D Viewer', 'FreeWRL']['FreeWRL']['FreeWRL']['Parallel Graphics Cortona3D Viewer']"], "wrf": ["WebEx Recording", "Recording created by WebEx Recorder, a standalone program that allows users to record audio and video data; contains audio and video data used for demonstrations, training, and conferencing; can be uploaded to WebEx sites and shared with others by specifying the file stream or download URL.", "Windows, Mac, ", "['Cisco WebEx Player']['Cisco WebEx Player']"], "wri": ["Microsoft Write Document", "Text document created with Microsoft Write, a basic word processor that came with early versions of Windows through Windows 3.1; may contain styled text and page formatting information.", "Windows, Mac, Linux, ", "['Corel WordPerfect X8', 'Rising Sun Solutions Atlantis Word Processor', 'LibreOffice']['Planamesa NeoOffice', 'LibreOffice']['LibreOffice']"], "wq2": ["Quattro Pro for DOS Spreadsheet File", "Spreadsheet file created in Quattro Pro for DOS, a spreadsheet program for DOS; stores data that is represented as an array of rows and columns.", "Windows, ", "['Corel Quattro Pro X8']"], "wq1": ["Quattro Pro for DOS Spreadsheet File", "Spreadsheet file created in Quattro Pro for DOS, a program used to develop spreadsheets in DOS; contains data stored in an grid of rows and columns.", "Windows, ", "['Corel Quattro Pro X8']"], "wpw": ["WinDev Mobile Window File", "Developer file created by WinDev, an IDE used for developing Windows and mobile applications; saves a program window, which acts like a dialog box or output view for the final program; can contain text, fields, buttons, and other visual elements.", "Windows, Windows, ", "['PC SOFT WinDev']['Corel WordPerfect X8']"], "wpt": ["WordPerfect Template", "Template created by WordPerfect, a word processing application that is part of the WordPerfect Office suite; stores a pre-formatted document that can be used to create WordPerfect (.WPD) documents; enables users to create multiple documents with a similar look and feel.", "Windows, Windows, Windows, Android, Windows, Mac, Linux, ", "['Corel WordPerfect X8']['Microsoft Works']['Kingsoft WPS Office', 'Kingsoft Writer']['Kingsoft WPS Office for Android']['Cube 2: Sauerbraten']['Cube 2: Sauerbraten']['Cube 2: Sauerbraten']"], "wps": ["Kingsoft Writer Document", "A WPS file is a word processing document created by Kingsoft Writer, a word processor that is part of the Kingsoft WPS Office suite.  It contains text, images, and page formatting.  WPS files are similar to Microsoft Word documents (.DOC or .DOCX files).", "Windows, Android, Windows, Mac, Linux, Windows, ", "['Kingsoft WPS Office', 'Kingsoft Writer']['Kingsoft WPS Office for Android']['File Viewer Plus', 'Microsoft Works', 'NCH Doxillion', 'LibreOffice']['Planamesa NeoOffice', 'LibreOffice']['OxygenOffice Professional', 'LibreOffice'][]"], "wpx": ["Printer Description File", "Printer information file that contains a description of the printer's features; may be referenced when printer jobs are created and sent to the printer; often installed with Windows PostScript printers.", "Windows, Mac, Windows, ", "[]['Parallels Desktop for Mac with Windows installed']['Serif WebPlus']"], "wpp": ["WebPlus Project File", "Website development project created with Serif WebPlus, a graphic-based Web design program; WebPlus pages may contain text, images, podcasts, YouTube videos, Flash animations, secure pages, e-commerce functionality, and dynamic content.", "Windows, Windows, Mac, Windows, ", "['Serif WebPlus']['NCH WavePad']['NCH WavePad']['Corel WordPerfect X8']"], "wproj": ["Wwise Project File", "Project file created by Wwise, a program used for creating interactive audio for video games; saves sound settings and references to imported audio files; allows the sound engineer team to develop and organize sounds during game development.", "Windows, ", "['Audiokinetic Wwise']"], "wpost": ["Windows Live Writer Post File", "Web blog post created by Windows Live Writer, a blogging program included with the Windows Live Essentials Pack; saves a blog post entry written by the user and can contain images, videos, and maps as well as the written text.", "Windows, ", "['Microsoft Windows Live Writer']"], "wpm": ["Warcraft 3 Path Map File", "File used by Warcraft III, a real-time strategy game; contains pathing data for a map; used by the game's artificial intelligence (AI) to move units across the map without requiring the player to micromanage unit movement around obstacles.", "Windows, Mac, Windows, ", "['Blizzard Warcraft 3']['Blizzard Warcraft 3']['Corel WordPerfect X8']"], "wpo": ["HOLUX Waypoint File", "Waypoint file format created by HOLUX GPS devices; contains waypoint data including name, longitude, latitude, date created, and use counts; used for creating navigation routes and storing points of interest.", "Windows, Mac, Linux, Windows, ", "['GPSBabel']['GPSBabel']['GPSBabel'][]"], "wpl": ["Windows Media Player Playlist", "Playlist of songs or videos that can be played by Windows Media Player; may be used to create dynamic playlists; stores a list of references to the actual files, but not the files themselves; written in the WPL 1.0 format, which is extended from the XML format; can be used in Windows Media Player 9 or later.", "Windows, Windows, Windows, ", "['Microsoft Windows Media Player', 'Nullsoft Winamp', 'Roxio Creator NXT Pro 5']['Rockstar Games Grand Theft Auto 4', 'Rockstar Games Grand Theft Auto: San Andreas', 'WPL Manager'][]"], "wpk": ["Nero Wave Editor File", "Describes a sound file edited with Nero Wave Editor, part of the the Nero CD/DVD disc authoring suite; contains edits made to the audio file, but not the actual audio itself.", "Windows, Windows, Windows, ", "['Nero 2017']['Microsoft Windows with USB connection']['Corel WordPerfect X8']"], "wpi": ["Inkling Sketch Binary File", "Sketch file created by Inkling, a package, which includes a pen, receiver, and application, that captures paper sketches and converts them to digital sketches; contains a sketch made up of layers and pen strokes that can be manipulated, merged, or removed.", "Windows, Mac, ", "['Wacom Inkling Sketch Manager', 'Adobe Photoshop CC 2017', 'Adobe Illustrator CC 2017', 'Autodesk SketchBook Pro 7']['Wacom Inkling Sketch Manager', 'Adobe Photoshop CC 2017', 'Adobe Illustrator CC 2017', 'Autodesk SketchBook Pro 7']"], "wph": ["Phoenix BIOS File", "BIOS file used by computer systems that use the Phoenix BIOS; contains system-level data for controlling low-level devices; can be \"flashed,\" or installed, to the computer's EEPROM using the program phlash16.exe; usually has the filename BIOS.WPH.", "Windows, ", "[]"], "wpg": ["WordPerfect Graphic File", "Graphic created by WordPerfect, a word processing program; can contain both vector and bitmap image data and may include up to 256 colors; may also contain Encapsulated PostScript (.EPS) information; often used for clipart images that are embedded into word processing documents.", "Windows, Mac, Linux, ", "['Corel WordPerfect X8', 'CorelDRAW Graphics Suite X8', 'Corel PaintShop Pro X9', 'ACD Systems Canvas X 2017', 'Serif PhotoPlus', 'Inkscape']['Lemkesoft GraphicConverter', 'Inkscape']['Inkscape']"], "wpf": ["WordPerfect Form", "Form created by WordPerfect software; includes fields for entering data that can be customized by the user; may also be opened by Microsoft Word and exported by Adobe Capture.", "Windows, Mac, ", "['Corel WordPerfect X8', 'Microsoft Word 2016']['Microsoft Word 2016']"], "wpe": ["openCanvas 1.1 Event File", "File created by openCanvas 1.1, a free drawing program designed for use with drawing tablets; saves the stroke events used to create the drawing so that it can be recreated or reanimated in the software.", "Windows, Windows, ", "['Portalgraphics openCanvas']['Corel WordPerfect X8']"], "wpd": ["WordPerfect Document", "A WPD file is a text document created by Corel WordPerfect, a popular word processor.  It may contain formatted text, tables, drawn objects, and images.  WPD files are stored in a proprietary Corel format, but can be exported to other formats from within WordPerfect.", "Windows, Mac, Windows, Windows, ", "['Corel WordPerfect X8', 'Microsoft Word 2016', 'Nuance OmniPage Ultimate', 'ACD Systems Canvas X 2017', 'NCH Doxillion']['Planamesa NeoOffice', 'Windows Document Viewer Pro']['Swiftpage Act!'][]"], "wpc": ["WordPad Converter File", "File used by Microsoft Word and WordPad, which are common Windows word processing programs; contains instructions for converting a file from a non-native format, such as older versions of files, to a more usable format.", "Windows, Windows, ", "['Microsoft Word 2016', 'Microsoft WordPad'][]"], "wpb": ["openCanvas 1.1 Image", "Image created with openCanvas 1.1, the free version of openCanvas drawing software before it became commercialized; often used for saving anime drawings and other digial art.", "Windows, Windows, ", "['Portalgraphics openCanvas'][]"], "wpa": ["ACT! Word Processing Document", "Text document format used by ACT! contact management software, versions 3 and later.", "Windows, ", "['Swiftpage Act!']"], "wp7": ["WordPerfect 7 Document", "Word processing document created by WordPerfect 7.x; can be opened with Corel WordPerfect 7 or later.", "Windows, ", "['Corel WordPerfect X8']"], "wp6": ["WordPerfect 6 Document", "Word processing document created by WordPerfect 6.x for DOS, the first version of WordPerfect to include a graphical editing mode, which displayed how the document would look when printed; may contain text styles such as bold, underlined, and italics, which were not possible in previous versions of the program.", "Windows, ", "['Corel WordPerfect X8']"], "wp5": ["WordPerfect 5 Document", "Word processing document created by WordPerfect 5.x for DOS, a highly successful version of WordPerfect; included support for tables within the document.", "Windows, ", "['Corel WordPerfect X8']"], "wp4": ["WordPerfect 4 Document", "Word processing document created by WordPerfect 4.x for DOS, the first version to include automatic paragraph numbering; overtook WordStar as the most popular word processor for the DOS platform.", "Windows, ", "['Corel WordPerfect X8']"], "wowproj": ["AddOn Studio Project File", "Project file created by AddOn Studio for World of Warcraft (WoW), a program used for developing WoW user interface add-ons; saves the design of the addon as well as a scripted Lua actions for input events; used for saving development progress.", "Windows, ", "['Addon Studio for World of Warcraft']"], "wowsl": ["WOW Slider", "Slider created by WOW Slider, a program that creates jQuery image sliders for websites; contains images you add, transitional effects, and text.", "Windows, Mac, ", "['WOW Slider']['WOW Slider']"], "wp": ["WordPerfect Document", "Word processing document created by Corel WordPerfect, a popular word processor for Windows; may contain text, images, forms, and other data.", "Windows, Mac, ", "['Corel WordPerfect X8']['Planamesa NeoOffice']"], "wp3": ["Microsoft Photo Story Project File", "Project file created by Photo Story, a program used for creating digital slideshows; contains pictures, effects, captions, audio, and playback settings; used to compile personal photos together for playback in desktop and mobile device video players.", "Windows, ", "['Microsoft Photo Story']"], "wow": ["Grave Composer Music Module", "Audio module format use by the Grave Composer audio tracker, an older tracking program for DOS-based PCs; also known as \"Mod's Grave;\" may contain up to 8 channels.", "Windows, ", "['OpenMPT']"], "wotreplay": ["World of Tanks Replay File", "Game file created by World of Tanks (WoT), a multiplayer tank battling game; saves a multiplayer battle replay that can be played back at a later time; saved to the \\World of Tanks\\Replays\\ installation directory if replay recording is enabled in the game options.", "Windows, ", "['Wargaming.net World of Tanks', 'WOT Replays Manager', 'WOT Replay Parser']"], "wot": ["WebEx Recording File", "Video file created by older versions of WebEx business conferencing software; saves a recording of the conversation and displayed presentations; used for reviewing meetings.", "Windows, Windows, Mac, Linux, ", "['WebEx Player']['PGP Desktop']['PGP Desktop'][]"], "world": ["WorldPainter File", "File created by WorldPainter, a program used for building worlds for the game Minecraft; can include terrain as well as brushed colors that change the look of the landscape; may be exported to a Minecraft world (level.dat and .MCA regions) for importing into the game.", "Windows, Mac, Linux, iOS, Android, Windows, ", "['WorldPainter']['WorldPainter']['WorldPainter']['Re-Logic Terraria']['Re-Logic Terraria']['The Sims 3 Create a World Tool']"], "workflow": ["Automator Workflow", "Automated workflow created by Apple's Automator program, introduced in Mac OS X 10.4; includes a list of commands for automating processes such as saving and mailing a PDF or selecting and copying certain files.", "Mac, ", "['Apple Automator']"], "worksheet": ["BBEdit Shell Worksheet File", "Developer file created by BBEdit, a Mac OS X source code development program; stores an interactive programmer worksheet, which can save source code text as well as execute commands in-line while editing; used for adding Unix command line features to source code development.", "Mac, ", "['Bare Bones BBEdit']"], "workspace": ["Code::Blocks Workspace File", "Developer workspace file created by Code::Blocks, a free, cross platform application for C++ development; saved using XML formatting and stores the list of opened projects; used for saving grouped projects together.", "Windows, Mac, Linux, Windows, Mac, ", "['Code::Blocks']['Code::Blocks']['Code::Blocks']['Adobe Bridge CC']['Adobe Bridge CC']"], "work": ["Bibble Work Queue File", "File created by Bibble, a digital photo editing application; saves settings for batch processing photos; includes the output file type, image resizing options, image and metadata (e.g., EXIF, color profile); used for saving presets that can be run for multiple groups of images.", "Windows, Mac, Linux, ", "['Corel AfterShot Pro 3']['Corel AfterShot Pro 3']['Corel AfterShot Pro 3']"], "wordlist": ["Desktop Poet Word List File", "Word list used by Desktop Poet, a \"fridge poetry\" program that allows users to create poetry by arranging words on the desktop; contains a collection of words, as well as definitions for word tenses (e.g., verb tenses, singular and plural tenses); also stores the word list title, language, author, and copyright information.", "Windows, Mac, ", "['Mariner Desktop Poet']['Mariner Desktop Poet']"], "wor": ["MapInfo Workspace File", "Map workspace file used by MapInfo mapping and geographic analysis software; contains a visual map of an area that can be browsed and zoomed using MapInfo software; typically includes information about locations within the map, such as population and demographic data.", "Windows, ", "['Pitney Bowes MapInfo']"], "wop": ["Wonderland Object Preset", "Object preset file for Wonderland Adventures Editor, a program used to create and edit levels for Wonderland Adventures; a hex file that contains 3D models, character movements, logic data, level parameters, and other data.", "Windows, ", "['Midnight Synergy Wonderland Adventures Editor']"], "wolfquest": ["WolfQuest Saved Game", "Saved game created by WolfQuest, a 3D wildlife simulation game; contains the wolf name, world location, hunting experience, and other information about the progress in life, such as the status in a wolf pack or whether the wolf has mated; used for saving and loading game progress.", "Windows, Mac, ", "['Minnesota Zoo WolfQuest']['Minnesota Zoo WolfQuest']"], "woa": ["WebObjects Application", "Web application created with WebObjects, an enterprise framework developed by Apple; uses Java code and object-oriented design principles; can be deployed on any platform that supports Java programs.", "Windows, Mac, Linux, ", "['Web browser']['Web browser']['Web browser']"], "woff2": ["Web Open Font Format 2.0 File", "A WOFF2 file is a web font file created in the WOFF (Web Open Font Format) 2.0 format, an open format used to deliver webpage fonts on the fly.  It is saved as a compressed container that supports TrueType (.TTF) and OpenType (.OTF) fonts.  WOFF2 files also support font licensing metadata.", "Windows, Mac, Linux, ", "['Microsoft Edge', 'Google Chrome', 'Mozilla Firefox', 'Opera']['Apple Safari', 'Google Chrome', 'Mozilla Firefox', 'Opera']['Google Chrome', 'Mozilla Firefox', 'Opera']"], "woff": ["Web Open Font Format File", "A WOFF file is a web font file created in the WOFF (Web Open Font Format) format, an open format used for delivering webpage fonts on the fly.  It is saved as a compressed container and supports TrueType (.TTF) and OpenType (.OTF) fonts and also supports font licensing information.", "Windows, Mac, Linux, ", "['Microsoft Internet Explorer', 'Google Chrome', 'Mozilla Firefox', 'Opera', 'FontForge']['Google Chrome', 'Mozilla Firefox', 'Opera', 'FontForge']['Google Chrome', 'Mozilla Firefox', 'Opera', 'FontForge']"], "wnk": ["Wink Presentation", "Presentation created by Wink, a program used to create software tutorials; contains a collection of slides, which are made up of screenshots taken by the program; may also include other data, such as slide titles, appearance properties, audio, text, drawn shapes, and presentation styles.", "Windows, Linux, ", "['DebugMode Wink']['DebugMode Wink']"], "wncry": ["Wana Decrypt0r 2.0 Encrypted File", "A WNCRY file is a file encrypted by Wana Decrypt0r 2.0, a ransomware infection utilized by cybercriminals.  It contains a user's file, such as a .BAT, .BMP, .WAV, or .XLSX file, encrypted with the RSA algorithm and AES-128 ciphers.  WNCRY files became prevalent in 2017.", "Windows, ", "[]"], "wn": ["WN Web File", "Web file used by WN, a Web server designed to protect visibility and access to server files; stores information about files served on the server; may describe .HTML files, images, and other binary files; used for specifying the content of Web files in a directory.", "Linux, Windows, Mac, ", "['WN']['text editor']['text editor']"], "wmz": ["Compressed Windows Media Player Skin", "Preinstalled or custom skin that changes the appearance of the Windows Media Player interface; contains a combination of graphics and JScript code that defines the behavior of each element in the skin; compressed using ZIP compression.", "Windows, Windows, Mac, ", "['Microsoft Windows Media Player', 'SkinDoc']['Corel WinZip 21', 'Smith Micro StuffIt Deluxe for Windows']['Apple Archive Utility', 'Smith Micro StuffIt Deluxe 16']"], "wmx": ["Windows Media Redirector File", "Shortcut file used by Windows Media Player, the default multimedia player for Windows; saves a shortcut to a Windows Media Audio (.WMA) or Windows Media Video (.WMV) file; stores the location of the media file, but doesn't include the actual audio or video data itself.", "Windows, ", "['Microsoft Windows Media Player']"], "wmt": ["WinMount Virtual Disk File", "Virtual disk or Ramdisk file created by WinMount, a compressed file management program; stores a virtual hard drive tha can be mounted by the program; includes the volume format (FAT32, NTFS, Unformatted) as well as the disk size.", "Windows, ", "['WinMount International WinMount']"], "wms": ["Windows Media Skin", "Preinstalled or custom skin that changes the appearance of the Windows Media Player interface; contains a combination of graphics and JScript code that defines the behavior of each element in the skin; can be installed by double-clicking the file.", "Windows, ", "['Microsoft Windows Media Player']"], "wmv": ["Windows Media Video File", "A WMV file is a video file based on the Microsoft Advanced Systems Format (ASF) container format and compressed with Windows Media compression.  It contains video encoded with one of Microsoft's Windows Media Video (WMV) proprietary codecs and is similar to an .ASF file.", "Windows, Mac, Web, iOS, Android, ", "['File Viewer Plus', 'Microsoft Windows Video', 'Microsoft Windows Media Player', 'Nullsoft Winamp', 'CyberLink PowerDVD 16', 'CyberLink PowerDirector 15 Ultra', 'Audials One 2017', 'Roxio Creator NXT Pro 5', 'Xilisoft Video Converter Ultimate', 'Web browser']['Eltima Elmedia Player', 'ShedWorx Smart Converter', 'Apple QuickTime Player with Flip4Mac WMV Components', 'Apple QuickTime Pro', 'Web browser']['Google Drive']['Macca Studios WMV Player', 'olimsoft OPlayer', 'PentaLoop PlayerXtreme Media Player']['J2 Interactive MX Player']"], "wmo": ["World of Warcraft World Map Object", "File format used to store 3D object data for World of Warcraft, an online multiplayer adventure game; commonly referred to as a \"world map object\" or WMO; may be saved as a root file or a group file.", "Windows, Mac, ", "['Blizzard World of Warcraft']['Blizzard World of Warcraft']"], "wmp": ["Windows Media Photo File", "Windows Media Photo, or \"WMPhoto,\" image format developed by Microsoft; stores a raster image in a format similar to a .JPG; supports black and white, RGB, CMYK, or multi-channel graphic formats; also supports lossy and lossless compression optimized for digital photos. ", "Windows, Mac, ", "['Microsoft Windows Photo Gallery', 'Microsoft Windows Live Photo Gallery', 'Alchemy Mindworks Graphic Workshop Professional', 'Adobe Photoshop with HD Photo plugin']['Adobe Photoshop with HD Photo plugin']"], "wmmp": ["Windows Movie Maker Project File", "Video project created with Microsoft Windows Movie Maker, a digital video-editing program for creating home movies; includes a video timeline, references to video clips used in the movie, transitions, effects, and other information.", "Windows, ", "['Microsoft Windows Movie Maker']"], "wml": ["Wireless Markup Language File", "Web page created for mobile devices, such as PDAs (personal digital assistants) and cell phones; similar to an .HTML file, but written in the wireless markup language (WML) instead of HTML.", "Windows, Mac, Linux, ", "['Adobe Dreamweaver CC 2017', 'SyncRO Soft oXygen XML Editor', 'AbiSource AbiWord', 'Microsoft Internet Explorer', 'Google Chrome', 'Mozilla Firefox', 'Web browser']['Adobe Dreamweaver CC 2017', 'SyncRO Soft oXygen XML Editor', 'Apple Safari', 'Google Chrome', 'Mozilla Firefox', 'Web browser']['SyncRO Soft oXygen XML Editor', 'Google Chrome', 'Mozilla Firefox', 'Web browser']"], "wmga": ["Web Manga Document", "Manga document used by Manga Reader, an application used to read electronic print cartoons and comic books; stores the structure of the manga document; includes URL references to page content (text, graphics, etc.) instead of the page content itself; used for distributing manga comics.", "Windows, ", "['Manga Reader', 'Manga Creator']"], "wmd": ["Windows Media Download Package", "Zip compressed file used by Windows Media Player; may store multimedia content, playlists, and borders (custom interfaces); used as a format for downloading audio and video over the Internet.", "Windows, ", "['Microsoft Windows Media Player']"], "wma": ["Windows Media Audio File", "A WMA file is an audio file saved in the Advanced Systems Format (ASF) proprietary format developed by Microsoft.  \r\nIt contains Windows Media Audio and metadata objects such as the title, artist, album, and genre of the track.  WMA files are similar to .MP3 files and primarily used for streaming music from the web.", "Windows, Mac, iOS, ", "['File Viewer Plus', 'Microsoft Windows Music', 'Microsoft Windows Media Player', 'Microsoft Groove Music', 'Nullsoft Winamp', 'ArcSoft TotalMedia Theatre', 'Xilisoft Video Converter Ultimate', 'Web browser']['ShedWorx Smart Converter', 'Apple QuickTime Player with Flip4Mac WMV Components', 'Web browser', 'Eltima Elmedia Player']['olimsoft OPlayer']"], "wmf": ["Windows Metafile", "Proprietary Windows graphic format developed by Microsoft; contains a series of drawing operations, including commands for drawing lines, circles, and rectangles; may also contain bitmap drawing operations; used primarily for vector images, but can also include raster graphics.", "Windows, Mac, Linux, Windows, Mac, Linux, ", "['File Viewer Plus', 'ACD Systems ACDSee 20', 'Adobe Illustrator CC 2017', 'IMSI TurboCAD Pro 2017', 'CorelDRAW Graphics Suite X8', 'Corel PaintShop Pro X9', 'ACD Systems Canvas X 2017', 'Newera Graphics Converter Pro', 'Microsoft Windows Photo Viewer', 'Microsoft Picture It!', 'Inkscape']['IMSI TurboCAD Deluxe v10', 'Adobe Illustrator CC 2017', 'Cristallight WMF Converter Pro', 'Apple QuickTime Player with Flip4Mac WMV Components', 'Inkscape']['Inkscape', 'GIMP'][][][]"], "wme": ["Windows Media Encoder Session File", "A WME file is a session profile created by Microsoft Windows Media Encoder 9 Series, a production tool used to convert audio and video that is live or prerecorded into Windows Media files (.WMV or .WMA files) or streams.  It contains settings for an encoding session that can be used for other sessions.", "Windows, ", "['Microsoft Windows Media Encoder 9 Series']"], "wmdb": ["Windows Media Database File", "Library of media files located by Microsoft Windows Media Player; contains a list of references to audio and video files located by Windows Media Player after scanning the hard disk for media files; typically named \"CurrentDatabase_###.wmdb.\"", "Windows, ", "['Microsoft Windows Media Player']"], "wm": ["Windows Media File", "Windows Media audio or video file; may contain audio, video, or both types of data; formatted using the Windows Media Player codec.", "Windows, ", "['Microsoft Windows Video', 'Microsoft Windows Media Player', 'Digital Cloud Technologies Media Player']"], "wlz": ["Winamp Language Pack", "Plugin file used by Winamp, a Windows music player; contains a collection of .LNG files for the language pack compressed in a .ZIP format; allows users to customize the interface to their own language.", "Windows, Windows, ", "['Nullsoft Winamp']['Gilles Vollant WinImage']"], "wlu": ["Jaff Ransomware Encrypted File", "A WLU file is a file encrypted by Jaff ransomware, a computer infection utilized by cybercriminals.  It contains a user's file, such as a .ACCDB, .ODS, .PPTX, or .WMV file, encrypted with the RSA algorithm and AES-128 ciphers.  WLU files became prevalent in 2017.", "Windows, ", "[]"], "wls": ["R-Link Update File", "A WLS file is a system update file used by R-Link, a tablet included with Renault vehicles.  It contains encrypted update data used by R-Link to update the system.", "Windows, Mac, ", "['Renault R-Link Toolbox']['Renault R-Link Toolbox']"], "wlx": ["Windows Live Mesh Sync File", "Temporary file created by Live Mesh, a Microsoft application used for synchronizing files between computers, Windows Live SkyDrives, and other storage locations; marks a file that still has to be downloaded from a remote storage location to the local storage location; acts as a placeholder until the actual file is downloaded.", "Windows, Mac, Windows, Windows, ", "['Microsoft OneDrive']['Microsoft OneDrive']['Garmin MapSource']['Verity Software House WinList']"], "wlp": ["Worldlabel.com Label Designer File", "Document created by Worldlabel.com Label Designer, a program used for designing and printing labels for CDs, addresses, envelopes, and other media; stores the label document dimensions, design layout, and data; supports pictures, bar codes, drawn shapes, counters, and various text styles.", "Windows, ", "['Worldlabel.com Label Designer']"], "wll": ["Microsoft Word Add-in", "Plugin file used by Microsoft Word, a word processing application; contains a software component that adds new features to the program; most commonly developed and distributed by third-party software developers for integrating other technologies with Word.", "Windows, ", "['Microsoft Word 2016']"], "wlmp": ["Windows Live Movie Maker Project File", "A WLMP file is a movie project file created by Windows Live Movie Maker, a program that allows users to create their own movies and slideshows.  It contains movie transitions, music, and effects as well as links to digital photos or videos.  WLMP files are used to create videos but they do not contain actual video.", "Windows, ", "['Microsoft Windows Live Movie Maker']"], "wldx": ["World Map File", "World map file created by Platform Game Engine (PGE) Project, an open source game engine; contains the overhead map of a world; includes paths to different playable levels, which are specified in .LVLX and .LVL files.", "Windows, Mac, Linux, ", "['Wohlstand PGE Editor']['Wohlstand PGE Editor']['Wohlstand PGE Editor']"], "wld": ["Terraria World File", "Game file used by Terraria, a 2D action adventure and sandbox construction game; saves a world, which contains terrain, water, monsters, items, and other objects; used for single or multiplayer gameplay and can be loaded by the Terraria dedicated server, which allows players to host Terraria worlds over a network.", "Windows, Windows, Linux, Windows, Mac, Linux, ", "['Re-Logic Terraria', 'Re-Logic Terraria Dedicated Server', 'Terraria Map Editor', 'MoreTerra']['ESRI ArcGIS for Desktop', 'GDAL', 'text editor']['GDAL', 'text editor']['Super Mario Bros. X', 'Wohlstand PGE Editor']['Wohlstand PGE Editor']['Wohlstand PGE Editor']"], "wlb": ["WinList Protocol Bundle", "Protocol bundle file used by WinList, a flow cytometry analysis program; contains a .WLX file in a Zip-compatible format; includes copies of FCS data files that are used in the setup.", "Windows, ", "['Verity Software House WinList']"], "wl6": ["Wolfenstein 3D Data File", "Game data file used by Wolfenstein 3D, one of the original first-person shooters (FPS); may contain sprites, textures, sounds, maps, and other data; loaded during gameplay.", "Windows, Mac, ", "['id Software Wolfenstein 3D']['id Software Wolfenstein 3D']"], "wl1": ["Wolfenstein 3D Data File", "Game data file used by Wolfenstein 3D, the original installation of the Wolfenstein first-person shooter series; may contain sprites, textures, sounds, maps, and other data; used by the shareware version of Wolfenstein 3D.", "Windows, ", "['id Software Wolfenstein 3D']"], "wku": ["Lotus 1-2-3 Spreadsheet", "Spreadsheet file created by older versions of Lotus 1-2-3, and the format is not supported anymore; originally used on DOS-based systems and early Windows-based computers.", "Windows, Mac, ", "['IBM Collaboration Solutions']['IBM Collaboration Solutions']"], "wks": ["Lotus 1-2-3 Spreadsheet", "Spreadsheet file created by Lotus 1-2-3; stores data in a grid of cells, which may contain formulas, alphanumeric text, or number values and are organized by rows and columns.", "Windows, Mac, Linux, Windows, Mac, ", "['IBM Collaboration Solutions', 'Microsoft Excel 2016', 'Corel Quattro Pro X8', 'Apache OpenOffice', 'Gnumeric']['Microsoft Excel 2016', 'Planamesa NeoOffice', 'Apache OpenOffice']['Apache OpenOffice', 'Gnumeric']['Microsoft Works', 'Microsoft Excel 2016', 'R&L WKS/WDB Converter']['Microsoft Excel 2016']"], "wke": ["Lotus 1-2-3 Educational Version Worksheet", "Spreadsheet file created by Lotus 1-2-3 educational version; contains data formatted in a grid of cells, each of which may contain alphanumeric text, formulas, or number values; organized in a spreasheet by rows and columns.", "Windows, ", "['Corel Quattro Pro X8']"], "wk5": ["Lotus 5 Worksheet", "Spreadsheet created by Lotus 1-2-3, version 5; contains data arranged by rows and columns, including numbers, text, and formulas; used for storing data and computing formulas.", "Windows, Mac, ", "['IBM Collaboration Solutions', 'Microsoft Excel 2016']['IBM Collaboration Solutions', 'Microsoft Excel 2016']"], "wki": ["Lotus 2 Worksheet", "Spreadsheet file created by version 2 of Lotus 1-2-3; saves data in the format of rows and columns; not used anymore since Lotus 1-2-3 version 2 was released in the 1980s and the software underwent many later revisions.", "Windows, Mac, ", "['IBM Collaboration Solutions']['IBM Collaboration Solutions']"], "wk4": ["Lotus 4 Worksheet", "Spreadsheet created by IBM Lotus 1-2-3 (v.4), a spreadsheet program included with Lotus SmartSuite; stores data in cells that are organized into rows and columns; each cell can store static data or a formula, which automatically updates the value displayed in the cell.", "Windows, Mac, Linux, ", "['IBM Collaboration Solutions', 'Corel Quattro Pro X8', 'Gnumeric']['IBM Collaboration Solutions']['Gnumeric']"], "wjr": ["ReGet Deluxe Data File", "Data file used by ReGet Deluxe, a modern download manager for Windows XP and Vista; may store configuration information (Default.wjr), file queue data (Queue.wjr), or other information referenced by ReGet.", "Windows, ", "[]"], "wjf": ["WinZip Job File", "File created by WinZip, a utility used for \"zipping\" files into compressed .ZIP archives; contains job instructions for how the archive should be created, such as folder names, encryption standard, security settings, and ZIP file destination; can be run manually or scheduled for execution on a periodic basis in WinZip.", "Windows, Windows, ", "['Corel WinZip 21']['Mariner WinJournal']"], "wje": ["WinJournal Entry", "Digital journal entry created by WinJournal, a journaling and blogging program for Windows; contains a single journal entry, including the date, topic, and entry text; may also include images, audio, and video; used for exporting individual journal entries and importing them into another journal (.WJF file).", "Windows, ", "['Mariner WinJournal']"], "wk3": ["Lotus 3 Worksheet", "Spreadsheet file created by Lotus 1-2-3, version 3; stores data in cells, which are organized into a grid of rows and columns; may be used for a variety of data-entry purposes.", "Windows, Mac, ", "['IBM Collaboration Solutions', 'Microsoft Excel 2016']['IBM Collaboration Solutions', 'Microsoft Excel 2016']"], "wk2": ["Lotus 2 Worksheet", "Spreadsheet created by Lotus 1-2-3, version 2, a spreadsheet program; contains data as a grid of rows and columns; supports text, numbers, formulas, and other types of data; used to store and organize data.", "Windows, Mac, ", "['IBM Collaboration Solutions', 'Microsoft Excel 2016']['IBM Collaboration Solutions', 'Planamesa NeoOffice', 'Microsoft Excel 2016']"], "wk1": ["Lotus Worksheet", "Spreadsheet created by Lotus 1-2-3, a popular spreadsheet program in the 1990s; contains cells, which are organized by rows and columns; used to store and analyze structured data, as well as quickly compute formulas.", "Windows, Mac, Linux, ", "['IBM Collaboration Solutions', 'Corel Quattro Pro X8', 'Apache OpenOffice', 'Gnumeric']['IBM Collaboration Solutions', 'Planamesa NeoOffice', 'Apache OpenOffice']['Apache OpenOffice', 'Gnumeric']"], "wiz": ["Microsoft Wizard File", "Wizard file used by Microsoft programs, such as Microsoft Word; contains macros, templates, and user interface elements; used to guide users through a series of steps in completing a complex or repetitive task; can be created as an add-in for Microsoft programs.", "Windows, ", "['Microsoft Word 2016', 'Microsoft Publisher 2016']"], "wixproj": ["WiX Project File", "File created by the WiX toolset, a Windows installer development program; contains elements such as <Configuration>, <ProductVersion>, <OutputName>, and <OutputPath> necessary to create a .MSI (Windows Installer package) file using the WiX Toolset.", "Windows, ", "['WiX Toolset', 'Microsoft Visual Studio 2017']"], "wixout": ["WiX XML Output File", "Output file created by the WiX toolset, a Windows installer developing program; generated when several object files (.WIXOBJ) are linked; the XML form of the final output; not intended to be manually opened.", "Windows, ", "['WiX Toolset']"], "wixobj": ["WiX Object File", "Object file created by the WiX toolset, a Windows installer developing program; contains multiple sections that hold symbols and references to other symbols; comprised of <table>, <row>, and <field> elements holding data that is placed into the Windows Installer database; created when each WiX Source file is compiled.", "Windows, ", "['WiX Toolset']"], "wixmst": ["WiX Transform File", "Transform file created by the WiX toolset, a Windows installer development utility; produced to represent the difference between a pair outputs or XML outputs; contains the MsiFileHash table that organizes the differences; appears in XML form.", "Windows, ", "['WiX Toolset']"], "wixpdb": ["WiX Debug File", "File created by the WiX toolset, a Windows installer development program; generated by the linker tool for every final output; contains debugging information.", "Windows, ", "['WiX Toolset']"], "winmd": ["Windows Metadata File", "File created using the Microsoft Interface Definition Language (MIDL); contains metadata that represents the API for customized Windows Runtime components; written in the DLL file format but does not have to contain code like traditional .DLL files; its format is used by the (.NET|aspnet) framework.", "Windows, ", "['Microsoft Visual Studio 2017']"], "wixmsp": ["WiX XML Patch File", "Patch file created by the WiX toolset, a Windows installer development utility; produced when .WIXOBJ files are linked in a patch build; contains the XML output of the linked WIXOBJ files.", "Windows, ", "['WiX Toolset']"], "wixlib": ["WiX Library File", "Library file created by WiX Toolset, a Windows installer development utility; contains a library of setup functions, including references connected to other elements in XML form.  ", "Windows, ", "['WiX Toolset']"], "wiq": ["Visual Studio Work Item Query File", "File used by Visual Studio, a software development application developed by Microsoft; used by software development teams for storing work items such as bugs and tasks; helps with project management because it allows work items to be assigned, queued, and tracked.", "Windows, ", "['Microsoft Visual Studio 2017']"], "windowslivecontact": ["Windows Live Contacts File", "File used by Windows Live Messenger, an online instant messaging program; contains contact card data, including name, nickname, email address, phone number, professional title, and photo image; saved in an encrypted format.", "Windows, ", "['Microsoft Windows Live Messenger']"], "winclone": ["Winclone Image", "Disk image file created by Winclone, a program used for managing Mac Boot Camp partitions; often contains an image of a Windows partition for XP, Vista, or 7; allows a Boot Camp partition to be saved as an image and then restored on another drive.", "Mac, ", "['Twocanoes Winclone']"], "wil": ["WinImage Disk Image List", "List of disk images generated by WinImage, a disk imaging program; created using the Batch Assistant within WinImage; may be used to export multiple .IMA files or a single .WLZ file.", "Windows, ", "['Gilles Vollant WinImage']"], "win": ["FoxPro Window Settings", "Contains FoxPro window definitions and statuses; used for backing up window settings; can be restored using the RESTORE WINDOW command", "Windows, Windows, ", "['Microsoft Visual FoxPro'][]"], "wii": ["Scrambled Wii Disc Image", "Disc image format used by the homebrew community for Nintendo Wii discs; saves a Wii game in a scrambled format; can be unscrambled and converted to the .ISO format with Wii Unscrambler and then burned to a standard disc; sometimes used for backing up Wii games.", "Windows, ", "['Wii Unscrambler']"], "wim": ["Windows Imaging Format File", "File-based imaging format introduced with Windows Vista; allows a single disk image to be deployed to multiple computer platforms; files such as drivers, updates, and components can be managed within the file without booting the operating system image.", "Windows, ", "['File Viewer Plus', 'Microsoft ImageX', 'WinMount International WinMount', '7-Zip', 'PeaZip', 'ExtractNow']"], "wie": ["WordPress Widget Export File", "Exported widget file created by Widget Importer & Exporter, a WordPress plugin used to import and export widgets; contains a widget in JSON format that has been exported from a WordPress site.", "Web, ", "['WordPress']"], "wif": ["Weaving Interchange Format File", "A WIF file is a pattern file saved in the Weaving Interchange Format (WIF) and used by WeaveIt software.  It contains a draft pattern of a weave which consists of cells that can be used to mark positions and fill with color.", "Windows, iOS, Android, ", "['Canyon Art WeaveIt']['Canyon Art iWeaveIt']['Canyon Art iWeaveIt']"], "widget": ["Microsoft Windows Mobile Widget", "HTML-based widget used by Windows Mobile, an operating system for PDAs, digital phones, and other mobile devices; contains an archive of files in a compressed Zip format; may store .HTML, .XML, .CSS, and .JS files, as well as other Web-based files.", "Windows, Windows, Mac, Windows, Mac, Linux, ", "['Microsoft Windows Mobile SDK', 'Microsoft Visual Studio with Windows Mobile Developer Tool Kit plug-in']['7-Zip', 'Corel WinZip 21']['The Unarchiver', 'Apple Archive Utility'][][][]"], "wic": ["J Wavelet Image", "Image created with the J Wavelet codec wavelet compression algorithm; may be opened and converted to more common raster image formats using XnView, even though the file extension is very rare.", "Windows, Mac, Linux, ", "['XnViewMP']['XnViewMP']['XnViewMP']"], "wid": ["SAP BusinessObjects Web Intelligence File", "Data file created by SAP BusinessObjects, a business analytics application used for studying competitive intelligence, profits, and customer relationships; saves a collection of data and reports that are the result of analysis conducted in the software; used for storing business intelligence analyses.", "Windows, Windows, ", "[]['Microsoft Visual Studio 2017']"], "wi": ["Wavelet Image", "Image file compressed using wavelet image compression, a high compression algorithm that maintains the most of the quality of the original image.", "Windows, Mac, ", "['CorelDRAW Graphics Suite X8', 'Corel Presentations X8'][]"], "whtt": ["HTTrack Website Copier File", "Website downloaded with HTTrack, a free offline browser program; downloads the Web pages, directories, and images from an entire website; may be used for viewing a website when not connected to the internet.", "Windows, Linux, ", "['WinHTTrack']['HTTrack', 'WebHTTrack']"], "whf": ["Wing Helper File", "Proprietary data file generated by Wing Helper, a parametric 3D CAD tool for designing RC airplanes; contains information about all RC airplane elements that Wing Helper supports.", "Windows, Mac, Linux, ", "['Wing Helper']['Wing Helper']['Wing Helper']"], "whirld": ["Unity Whirld Package", "World designed in the Whirld open file format; created using the Unity 3D engine; contains a 3D world and corresponding settings, such as lighting, terrain, and player spawn locations.", "Windows, Mac, Linux, ", "['Unity Technologies Unity', 'Syn3h']['Unity Technologies Unity', 'Syn3h']['Unity Technologies Unity', 'Syn3h']"], "wgz": ["S60 Web Runtime Widget Package", "Compressed archive that contains a widget, or small program, for Nokia S60-based phones; may include HTML, CSS and JavaScript files; runs via the Web Runtime (WRT) software included with S60 phones.", "Windows, Mac, ", "['Nokia Suite', 'Nokia PC Suite']['Nokia Multimedia Transfer']"], "wgt": ["IMPS Data File", "Contains Census Bureau data recorded by IMPS (Integrated Microcomputer Processing System) survey and census data processing software", "Windows, Linux, Windows, Mac, Linux, ", "[][]['Opera']['Opera']['Opera']"], "wgs": ["Walk-Graph Segment File", "Image file used by RichFX online merchandising programs such as Rich Catalog, Zoom, Color Change, Rotate, and Design; can also be viewed with the RichFX RealPlayer plugin.", "Windows, ", "[]"], "wgp": ["Web Gallery Project", "Web gallery created with WebHat Web Gallery software; can be published to the Web with a custom template or \"scheme;\" may also include special image effects, such as borders, shadows, and other filters.", "Windows, ", "[]"], "wgi": ["Wildgame Innovations Video File", "A WGI file is a video recorded by Wildgame Innovations software, which is used to record wild game activity in different locations for hunting purposes.  The video is a collection of time-lapse images known as \"flex-time.\"", "Windows, Mac, Linux, ", "['Wildgame Innovations software', 'VideoLAN VLC media player']['Wildgame Innovations software', 'VideoLAN VLC media player']['VideoLAN VLC media player']"], "wgf": ["Widelands Game File", "Saved game created by Widelands, an open source strategy game where players build settlements and battle other tribes; contains the initial saved state for a game; used to record the starting conditions for a game.", "Windows, Mac, Linux, ", "[][][]"], "wfw": ["Windows Firewall Policy File", "A WFW file is a settings file created by Windows Firewall with Advanced Security, a utility that comes with the Windowsoperating system.  It contains settings for a Windows firewall, which includes inbound and outbound connection security rules and general and logging settings.", "Windows, ", "[]"], "wft": ["GTA 4 Car Model File", "3D model used by Grand Theft Auto IV, an urban city action game; saves a model of a car that is driven around the city in the game; may be a preinstalled car model with the game, or sometimes is a model created by a game community \"modder.\"", "Windows, ", "['Rockstar Games Grand Theft Auto 4', 'Zanoza ZModeler', 'GTA IV Modding Unlocker']"], "wfp": ["WaveFront Program File", "Contains a single program, or patch, used by the Turtle Beach WaveFront synthesizer chip; WaveFront-based synthesizers includes the Maui, Tropez, Rio, and Monterey.", "Windows, ", "['FMJ-Software Awave Studio']"], "wfsp": ["Wondershare Fantashow Project", "A WFSP file is a video project created by Fantashow, a video editor used to make home movies.  It contains project elements, which includes references to imported video, audio, and images that have been imported.  WFSP files also contain a video style chosen by the user such as Stunning Film, Blinds Effect, and Shining Life.", "Windows, Mac, ", "['Wondershare Fantashow 3']['Wondershare Fantashow 3']"], "wfm": ["Pro Tools Wave Cache File", "File generated by Pro Tools, a professional audio recording, editing, and mixing application; saves waveform information that Pro Tools has calculated for audio files; enables Pro Tools to display a preview of the waveform in the software.", "Windows, Mac, Windows, Windows, ", "['Avid Pro Tools']['Avid Pro Tools']['Tektronix WaveStar', 'Tektronix Windows Oscilloscope WFM Converter']['dBase']"], "wfd": ["WaveFront Drum Kit File", "Contains audio samples for a complete drum kit; used by the Turtle Beach WaveFront synthesizer chip to recreate drum sounds; WaveFront-based synthesizers includes the Maui, Tropez, Rio, and Monterey.", "Windows, Windows, ", "['FMJ-Software Awave Studio'][]"], "wfc": ["Windows Wireless Network Settings File", "File used by Windows Connect Now, a program that helps network devices connect to wireless networks; contains wireless network settings in XML format, such as the SSID and encryption method; used for configuring and bootstrapping wireless network devices.", "Windows, ", "['Microsoft Windows Connect Now', 'text editor']"], "wfb": ["WaveFront Sound Bank", "Collection of sounds or audio samples used by the Turtle Beach WaveFront synthesizer chip; WaveFront-based hardware includes the MultiSound Monterey sound card and the Maui Wavetable Synthesizer.", "Windows, ", "['FMJ-Software Awave Studio']"], "wer": ["Windows Error Report", "Error report generated by Windows Error Reporting (WER); captures software crash data and helps users provide crash information when reporting errors; gathers information for both operating system application crashes.", "Windows, ", "[]"], "wem": ["Wwise Encoded Media File", "File created by Wwise (WaveWorks Interactive Sound Engine), a sound engine used for producing video game audio; contains audio data encoded in the Wwise proprietary format; uses a format that allows sounds to be modified in real-time during gameplay; may be packaged within a game archive rather than stored as a standalone game asset file.", "Windows, ", "['Audiokinetic Wwise']"], "webz": ["WEBZ Compressed eBook File", "eBook file used by Web Books Viewer, an eBook reader that runs in a Web browser; contains HTML files, images, and CSS  files in a compressed .ZIP archive; decompressed and displayed when opened in the Web Books Viewer.", "Web, ", "['Web Books Publishing Web Books Viewer']"], "webtheme": ["iWeb Theme Template", "Theme template created by iWeb, a user-friendly Web design program; contains pre-designed themes such as Leaf Print, Fine Line, Goldenrod, and Modern Frame; each theme contains fonts and images specific to the theme; opened through the application.", "Mac, ", "['Apple iWeb']"], "webtest": ["Visual Studio Web Test File", "A WEBTEST file contains a web test used by Visual Studio, a software development tool for Windows programs and web applications.  It stores HTTP requests that have been recorded by the Web Test Recorder in a browser session or manually built by the Web Test Editor in Visual Studio.  WEBTEST files are used by developers to test the performance of a website before it is published.", "Windows, ", "['Microsoft Visual Studio 2017']"], "webtemplate": ["iWeb Template", "Template created by iWeb, a user-friendly Web design program; contains pre-designed templates organized under themes such as Leaf Print, Fine Line, Goldenrod, and Modern Frame; opened through the application.", "Mac, ", "['Apple iWeb']"], "website": ["Internet Explorer Pinned Site Shortcut", "A WEBSITE file is a pinned site shortcut created by Internet Explorer (IE), a web browser for Windows.  It contains a web address reference (a URL) and an icon file, which references the website's favicon.ico and is used as the displayed icon for the shortcut.  WEBSITE files are used for saving and opening bookmarks and favorites.", "Windows, ", "['Microsoft Internet Explorer']"], "webpublishhistory": ["Alpha Five Web Publish History File", "File created by Alpha Five, a Web, mobile, and desktop application development program; contains information about publishing history; referenced by Alpha Five to determine what needs to be published from the Web project such as .A5W and .A5WCMP files.", "Windows, ", "['Alpha Software Alpha Anywhere']"], "webp": ["WebP Image", "Raster image format (pronounced \"Weppy\") developed by Google for Web graphics; designed to reduce image file sizes over standard JPEG compression while maintaining the same or similar quality; allows images to be downloaded more quickly.", "Windows, Mac, Linux, ", "['File Viewer Plus', 'Google Chrome', 'Adobe Photoshop with WebP File Format plug-in', 'Logipole Konvertor', 'Opera', 'IrfanView', 'WebP Codec for Windows']['Google Chrome', 'Adobe Photoshop with WebP File Format plug-in', 'Pixelmator 3', 'Opera']['Google Chrome', 'Opera']"], "webpnp": ["Web Point and Print File", "Printer driver package file used by Microsoft Windows; saved in the .CAB format and contains an install package for a printer driver; used for distributing printer drivers provided from websites or client networks.", "Windows, ", "['Microsoft Windows']"], "webm": ["WebM Video File", "A WEBM file is a compressed video saved in the WebM format, an open, high-quality video standard.  It stores video compressed using VP8 technology and audio compressed using Ogg Vorbis compression.  WEBM files are commonly used for delivering online videos using the HTML5 <video> tag.", "Windows, Mac, Linux, iOS, Android, ", "['File Viewer Plus', 'VideoLAN VLC media player', 'Miro Video Converter', 'Microsoft Windows Media Player with DirectShow Filter', 'Microsoft Edge', 'Microsoft Internet Explorer with VP8 plug-in', 'Mozilla Firefox', 'Google Chrome', 'Opera']['VideoLAN VLC media player', 'Miro Video Converter', 'ShedWorx Smart Converter', 'Mozilla Firefox', 'Google Chrome', 'Opera', 'Eltima Elmedia Player']['VideoLAN VLC media player', 'FFmpeg', 'Mozilla Firefox', 'Opera']['olimsoft OPlayer', 'PentaLoop PlayerXtreme Media Player']['File Viewer for Android']"], "webloc": ["Mac OS X Website Location", "A WEBLOC file is a Mac OS X website shortcut typically generated by the Safari web browser.  It contains the URL of a webpage and is created by dragging the website icon next to the address field to the desktop or another folder on the hard drive.  WEBLOC files are similar to .URL files created by other programs.  ", "Windows, Mac, ", "['text editor']['Apple Safari', 'Google Chrome', 'Mozilla Firefox', 'Mozilla SeaMonkey', 'Opera']"], "webhistory": ["Safari Web History File", "File created by Safari, a Web browser for Mac OS X; saves data for a visited Web page, including the Web page's title and URL; used for remembering visited websites and auto-completing Web addresses as users type them in the address bar.", "Mac, ", "['Apple Safari']"], "web": ["Xara Web Document", "Web development project created by Xara Web Designer or Xara Designer Pro; includes the selected site template, the site pages, and the user customizations; can be published to the website server via FTP when complete.", "Windows, ", "['MAGIX Xara Designer Pro X11', 'MAGIX Xara Web Designer 11', 'MAGIX Xara Photo & Graphic Designer 11']"], "webdoc": ["Box.net Web Document", "Online document created using Zoho Editor, a Web browser application used to edit documents for the Box.net file sharing service; saves the document in a proprietary Box.net format that is only editable with the online Zoho Editor; can be viewed with the Box.net offline Box Sync application.", "Windows, ", "['Box.net Box Sync']"], "webbookmark": ["Safari Web Bookmark File", "Bookmark file created by Safari, a Mac OS X Web browser; saves a bookmarked Web page, including the Web page's title, URL, and bookmark group; used for saving and organizing favorites and other Web pages.", "Mac, ", "['Apple Safari']"], "webarchivexml": ["Android Web Browser Archive", "Webpage archive created by the default Web browser on Android mobile devices; saves an offline version of a webpage that may be viewed without being connected to the Internet; saved to the Downloads directory on the Android device and can only be viewed in the Android browser.", "Android, ", "['Google Android Browser']"], "weavelibrary": ["Painter Weave Library", "Library created and used by Corel Painter, a drawing application used to create digital artwork; holds a collection of media weaves, which are textured patterns that can be added to the canvas; includes Pastel Plaid, Checkerboard Diamonds, and Picnic weaves; similar to .ABR Photoshop brushes.", "Windows, Mac, ", "['Corel Painter 2017']['Corel Painter 2017']"], "webapp": ["Firefox Web App Manifest File", "Web app manifest file used by Firefox OS apps to identify important details of an app; contains information in JSON format about an app, which includes the name, developer, launch path, description, and icon(s); also contains a list of web APIs that the app requires.", "Windows, Mac, Linux, Web, ", "['Mozilla Web App Validator']['Mozilla Web App Validator']['Mozilla Web App Validator']['Mozilla Web App Validator']"], "webarchive": ["Safari Web Archive", "A WEBARCHIVE file is a webpage saved by the Safari web browser.  It contains HTML and linked images so the page can be loaded fully at a later time even if the computer is offline, or not connected to the Internet.  WEBARCHIVE files may also contain CSS or JavaScript depending on the webpage content. ", "Windows, Mac, ", "['Apple Safari']['Apple Safari', 'iCab', 'Cruz', 'Apple TextEdit']"], "weap": ["Quake 3 Engine Weapon File", "Weapon description file used by id Tech 3 (Quake III engine) games; contains plain-text definition for game weapons, including 3D models, animations, sounds, and the weapon icon; often used by game modification packages to store custom weapons.", "Windows, ", "['Microsoft Notepad', 'Microsoft WordPad', 'text editor']"], "wea": ["Ecotect Weather File", "Weather data file used by Autodesk Ecotect, a building analysis program for designing energy efficient buildings; may also be opened using the Weather Tool, a program used for analyzing and visualizing hourly climate data.", "Windows, ", "[]"], "wdw": ["WinDev Window File", "Developer file created by WinDev, a program used for making Windows and mobile applications; saves an application window and may include text fields, buttons, drop-down menus, graphics, and other elements; acts as a dialog box for user input or as a view for output display.", "Windows, ", "['PC SOFT WinDev']"], "wdseml": ["Thunderbird Searchable Email File", "File created by Mozilla Thunderbird, a free email and news program; contains email message information and enables Windows search to find specific content in the emails when performing Windows searches; provides a convenience for Windows Thunderbird users.", "Windows, ", "['Mozilla Thunderbird']"], "wdq": ["Offline Explorer Queue File", "List of website files to be downloaded with Offline Explorer, a website archiving program; serves as a download queue that contains URLs of HTML pages, images, and other files from a specific website.", "Windows, ", "[]"], "wdp": ["Windows Media Photo File", "Compressed raster image format developed by Microsoft; similar to the .JPG format, but uses a higher degree of compression and supports both lossy and lossless compression; used primarily for high-resolution digital photographs; can be used with several Microsoft products including Windows Photo Viewer, Windows Live Movie Maker (WLMM), and Microsoft Word.", "Windows, Mac, Windows, Windows, ", "['Microsoft Windows Photo Viewer', 'Microsoft Windows Live Movie Maker', 'Corel PaintShop Pro X9', 'Serif PhotoPlus', 'Adobe Photoshop with HD Photo plugin', 'Alchemy Mindworks Graphic Workshop Professional', 'Axel Rietschin FastPictureViewer', 'dotPDN paint.net', 'CoolUtils Total Image Converter']['Adobe Photoshop with HD Photo plugin']['Autodesk AutoCAD Electrical 2017']['PC SOFT WinDev']"], "wdl": ["World Definition Language Script", "Script written in the World Definition Language (WDL); used for programming games in 3D Gamestudio (3DGS), a game development program; contains program source code and may reference other WDL files.", "Windows, ", "[]"], "wdgtproj": ["Dashcode Widget Project", "Widget development project created by Dashcode, a program used for developing widgets for the Mac OS X dashboard; may include HTML, CSS, and JavaScript content; used for simple, lightweight applications such as clocks, small games, and weather trackers.", "Mac, ", "['Apple Dashcode']"], "wdgt": ["Dashboard Widget", "Widget used by the Dashboard in Mac OS X 10.4 and later; contains a small program such as a clock, calendar, dictionary word search, weather report, or a calculator; used as the format for distributing widgets and can be double-clicked to install the widget on the dashboard.", "Mac, Windows, Mac, Linux, Windows, Mac, ", "['Apple OS X']['Opera']['Opera']['Opera']['Adobe Captivate']['Adobe Captivate']"], "wdf": ["Workshare Compare DeltaFile", "Document created by Workshare Compare, an application used for document comparison; stores a document that contains the comparison, or redline, between two versions of a document; used for document collaboration in office environments.", "Windows, Windows, Windows, Windows, Mac, Linux, Windows, ", "['Workshare 9'][][]['WiiJManager']['Wiimms WBFS Tool', 'WiiJManager']['Wiimms WBFS Tool', 'WiiJManager']['Midnight Synergy Wonderland Adventures', 'Midnight Synergy Wonderland Adventures Editor', 'Microsoft Windows Media Player', 'Microsoft Windows Photo Viewer']"], "wdb": ["Microsoft Works Database", "Database created with the Microsoft Works database program; similar to an Access Database (.MDB file), but with more limitations; uses a proprietary data format that cannot be opened by MS Access.", "Windows, Mac, Windows, Mac, ", "['Microsoft Works', 'CodeAlchemists Works Database Converter', 'R&L WKS/WDB Converter']['LawBox LLC WDB Viewer Pro']['Blizzard World of Warcraft']['Blizzard World of Warcraft']"], "wcz": ["Chameleon Clock Wallpaper File", "File used by Chameleon Clock, a program used to customize Windows wallpapers; contains a background image, preview images, and several other images containing graphics for displaying the current time; used to synchronize wallpaper graphics with the system clock time; stored using Zip compression.", "Windows, ", "[]"], "wcx": ["RemoteApp and Desktop Connections Configuration File", "Configuration file used by Remote Desktop Connection, a program included with Windows used to access computers remotely; contains setup information to bootstrap or install initial connection settings; often distributed within company networks when computers are setup or updated.", "Windows, ", "['Microsoft Remote Desktop Connection']"], "wd3": ["Offline Explorer Data File", "File created by Offline Explorer, a program used for downloading webpages and viewing them offline; acts as a project file for the downloaded website and contains references to the sitemap of downloaded files.", "Windows, ", "['MetaProducts Systems Offline Explorer']"], "wcry": ["WannaCry Virus Encrypted File", "A WCRY file is a file encrypted by WannaCryptor ransomware infection utilized by cybercriminals.  It contains a user's file, such as a .BAK, .DOC, .MPG, or .PDF file, encrypted by the virus.  WCRY files became prevalent in 2017.", "Windows, ", "[]"], "wcp_settings": ["Alpha Five Settings File", "Settings files created by Alpha Five, an IDE used to develop Web, mobile, and desktop applications; contains Web Project settings for a profile; holds data such as the project name and the path to the \"WebProject\" folder that holds project files like .A5W, .A5WCMP, .PNG, and .A5RPT; located in the same location as the \"WebProjects\" folder, which is inside your project folder.", "Windows, ", "['Alpha Software Alpha Anywhere']"], "wcp": ["WinDVD Creator Project File", "Contains DVD project information for a DVD created with InterVideo WinDVD Creator; stores project configuration information and references to video clips used by the DVD project.", "Windows, ", "[]"], "wcm": ["WordPerfect Macro", "Runs a series of commands or automates a task in the WordPerfect word processing program; can be created/recorded by selecting Tools→Macro-Record within WordPerfect.", "Windows, Windows, ", "['Corel WordPerfect X8']['Microsoft Works']"], "wcinv": ["Windows Meeting Space Invitation File", "A WCINV file contains an invitation created by Windows Meeting Space, a peer-to-peer collaboration program included with Windows Vista.  It stores an invitation created to share with other users in order to invite them to join a meeting.  WCINV files are no longer used by Windows Meeting Space since the program was discontinued.", "Windows, ", "[]"], "wcat": ["WinCatalog Collection File", "File created by WinCatalog, a program used to index file information in Windows; contains an index of information about discs, hard drive files, and folders; helps users perform fast searches in place of the Windows search.", "Windows, ", "['WinCatalog']"], "wcf": ["WebEx Saved Chat Session", "Text automatically saved from a chat session during a WebEx Web meeting or online seminar; records the date and time of each message sent.", "Windows, Mac, ", "['text editor']['text editor']"], "wcd": ["Works Calendar File", "File created by the calendar component of Microsoft Works, which allows users to manage personal schedules; contains appointments, dates, and other important events; saved by default with the filename Mswkscal.wcd.", "Windows, ", "['Microsoft Works']"], "wc": ["Valve Hammer Configuration File", "File created by Valve Hammer Editor, a mapping tool for the Goldsource engine that runs games such as Counter-Strike and Half-Life; contains configuration information for compiling maps into formats that are usable in the Source engine; configurations include Default, Fast, HDR Full Compile, Run Map in Engine Fullscreen, and more.", "Windows, ", "['Valve Hammer Editor']"], "wbz": ["Webshots Download Picture File", "File used by Webshots Desktop Connect, a program used for viewing, organizing, and sharing digital pictures over the Web; contains one or more downloaded images in a proprietary format; used to package images for download so that they are viewable in Webshots Desktop Connect.", "Windows, Mac, Linux, ", "['Threefold Photos Webshots Desktop Connect', 'Ultimate Webshots Converter', 'fCoder Group Image Converter Plus', 'XnViewMP']['XnViewMP', 'Ultimate Webshots Converter']['Ultimate Webshots Converter']"], "wbxml": ["WAP Binary XML File", "File created in the WAP (Wireless Application Protocol) Binary XML (WBXML) format, a compact binary file format used for transmitting XML documents over wireless mobile networks; allows mobile devices to preserve XML formatting while reducing the transmission time.", "Windows, Mac, Linux, ", "['Digia Qt SDK', 'Wbxml Parser for SYNCML']['Digia Qt SDK']['libwbxml2-utils', 'Digia Qt SDK']"], "wbt": ["Toribash Help File", "Contains help documentation for Toribash, a 3D fighting game where users create the characters' moves; may include tutorials, FAQs, and other game help; must be stored in the scripts folder in order to open correctly.", "Windows, Mac, Linux, ", "['Nabi Studios Toribash']['Nabi Studios Toribash']['Nabi Studios Toribash']"], "wbs": ["WebBlender Project File", "Project created by WebBlender, an interactive, kid-friendly presentation and web site creation program; contains a WebBlender site, which holds features such as pages, images, text, shapes, buttons, and animations; published as .HTML files.", "Windows, Mac, Linux, ", "['Tech4Learning WebBlender 2']['Tech4Learning WebBlender 2']['Tech4Learning WebBlender 2']"], "wbp": ["Webshots Collection File", "File used by Webshots Desktop Connect, an application that enables users to view, organize, and share pictures; contains a collection of .JPEG images stored in the Webshots proprietary format; used to organize multiple pictures in a single collection; same as a .WBC file but less common.", "Windows, Mac, Linux, ", "['Threefold Photos Webshots Desktop Connect', 'Ultimate Webshots Converter']['Ultimate Webshots Converter']['Ultimate Webshots Converter']"], "wbmp": ["Wireless Bitmap Image File", "Black and white bitmap image format used by mobile devices such as cell phones and PDAs; can be sent from one phone to another via the SMS messaging protocol; similar to a standard bitmap (.BMP) file, but only supports monochrome (1-bit) image data.", "Windows, Mac, Linux, Android, ", "['File Viewer Plus', 'Adobe Photoshop CC 2017', 'Adobe Photoshop Elements 15', 'ACD Systems Canvas X 2017', 'ACD Systems ACDSee 20', 'Corel PaintShop Pro X9', 'Inkscape']['Adobe Photoshop CC 2017', 'Adobe Photoshop Elements 15', 'Inkscape']['Inkscape']['File Viewer for Android']"], "wbm": ["Webmin Module", "Plug-in file used by Webmin, a Web-based system administration user interface for Unix; saves a module, which is an addon for the base software; used for adding new control panels or report interfaces, such as printer managers, Web server controls, or system monitors.", "Linux, Windows, Mac, Linux, ", "['Webmin']['Adobe Photoshop CC 2017', 'Adobe Photoshop Elements 15', 'Corel PaintShop Pro X9', 'ACD Systems ACDSee 20', 'XnViewMP']['Adobe Photoshop CC 2017', 'Adobe Photoshop Elements 15', 'XnViewMP']['XnViewMP']"], "wbk": ["Word Document Backup", "Backup file created by Microsoft Word, a popular word processor; contains a backup copy of a Word document (.DOC); used to recover a document file in the event that it is deleted or corrupted.", "Windows, Mac, Windows, ", "['Microsoft Word 2016']['Microsoft Word 2016']['Corel WordPerfect X8']"], "wbi": ["Compact ISO File", "Compact ISO file used to store Wii game data; contains an exact duplicate of data from the original disc, but does not include any \"junk data.\"", "Windows, ", "['Wii Backup Manager']"], "wbfs": ["Wii Backup File System File", "Alternative Wii game disc image format designed by Wii homebrew developers; contains an image of a Wii game that can be loaded onto a WBFS partition; used to store Wii games on Secure Digital (SD) or USB external devices that are formatted with the WBFS format.", "Windows, Mac, Linux, ", "['WBFS Manager', 'WiiJManager', 'Wii Backup Manager', 'Wii Unscrambler', 'Dolphin']['Wiimms WBFS Tool', 'WiiJManager', 'Dolphin']['Wiimms WBFS Tool', 'WiiJManager', 'Dolphin', 'Wiithon']"], "wbd": ["Webshots Picture File", "Picture file used by Webshots Desktop Connect, a program used for sharing, organizing, and viewing pictures; contains a picture image stored in a proprietary format; used by Webshots to help users organize their pictures.", "Windows, Mac, Linux, ", "['Threefold Photos Webshots Desktop Connect', 'Ultimate Webshots Converter', 'fCoder Group Image Converter Plus', 'XnViewMP']['XnViewMP', 'Ultimate Webshots Converter']['XnViewMP', 'Ultimate Webshots Converter']"], "wbc": ["Webshots Collection File", "File used by Webshots Desktop Connect, a program that allows users to share, organize, and view pictures; contains a collection of .JPEG pictures stored in a proprietary format; used for organizing multiple pictures in a single collection; often contain encrypted data.", "Windows, Mac, Linux, ", "['Threefold Photos Webshots Desktop Connect', 'Ultimate Webshots Converter', 'fCoder Group Image Converter Plus', 'XnViewMP']['Ultimate Webshots Converter', 'XnViewMP']['Ultimate Webshots Converter', 'XnViewMP']"], "wb1": ["Corel Quattro Pro File", "File created by Quattro Pro, a spreadsheet program that is included in Corel WordPerfect Office; contains spreadsheet data such as sheets, calculations, numbers, and charts; used for common business office and personal finance tasks.", "Windows, Windows, Mac, Linux, ", "['Corel Quattro Pro X8', 'Microsoft Excel 2016']['Threefold Photos Webshots Desktop Connect', 'Ultimate Webshots Converter', 'fCoder Group Image Converter Plus', 'BioniX Wallpaper', 'XnViewMP']['Ultimate Webshots Converter', 'XnViewMP']['Ultimate Webshots Converter', 'XnViewMP']"], "wbcat": ["Windows Backup Catalog File", "Backup information file created by the Windows Backup and Restore application; stores a catalog of files created for the backup; created with several .ZIP files, which contain the system and user files for the backup.", "Windows, ", "['Microsoft Windows Backup and Restore']"], "wbb": ["WinBackup Archive", "Backup archive created with WinBackup, a backup utility for Windows; may contain a full system backup or an archive of files selected by the user; can be used to restore data if the original data is lost or corrupted.", "Windows, ", "[]"], "wba": ["WindowBlinds Compressed Skin", "Custom skin or theme created with WindowBlinds, a program used for customizing the interface of the Windows operating system; can alter the look of  window borders, title bars, task bars, progress animations, toolbar icons, the Start menu, and other aspects of Windows.", "Windows, ", "['Stardock WindowBlinds']"], "wb3": ["Corel Quattro Pro 7 and 8 File", "File created by Quattro Pro, a spreadsheet program included with Corel WordPerfect Office; contains data, charts, calculations, and scripts in a grid of spreadsheet cells; typically used for common business tasks or in personal finance.", "Windows, ", "['Corel Quattro Pro X8', 'Microsoft Excel 2016']"], "wb2": ["Webshots Picture File", "Picture file format created and used by Webshots Desktop Connect, a program that allows users to view, organize, and share pictures; contains an image stored in the Webshots proprietary format.", "Windows, Mac, Windows, ", "['Threefold Photos Webshots Desktop Connect']['Threefold Photos Webshots Desktop Connect']['Corel Quattro Pro X8', 'Microsoft Excel 2016']"], "wb0": ["Webshots Picture File", "Picture file format used by Webshots Desktop Connect, a program used to share, organize, and view pictures; contains a picture image used by Webshots to help users organize their pictures.", "Windows, Mac, Linux, ", "['Threefold Photos Webshots Desktop Connect', 'Ultimate Webshots Converter']['Ultimate Webshots Converter']['Ultimate Webshots Converter']"], "w64": ["Sony Wave64 Audio File", "Audio container file created in Sony's Wave64 format, which is supported by various Sony audio editing programs; useful for audio editing because it supports arbitrary sampling frequencies, channels, and bit depths.", "Windows, Mac, ", "['MAGIX Sound Forge Pro 11', 'MAGIX Vegas Pro 14', 'MAGIX SpectraLayers Pro 4']['ShedWorx Smart Converter', 'MAGIX SpectraLayers Pro 4']"], "w3x": ["Warcraft 3 Expansion Map FIle", "Game map or scenario created for Warcraft III: The Frozen Throne expansion pack; includes terrain information, regions, units, and other objects that can be placed within the map; may be included with the game or created by players using the Warcraft III World Editor.", "Windows, Mac, ", "['Blizzard Warcraft 3: The Frozen Throne', 'Blizzard Warcraft 3 World Editor']['Blizzard Warcraft 3: The Frozen Throne', 'Blizzard Warcraft 3 World Editor']"], "w3z": ["Warcraft 3 Saved Game File", "Mission save file created by Warcraft III and the Warcraft III Frozen Throne expansion pack; saves current progress and allows the game to be loaded and continued at a later time.", "Windows, Mac, ", "['Blizzard Warcraft 3']['Blizzard Warcraft 3']"], "wa": ["Windows Addon Archive", "Addon archive created and used by Win Toolkit, a lightweight application for Windows 7 that allows you to customize a Windows installation; contains application information that can be integrated with a .WIM file to allow you to customize the programs that are installed during the Windows installation.", "Windows, ", "['Win Toolkit']"], "w3n": ["Warcraft 3 Expansion Campaign Map File", "A W3N file is used by Warcraft III: The Frozen Throne, an expansion to Warcraft III.  It contains campaign maps, which consist of a series of missions and is used for creating custom campaigns.  W3N files may be created using the Campaign Editor component of the Warcraft III World Editor but may only be used by The Frozen Throne expansion pack.", "Windows, Mac, ", "['Blizzard Warcraft 3: The Frozen Throne', 'Blizzard Warcraft 3 World Editor']['Blizzard Warcraft 3: The Frozen Throne', 'Blizzard Warcraft 3 World Editor']"], "w3m": ["Warcraft 3 Map File", "Game map used by Warcraft III: Reign of Chaos; includes terrain, objects, and resources placed within the map; may be included with the game or created by players with the Warcraft III World Editor.", "Windows, Mac, ", "['Blizzard Warcraft 3', 'Blizzard Warcraft 3 World Editor']['Blizzard Warcraft 3', 'Blizzard Warcraft 3 World Editor']"], "w3g": ["Warcraft 3 Replay File", "Recording of a Warcraft III game; includes all activity of a scenario or match from start to finish; saved automatically in the WarCraft III installation folder; will be overwritten the next time a game is played if the file is not saved manually.", "Windows, Mac, ", "['Blizzard Warcraft 3']['Blizzard Warcraft 3']"], "w3d": ["Adobe Shockwave 3D File", "File used by Adobe Director, a program used for making interactive multimedia content for the Web, CDs, and DVDs; stores a 3D scene and/or animation that was exported from a third-party 3D modeling program and then imported into Adobe Director for publishing online.", "Windows, Mac, ", "['Adobe Director', 'Adobe Shockwave Player']['Adobe Director', 'Adobe Shockwave Player']"], "w32": ["Win32 Makefile", "Developer file used by Visual Studio, Make, and other programs used for building Win32 (Windows) application executables (.EXE files); saved in a plain text format and contains instructions for constructing the EXE file; often named Makefile.w32.", "Windows, Windows, ", "['Microsoft Visual Studio 2017', 'GNU Make for Windows'][]"], "w02": ["Split Archive File", "Archive file used by various programs; contains a portion of the installation or archive files needed to reconstruct or install a program; commonly downloaded as \"disk 2\" of an installation; typically has a corresponding \"disk 1\" installer file, which may have the name setup.exe.", "Windows, ", "[]"], "w01": ["Yamaha SY Series Wave File", "Audio wave file saved by a Yamaha SY series synthesizer such as the SY99 or SY85; may also be used by the TX16W sampler, which typically saves files with a .TXW extension.", "Windows, Windows, ", "['FMJ-Software Awave Studio']['Samsung Recovery']"]}