{"x": ["DirectX Model File", "3D image file used by DirectX technology, which is often used for rendering 3D graphics in games; may contain specifications for meshes, textures, animations, and objects; can be exported using the DirectX SDK plugins for 3ds Max and Maya, or with custom exporters for programs such as Blender and DeleD.", "Windows, Windows, Linux, ", "['Microsoft DirectX SDK']['Microsoft Visual Studio with MKS Lex & Yacc plug-in', 'text editor']['Lex', 'text editor']"], "xar": ["Xara Xtreme Drawing", "Vector format used by Xara Xtreme and its predecessors, Xara X, CorelXARA, and Xara Photo & Graphic Designer; also created by Xara Designer Pro; can be used for editing photos, creating illustrations, and developing Web graphics; previously known as the Flare file format.", "Windows, Linux, Windows, Mac, Windows, Mac, Linux, ", "['MAGIX Xara Designer Pro X11', 'MAGIX Xara Photo & Graphic Designer 11']['Xara Xtreme for Linux']['Microsoft Excel 2016']['Microsoft Excel 2016']['File Viewer Plus', '7-Zip']['xar', 'Incredible Bee Archiver']['xar']"], "xappl": ["Spoon XML Application Configuration File", "File created by Spoon Virtual Application Studio, a program used for creating virtualized applications; stores the input application, the virtualization settings, and build settings required to create the output virtual application; after built, can be run as a standalone executable (.EXE), with Spoon's Virtual Desktop Server, or from the Spoon.net website as a hosted application.", "Windows, ", "['Spoon Virtual Application Studio']"], "xbc": ["SMART Notebook File", "Legacy file format used by SMART Notebook interactive whiteboard software; contains a collection of gallery items, which may include clip art images, audio files, video files, notes, and .NBK files; used for storing organized collections of classroom materials and extracting content for lectures.", "Windows, Mac, Linux, ", "['SMART Technologies Notebook']['SMART Technologies Notebook']['SMART Technologies Notebook']"], "xapk": ["Compressed Android Package File", "An XAPK file is a package used to install Android apps on mobile devices.  It is similar to the standard .APK format, but may contain other assets used by the app, such as an .OBB file, which stores graphics, media files, and other app data.  XAPK files are used for distributing apps on third-party Android app download websites.  They are not supported by Google Play.", "Windows, Android, ", "['Pure APK Install']['APKPure']"], "xbdoc": ["Xiosis Scribe Document", "Document created by Xiosis Scribe, a word processing program; supports formatted text, page formatting, images, and tables; can be edited with the unique \"next generation\" toolset and user interface provided with the software.", "Windows, ", "['Xiosis Akuru']"], "xbe": ["Xbox Executable File", "The runnable application from an Xbox video game disc; typically not meant to be opened on a computer, but may possibly be opened on a PC using an Xbox emulation program.", "Windows, ", "[]"], "xba": ["OpenOffice.org Basic Module File", "Application library or macro used by OpenOffice.org, an open-source productivity suite; contains the functionality for the component and is written in the OpenOffice.org Basic programming language; used for storing the source code for software add-on components.", "Windows, Mac, Linux, ", "['Apache OpenOffice']['Apache OpenOffice']['Apache OpenOffice']"], "xas": ["Pro/ENGINEER Assembly Instance Accelerator File", "File created by Pro/ENGINEER, a program used to design manufactured components and processes; contains an instance of an .ASM assembly file, which is a particular parametric definition from a \"family table\" of assemblies within the ASM file.", "Windows, Mac, ", "['Parametric Technology Creo', 'Adobe Acrobat DC']['Adobe Acrobat DC']"], "xbd": ["DocuWorks Binder File", "An XBD file contains one or more DW documents created by DocuWorks, a program used to manage documents and improve business workflow.  It stores a binder of documents and also includes metadata for each DW file.", "Windows, iOS, Android, ", "['Xerox DocuWorks']['Fuji Xerox DocuWorks Viewer Light']['Fuji Xerox DocuWorks Viewer Light']"], "xbap": ["XAML Browser Application File", "Internet application file used by XAML Browser Application (XBAP) technology, which allows rich Internet applications to run in Web browsers; contains a compiled program file, similar to an .EXE file but for the Web browser; executed within a sandbox to provide security.", "Windows, ", "['Microsoft Visual Studio 2017', 'Microsoft Internet Explorer', 'Mozilla Firefox']"], "xap": ["XACT Project", "Project created with the Microsoft Cross-Platform Audio Creation Tool (XACT); saved in a text format and contains the intermediate form of the information produced by XACT; includes complete descriptions of wave banks (.XWB files), sound banks (.XSB files), and global settings (.XGS files).", "Windows, Windows, Mac, Windows Phone, ", "[]['Web browser']['Web browser'][]"], "xan": ["Worms Map File", "Map file used by some Worms series games including Worms 3D and Worms Mayhem; saves the three-dimensional geometry of the map and includes features such as terrain, buildings, and water.", "Windows, ", "['Team17 Worms Mayhem', 'Team17 Worms 3D', 'MapListEditor for Worms 4 Mayhem', 'W3D Editor']"], "xamlx": ["Visual Studio Workflow Service File", "Developer file used by Visual Studio, a software development application; uses XML formatting and defines a workflow service, which specifies activities to be implemented by a program; used for defining how a remote service program runs.", "Windows, ", "['Microsoft Visual Studio 2017']"], "xaml": ["XAML File", "Extensible Application Markup Language file that uses Windows Presentation Foundation (WPF) code; XAML (pronounced \"zammel\") is a descriptive programming language developed by Microsoft for creating user interfaces; introduced during the development stages of Longhorn, which is now Windows Vista.", "Windows, ", "['Microsoft Visual Studio 2017', 'Liquid Technologies Liquid XML Studio']"], "xyz": ["Molecule Specification File", "File used by various chemistry programs, such as TINKER and UniChem; contains a description of a molecule, including the number of atoms, element symbol, and X, Y, and Z coordinates; stored in a plain text format.", "Windows, Mac, Linux, Windows, Mac, Linux, ", "['Avogadro', 'Jmol', 'Agile Molecule Abalone', 'Agile Molecule Ascalaph']['Avogadro', 'Jmol']['Avogadro', 'Jmol']['Celestia']['Celestia']['Celestia']"], "xaiml": ["XAIML Chatterbot Database File", "File created in the Extended Artificial Intelligence Markup Language (XAIML), a language used to represent the artificial intelligence of chatterbots; contains a knowledge base that is used in conjunction with the ProgramPY-SH engine to simulate intelligent chat conversations.", "Linux, ", "['Neo']"], "xzm": ["Porteus Module", "Module used by Porteus, a portable Linux operating system, to install and uninstall files; compressed similarly to .ZIP files and can contain multiple files and directories.", "Linux, ", "['Porteus']"], "xzfx": ["ZipLogix ZipForm File", "File created by ZipForm, an application used to facilitate real estate transactions online; contains a real estate form stored in proprietary format; typically used to send real estate information over email.", "Windows, Mac, Linux, ", "['ZipLogix zipForm Standard']['ZipLogix zipForm Standard']['ZipLogix zipForm Standard']"], "xz": ["XZ Compressed Archive", "Archive compressed using XZ compression, a high ratio compression algorithm; contains one or more compressed files; commonly used to distribute Slackware Linux package distributions.", "Windows, Mac, Linux, Android, ", "['File Viewer Plus', '7-Zip', 'WinRAR 5', 'ExtractNow']['The Unarchiver']['Tukaani XZ Utils']['RARLAB RAR']"], "xyzv": ["Celestia Sampled Trajectory File", "Data file used by Celestia, a free universe visualization program; saves a list of positions and timestamps as well as velocities for each position; used for defining the location and trajectory of entities, such as planets, moons, and stars.", "Windows, Mac, Linux, ", "['Celestia']['Celestia']['Celestia']"], "xyw": ["XYWrite for Windows Document", "Text document created by XYWrite for Windows 3.x/4.x", "Windows, ", "[]"], "xy": ["XYWrite Document", "Text document created by XYWrite, an early word processing program for Windows; contains plain text markup delimited by << and >> symbols.", "Windows, ", "['Corel WordPerfect X8', 'text editor']"], "xys": ["XYplorer Script File", "Script library created with XYplorer, a multi-tabbed dual pane file manager for Windows; includes custom commands written in the XYplorer Scripting language; may be used to automate common tasks.", "Windows, ", "[]"], "xyp": ["XYWrite Plus Document", "Text document created by XYWrite Plus, a a word-processing software program from The Technology Group.", "Windows, ", "[]"], "xy3": ["XYWrite III Document", "Text document created by version 3 of XYWrite", "Windows, ", "[]"], "xxd": ["Brixx Planner Calendar", "Calendar used by Brixx Planner, a modeling program used for business planning; contains events and related information entered by the user; saved in a proprietary format that can only be opened with Brixx Solutions software.", "Windows, ", "[]"], "xxx": ["Compucon Singer Embroidery File", "File used by Compucon's Embroidery Operating System (EOS), a program used to create embroideries and other patterns for Compucon sewing machines; contains a stitch pattern, including color, lettering, design patterns, stitch density, and size.", "Windows, ", "[]"], "xxe": ["XXEncoded File", "7-bit ASCII text file that can be sent via e-mail without being corrupted; created for older e-mail programs that do not recognize binary attachments; most e-mail programs now convert binary attachments automatically.", "Windows, ", "['ConeXware PowerArchiver', 'ESTsoft ALZip', 'Corel WinZip 21', 'WinRAR 5', 'Spadix ClikView', 'Acubix PicoZip', 'Ghisler Total Commander']"], "xx": ["XXEncoded File", "7-bit ASCII text file encoded with XX encoding (XXEncoding), an encoding method that uses only alphanumeric characters, and the plus and minus signs.", "Windows, ", "['ConeXware PowerArchiver', 'Corel WinZip 21', 'Acubix PicoZip']"], "xws": ["Xara Web Designer Graphic", "Image created by Xara Web Designer (formerly Xara Webstyle), a visual Web page design application; stores a Web graphic in a proprietary format; may be a banner, navbar, logo, button, background, photo, or another image type; typically built from a Webstyle template.", "Windows, ", "['MAGIX Xara Web Designer 11']"], "xwd": ["X Windows Dump Image", "Uncompressed bitmap image created by the X Windows System, a visual application used to manage networked client-server computers; stores a screenshot, or \"screen dump,\" of a background or window from the application's GUI; created by the xwd client process.", "Windows, Mac, Linux, ", "['Corel PaintShop Pro X9', 'Newera Graphics Converter Pro', 'XnViewMP', 'GIMP']['XnViewMP', 'GIMP']['XnViewMP', 'GIMP']"], "xwp": ["Xerox Writer Text Document", "A XWP file is a text document created with Xerox Writer, one of the original word processing programs.  It contains text added by the Xerox Writer user and saved in the Writer format.", "Windows, Windows, Windows, ", "[][][]"], "xwk": ["Crosstalk Communicator Keyboard Mapping File", "Configuration file used by Crosstalk Communicator, a fax modem software program developed by Intel; maps keys on the keyboard to different commands; typically included with Intel fax modem hardware.", "Windows, ", "[]"], "xwf": ["OmniPage Workflow File", "Workflow file created with OmniPage OCR software; used for streamlining document conversions by automating scanning, converting, and saving processes; may be a pre-built workflow or created by the user with the Workflow Assistant.", "Windows, Mac, ", "['Nuance OmniPage Ultimate']['Nuance OmniPage Pro X']"], "xwb": ["XACT Wave Bank", "Collection of waves, or sound files, created with XACT (the Microsoft Cross-Platform Audio Creation Tool); logically grouped into a single file by an audio designer so it can be integrated into a video game.", "Windows, ", "[]"], "xvmconf": ["World of Tanks XVM Configuration File", "Text configuration file used by XVM (eXtended Visualization Mod), a mod for the tank fighting game World of Tanks (WoT); configures additional features such as vehicle markers, player or clan icons, vehicle icon sets, and in-game player ratings.", "Web, ", "['XVM editor']"], "xvm": ["VMware Console Configuration File", "Settings file used by VMware virtualization software; contains connection information used for connecting to a remote VMware server; stores parameters such as the connection port, login options, and the remote .VMX file to load; used for starting remote console sessions.", "Windows, Linux, ", "['VMware Workstation 12.5 Pro']['VMware Workstation 12.5 Pro']"], "xvid": ["Xvid-Encoded Video File", "Video clip or movie encoded using Xvid, an open-source video codec published under the GNU GPL license; compresses video data using MPEG-4 technology; allows for faster data transmission and more efficient storage of video files.", "Windows, Mac, Linux, iOS, ", "['Roxio Creator NXT Pro 5', 'Microsoft Windows Media Player with Xvid codec', 'Media Player Classic with Xvid codec', 'BS.Player', 'CoolUtils Total Movie Converter']['Roxio Toast 15', 'Eltima Elmedia Player', 'Apple QuickTime Player with DivX and Xvid codec']['Xvid for SuSE Linux', 'Xvid for Debian']['olimsoft OPlayer']"], "xvd": ["Xbox Virtual Disk", "Software package wrapper format used by Xbox One to store secured data such as system images/data; may also store console update, system, and settings information. ", "Windows, ", "['xvdtool']"], "xvct": ["VISE XML Project File", "XML project file created by VISE X, an application used to build Mac OS X installer files; contains references to the installation files and actions required to make the installation; used for exporting binary .VCT projects using XML formatting.", "Mac, ", "['MindVision VISE X']"], "xv3": ["Lattice XVL Geometry File", "File created by Lattice Technology programs, which are used to create Digital Mock Up (DMU) documentation of 3D models; contains a model, including its three-dimensional geometry and appearance; used to save and load 3D design data.", "Windows, Mac, ", "['Adobe Acrobat DC']['Adobe Acrobat DC']"], "xva": ["XenServer Virtual Appliance File", "File used by XenCenter, an administration tool for XenServer virtualization software; saves all data for a \"virtual appliance,\" which is a virtual machine that includes a pre-installed operating system and applications; used for importing, exporting, and instantiating virtual appliances.", "Windows, ", "['Citrix XenCenter']"], "xv0": ["Lattice XVL Structure File", "File created by Lattice Technology programs, which are used to document 3D designs; contains a three-dimensional model, including its structure and appearance; stored in a highly compressed format.", "Windows, Mac, ", "['Adobe Acrobat DC']['Adobe Acrobat DC']"], "xum": ["Excel Unit Operation Model File", "Model file created and used by Excel CAPE-OPEN Unit Operation, a program that allows users to create an Excel workbook for calculating unit operations and use in a CAPE-OPEN simulation environment; stores an .XLS file and metadata for a CAPE-OPEN Excel Unit Operation.", "Windows, ", "['AmsterCHEM Excel CAPE-OPEN Unit Operation']"], "xur": ["Xbox 360 Binary User Interface File", "Compiled skin file used by \"modded\" Xbox 360 game consoles; generated from an .XUI file using the Xbox UI Tool, which is included with Microsoft's Xbox SDK; stores graphics and appearance data for the style of the Xbox dashboard; used for customizing the Xbox interface.", "Windows, ", "['Microsoft Xbox SDK']"], "xul": ["XML User Interface Language File", "Self-contained application or Firefox extension written in XML; supported by Mozilla browsers and other Web browsers that are based on the Gecko engine.", "Windows, Mac, Linux, ", "['Mozilla Firefox', 'Mozilla SeaMonkey']['Mozilla Firefox', 'Mozilla SeaMonkey']['Mozilla Firefox', 'Mozilla SeaMonkey']"], "xtreme": ["Winstep Xtreme Theme Pack", "Theme file format used by Winstep Xtreme, a desktop customization program for Windows; contains one or more themes that can be applied to alter the Windows interface; saved in a compressed format that is automatically expanded by Winstep when opened.", "Windows, ", "[]"], "xtodvd": ["ConvertXtoDVD Project File", "Project created and used by ConvertXtoDVD, a DVD authoring tool; contains any data related to a project, which includes source file locations, customized settings, and DVD menus; can be opened and edited at a later time.", "Windows, ", "['VSO ConvertXtoDVD']"], "xtl": ["Vietcong Data File", "Data file used by Vietcong, an FPS (first-person shooter) game that takes place during the Vietnam War; typically stored within another game data file, which can be extracted using some file unpacking utilities.", "Windows, ", "[]"], "xtp": ["xTime Project Document", "Project accessed by xPlan, a project management application; similar to the .PJ2  and .PJM file; created by the app4mac xTime Project program, which became xPlan; contains project data input such as the budget, project tasks, days off, and task duration.", "Mac, iOS, Windows, Windows, Windows, ", "['adnx xPlan']['adnx xPlan']['Autodesk AutoCAD 2017', 'Autodesk AutoCAD Civil 3D 2017']['Microsoft InfoPath'][]"], "xtm": ["CmapTools Exported Topic Map", "Concept map created by CmapTools, a program used for visualizing organized knowledge; consists of graphical and textual data that can be displayed within CmapTools; does not include layout, style, or background image information.", "Windows, Mac, Linux, Windows, Linux, ", "['IHMC CmapTools']['IHMC CmapTools']['IHMC CmapTools'][][]"], "xui": ["Xbox 360 User Interface File", "Skin file used by \"modded\" Xbox 360 game consoles; created and edited by the Xbox UI Tool, which is part of Microsoft's Xbox SDK; saves graphics and layout information for the dashboard; used for customizing the look and feel of the Xbox interface.", "Windows, ", "['Microsoft Xbox SDK']"], "xtbl": ["XTBL Ransomware Encrypted File", "An XTBL file is a file encrypted by .xtbl ransomware (also known as the Troldesh trojan), a virus used by cybercriminals to hijack a user's computer files until the user pays the criminal.  It contains a user's personal file, such as a .PDF, .XLSX, or .RAW file.  XTBL files are encrypted with AES-265 and RSA methods.", "Windows, ", "[]"], "xtg": ["Extensible TreeGraph File", "File created by TreeGraph 2, a program used to build and annotate phylogenetic trees; stores a phylogenetic tree in the XML-based Extensible TreeGraph (XTG) format; includes annotations and formatting information.", "Windows, Mac, Linux, ", "['TreeGraph']['TreeGraph']['TreeGraph']"], "xt": ["Xdebug Trace File", "Output file generated by Xdebug, an Apache Web server plugin used for tracing PHP execution; logs the output of the PHP code line by line; used for checking and debugging functions written in PHP.", "Windows, Linux, Windows, ", "[][]['Starbreeze Studios Fasttracker']"], "xsvf": ["Xilinx Serial Vector Format File", "Binary file created for testing programmable logic device (PLD) designs; contains the compact, binary version of an ASCII text .SVF file; used for optimizing the file format of test cases for Xilinx devices.", "Windows, ", "['Xilinx ISE Design Suite', 'Xilinx ISE WebPACK']"], "xsx": ["Visual Studio XML Schema Layout File", "XML properties file used by Visual Studio, a Windows IDE developed by Microsoft; contains layout settings for an XML schema which is stored in an .XSD file; auto-generated by Visual Studio when designing schema layouts in the XML Schema Designer interface.", "Windows, ", "['Microsoft Visual Studio 2017']"], "xst": ["WebSphere Query Template", "File used by WebSphere Application Server, a server program that hosts Web applications; contains an SQLtoXML Java class, database connection information, and an SQL query; used to generate XML data from SQL database queries.", "Windows, Linux, ", "[][]"], "xsn": ["InfoPath Form Template File", "Form template used by Microsoft InfoPath, a form design and creation program; saved as a compressed .CAB (cabinet) file, which contains multiple files.", "Windows, ", "['Microsoft InfoPath']"], "xspf": ["XSPF Playlist File", "Playlist saved in the XML Shareable Playlist Format (XSPF); uses XML tags to organize and list files included in the playlist; similar to a .M3U file, but uses standard XML; does not contain actual audio data.", "Windows, Mac, Linux, ", "['Roxio Creator NXT Pro 5', 'VideoLAN VLC media player', 'Clementine']['VideoLAN VLC media player', 'Clementine', 'Macgo Mac Media Player']['Amarok', 'Audacious', 'VideoLAN VLC media player', 'Clementine']"], "xss": ["XML Style Sheet", "Style sheet file created in UIX Styles' XML Style Sheet (XSS) language, which is based on the CSS standard, except that styles are specified in an XML format; contains layout properties for a document; used for defining the appearance of Web application pages.", "Windows, Linux, ", "['Microsoft Visual Studio 2017']['Oracle UIX']"], "xsp": ["Kodi Smart Playlist File", "Song or video playlist used by Kodi, a free software multimedia player; may contain a list of specific audio and video files to play, or may store criteria for the types of media to play (e.g., play Rock music or all 90s music); can specify songs, albums, movies, TV shows, and other types of media.", "Windows, Mac, Linux, iOS, Android, ", "['Kodi', 'text editor']['Kodi', 'text editor']['Kodi', 'text editor']['Kodi']['Kodi']"], "xslt": ["XSL Transformation File", "Text file similar to an .XSL document that contains XML style transformation information; used for transforming XML documents into a standard output format, such as a text document or an .HTML Web page.", "Windows, Mac, Linux, ", "['File Viewer Plus', 'FileMaker Pro', 'Microsoft Visual Studio 2017', 'SyncRO Soft oXygen XML Editor', 'Liquid Technologies Liquid XML Studio', 'Microsoft Notepad']['FileMaker Pro', 'MacroMates TextMate', 'SyncRO Soft oXygen XML Editor']['SyncRO Soft oXygen XML Editor']"], "xslic": ["XenServer License File", "Software license file used by XenClient, an administration application for XenServer virtualization software; contains a key that registers the XenServer software; includes the expiry date, product code, number of licensed sockets, and other product information.", "Windows, ", "['Citrix XenCenter']"], "xsl": ["XML Style Sheet", "Defines the style of text, tables, and other objects within a XML document; similar to a .CSS file used by .HTML documents; can be opened with FileMaker or any program that supports XML style sheets.", "Windows, Mac, Linux, ", "['File Viewer Plus', 'Microsoft Visual Studio 2017', 'SyncRO Soft oXygen XML Editor', 'Altova XMLSpy', 'Liquid Technologies Liquid XML Studio', 'FileMaker Pro', 'Microsoft Notepad', 'text editor']['FileMaker Pro', 'SyncRO Soft oXygen XML Editor', 'MacroMates TextMate', 'Bare Bones BBEdit', 'text editor']['SyncRO Soft oXygen XML Editor', 'text editor']"], "xsiaddon": ["Softimage Add-on File", "Add-on file used by Softimage, a 3D character animation and effects application; contains plug-in functionality as well as help documentation and information for adding toolbars and menus; used for packaging and distributing add-ons.", "Windows, ", "['Autodesk Softimage 2015']"], "xsc": ["Visual Studio Dataset Internal Info File", "File created by the Visual Studio software development IDE; auto-generated by Visual Studio when the user creates an XML schema (.XSD file) containing data in addition to the schema.", "Windows, ", "['Microsoft Visual Studio 2017']"], "xsd": ["XML Schema Definition", "Defines what elements and attributes may appear in an XML document; also defines the relationship of the elements and what data may be stored in them; written in the W3C XML Schema language.", "Windows, Mac, Linux, ", "['File Viewer Plus', 'Microsoft XML Notepad', 'Microsoft Visual Studio 2017', 'SyncRO Soft oXygen XML Editor', 'Liquid Technologies Liquid XML Studio', 'Progress Stylus Studio', 'JAPISoft EditiX', 'Altova XMLSpy', 'text editor']['SyncRO Soft oXygen XML Editor', 'Bare Bones BBEdit', 'text editor']['SyncRO Soft oXygen XML Editor', 'text editor']"], "xsi": ["Softimage XSI 3D Image", "Three-dimensional image created by Softimage, a 3D character animation and effects program used in video games and film productions; stores the mesh (geometry), textures, shades, and other model data for a character; used for animating characters within 3D scenes.", "Windows, ", "['Autodesk Softimage 2015', 'Okino Computer Graphics PolyTrans']"], "xsf": ["InfoPath Form Definition File", "File used by InfoPath, a program used for creating forms; specifies the content, properties, and structure of the form template (.XSN file); stored as one of the files inside of the XSN template; adheres to the InfoPath XSF schema (an .XSD file) published by Microsoft.", "Windows, Windows, Linux, ", "['Microsoft InfoPath']['Cal3dViewer', 'Cal3d2ogre']['Cal3D']"], "xsb": ["XACT Sound Bank", "Collection of sounds and cues created with Microsoft XACT, the Cross-Platform Audio Creation Tool; used for creating video game sounds and defining when they should be played in the game.", "Windows, ", "[]"], "xs": ["Age of Empires 3 Map AI Generator", "File used for generating artificial intelligence (AI) for custom maps in Age of Empires III (AOE3); referenced during the map compilation process when a custom XML map file is loaded.", "Windows, Mac, ", "['Microsoft Age of Empires 3'][]"], "xry": ["XRY Data File", "Data archive created with XRY, a mobile phone data retrieval program used for forensic purposes; may contain multiple types of data downloaded from a phone, including the phone book, call list, text messages, pictures, calendars, notes, and audio files; all data is stored in a single file with an \".xry\" extension.", "Windows, ", "['Micro Systemation XRY']"], "xrp": ["RationalPlan Project File", "Project created with RationalPlan project management software; used for tracking project-related data, such as resources, workload, costs, and budget management; may be as a Single Project or a Multi Project file (created with RationalPlan Multi Project).", "Windows, Mac, Linux, ", "['Stand By Soft RationalPlan']['Stand By Soft RationalPlan']['Stand By Soft RationalPlan']"], "xrns": ["Renoise Song File", "Song format used by Renoise, a song creation program; stores data in a compressed .ZIP format that includes a Song.xml file and a SampleData folder; song information is stored in the Song.xml file, while samples and instruments are stored in the SampleData folder.", "Windows, Mac, Linux, ", "[][][]"], "xrm-ms": ["Microsoft Security Certificate", "Certificate file created by Microsoft and an Original Equipment Manager (OEM), such as Dell, to digitally verify the purchase and authenticity of software; contains encrypted certificate data signed with Microsoft and OEM keys; used to activate software on individual computers.", "Windows, ", "['Microsoft Windows']"], "xrff": ["Extensible Attribute-Relation File Format", "File created in the XRFF format, a variation of the .ARFF format that uses XML formatting instead of simple text; used in machine learning exercises, typically with the Weka software; sometimes compressed as a .GZ file (\".xrff.gz\") to reduce the file size.", "Windows, Mac, Linux, ", "['Weka', 'text editor']['Weka', 'text editor']['Weka', 'text editor']"], "xrf": ["Cal3D XML Materials File", "3D materials file created in the Cal3D XML materials format; contains references to the graphics that are overlaid on a model's 3D mesh to provide its surface appearance; can specify settings for diffusion, shininess, and ambience.", "Windows, Linux, ", "['Cal3dViewer', 'Cal3d2ogre']['Cal3D']"], "xrdml": ["XRDML Data File", "File format used to store X-ray powder diffraction measurement data collected by PANalytical XRD instruments such as Data Collector and X'Pert Powder; also contains any information required to reproduce the measurement data, which includes the instrument type and settings.", "Windows, ", "['PANalytical Data Collector']"], "xrb": ["XMind Resource Bundle", "An XRB file is a resource bundle used by XMind, a brainstorming and mind mapping application.  It stores a user's custom templates, themes, markers, and clip art.  The file allows users to share resources with others between different XMind applications running on Windows and OS X computers.", "Windows, Mac, Linux, ", "['XMind']['XMind']['XMind']"], "xpt": ["Mozilla Firefox Component", "An XPT file is a component used by Mozilla Firefox, a cross-platform web browser.  It contains a plugin (such as flashplayer.xpt) that adds features and functionality to the web browser.  XPT files are installed in the web browser's components folder.", "Windows, Mac, Linux, Windows, Mac, Linux, ", "['Mozilla Firefox']['Mozilla Firefox']['Mozilla Firefox']['IBM SPSS']['IBM SPSS']['IBM SPSS']"], "xqy": ["XQuery Source File", "File written using XQuery, an XML data retrieval and manipulation language; contains source code that reads and extracts information from the data model stored in an XML data source; used in various Web and desktop software products for handling XML content.", "Windows, Mac, Linux, ", "['SyncRO Soft oXygen XML Editor', 'Progress Stylus Studio', 'Altova XMLSpy', 'Liquid Technologies Liquid XML Studio', 'Microsoft XML Notepad', 'text editor']['MacroMates TextMate', 'text editor']['text editor']"], "xquery": ["XQuery Source Code File", "File written using XQuery, a query language used for retrieving and manipulating data from XML data sources; may contain syntax for opening XML files as well as iterating over the XML data and performing calculations.", "Windows, Mac, Linux, ", "['SyncRO Soft oXygen XML Editor', 'Altova XMLSpy', 'Progress Stylus Studio', 'Liquid Technologies Liquid XML Studio', 'Microsoft XML Notepad', 'text editor']['MacroMates TextMate', 'text editor']['text editor']"], "xqt": ["SuperCalc Macro File", "Macro that can execute commands and automate tasks in SuperCalc, an older spreadsheet program that improved on VisiCalc.", "Windows, Mac, ", "[][]"], "xqm": ["XQuery Module", "File written in XQuery, a language used for querying and manipulating data from XML data sources; stores an XQuery module, which typically contains reusable functions; used for storing source code libraries whose functions can be invoked when included in XQuery code.", "Windows, Mac, Linux, ", "['SyncRO Soft oXygen XML Editor', 'Progress Stylus Studio', 'Altova XMLSpy', 'Liquid Technologies Liquid XML Studio', 'text editor']['MacroMates TextMate', 'text editor']['text editor']"], "xql": ["XML Query Language File", "File written in the XQuery language, a standard used for reading and writing data using XML data sources; contains XQuery source code, which can open XML files, extract the desired information, and output the results.", "Windows, Mac, Linux, ", "['SyncRO Soft oXygen XML Editor', 'Altova XMLSpy', 'Progress Stylus Studio', 'Liquid Technologies Liquid XML Studio', 'Microsoft XML Notepad', 'text editor']['MacroMates TextMate', 'text editor']['text editor']"], "xq": ["XQuery File", "File written using XQuery, a language used for querying and manipulating data from XML data sources; contains source code that reads and extracts information using a logical data model created from an XML data source; used in various Web and desktop software products for handling XML content.", "Windows, Mac, Linux, ", "['SyncRO Soft oXygen XML Editor', 'Altova XMLSpy', 'Progress Stylus Studio', 'Liquid Technologies Liquid XML Studio', 'text editor']['MacroMates TextMate', 'text editor']['text editor']"], "xps": ["XML Paper Specification File", "An XPS file is a document that contains fixed page layout information written in the XPS page description language.  It defines the layout, appearance, and printing information for a document.  XPS file are similar to .PDF files, but saved in Microsoft’s proprietary XPS format.", "Windows, Mac, Linux, ", "['Microsoft XPS Viewer', 'Nuance Power PDF Standard', 'Dolphin Futures XPS Viewer', 'Pagemark XpsViewer', 'Pagemark XpsConvert', 'Mozilla Firefox with Pagemark XpsPlugin', 'XPS Annotator', 'NiXPS View', 'NiXPS Edit']['Nuance PDF Converter for Mac 6', 'Pagemark XpsViewer', 'Apple Safari with Pagemark XpsPlugin', 'Mozilla Firefox with Pagemark XpsPlugin', 'NiXPS View', 'NiXPS Edit']['Pagemark XpsViewer', 'Mozilla Firefox with Pagemark XpsPlugin', 'KDE Okular']"], "xpr": ["Pro/ENGINEER Part Instance Accelerator File", "File created by Pro/ENGINEER, a program used for 3D product design; contains an instance of a part (.PRT) file, which defines specific parameters for a generic part.", "Windows, Mac, Windows, Mac, Linux, Windows, Mac, Windows, ", "['Parametric Technology Creo', 'Dassault Systemes SolidWorks', 'Adobe Acrobat DC']['Adobe Acrobat DC']['SyncRO Soft oXygen XML Editor']['SyncRO Soft oXygen XML Editor']['SyncRO Soft oXygen XML Editor'][][]['Microsoft Expression Studio']"], "xpp": ["X++ Source Code File", "Source code file written in X++, an object-oriented language developed by Microsoft for Microsoft Dynamic AX ERP (enterprise resource planning) software; uses syntax similar to the C# language; can be created and edited using MorphX, an IDE that is part of Microsoft Dynamics AX.", "Windows, ", "['Microsoft Dynamics AX']"], "xpm": ["X11 Pixmap Graphic", "Bitmap image used by the X Windows System, a (GUI) used to run networked client-server computers; supports monochrome, gray-scale, and color pixmap data; stores pixmaps as static character arrays in the C programming language.", "Windows, Mac, Linux, Android, Windows, Mac, ", "['File Viewer Plus', 'GIMP', 'CorelDRAW Graphics Suite X8', 'Corel PaintShop Pro X9', 'ACD Systems Canvas X 2017', 'ACD Systems ACDSee 20', 'GraphicRegion.com Able Batch Converter', 'XnViewMP', 'IrfanView']['GIMP', 'Pixelmator 3', 'Planamesa NeoOffice', 'XnViewMP']['GIMP', 'XnViewMP']['File Viewer for Android'][][]"], "xpll": ["Pull-Planner Data File", "An XPLL file is a data file created by Pull-Planner, a program used to calculate cable pulling tension and sidewall pressure for designing conduit systems and planning cable pulls.  It contains cable and conduit data, data calculations, and a summary for the cable and conduits.", "Windows, ", "['American Polywater Pull-Planner']"], "xpj": ["RoboHelp HTML Project File", "Help project file created by RoboHelp, a help content authoring application; saved using XML formatting and contains references to HTML help files and other help content assets; also contains navigation, table of contents, and search indexing information.", "Windows, Mac, Windows, Mac, ", "['Adobe RoboHelp']['Adobe RoboHelp'][][]"], "xpl": ["LcdStudio Playlist File", "File used by LcdStudio, a program that allows users to create programs that render computer performance data on an entire monitor screen; contains a list of .XDS design files to be played in an LcdStudio application; used to display dynamic visualizations from live computer performance data.", "Windows, ", "[]"], "xpk": ["WWE RAW Model File", "Contains 3D models that define how characters look in the WWE RAW wrestling game; can be edited to alter or \"mod\" the appearance of characters; some common XPK files include tf.xpk, ff.xpk, if.xpk, and sf.xpk.", "Windows, ", "[]"], "xpi": ["Mozilla Installer Package", "An XPI file is a compressed installation archive used by various Mozilla applications, including Firefox, Thunderbird, and SeaMonkey.  it may contain the primary components installed with the software, or may contain an software extension, such as a web browser plug-in.", "Windows, Mac, Linux, ", "['Mozilla Firefox', 'Mozilla Thunderbird', 'Mozilla SeaMonkey']['Mozilla Firefox', 'Mozilla Thunderbird', 'Mozilla SeaMonkey']['Mozilla Firefox', 'Mozilla Thunderbird', 'Mozilla SeaMonkey']"], "xpdl": ["XPDL Module", "Business process created for TIBCO iProcess or Business Studio business process management (BPM) software; contains code written in XPDL, the XML Process Definition Language; includes one or more processes that can be added to a iProcess or Business Studio business model.", "Windows, ", "['TIBCO iProcess Suite', 'TIBCO Business Studio']"], "xpg": ["Autoplay Media Studio Exported Page", "Individual page exported from an AutoPlay Media Studio project; may be selected from a presentation or a custom application; created by selecting \"Page→Organize→Export...\" within AutoPlay Media Studio.", "Windows, ", "['Indigo Rose AutoPlay Media Studio']"], "xpf": ["LMMS Preset File", "Preset file created by LMMS (Linux MultiMedia Studio), a music production program; contains instrument settings presets; includes instrument settings data like the project version, instrument track settings, instrument names, and effects.", "Windows, Linux, ", "['LMMS']['LMMS']"], "xpd": ["PlayStation Store PSP License File", "License file downloaded along with content from the Sony PlayStation Store; used for Digital Rights Management (DRM\\|rm) and required to transfer games and other downloaded files to the PlayStation Portable (PSP) device.", "Windows, Windows, Mac, ", "[]['Web browser']['Web browser']"], "xp4": ["KiriKiri Package", "File used by KiriKiri, a Japanese visual novel scripting engine; may store text, images, audio, and other data used by a visual novel; used for packaging data together in a single compressed file for the story.", "Windows, ", "[]"], "xp3": ["KiriKiri Package File", "File used by KiriKiri, a Japanese scripting engine often used to create visual novels; stores resource files that may contain text, images, audio, and other data; used for packaging game resources that are loaded during gameplay.", "Windows, ", "['insani XP3 / Kirikiri tools']"], "xpaddercontroller": ["Xpadder Controller Profile", "Profile of a controller or joystick used by Xpadder, a keyboard and mouse emulation program; contains layout information for a controller and defines how the buttons and movements are mapped to a keyboard and mouse.", "Windows, ", "[]"], "xp2": ["XPilot NG", "Game file used by XPilot NG, the \"next generation\" version of the older XPilot multiplayer 2D space fighting game; saves the 2D map as a set of polygons, each of which define different obstacles and features of the map.", "Windows, Linux, ", "['XPilot NG']['XPilot NG']"], "xoml": ["Windows Workflow File", "File written in XAML (Extensible Application Markup Language), a descriptive programming language used for creating user interfaces; contains a tree-based structure that defines a root workflow node and nested sub-elements; may also contain embedded segments of code.", "Windows, ", "['Microsoft Visual Studio 2017']"], "xp": ["Fastracker 2 Pattern", "Song pattern saved by the Fasttracker audio tracker; can be used with other patterns to create a complete song, or .XM module.", "Windows, Windows, Linux, ", "['Starbreeze Studios Fasttracker']['XPilot']['XPilot']"], "xol": ["Swiss Map Overlay", "Map format used by Swiss Map software; contains overhead maps of Switzerland, including satellite images, aerial photographs, and topology information.", "Windows, Mac, Windows, ", "['swisstopo Swiss Map']['swisstopo Swiss Map'][]"], "xojo_xml_toolbar": ["Xojo Toolbar File", "File created by Xojo, an IDE that allows users to create desktop, web, and web-mobile applications; contains XML formatted data that describes a toolbar, such as represented interfaces and attributes.", "Windows, Mac, Linux, ", "['Xojo']['Xojo']['Xojo']"], "xojo_xml_project": ["Xojo XML Project File", "Project created by Xojo, an IDE used to create desktop, web, and web-mobile applications; contains data in XML format that references contents of the application, such as windows, menus, controls, and build settings; can be built into an executable file.", "Windows, Mac, Linux, ", "['Xojo']['Xojo']['Xojo']"], "xojo_xml_window": ["Xojo XML Window File", "Window file created by Xojo, an IDE that enables users to create programs; replaced the .RBW file extensionused to share a window between Xojo projects; saved in the Xojo XML format; includes information that describes aspects of the window, such as buttons, custom backdrops, and frame type.", "Windows, Mac, Linux, ", "['Xojo']['Xojo']['Xojo']"], "xom": ["Worms 3D Object File", "File used by Worms, a multi-player turn-based game where players control and battle against teams of worms; contains 3D geometry, textures, colors, and effects; used to store pre-installed and customized worm, weapon, and map objects.", "Windows, Mac, ", "['Team17 Worms Mayhem', 'Team17 Worms 3D', 'Team17 Worms', 'W3D Editor'][]"], "xojo_xml_menu": ["Xojo XML Menu File", "Menu file created by Xojo, a software development IDE; used to export a menu bar in XML format between different projects; includes information such as items, platform-specific shortcuts, menus, and menu appearance; replaced the .RBM file extension.", "Windows, Mac, Linux, ", "['Xojo']['Xojo']['Xojo']"], "xojo_toolbar": ["Xojo Toolbar File", "File created by Xojo, an IDE that allows users to develop cross-platform desktop and web applications; contains toolbar data in the default Xojo Project format; includes user-specified interfaces, ID information, and attributes.", "Windows, Mac, Linux, ", "['Xojo']['Xojo']['Xojo']"], "xojo_window": ["Xojo Window File", "Window file created by Xojo, an IDE that enables users to create custom applications; used to share a window in the Xojo project (text) format; includes information, such as window behavior, minimum window size, and background color; replaced the .RBW file extension.", "Windows, Mac, Linux, ", "['Xojo']['Xojo']['Xojo']"], "xojo_project": ["Xojo Project File", "Project created by Xojo, an IDE used to create desktop, web, and console applications; can be built into an executable file; contains data in the Xojo project (text) format that references the contents of the application; includes windows, menus, and build settings.", "Windows, Mac, Linux, ", "['Xojo']['Xojo']['Xojo']"], "xojo_menu": ["Xojo Menu File", "Menu file created by Xojo, an IDE used to create custom applications for Windows, OS X, and Linux platforms; replaced the .RBM file extension; used to share a menu bar in the Xojo project (text) format; includes other menu bar information, such as menus, behaviors, items, and platform-specific shortcuts.", "Windows, Mac, Linux, ", "['Xojo']['Xojo']['Xojo']"], "xojo_binary_window": ["Xojo Binary Window File", "Window file created by Xojo, an IDE used to create applications; used to share a window in the Xojo binary format between Xojo projects; includes information that describes parts of the window, such as frame type, buttons, and custom backdrops; replaced the .RBW file extension.", "Windows, Mac, Linux, ", "['Xojo']['Xojo']['Xojo']"], "xojo_binary_toolbar": ["Xojo Binary Toolbar File", "File created by Xojo, an IDE that allows users to develop cross-platform applications; contains toolbar data in binary format, such as represented interfaces and declared methods.", "Windows, Mac, Linux, ", "['Xojo']['Xojo']['Xojo']"], "xojo_binary_project": ["Xojo Binary Project File", "Project created by Xojo, an IDE used to create desktop, web-mobile, and web applications; contains data in binary format that references the contents of the application, including menus, windows, and build settings; can be built into an executable file.", "Windows, Mac, Linux, ", "['Xojo']['Xojo']['Xojo']"], "xojo_binary_menu": ["Xojo Binary Menu File", "Menu file created by Xojo, a software development IDE; replaced the .RBM file extension; stores binary data for a desktop application menu bar that is being developed in the Xojo IDE; includes information such as menus, items, behaviors, and platform-specific shortcuts.", "Windows, Mac, Linux, ", "['Xojo']['Xojo']['Xojo']"], "xnt": ["QuarkXPress Extension File", "Application extension used by QuarkXPress, a program used for professional publishing; extends the functionality of the default QuarkXPress application; used for adding new components to the user interface, importing and exporting new file types, enhancing application workflows, or adding other functions.", "Windows, Mac, ", "['QuarkXPress']['QuarkXPress']"], "xof": ["Reality Lab 3D Image File", "Three-dimensional image file created by RenderMorphics Reality Lab, a 3D API used for older computer-based video games; stores a 3D image that can be rendered with some older video cards; may be saved in a binary or ASCII text format.", "Windows, ", "[]"], "xnk": ["Exchange Shortcut", "Folder shortcut that opens a folder in Microsoft Exchange; created by dragging a folder from the Folder List in Outlook or Exchange to the Windows desktop.", "Windows, ", "[]"], "xnb": ["XNA Game Studio Binary Package", "Binary data file created with XNA Game Studio Express, an IDE designed for developing Windows and Xbox 360 games; contains one or more files in a single package.", "Windows, ", "['Microsoft XNA Game Studio', 'Microsoft XNA Game Studio Express', 'The GameTools Suite', 'Re-Logic Terraria']"], "xmzx": ["ExamSoft Exam File", "Exam file used by ExamSoft, an online assessment-management program; contains an exam downloaded from ExamSoft.", "Web, ", "['ExamSoft']"], "xmwx": ["ExamSoft Working File", "Working file used by ExamSoft, an online assessment-management program; contains answers from an exam while the user is working on the exam.", "Web, ", "['ExamSoft']"], "xmv": ["Xbox Media Video File", "Video file used by some games for the Xbox console system; uses a format developed by Microsoft specifically for playback on the Xbox; typically converted from a .WMV file to the XMV format using xmvtool, a program included with the Xbox software development kit provided by Microsoft.", "Windows, Mac, Linux, ", "['FFmpeg']['FFmpeg']['FFmpeg']"], "xmz": ["FastTracker 2 Extended Module", "Audio tracker module format used by Fasttracker 2, a music module creation and playback program; contains audio samples and patterns of notes that are used to play back the samples at different pitches; supports multiple tracks and effects.", "Windows, ", "['Starbreeze Studios Fasttracker', 'MODPlug Player', 'OpenMPT']"], "xmu": ["Expressive Music Container File", "File used by sonaBuilder, an application used for creating musical accompaniments played by Cadenza; contains metadata, such as the timing and mapping of the musical accompaniment, that is referenced by Cadenza to follow the user's pace; also contains the audio that is played to support the performing musician.  ", "Mac, ", "[]"], "xmp": ["Extensible Metadata Platform File", "An XMP file is a metadata file used by Adobe programs such as Photoshop and Bridge.  It contains the edits made to a camera raw file, such as a .CR2 or .NEF file, and is automatically generated and saved in the same directory as the corresponding camera raw file.  XMP files include various properties of an image file, such as a description, title, keywords, author, copyright, brightness, exposure, contrast, crop angle, shadow, saturation, sharpness, tint, and temperature.", "Windows, Mac, Windows, Mac, Linux, ", "['Adobe Bridge CC', 'Adobe Photoshop CC 2017', 'Adobe Prelude CC 2017', 'Microsoft Windows Photos', 'Adobe XMP Toolkit', 'text editor']['Adobe Bridge CC', 'Adobe Photoshop CC 2017', 'Adobe Prelude CC 2017', 'Adobe XMP Toolkit', 'text editor']['XMind']['XMind']['XMind']"], "xmt": ["XMind Template", "An XMT file is a template used by XMind, a brainstorming and mind mapping application.  It contains a diagram, such as a map, organizational chart, logic chart, timeline, or matrix, with user-defined settings.  The file allows users to save a layout of a diagram and replicate it.", "Windows, Mac, Linux, ", "['XMind']['XMind']['XMind']"], "xmmap": ["MindManager XML Map File", "XML version of a diagram created by Mindjet MindManager, a visual diagramming application; stores a \"mind map\" made up of drawn objects, text, and other symbols; stores ideas captured during the brainstorming process.", "Windows, Mac, ", "['Mindjet']['Mindjet']"], "xmm": ["3ds Max XML Animation Map File", "XML file used by 3ds Max, a three-dimensional animation and modeling program; defines how the loaded animation data from an .XAF file is assigned to objects in a scene; allows motion data to be merged into a 3D scene.", "Windows, ", "['Autodesk 3ds Max 2017']"], "xms": ["Music Studio Project", "Project created and used by Music Studio, an iOS music production app; contains music project information, which includes audio tracks, song parameters, keyboard layout, effect settings, metronome settings, and interface settings.", "iOS, Windows, ", "['Alexander Gross Music Studio'][]"], "xmlper": ["LeCroy Binary Waveform File", "Contains datapoints used to recreate a waveform saved on a LeCroy Oscilloscope as a binary data file; typically written \"XMLper\"", "Windows, ", "[]"], "xmpz": ["Miradi XML Project File", "Project file created with Miradi, a program used for environmental conservation planning purposes; similar to an .MPZ file, but is saved in an XML format; contains project data, such as environmental threats, targets, and planning information.", "Windows, Mac, Linux, ", "['Benetech Miradi']['Benetech Miradi']['Benetech Miradi']"], "xmlff": ["XML Flat File", "Database file format developed by Control Split; contains XML schema merged with Python arrays in plain text format.", "Windows, Mac, Linux, ", "['text editor']['text editor']['text editor']"], "xml": ["XML File", "An XML file is an XML (Extensible Markup Language) data file that uses tags to define objects and object attributes.  It is formatted much like an .HTML document, but uses custom tags to define objects and the data within each object.  XML files can be thought of as a text-based database.", "Windows, Mac, Linux, iOS, Android, Linux, ", "['File Viewer Plus', 'Altova XMLSpy', 'Microsoft Visual Studio 2017', 'SyncRO Soft oXygen XML Editor', 'Liquid Technologies Liquid XML Studio', 'Progress Stylus Studio', 'JAPISoft EditiX', 'Wattle XMLwriter', 'Microsoft XML Notepad', 'text editor']['JAPISoft EditiX', 'Bare Bones BBEdit', 'MacroMates TextMate', 'text editor']['SCREEM', 'text editor'][]['File Viewer for Android']['Cinelerra']"], "xmf": ["Cal3D XML Mesh File", "Three-dimensional model mesh file created with Cal3D, an open source character animation library; contains polygons made up of nodes and edges, which comprise the geometry of the character; gives the model its skeletal structure.", "Windows, Mac, Linux, Windows, Windows, ", "['Cal3dViewer', 'Cal3d2ogre', 'IMVU']['IMVU']['Cal3D'][]['H+H Software Virtual CD', 'EZB Systems UltraISO']"], "xmi": ["XML Metadata Interchange File", "File created in the XMI (XML Metadata Interchange) format, an XML file format most commonly used for exchanging UML diagrams; stores model design information in a standard XML format; used for transferring design information between software programs.", "Windows, Mac, Linux, Windows, ", "['Liquid Technologies Liquid XML Studio', 'Sparx Systems Enterprise Architect', 'Altova UModel', 'No Magic MagicDraw', 'Eclipse IDE for Java Developers']['No Magic MagicDraw', 'Eclipse IDE for Java Developers']['No Magic MagicDraw', 'Eclipse IDE for Java Developers']['Nullsoft Winamp', 'FMJ-Software Awave Studio']"], "xmind": ["XMind Workbook File", "Workbook file created by XMind, a brainstorming and mind mapping application; can contain multiple sheets, each with a diagram that captures ideas during a brainstorming session; also used for storing organizational charts, work schemes, Gantt charts, and other individual and business diagrams.", "Windows, Mac, Linux, iOS, ", "['XMind', 'Seavus iMindQ']['XMind', 'Seavus iMindQ']['XMind']['Seavus iMindQ']"], "xmdx": ["ExamSoft Answer File", "Answer file used by ExamSoft, an online assessment-management program; contains the final, completed version of an exam, which includes encrypted answers.", "Web, ", "['ExamSoft']"], "xmd": ["Bitdefender Plugin File", "File used by Bitdefender antivirus and Internet protection software; saves file signature information that helps the software recognize threats for common file exploitations, such as .ZIP and .RAR.", "Windows, Mac, Web, Windows, ", "['Bitdefender Total Security 2017', 'Bitdefender Antivirus Plus 2017']['Bitdefender Antivirus for Mac']['ExamSoft']['Engelmann Media CDRWIN', 'H+H Software Virtual CD', 'EZB Systems UltraISO']"], "xmct": ["Mathcad XML Worksheet Template", "Template file created by Mathcad, a program used for engineering calculations; saves a worksheet template that can be used for creating multiple .XMCD documents from the same starting point.", "Windows, ", "['PTC Mathcad Prime 3.0']"], "xmcdz": ["Mathcad Compressed Worksheet File", "XML-based worksheet created with Mathcad, a program for creating engineering and scientific calculations; may include both mathematical and textual elements; similar to a .XMCD file, but saved in a compressed format.", "Windows, ", "['PTC Mathcad Prime 3.0']"], "xmcd": ["Mathcad Worksheet File", "XML-based worksheet created with Mathcad, an engineering calculation program developed by Parametric Technology Corporation (PTC); may contain both math and text elements.", "Windows, ", "['PTC Mathcad Prime 3.0', 'SMath Studio']"], "xmb": ["Age of Empires Game Data File", "Stores data used by different scenarios in Age of Empires, a real-time strategy game; may include level data, sounds, and other information; saved in an XML format and often ends with a \"*.xml.xmb\" extension.", "Windows, Windows, Mac, ", "['Microsoft Age of Empires'][][]"], "xmap": ["XMind 2007/2008 Workbook", "Workbook created by XMind, a mind mapping application; created by the 2007 and 2008 releases of the software, but can still be opened by recent XMind versions; used for visually storing ideas captured during brainstorming sessions.", "Windows, Mac, Linux, ", "['XMind']['XMind']['XMind']"], "xm": ["Fasttracker 2 Extended Module", "Music module created by Fasttracker 2, an audio tracker program; uses MIDI data and sound samples to compose songs; similar to a .S3M or .MOD file, but is saved in the Fasttracker format.", "Windows, Mac, Linux, ", "['XMPlay', 'Nullsoft Winamp', 'MilkyTracker', 'OpenMPT', 'FMJ-Software Awave Studio', 'VideoLAN VLC media player', 'CoolUtils Total Audio Converter', 'MikMod']['CocoModX', 'MilkyTracker', 'PlayerPro', 'XimpleMOD', 'VideoLAN VLC media player', 'MikMod']['MilkyTracker', 'VideoLAN VLC media player', 'MikMod']"], "xlw": ["Excel Workspace File", "Workspace file saved by Microsoft Excel, a program used to create spreadsheets; contains the screen locations of one or more workbooks, as well as references to the workbook files; used to restore the layout when working simultaneously on multiple workbooks.", "Windows, Mac, Windows, Mac, ", "['Microsoft Excel 2016']['Microsoft Excel 2016']['Microsoft Excel 2016']['Microsoft Excel 2016', 'Planamesa NeoOffice']"], "xltx": ["Excel Open XML Spreadsheet Template", "An XLTX file is a template created by Microsoft Excel, a program used for creating spreadsheets.  It contains default settings and layout information used to create .XLSX files.   XLTX files may be used to create multiple spreadsheets with common formatting and properties.", "Windows, Mac, ", "['Microsoft Excel 2016']['Microsoft Excel 2016']"], "xltm": ["Excel Open XML Macro-Enabled Spreadsheet Template", "Template file created by Microsoft Excel, a spreadsheet program; contains default settings and layout properties for a macro-enabled spreadsheet; used to create a new macro-Enabled workbook (.XLSM file) that uses the Open XML format, which was introduced in Microsoft Office 2007.", "Windows, Mac, ", "['Microsoft Excel 2016']['Microsoft Excel 2016']"], "xlv": ["Excel Visual Basic Module", "Module written in VBA (Visual Basic for Applications) for Microsoft Excel; adds extra functionality, such as new features and automations, to the Excel spreadsheet program.", "Windows, Mac, ", "['Microsoft Excel 2016']['Microsoft Excel 2016']"], "xlthtml": ["Microsoft Excel HTML Spreadsheet Template", "HTML version of a .XLT spreadsheet template created with Microsoft Excel, a spreadsheet application; contains HTML that renders the template using similar formatting as the original XLT file; used for viewing published spreadsheet information in a Web browser.", "Windows, Mac, ", "['Microsoft Excel 2016']['Microsoft Excel 2016']"], "xlt": ["Excel Template", "An XLT file is a template created by Microsoft Excel, a spreadsheet application included with the Microsoft Office suite.  It contains default formatting and data for a spreadsheet and is used as a basis for creating new .XLS files.  XLT files are saved in the Excel Binary File Format, which was the primary format until the Office Open XML format (.XLTX file extension) replaced it in Excel 2007 for Windows and 2008 for Mac.", "Windows, Mac, ", "['Microsoft Excel 2016']['Microsoft Excel 2016']"], "xlshtml": ["Microsoft Excel HTML Spreadsheet", "HTML version of an .XLS spreadsheet created with Microsoft Excel, a spreadsheet productivity application; contains the HTML representation of the source XLS spreadsheet file, which can be viewed in a Web browser; used for viewing published spreadsheets without the Excel application.", "Windows, Mac, ", "['Microsoft Excel 2016']['Microsoft Excel 2016']"], "xlsb": ["Excel Binary Spreadsheet", "An XLSB file is a spreadsheet file created by Microsoft Excel, a program used to create and edit spreadsheets.  It contains a spreadsheet of cells arranged by a grid of rows and columns, as well as charts, macros, and formatting.  XLSB files are saved in a binary format.", "Windows, Mac, Linux, ", "['Microsoft Excel 2016', 'Apache OpenOffice', 'Apache Open Office']['Microsoft Excel 2016', 'Apache OpenOffice', 'Apache Open Office']['Apache OpenOffice', 'Apache Open Office']"], "xlsx": ["Microsoft Excel Open XML Spreadsheet", "An XLSX file is an Excel spreadsheet created by Microsoft Excel or another spreadsheet program, such as OpenOffice Calc or Apple Numbers.  It stores data in worksheets, which contain cells arranged in a grid of rows and columns, and may also contain charts, mathematical functions, styles, and formatting.  XLSX files are commonly used to store financial data and to create simple or complex mathematical models.", "Windows, Mac, Linux, Web, iOS, Android, ", "['File Viewer Plus', 'Microsoft Excel 2016', 'OxygenOffice Professional', 'Corel WordPerfect X8', 'Apache OpenOffice', 'SoftMaker Office', 'Gnumeric', 'LibreOffice']['Microsoft Excel 2016', 'Apple Numbers 4', 'Apache OpenOffice', 'Planamesa NeoOffice', 'LibreOffice']['OxygenOffice Professional', 'Apache OpenOffice', 'Gnumeric', 'LibreOffice']['Google Drive', 'Intuit QuickBooks Canada']['Microsoft Excel', 'Apple Numbers', 'MobiSystems OfficeSuite Pro', 'Infraware Polaris Office', 'Google Drive']['Microsoft Excel', 'Kingsoft WPS Office for Android', 'MobiSystems OfficeSuite Pro', 'Google Drive', 'SoftMaker Office: PlanMaker Mobile']"], "xlsmhtml": ["Microsoft Excel MIME HTML Spreadsheet", "Archived MIME HTML spreadsheet file saved by earlier versions of the Microsoft Excel spreadsheet application; contains HTML code that represents the spreadsheet in a format similar to the original .XLS file; used for viewing published spreadsheets in a Web browser.", "Windows, Mac, ", "['Microsoft Excel 2016']['Microsoft Excel 2016']"], "xlsm": ["Excel Open XML Macro-Enabled Spreadsheet", "An XLSM file is a macro-enabled spreadsheet created by Microsoft Excel, a widely used spreadsheet program that comes with every edition of the Microsoft Office suite.  It contains worksheets of cells arranged by rows and columns as well as embedded macros programmed in the Visual Basic for Applications (VBA) language.  XLSM files are saved in the Open XML format introduced in Microsoft Office 2007.", "Windows, Mac, Web, iOS, Android, ", "['File Viewer Plus', 'Microsoft Excel 2016', 'Microsoft Access 2016', 'Corel Quattro Pro X8']['Microsoft Excel 2016']['Google Drive']['MobiSystems OfficeSuite Pro']['MobiSystems OfficeSuite Pro']"], "xls": ["Excel Spreadsheet", "An XLS file is a spreadsheet file created by Microsoft Excel or another spreadsheet program, such as OpenOffice Calc or Apple Numbers.  It stores data in worksheets, charts, and macros.  XLS files are saved in the Excel Binary File Format, which was the primary format until the Office Open XML format (.XLSX file extension) replaced it in Excel 2007.", "Windows, Mac, Linux, Web, iOS, Android, ", "['File Viewer Plus', 'Microsoft Excel 2016', 'Microsoft Excel Viewer', 'Corel Quattro Pro X8', 'Apache OpenOffice', 'Kingsoft Spreadsheets', 'Nuance OmniPage Ultimate', 'SoftMaker Office', 'Gnumeric', 'LibreOffice']['Microsoft Excel 2016', 'Apache OpenOffice', 'Planamesa NeoOffice', 'LibreOffice']['Apache OpenOffice', 'Gnumeric', 'LibreOffice']['Google Drive']['Microsoft Excel', 'MobiSystems OfficeSuite Pro', 'Infraware Polaris Office', 'Google Drive']['Microsoft Excel', 'Kingsoft WPS Office for Android', 'MobiSystems OfficeSuite Pro', 'Google Drive', 'SoftMaker Office: PlanMaker Mobile']"], "xlr": ["Works Spreadsheet", "An XLR file is a spreadsheet or chart created with versions 6-9 of Microsoft Works, a popular productivity suite.  It stores data in cells that are organized in a grid consisting of rows and columns.", "Windows, Mac, ", "['Microsoft Works', 'Microsoft Excel 2016']['Microsoft Excel 2016']"], "xlnk": ["XML Shortcut File", "Shortcut or \"link\" to another file that uses XML formatting; similar to a .LNK file, but can used on multiple platforms due to its XML-based structure; contains the path to the target file within the \"TargetFile\" tag in the XML.", "Windows, Linux, ", "[][]"], "xlm": ["Excel Macro", "Contains macros used for automating processes in Microsoft Excel; may be preinstalled with Excel or created by the user; can be recorded by selecting Tools→Macro→Record New Macro...; when creating the macro, a keyboard shortcut can be assigned to run the macro.", "Windows, Mac, ", "['Microsoft Excel 2016']['Microsoft Excel 2016']"], "xll": ["Excel Add-In File", "Contains extra functions, templates, or other tools that enhance the capabilities of Microsoft Excel; similar to a standard .DLL file (Dynamic Link Library), but is specifically written for MS Excel.", "Windows, Mac, ", "['Microsoft Excel 2016']['Microsoft Excel 2016']"], "xlk": ["Excel Backup File", "Backup file created by Microsoft Excel, a spreadsheet program; contains a backup copy of a .XLS file; used to recover spreadsheet data in the event that a spreadsheet file is lost or corrupted.", "Windows, Mac, ", "['Microsoft Excel 2016']['Microsoft Excel 2016']"], "xliff": ["XLIFF Localization File", "File created using the XLIFF (XML Localization Interchange File Format) standard, which is used for storing language translation information; more commonly uses the .XLF extension.", "Windows, Mac, Linux, ", "['SDL Trados Studio', 'OmegaT', 'Maxprograms Swordfish']['OmegaT', 'Maxprograms Swordfish']['OmegaT', 'Maxprograms Swordfish']"], "xlmv": ["Xunlei Movie File", "Video file used by Xunlei, a Chinese Internet download manager also referred to as \"Thunder;\" used by the Xunlei Movie digital movie service, which provides online movies for video playback in the Xunlei software; saves the video in a proprietary format.", "Windows, Mac, ", "['Thunder']['Thunder']"], "xlf": ["XLIFF Document", "XML formatted file based on the XLIFF (XML Localisation Interchange File Format) specification developed by the OASIS Technical Committee; used as a standard means of exchanging localizable data and related information in a lossless format.", "Windows, Mac, Linux, ", "['OmegaT', 'Maxprograms Swordfish', 'text editor']['OmegaT', 'Maxprograms Swordfish', 'text editor']['OmegaT', 'Maxprograms Swordfish', 'text editor']"], "xlgc": ["ExpressK Database File", "Database format used by ExpressK, a key management program designed for small businesses; includes a list of locks, keys, and users; may also include building diagrams and equipment maintenance schedules.", "Windows, ", "[]"], "xld": ["Excel Database File", "Database file created by older versions of Microsoft Excel, including Excel 5.0 and Excel 95; stores structured data in a proprietary format that is no longer supported by recent versions of the software.", "Windows, Mac, ", "['Microsoft Excel 2016']['Microsoft Excel 2016']"], "xlc": ["Excel Chart", "Chart created with data from a Microsoft Excel spreadsheet; can be generated from a selection of data by selecting Insert→Chart within Excel; may be saved within the Excel spreadsheet (.XLS file) or separately as an XLC file.", "Windows, Mac, ", "['Microsoft Excel 2016', 'ACD Systems Canvas X 2017']['Microsoft Excel 2016']"], "xla": ["Excel Add-In File", "Adds modules, extra functions, and other tools to Microsoft Excel; may be included with the Excel software program, developed by a third-party, or created by the user.", "Windows, Mac, ", "['Microsoft Excel 2016']['Microsoft Excel 2016']"], "xl": ["Excel Spreadsheet", "Alternative extension used for Excel spreadsheet files; contains data organized in rows and columns; can be exported from Excel as a text file, .CSV, or .TSV file.", "Windows, Mac, ", "['Microsoft Excel 2016']['Microsoft Excel 2016']"], "xise": ["Xilinx ISE Project File", "Project file created by ISE, an application used for designing computer hardware electronics devices; saves a list of the source files used by the project as well as project properties and the software version for the project; used for FPGA (Field-programmable Gate Array) design.", "Windows, ", "['Xilinx ISE Design Suite']"], "xlb": ["Excel Toolbars File", "Stores custom settings for toolbars (also known as command bars) created in Microsoft Excel; toolbar settings can be modified within Excel by choosing \"Toolbars\" from the View menu; the XLB file stores these custom settings, including which toolbars are visible, where they are located, and what options are available on each toolbar.", "Windows, Mac, Windows, Mac, Linux, ", "['Microsoft Excel 2016']['Microsoft Excel 2016']['Apache OpenOffice']['Apache OpenOffice']['Apache OpenOffice']"], "xif": ["ScanSoft Pagis File", "XIF (eXtended Image Format) file originally created for the ScanSoft Pagis scanning software; designed as an extension to the .TIFF format for storing text documents as images; separates the image into four layers:\r\n\r\nText layer for optical character recognition (OCR)\r\nLayer for text colors\r\nColor image segments layer\r\nBackground tint layer\r\n\r\nNOTE: ScanSoft is now Nuance Communications.  The XIF file format is still supported by some Nuance applications.", "Windows, ", "['Nuance OmniPage Ultimate', 'ACD Systems ACDSee 20', 'Logipole Konvertor']"], "xlam": ["Excel Open XML Macro-Enabled Add-In", "File used by Microsoft Excel, a program that allows users to create and edit spreadsheets; contains a macro-enabled add-in, which provides extra functionality and tools that may execute macros.", "Windows, Mac, ", "['Microsoft Excel 2016']['Microsoft Excel 2016']"], "xip": ["macOS Signed Archive", "An XIP file is a .XAR archive that contains one or more files compressed or \"zipped\" using GNU Zip (gzip) compression that have been digitally signed.  It also includes metadata such as certificates and the date and time the archive was created and modified.", "Mac, ", "['Apple Archive Utility']"], "xib": ["Interface Builder File", "Application interface created with Interface Builder, a graphical editor for designing and testing user interfaces; saved in a text-based flat-file format, introduced in Interface Builder 3.0.", "Mac, ", "[]"], "xi": ["Fasttracker 2 Extended Instrument File", "Instrument file format used by Fasttracker; stores wave samples that are played back in Fasttracker songs.", "Windows, Mac, Linux, ", "['Starbreeze Studios Fasttracker', 'MilkyTracker', 'FMJ-Software Awave Studio']['MilkyTracker']['MilkyTracker']"], "xhtml": ["Extensible Hypertext Markup Language File", "An XHTML file is a web page written in XHTML, a reformulation of HTML 4 as an XML 1.0 application.  It uses standard HTML tags, but must conform to more strict XML guidelines.", "Windows, Mac, Linux, Android, ", "['File Viewer Plus', 'Microsoft Internet Explorer', 'Mozilla Firefox', 'Web browser', 'Adobe Dreamweaver CC 2017', 'Adobe ColdFusion Builder']['Apple Safari', 'Mozilla Firefox', 'Web browser', 'Adobe Dreamweaver CC 2017', 'Adobe ColdFusion Builder']['Mozilla Firefox']['File Viewer for Android']"], "xht": ["XHTML File", "Web file written in XHTML, the Extensible Hypertext Markup Language; similar to a .HTML file, but is based on the more strict .XML syntax; allows for a more consistent representation of Web pages across multiple browsers.", "Windows, Mac, ", "['Web browser']['Web browser']"], "xgs": ["XACT Global Settings File", "Configuration file created with XACT, the Microsoft Cross-Platform Audio Creation Tool; contains the categories, variables, and run-time parameter controls defined by the sound designer; referenced by video games that use XACT sound data, including .XWB and .XSB files.", "Windows, ", "[]"], "xgp": ["Xfire Game Patcher File", "File created by XGP (Xfire Game Patcher), a program used for modifying the xfire_games.ini file used by Xfire; saves a list of XGP-managed games profiles, which can be used to patch the Xfire .INI file.", "Windows, ", "['XGP']"], "xgmml": ["XGMML Graph File", "File created in the XGMML (eXtensible Graph Markup and Modeling Language) format, an XML format used for describing structured graphs; describes nodes and vertices that comprise a graph; based on the .GML (Graph Modeling Language) format and is used for exchanging data between graph applications.", "Windows, Mac, Linux, ", "['yWorks yEd Graph Editor', 'Cytoscape']['yWorks yEd Graph Editor', 'Cytoscape']['yWorks yEd Graph Editor', 'Cytoscape']"], "xhtm": ["Extensible Hypertext Markup Language Document", "Web page file written in XHTML, a reformulation of HTML 4 that uses XML 1.0; includes standard HTML tags, which must adhere to more strict XML guidelines; used for publishing website content.", "Windows, Mac, Linux, ", "['Microsoft Internet Explorer', 'Mozilla Firefox', 'Google Chrome', 'Web browser', 'Adobe Dreamweaver CC 2017']['Apple Safari', 'Mozilla Firefox', 'Google Chrome', 'Web browser', 'Adobe Dreamweaver CC 2017']['Mozilla Firefox']"], "xgml": ["Graph Modeling Language XML File", "File created in the XML version of the Graph Modeling Language (GML) format (the plain ASCII version uses the .GML extension); used to describe graph structures such as hierarchies, networks, and knowledge relationships.", "Windows, Mac, Linux, ", "['yWorks yEd Graph Editor']['yWorks yEd Graph Editor']['yWorks yEd Graph Editor']"], "xgdw": ["GDevelop Extension File", "An XGDW file is an extension file used by GDevelop, an application that allows users to create games without programming knowledge.  It contains an extension selected by the user when compiling a .GDG project into a native executable.  The extension file allows you to add functionality to your game.", "Windows, Mac, Linux, ", "['GDevelop']['GDevelop']['GDevelop']"], "xft": ["Adobe Form Designer 5.0 File", "Form created by Adobe Form Designer 5 or by the older version of the software called FormFlow Designer 99, also known as Accelio Capture FormFlow Designer.", "Windows, Windows, ", "['Adobe LiveCycle ES4'][]"], "xfs": ["eRacer Sound File", "Audio file format used by eRacer, a programmable robot", "Windows, ", "[]"], "xfr": ["iProcess Process Definition File", "Process definition created for TIBCO iProcess, a business process management (BPM) application used for modeling, automating, and optimizing business processes; contains a specific process that can be added to a business model.", "Windows, ", "['TIBCO iProcess Suite']"], "xfo": ["XSL-FO Formatted Form", "Form that is formatted using on the XSL-FO (Extensible Stylesheet Language - Formatting Objects) markup language; defines how XML data is formatted for the screen, print, or other type of media; may be used in online or offline applications.", "Windows, ", "[]"], "xfn": ["Ventura Printer Font", "Printer font file used by the Corel Ventura publishing application, a program that can transform complex documents and XML files into visually rich publications; the XFN font format ensures accurate printing of text and is supported by Xerox printers.", "Windows, ", "[]"], "xflow": ["FlowExchange Data File", "Data file created in the FlowExchange format, which is used to transfer material stream data between CAPE-OPEN compliant flowsheet simulators; stores flowsheet material stream data and physical properties.", "Windows, ", "['AmsterCHEM FlowExchange']"], "xfl": ["Animate Movie Archive", "An XFL file is a file saved in the Adobe XFL format, which is a compressed archive of an Animate movie's contents.  It contains an XML file that specifies the structure of the movie and includes a Library folder that contains movie assets, such as images, audio, or video.  XFL files are the XML-based equivalent of .FLA files.", "Windows, Mac, ", "['Adobe Animate CC 2017', 'Adobe InDesign CC 2017', 'Adobe After Effects CC 2017']['Adobe Animate CC 2017', 'Adobe InDesign CC 2017', 'Adobe After Effects CC 2017']"], "xfdl": ["XFDL File", "Extensible Forms Description Language (XFDL) file that uses XML to describe a structured, legally-binding business form; contains business form data including layout, business transaction details, inline mathematical and conditional expressions, and digital signatures; addresses business transaction needs for non-repudiation, auditability, security, and preservation of context.", "Windows, Mac, ", "['IBM Lotus Forms Viewer', 'Microsoft Notepad', 'Notepad++', 'text editor']['text editor']"], "xfdf": ["Adobe Acrobat XFDF File", "XML Forms Data Format (XFDF) file created by Adobe Acrobat, a PDF authoring application; stores descriptions of page form elements and their values, such as the names and values for text fields; used for saving form data that can be imported into a PDF document.", "Windows, Mac, ", "['Adobe Acrobat DC']['Adobe Acrobat DC']"], "xet": ["eManager Process Definition", "Defines business processes monitored by eManager, a modular system for procedures and quality and risk control.", "Windows, ", "[]"], "xfd": ["XFD File", "File that uses the Extensible Forms Description Language (XFDL) standard to represent a structured, legally-binding business form; contains business form data including layout, digital signatures, inline expressions, and business transaction details; addresses business transaction needs for auditability, non-repudiation, preservation of context, and security.", "Windows, Windows, Mac, Linux, ", "['IBM Lotus Forms Viewer']['Adobe Acrobat DC', 'Adobe Reader']['Adobe Acrobat DC', 'Adobe Reader']['Adobe Reader']"], "xfb": ["Xserve RAID Firmware Binary File", "Binary file utilized by Xserve RAID Admin, an application used for managing the mass storage device Xserve RAID; contains a firmware update, for the RAID controllers and co-processor; installed through the Xserve RAID admin.", "Windows, Mac, Linux, ", "['Apple Xserve RAID Admin']['Apple Xserve RAID Admin']['Apple Xserve RAID Admin']"], "xez": ["eManager Template Package", "Compressed package of templates use by eManager, a modular system for procedures and quality and risk control; contains XML and graphics.", "Windows, ", "[]"], "xex": ["Xbox 360 Executable File", "Application or video game developed for the Xbox 360 gaming console; designed to run on an Xbox 360 and is not meant to be opened on a PC.", "Windows, ", "[]"], "xev": ["eManager Auto-Update File", "Provides automatic software updates and delivery of new procedures for eManager, a modular system for procedures and quality and risk control.", "Windows, ", "[]"], "xesc": ["Expression Encoder Screen Capture File", "Video file created by Expression Encoder Screen Capture, a screen recording application included with Microsoft Expression Studio; saves a recording of the user's screen and may also include audio recorded with a microphone.", "Windows, ", "['File Viewer Plus', 'Microsoft Expression Studio', 'Microsoft Expression Encoder', 'Microsoft Expression Encoder Screen Capture Codec', 'VideoLAN VLC media player']"], "xes": ["eManager Skins Definition", "Defines the user interface for various skins, or appearances, used by eManager; formatted in XML.", "Windows, ", "[]"], "xensearch": ["XenCenter Saved Search File", "File created by XenCenter, the program used for managing Citrix XenServer, a virtual machine management application; saves search criteria for locating virtual machines; allows the search to be performed again in the software.", "Windows, ", "['Citrix XenServer']"], "xer": ["Primavera P6 Project File", "Project planning file created by Primavera P6, a project planning application; saves the tasks, timeline, materials, and other resources required for the project; enables a project manager to plan and track progress.", "Windows, ", "['Oracle Primavera', 'Primavera Reader']"], "xep": ["eManager File Packaging Information", "Defines eManager components and the location where they will be unpacked.", "Windows, ", "[]"], "xen": ["Guitar Hero III Data File", "Data file used by Guitar Hero III for the Mac or PC; may contain graphics, textures, video, audio or other data used by the game; stored in a package format and usually named \"[filename].pak.xen.\"", "Windows, Mac, ", "[][]"], "xej": ["Expression Encoder Job File", "File created by Microsoft Expression Encoder, an application used for transcoding video; saves a video encoding job in an XML format; stores references to the source video files as well as the transcoding settings for each file in the job; also saves the output video quality and file type (e.g., .WMV); used as Encoder's native save file type.", "Windows, ", "['Microsoft Expression Studio']"], "xem": ["eManager Metered Units", "Defines metered units and credits used by eManager, a modular system for procedures and quality and risk control.", "Windows, Windows, ", "[][]"], "xel": ["Expression Encoder Live Encoding File", "Settings file created by Expression Encoder, a video transcoding application included with Microsoft Expression Studio; stores the presets for a live video encoding session and includes references to the source media as well as the transcoding settings for each file; saved in an XML format.", "Windows, ", "['Microsoft Expression Studio']"], "xef": ["eManager Form Data", "Data used by eManager, a modular system for procedures and quality and risk control; formatted in XML.", "Windows, Windows, Mac, ", "[]['E-merge WinAce']['MacUnace']"], "xdw": ["Fuji Xerox DocuWorks File", "Proprietary image format used by Fuji Xerox DocuCentre scanners and copiers; may include both images and text, as well as links to Web pages or other documents; scanned text may be converted to actual characters using DocuWorks OCR technology and searched like a word processing document.", "Windows, Mac, ", "[][]"], "xdr": ["XML-Data Reduced File", "File created using the XML-Data Reduced (XDR) schema definition language; contains a data definition that describes the data in one or more related XML files; used by XML parsers to understand and parse XML data.", "Windows, ", "['Liquid Technologies Liquid XML Studio', 'Microsoft Notepad', 'text editor']"], "xdi": ["WinArchiver Extended Disc Image File", "Compressed disc image created by WinArchiver, a file compression, spanning, and encryption program for Windows; saved in a proprietary format but can be decompressed to the standard .ISO format using WinArchiver's Tools → Decompress XDI File... menu option.", "Windows, ", "['WinArchiver', 'WinArchiver Virtual Drive']"], "xds": ["DS Game Maker Project File", "Project file created by DS Game Maker, a program that allows users to make custom Nintendo DS games; contains lines of program code for the game; used to store game code as well as to reference project resources, such as game images.", "Windows, Windows, ", "['Invisionsoft DS Game Maker'][]"], "xdp": ["XML Data Package", "XML file created in the XML Data Package format, a file format developed by Adobe Systems for packaging PDF data into XML files; contains the entire PDF document contents including form and template data; may also include character-encoded sections for binary content.", "Windows, Mac, Linux, ", "['Adobe Acrobat DC', 'Adobe LiveCycle ES4']['Adobe Acrobat DC']['Adobe LiveCycle ES4', 'Adobe Acrobat DC']"], "xdna": ["DNA Strider Sequence File", "Biological sequence file saved in the DNA Strider format; contains a biological sequence, which includes information about the sequence type (DNA, RNA, or protein-byte 2), sequence topology, and the sequence length.", "Windows, Mac, Linux, ", "['Genome Compiler', 'GSL Biotech SnapGene']['DNA Strider', 'Genome Compiler', 'GSL Biotech SnapGene']['Genome Compiler']"], "xdl": ["Oracle Expert Definition Language File", "Defines the classes and structures of other files created by the Oracle Expert database optimization program; created whenever a database, environment, instance, schema, or workload data is exported by Oracle Expert.", "Windows, Windows, Mac, ", "[]['text editor']['text editor']"], "xcworkspace": ["Xcode Workspace File", "File created by Xcode, a development application for creating iOS and Mac OS X (Cocoa) applications; saves workspace settings including and the View (Navigator, Debug, and Utilities panes) and Editor states; created by selecting File → Save As Workspace... with an open project.", "Mac, ", "['Apple Xcode']"], "xdb": ["Symantec Virus Database File", "Virus database file used by Symantec AntiVirus, an antivirus program; contains updated virus definitions; used to distribute virus definitions over the Internet when new viruses are discovered.", "Windows, Windows, ", "['Symantec EndPoint Protection 12'][]"], "xct": ["XVI32 Character Conversion Table File", "An XCT file contains a character conversion table created by XVI32, a freeware hex editor.  It stores a table of ANSI and ASCII characters and the characters to which they are converted when typed in XVI32.  XCT files are stored in plain text.", "Windows, ", "['XVI32']"], "xcsnapshots": ["Xcode Snapshot", "Project snapshot file created by Xcode, a Apple's development IDE for Mac OS X and iOS applications; contains all saved states of a development project, including resource files, source code, and project settings; can also include developer notes for each saved state; used for storing recovery checkpoints for a project.", "Mac, ", "['Apple Xcode']"], "xcu": ["OpenOffice.org Configuration File", "File used by OpenOffice.org, an open source office productivity suite; contains configuration information for an add-on in an XML format; commonly used to configure OpenOffice.org office extensions.", "Windows, Mac, Linux, ", "['Apache OpenOffice']['Apache OpenOffice']['Apache OpenOffice']"], "xcsl": ["CineStyle Color Correction File", "File used by CineStyle Color Assist, a program used for applying CineStyle color profiles to Canon DLSR cameras; saved in an XML format and contains metadata describing color correction information that helps give the camera higher quality pictures.", "Windows, ", "['Technicolor CineStyle Color Assist']"], "xcscheme": ["Xcode Scheme File", "File used by Apple Xcode, an application that helps users develop iOS and Mac OS X applications; contains build, run, test, profile, analyze, and archive configuration information for your project.", "Mac, ", "['Apple Xcode']"], "xcplugindata": ["Xcode Plug-in Data File", "Plugin data file used by Apple Xcode, a Mac OS  X software development program; contains data referenced by Xcode plugin files to provide functionality, such as generating .PLIST file structure definitions for an application; located inside .DVTPLUGIN and IDEPLUGIN files.", "Mac, ", "['Apple Xcode']"], "xcplugin": ["Xcode Plug-in", "Plugin bundle used by Apple Xcode, an iOS and OS X development  IDE; stores data referenced by Xcode to extend the application's capabilities, such as colored text or custom compilers; similar to a .BUNDLE file.", "Mac, ", "['Apple Xcode']"], "xcodeproj": ["Xcode Project", "An XCODEPROJ file is a Mac OS X or iOS software development project created with Apple's Xcode programming software.  It contains project configuration data and links to files referenced by the project.", "Mac, ", "['Apple Xcode']"], "xcodeplugin": ["Xcode Plug-in", "Plugin used by Apple Xcode, an IDE used to create iOS and OS X apps; contains data referenced by Xcode to extend the application's capabilities, such as a \"Clean Up Whitespace\" menu item that removes unnecessary end of line white space from text files.", "Mac, ", "['Apple Xcode']"], "xcode": ["Xcode Project", "Developer project file created by Xcode, a software development IDE used for creating Mac OS X applications; much less commonly used than .XCODEPROJ, which is the default Xcode project file extension.", "Mac, ", "['Apple Xcode']"], "xcf": ["GIMP Image File", "Image file created by the GNU Image Manipulation Program (GIMP), a freely distributed image editing program; saves layers, channels, paths, guides, and the current selection when saved.", "Windows, Mac, Linux, ", "['File Viewer Plus', 'GIMP', 'CorelDRAW Graphics Suite X8', 'CinePaint', 'XnViewMP', 'IrfanView']['GIMP', 'Seashore', 'CinePaint', 'XnViewMP']['GIMP', 'CinePaint', 'Kolourpaint']"], "xcdatamodeld": ["Xcode Core Data Model File", "Developer file created by Xcode, a free software IDE developed by Apple; created when the developer specifies that Core Data will be used for the project; saves an .XCDATAMODEL (without a \"D\") file as well as other files.", "Mac, ", "['Apple Xcode']"], "xccolortheme": ["Xcode Color Theme File", "File used by Apple Xcode, a program used to develop iOS and Mac OS X applications; contains data that describes the color theme of the code editor; includes the text color, text font, and text background color of different elements of source code editing, such as Plain Text, Strings, URLs, Attributes, and Comments.", "Mac, ", "['Apple Xcode']"], "xcconfig": ["Xcode Configuration Settings File", "Configuration file created by Xcode, a Mac OS X software development application; stores parameters for configuring the build of Xcode projects; can be referenced by multiple Xcode projects to use the same build settings.", "Mac, ", "['Apple Xcode']"], "xcdatamodel": ["Xcode Core Data Model File", "Developer file created by Xcode, Apple's development software for iOS and Mac OS X; saved within an .XCDATAMODELD (with a trailing \"D\") package and saves the data model, or schema used by the application; created when the developer enables a Core Data Model for an Xcode project.", "Mac, ", "['Apple Xcode']"], "xccrashpoint": ["Xcode Crash Point File", "An XCCRASHPOINT file is a crash file created by Xcode to store data about an app crash for reporting and debugging purposes.  It contains a .CRASH file and other logs that store information about the state of the computer at the time of a crash and includes timestamp, program, and memory dump information.", "Mac, ", "['Apple Xcode']"], "xcarchive": ["Xcode Archive", "Application archive created by Xcode, Apple's development IDE for Mac OS X and iOS applications; stores all application files in a format that can be submitted to the App Store for review; contains a digital signature identifying the developer.", "Mac, ", "['Apple Xcode', 'RB App Checker Lite']"], "xcappdata": ["Xcode App Data File", "Data file exported from Xcode, Apple's development IDE for Mac OS X and iOS; saves a package of user files that are saved by app on the iPhone; used by developers when testing apps.", "Mac, ", "['Apple Xcode']"], "xbsav": ["Mass Effect 2 Xbox Saved Game", "Game file saved by the Xbox version of Mass Effect 2, a shooter game that takes place in outer space; contains saved game data, such as the character name, weapons, currency, and level; used to save and load game progress.", "Windows, ", "[\"Gibbed's Mass Effect 3 Save Editor\", \"Gibbed's Mass Effect 2 Save Editor\"]"], "xbrl": ["XBRL Document", "Document written in eXtensible Business Reporting Language (XBRL), an XML-based language; contains business and financial data, such as balance sheets, ledgers, and financial statements; used for communicating and exchanging business performance reports; commonly uses the .XML extension but occasionally appears with the XBRL extension.", "Windows, ", "['Rivet Software Dragon View XBRL Viewer']"], "xbt": ["SMART Notebook Template File", "Template of a .XBK file created with SMART Technologies' interactive whiteboard classroom software; contains the default structure and materials for a classroom lesson; used for creating lectures and other classroom lectures with a common theme.", "Windows, Mac, Linux, ", "['SMART Technologies Notebook']['SMART Technologies Notebook']['SMART Technologies Notebook']"], "xbplate": ["Xiosis Scribe Template", "Document template created by Xiosis Scribe, a word processing application; saves the default page formatting and textual information for a document; used for generating multiple .XBDOC documents with a similar style.", "Windows, ", "['Xiosis Akuru']"], "xbmml": ["Braille Music Markup Language File", "File saved in the XBMML format and opened by Braille Music Reader, a music creation tool for visually impaired persons; contains a braille musical score including score settings, such as notes, pitch, and octaves; holds metadata related to the score for indexing purposes. ", "Windows, ", "['Braille Music Reader']"], "xbm": ["X11 Bitmap Graphic", "Bitmap image used by the X Window System (X11), a graphical user interface (GUI) used to manage networked client-server computers; stores a monochrome image that is written as plain text in the C programming language.", "Windows, Mac, Linux, Android, ", "['File Viewer Plus', 'Corel PaintShop Pro X9', 'ACD Systems Canvas X 2017', 'ACD Systems ACDSee 20', 'GraphicRegion.com Able Batch Converter', 'XnViewMP', 'IrfanView']['XnViewMP']['GIMP', 'XnViewMP']['File Viewer for Android']"], "xbl": ["Extensible Binding Language File", "File created in the XML Binding Language (XBL) format, an XML format used to specify the presentation of .XUL user interface widgets; contains \"bindings,\" which declare the layout of the XML interface elements; enables developers to change the look of widgets without having to modify the core functionality.", "Windows, Mac, Linux, ", "['Mozilla Firefox', 'Mozilla SeaMonkey']['Mozilla Firefox', 'Mozilla SeaMonkey', 'Apple Safari']['Mozilla Firefox', 'Mozilla SeaMonkey']"], "xbk": ["XenServer Backup File", "Backup file created by Citrix virtualization software; saves the configuration for a virtual server host so that it can be restored and restarted if it unexpectedly quits; does not include the virtual machines running on the server.", "Windows, Windows, Mac, Linux, ", "['Citrix XenCenter', 'Citrix XenServer']['SMART Technologies Notebook']['SMART Technologies Notebook']['SMART Technologies Notebook']"], "xaf": ["3ds Max XML Animation File", "XML file created by the 3ds Max modeling and animation software; contains motion information for a biped, which is a model with two-feet; enables modelers to accurately capture human and creature movements for video games, movies, and other 3D animations.", "Windows, Windows, Linux, Windows, ", "['Autodesk 3ds Max 2017']['Cal3dViewer', 'Cal3d2ogre']['Cal3D'][]"], "xadd": ["Expression Web Add-in", "Add-on used by Microsoft Expression Web, a program used for creating Web application designs; often used for adding new components that can be applied to developed Web applications, such as JavaScript components; saved in a .ZIP format.", "Windows, ", "['Microsoft Expression Studio']"], "xbf": ["XAML Binary File", "File created by Microsoft Visual Studio, A Windows SDK; contains a pre-parsed binary representation of a .XAML file produced by the XamlBinaryWriter class; intended to be write-once.", "Windows, ", "['Microsoft Visual Studio 2017', 'Windows Store Apps']"], "xa": ["The Sims Audio File", "Audio file used by The Sims, a game where players build and simulate cities; contains music or other sounds for the game; commonly stored within The Sims archive files (.FAR files).", "Windows, Mac, Linux, Windows, Windows, ", "['Electronic Arts The Sims', 'VideoLAN VLC media player']['Electronic Arts The Sims', 'VideoLAN VLC media player', 'Macgo Mac Media Player']['VideoLAN VLC media player']['EZB Systems UltraISO']['File Viewer Plus', 'PSMPlay', 'PsxMC']"], "x_t": ["Parasolid Model Part File", "File created by Parasolid, a CAD geometric modeling program; contains 3D model data such as geometry, topology, and color; designed as a standard export format for sharing Parasolid CAD models; saved in text format and can be exported and imported using a variety of other CAD programs.", "Windows, Mac, Linux, ", "['Siemens PLM Software Parasolid', 'Autodesk Fusion 360', 'Kubotek USA KeyCreator']['Siemens PLM Software Parasolid']['Siemens PLM Software Parasolid']"], "xbel": ["XBEL Bookmarks File", "Bookmarks file created in the XML Bookmark Exchange Language (XBEL) format; contains Web bookmarks, including their titles, URLs, and descriptions; can also store the bookmark folder hierarchy; used by some Web browsers for storing bookmarks, but is not used by the most popular browsers.", "Windows, Mac, Linux, ", "['Arora', 'Midori', 'XBELicious']['Arora', 'XBELicious']['Arora', 'Midori', 'Galeon', 'KDE Konqueror', 'XBELicious']"], "x_b": ["Parasolid Model Part File", "File created by Parasolid, a program for CAD geometric modeling; contains data such as geometry, topology, and color; designed as a standard exchange format for sharing CAD models; saved in binary format and may be imported or exported by other common CAD programs.", "Windows, Mac, Linux, ", "['Siemens PLM Software Parasolid', 'Autodesk Fusion 360']['Siemens PLM Software Parasolid']['Siemens PLM Software Parasolid']"], "x86": ["Linux Executable File", "Executable program file created for the Linux operating system; contains an application in binary format that is run as an executable; similar to the .EXE file in Microsoft Windows.", "Linux, ", "['Linux']"], "x4k": ["XML4King Configuration File", "File used by XML4King, a program used to convert .XLS or .CSV files from Microsoft Excel into .XML files that are usable by King Business Software; contains a collection of field mappings that map an Excel column in a source file to a field name from the King Business Software database.", "Windows, ", "[]"], "x3g": ["3D Print File", "3D printer file format used by desktop 3D printers with MakerBot or Sailfish firmwares such as MakerBot Replicator, FlashForge, and Wanhao; contains 3D model printing instructions.", "Windows, ", "['MakerBot Replicator']"], "x64": ["Commodore 64 Disk Image", "Disk image created from a Commodore 64 disk; Commodore 64, or C64, was a popular personal computer in the 1980s", "Windows, Mac, ", "['WinVICE', 'CCS64']['VICE']"], "x3f": ["SIGMA X3F Camera RAW File", "RAW file saved in SIGMA's X3F format, a high-end digital photo format also known as the Foveon X3 format or \"FOVb;\" holds data for a single image captured with a digital camera; supports the image data, thumbnails, preview images, and text property information; can be edited with several photo-editing applications.", "Windows, Mac, ", "['File Viewer Plus', 'SIGMA Photo Pro', 'Adobe Photoshop CC 2017', 'Corel PaintShop Pro X9', 'CyberLink PhotoDirector 8 Ultra', 'Google Picasa', 'Helicon Filter', 'EZ Freeware Free Opener']['SIGMA Photo Pro', 'Adobe Photoshop CC 2017', 'Google Picasa', 'CyberLink PhotoDirector 8 Ultra']"], "x32": ["Adobe Xtra File", "Application extension or \"xtra\" used by Adobe programs that were acquired from Macromedia; adds additional features, functionality, and file format support to Macromedia/Adobe software.", "Windows, Mac, ", "['Adobe Director', 'Adobe Flash Player', 'Adobe Shockwave Player', 'Adobe Authorware']['Adobe Director', 'Adobe Flash Player', 'Adobe Shockwave Player', 'Adobe Authorware']"], "x3d": ["Xara3D Project", "Three-dimensional image or animation created by Xara 3D Maker, a 3D image-editing and animation program; supports vector and raster graphics, transparency, lighting effects, and animation settings such as rotations, fades, and swings.", "Windows, ", "['MAGIX Xara 3D Maker 7']"]}