{"y": ["Yacc Source File", "Developer file used by Yacc (Yet Another Compiler-Compiler), a program used to generate source code parsers; contains formal declarations for how a programming language is defined; used for generating parsers for various languages.", "Windows, Mac, Linux, Windows, Mac, Windows, Mac, Linux, ", "['Microsoft Visual Studio with MKS Lex & Yacc plug-in', 'text editor']['Apple Xcode', 'Berkeley Yacc', 'Yacc', 'text editor']['Berkeley Yacc', 'Bison', 'Yacc', 'text editor']['Microsoft Windows Media Player with YUV Genius package', 'Apple QuickTime Player with QuickTime YUV codec']['Apple QuickTime Player with QuickTime YUV codec']['Smith Micro StuffIt Deluxe for Windows', 'Cloanto Amiga Forever']['Smith Micro StuffIt Deluxe 16', 'Cloanto Amiga Forever'][]"], "ypr": ["BYOB Project File", "Project file created by BYOB (Build Your Own Blocks), a visual programming environment that is an extension of MIT's Scratch software; contains an arrangement of visual blocks and flows between the blocks that make up the data and logic for the program; enables saving and loading of programs.", "Windows, Mac, Linux, ", "['Snap!']['Snap!']['Snap!']"], "yookoo": ["Yookoo Player Playlist File", "Playlist file created by Yookoo Player, an audio and video player for Windows; saves a list of audio and video files as well as information about each file, including the location of the file, the name of the multimedia content, and the duration; allows users to save and share audio and video favorites.", "Windows, ", "['Penguin George Yookoo Player']"], "ytf": ["Google Picasa Font Cache", "File contains font used by Google Picasa, an image sharing and editing program; holds the font type, size, and weight.", "Windows, Mac, ", "['Google Picasa']['Google Picasa']"], "yps": ["Yahoo! Messenger Data File", "Data file created by Yahoo! Messenger, an instant messaging application developed by Yahoo!; used by older versions of Yahoo! Messenger.", "Windows, Mac, ", "['Yahoo! Messenger']['Yahoo! Messenger']"], "yrcdat": ["YRC Software Data Script", "Script file created by Weblink, a Windows web browser; contains instructions executed by the Weblink program to perform functions such as referencing YRC .DLL files. ", "Windows, ", "['YRC Group Weblink']"], "ysp": ["BYOB Sprite File", "Graphics file used by BYOB (Build Your Own Blocks), a variant of the creative programming application Scratch; contains a 2D image and animation settings; often used for program characters or game objects.", "Windows, Mac, Linux, ", "['Snap!']['Snap!']['Snap!']"], "ytd": ["Grand Theft Auto 5 Texture File", "A YTD file is a texture file used by Grand Theft Auto 5 (GTA V), an open-world urban-adventure video game.  It contains textures for objects that appear during gameplay, such as vehicles and buildings.", "Windows, ", "['OpenIV', 'Rockstar Games Grand Theft Auto 5']"], "yrcbck": ["YRC Backup Archive", "Backup file created by Weblink, a web browser for the Windows platform; contains backup data for YRC Weblink data such as search history, .YRCBKM bookmark archive files, and downloads. ", "Windows, ", "['YRC Group Weblink']"], "yog": ["Outerra Captured Video File", "Video file captured by Outerra, a 3D planetary engine used for making space and earth simulations; contains video captured from an Outerra program; stores the video in a YCoCg (named \"yog\" by the Outerra developer) format.", "Windows, ", "['Outerra YOG Converter']"], "yrcbkm": ["YRC Bookmarks Archive", "Archive created by Weblink, a Windows web browser; contains one or more bookmarks of webpages that have been designated in the Weblink browser.", "Windows, ", "['YRC Group Weblink']"], "ync": ["yEnc Encoded File", "File encoded from a binary to a text format using the yEnc encoding method; similar to a standard US-ASCII encoded file, but significantly reduces the file overhead by using 8-bit Extended ASCII encoding; also includes a CRC checksum for verifying the integrity of the file.", "Windows, Mac, Linux, ", "['Smith Micro StuffIt Deluxe for Windows']['Smith Micro StuffIt Deluxe 16'][]"], "yml": ["YAML Document", "File created in the YAML (YAML Ain't Markup Language) format, a human-readable data format used for data serialization; allows data to be written and read independent of any particular language; can be incorporated into many different programming languages using supporting YAML libraries, including C/C++, Ruby, Python, Java, Perl, C#, PHP, and others.", "Windows, Mac, Linux, iOS, ", "['File Viewer Plus', 'Microsoft Notepad', 'text editor']['MacroMates TextMate', 'Apple TextEdit', 'text editor']['Vim', 'text editor']['Alexander Blach Textastic Code Editor']"], "ymp": ["YaST Metapackage File", "Installer package format used by openSUSE; allows one-click program installation from the Internet; includes metadata about the package, such as version information, system requirements, and installation details.", "Windows, Mac, Linux, ", "[][][]"], "ymg": ["Yahoo! Messenger File", "Data file used by Yahoo! Messenger, an online chatting application developed by Yahoo!; contains information used to run the application; used by older versions of Yahoo! Messenger.", "Windows, Mac, ", "['Yahoo! Messenger']['Yahoo! Messenger']"], "yml2": ["YML Script", "Script written in the YML programming language; contains a list of objects in a format similar to XML, but uses brackets instead of tags; can be edited in a text editor and compiled using the  yml2c compiler.", "Windows, Mac, Linux, ", "['text editor']['text editor']['text editor']"], "yz1": ["Yamazaki ZIPPER File", "Compressed archive created by Yamazaki ZIPPER, an older Windows application used for file compression and decompression; stores the archive in a proprietary format; rarely used as a form of compression.", "Windows, ", "['IZArc', 'TUGZip', 'WinInizio ZipGenius']"], "yz": ["YAC Compressed File", "File archive compressed with YAC (Yet Another Compressor), a file compression program developed for DOS; uses an improved version of the LZ+Huffman compression algorithm.", "Windows, ", "[]"], "yuv": ["YUV Video File", "A YUV file is a video file encoded in the YUV format.  It stores a sequence of YUV images as a single video file and may be saved in YUV 4:2:0, 4:2:2, 4:4:4 formats.  YUV video files may be decoded by MPEG-4 and H.264 decoders.", "Windows, Mac, Linux, Windows, Mac, Linux, ", "['Sunray Image YUVTools', 'WinXMedia AVI/WMV MP4 Converter']['MPlayerX', 'MPlayer']['MPlayer']['Datahammer 7yuv YUV Viewer', 'Elecard YUV Viewer', 'ImageMagick', 'XnViewMP']['XnViewMP']['XnViewMP']"], "yumtx": ["YUM Transaction File", "File created by Yellowdog Updater, Modified (YUM), a command-line utility for Linux operating systems, such as Fedora, CentOS, and Red Hat Enterprise Linux, that use the RPM Package Manager; contains transaction data that can be loaded at a later time to repeat a transaction.", "Linux, ", "['Yum Package Manager']"], "ym": ["Atari ST Audio File", "Audio file used by the Atari ST, an older computer system that was discontinued in the early 1990s; contains an audio loop or track that can be played back with the Atari ST YM chip; supports storage for the song name, author, comments, and the audio data itself.", "Windows, Mac, Linux, ", "['Audio Overload', 'ST-Sound', 'YMTOOL', 'YM to XM', 'Nullsoft Winamp with Chipamp plug-in', 'Nullsoft Winamp with V_Soft Vortex AY/YM Chip Emulator plug-in', 'Microsoft Internet Explorer with ST-Sound plug-in']['Audio Overload']['Audio Overload']"], "yfs": ["YSFLIGHT Mission File", "Game file used by YSFLIGHT, a free, cross-platform flight simulation game; stored in plain text and contains properties for mission obstacles and objectives; can specify enemy aircraft, starting positions, weather conditions, and other factors.", "Windows, Mac, Linux, ", "['YSFLIGHT', 'YSFLIGHT Scenery Editor']['YSFLIGHT']['YSFLIGHT']"], "yenc": ["yEnc File", "Encoded file that has been converted from binary to text using yEnc encoding; includes less overhead than Base64 and uuencode (.UUE) files, which allows for more efficient encoding.", "Windows, Mac, Linux, ", "['Smith Micro StuffIt Deluxe for Windows']['Smith Micro StuffIt Deluxe 16'][]"], "ydt": ["Yu-Gi-Oh! Power of Chaos Data File", "File used by Yu-Gi-Oh! Power of Chaos, a video game based on the Yu-Gi-Oh! trading card game; contains game data used for storing and loading game information; saved in the Yu-Gi-Oh! Power of Chaos Common\\[playername]\\ directory with the filename trunk.ydt.", "Windows, ", "[]"], "yka": ["Yenka Model File", "File created by Yenka, a program used by teachers for making interactive lessons; saves a \"Model,\" which can include shapes, written text, mathematical equations, and other mathematical constructs; used for teaching 2D and 3D mathematical concepts.", "Windows, Mac, ", "['Crocodile Clips Yenka']['Crocodile Clips Yenka']"], "ygf": ["Y Graph Format File", "Graph file created by yEd Graph Editor, a cross-platform graph editor; stores vertices and edges that comprise the graph, as well as the layout of the graph on the software's designing canvas; saved in a binary format.", "Windows, Mac, Linux, ", "['yWorks yEd Graph Editor']['yWorks yEd Graph Editor']['yWorks yEd Graph Editor']"], "ydl": ["PowerFlip YAODL 3D Image File", "3D model used by PowerFlip, a program used to view and rotate three-dimensional models; may include polygons, quad-meshes, NURBS, texture coordinates, and object properties; supports colors for objects, facets, and vertices.", "Windows, Linux, ", "[][]"], "ydr": ["Yu-Gi-Oh! Power of Chaos Replay File", "Recording of a duel from \"Yu-Gi-Oh! Power of Chaos\" that can be played back at a later time; may be saved by one of the three Power of Chaos games: Yugi the Destiny, Kaiba the Revenge, and Joey the Passion.", "Windows, ", "[]"], "ychat": ["Yahoo! Messenger Chat Log", "Log file created by Yahoo! Messenger for Mac, an online chatting application; contains a log of the messages sent back and forth; saved with the current date and the contact in the filename; can be used for reviewing the conversation history.", "Mac, ", "['Yahoo! Messenger']"], "ydk": ["Yu-Gi-Oh! Deck File", "Yu-Gi-Oh! deck file used by YGOPRO, a Yu-Gi-Oh! dueling game that allows you to play on or offline; contains a deck of virtual playing cards; includes life points, counters, and card effects.", "Windows, Mac, Linux, Android, ", "['YGOPRO']['YGOPRO']['YGOPRO']['YGOPRO']"], "ybk": ["YanCEyWare eBook", "Electronic book that can be read on a desktop computer using YanCEyDesktop; can also be read on a Pocket PC PDA using YanCEyWare Reader; supports text, graphics, highlighting, links across e-books, and page viewing history; common format used for storing The Church of Latter-day Saints literature and other religious texts, though it can be used for other nonfiction and fictional texts as well.", "Windows, Windows, ", "[][]"], "yaodl": ["PowerFlip 3D Image File", "3D model used by PowerFlip, a program used to view and spin 3D objects; may contain polygons, NURBS, quad-meshes, object parameters, textures, and colors for objects, facets, and vertexes.", "Windows, Linux, ", "[][]"], "ydc": ["Yu-Gi-Oh! Card Deck File", "File used by Yu-Gi-Oh! Power of Chaos, a fantasy trading card game adapted for computers; contains a card deck that has been created by a game user; allows users to save and load different assortments of card decks for game play.", "Windows, ", "[]"], "ybd": ["YobiDrive Link File", "File used by YobiDrive, a file sharing service that provides secure online storage locations for files and folders; saves a link to a file or folder available on a YobiDrive; used as a shortcut to a remote file stored on a YobiDrive, such as a document or a video.", "Windows, Mac, iOS, Android, ", "['YobiDrive']['YobiDrive']['YobiDrive']['YobiDrive']"], "yaml": ["YAML Document", "File created in the YAML (YAML Ain't Markup Language) format, a human-readable data format used for data serialization; used for reading and writing data independent of a specific programming language; can be used with various languages that support YAML libraries, such as C/C++, Ruby, Python, Java, Perl, C#, and PHP.", "Windows, Mac, Linux, iOS, ", "['File Viewer Plus', 'gVim', 'text editor']['MacroMates TextMate', 'text editor']['text editor']['Alexander Blach Textastic Code Editor']"], "ycm": ["Yugioh Card Maker File", "Custom trading card created with Yugioh Card Maker; use for playing Yu-Gi-Oh!, a collectible card game based on the Duel Monsters trading card game; Yu-Gi-Oh! is available in both Japanese and English versions.", "Windows, ", "[]"], "yam": ["Yahoo! Auctions Data", "Data file created by Yahoo! Seller's Manager, a desktop auction management program for Yahoo! Auctions, an early competitor to eBay; saves auction data such as the seller's information, items for sale, and item categories.", "Windows, ", "[]"], "y4m": ["YUV4MPEG2 Video File", "Video file created in the YUV4Mpeg format; stores a sequence of uncompressed YCbCr images that make up the video frame by frame; used as a raw, color-sensitive video format before compressing into a more popular video format such as MPEG-2 or Matroska (.MKV).", "Windows, Mac, Linux, ", "['FFmpeg']['FFmpeg']['FFmpeg']"], "yab": ["Yabasic Source Code", "Source code written by Yabasic (Yet another Basic) programming software; implements common and simple elements of the basic language, including goto/gosub commands and various types of loops; supports user-defined libraries and subroutines; Yabasic programs are capable of monochrome line graphics and printing.", "Windows, Linux, ", "['Yabasic']['Yabasic']"], "y3a": ["Yu-Gi-Oh! ONLINE 3 Avatar File", "Game file used by Yu-Gi-Oh! ONLINE 3: Duel Accelerator, an online card playing game; saves information about an avatar, which is the player's virtual person in the game; used for loading the avatar for dueling against other players.", "Windows, ", "['Konami Yu-Gi-Oh! ONLINE 3']"], "yal": ["Arts & Letters Clipart Library", "Collection of clipart images used by Arts & Letters software; stores images in vector format so they can be resized without losing quality; may be opened with either Arts & Letters Office edition or the Home/School edition.", "Windows, ", "[]"], "y3d": ["Yu-Gi-Oh! ONLINE 3 Deck File", "Card deck file used by Yu-Gi-Oh! ONLINE 3: Duel Accelerator, an online digital card playing game; contains a deck of cards, or \"recipe,\" that can be used for dueling against other players online; can be a custom user-made deck.", "Windows, ", "['Konami Yu-Gi-Oh! ONLINE 3']"]}