{"z": ["Unix Compressed File", "Compressed file used to store, or \"pack,\" files on Unix-based machines; incorporates a simple compression algorithm that is used to archive files and save disk space; can be decompressed on a Unix system by typing uncompress filename.z, where \"filename.z\" is the name of the file to decompress.", "Windows, Mac, Linux, Android, ", "['File Viewer Plus', 'Smith Micro StuffIt Deluxe for Windows', 'Corel WinZip 21', 'WinRAR 5', '7-Zip']['Smith Micro StuffIt Deluxe 16', 'Incredible Bee Archiver', 'The Unarchiver']['uncompress', 'gzip', 'zcat', 'znew', 'Archive Manager']['File Viewer for Android']"], "zdl": ["Avery DesignPro Label File", "File created by Avery DesignPro, a program that allows users to create printable labels; contains label data such as label size and layout information, graphics, bar codes, and text; used to create labels for mail, CDs, business cards, dividers, greeting cards, and t-shirts.", "Windows, Mac, ", "['Avery DesignPro', 'Avery Design & Print']['Avery Design & Print']"], "zdct": ["Adobe Language File", "Language file used by several Adobe applications; used for localizing the applications into different languages; may contain text for application menus or popup boxes; enables the same software to be reused across multiple languages.", "Windows, Mac, ", "['Adobe After Effects CC 2017', 'Adobe Photoshop Elements 15', 'Adobe Captivate', 'Adobe Dreamweaver CC 2017']['Adobe After Effects CC 2017', 'Adobe Photoshop Elements 15', 'Adobe Captivate', 'Adobe Dreamweaver CC 2017']"], "zeg": ["ZeroG Subtitles File", "Movie subtitles file created in the ZeroG format; defines subtitles in a simple text format and specifies the start and stop time for each subtitle; can be opened by Subtitle Workshop and converted to more popular subtitle formats.", "Windows, ", "['URUWorks Subtitle Workshop', 'text editor']"], "zepto": ["Zepto Virus File", "A ZEPTO file is a ransomware computer virus utilized by cybercriminals.  It contains a virus that copies files on your computer, encrypts them, and deletes the original files in order to force you to pay (most likely bitcoin) to decrypt them.  ZEPTO files are similar to .LOCKY virus files.", "Windows, ", "[]"], "zfsendtotarget": ["Compressed Folder", "Zipped file created by right-clicking a file or folder in Windows and selecting Send To→Compressed Folder; can be decompressed by Windows or decompression program.", "Windows, ", "['Microsoft Windows', 'Corel WinZip 21']"], "zdc": ["CD Catalog Expert Database File", "Catalog of files created by CD Catalog Expert, a file cataloging tool; stores references to files located on hard drives, CD and DVDs, and other disks; stores a list of files with related information (such as a user description) for each file.", "Windows, ", "[]"], "zfx": ["ZipForm File", "File created by ZipForm, a program used to facilitate real estate transactions online; contains real estate forms and other documentation; used for sending real estate information over email.", "Windows, Mac, Linux, ", "['ZipLogix zipForm Standard']['ZipLogix zipForm Standard']['ZipLogix zipForm Standard']"], "zds": ["GZDoom Save File", "Game saved by ZDoom or GZDoom, ported versions of the original Doom 3D first-person shooter; allows gameplay to be saved and loaded at a later time.", "Windows, Windows, ", "['ZDoom', 'GZDoom']['Avery DesignPro']"], "zfo": ["XSL-FO Online Form", "Online form that saves data in a standard XML format; also called an XSL-FO or XSL form; XSL-FO is a markup language that defines how the XML data is formatted; ZFO files are often used for online forms, such as registration forms; they can be filled out using the 602XML Filler.", "Windows, ", "[]"], "zdp": ["Avery DesignPro Label File", "File created by DesignPro, an application used for creating and printing labels; contains the graphics and layout information for a label; used for business cards, mail, CDs, t-shirts, and greeting cards.", "Windows, ", "['Avery DesignPro']"], "zdb": ["Zimbra Database File", "Email data file created by Zimbra Connector for Microsoft Outlook (ZCO), a plug-in for Outlook used to manage Zimbra email accounts; saved in the Outlook .PST format but uses the \".zdb\" extension instead; can be imported into an Outlook profile by first renaming the file extension to \".pst.\"", "Windows, Windows, Windows, Mac, ", "['Microsoft Outlook with Zimbra Connector plugin'][]['Intuit Quicken']['Intuit Quicken']"], "zblorb": ["Z-machine Package Game File", "Z-machine game file used by Interactive Fiction (IF) interpreters such as Zoom and Spatterlight; contains the story contents in a Blorb wrapper which enables inclusion of other gameplay files, such as .AIFF files for sound effects and .MOD files for music.", "Windows, Mac, Linux, Android, ", "['Windows Frotz']['Zoom', 'Spatterlight']['Zoom']['Onyxbits Text Fiction']"], "zap": ["ZoneAlarm Pro Data File", "Data file used by Zone Alarm utilities; contains security information and settings referenced by the program; common ZAP files include alert.zap, email.zap, filter.zap, firewall.zap, programs.zap, and security.zap.", "Windows, Windows, Windows, ", "['ZoneAlarm Antivirus 2017', 'ZoneAlarm Internet Security Suite 2017', 'ZoneAlarm Pro Firewall 2017']['Microsoft Windows Server 2016', 'Microsoft Group Policy Management Console', 'Microsoft Notepad', 'text editor'][]"], "zad": ["Carmageddon Game Data File", "Compressed game data file used by Carmaggedon: Reincarnation, a car racing game; contains compressed game data that alters gameplay, such as opponents, races, and power ups; similar to a .ZIP file but uses the ZAD extension.", "Windows, Mac, Linux, ", "['Stainless Games Carmageddon: Reincarnation', 'Corel WinZip 21', '7-Zip']['Stainless Games Carmageddon: Reincarnation', 'Corel WinZip Mac 5']['Stainless Games Carmageddon: Reincarnation', 'funzip', 'p7zip']"], "zabw": ["Compressed AbiWord Document File", "Compressed document created by AbiWord, an open source word processor; contains an .ABW document that has been compressed using Gzip compression; differs from an .BZABW file, which is compressed with Bzip2 compression.", "Windows, Mac, Linux, ", "['AbiSource AbiWord']['AbiSource AbiWord']['AbiSource AbiWord']"], "zzzzz": ["Ransomware Encrypted File", "A ZZZZZ file is a file encrypted by Locky ransomware, a virus utilized by cybercriminals.  It contains a user's personal file, such as a .TXT or .PNG file, encrypted with AES-265 and RSA methods.  ZZZZZ files became popular in 2016.", "Windows, ", "[]"], "zz": ["Zzip Compressed Archive", "File archive compressed with Zzip, a compression tool for Windows and Unix; uses a compression algorithm based primarily on the Burrows-Wheeler Transform method; supports file integrity tests and built-in multimedia detection and compression.", "Windows, Linux, ", "[][]"], "zzz": ["CCleaner Securely Deleted File", "File created by CCleaner, a utility used for optimizing computers by removing unused programs and files; stores a deleted file that has been securely wiped, which enables greater security since the original filename no longer exists; uses the filename ZZZZZZZZ.ZZZ.", "Windows, Windows, Mac, ", "['Piriform CCleaner 5']['Lionhead Studios Black and White']['Lionhead Studios Black and White']"], "zxp": ["Extension Manager Package", "Extension that adds additional capabilities to an Adobe software program; can be installed and removed using Adobe Extension Manager; saved in a zipped format that is decompressed when the extension is installed.", "Windows, Mac, ", "['Adobe Extension Manager CC']['Adobe Extension Manager CC']"], "zw": ["Zooper Widget Template", "Compressed .ZIP archive created and used by Zooper Widget Pro, an android app used to create custom Android widgets; stores a template with all the resources of the widget such as bitmaps and fonts.", "Android, Windows, Mac, Linux, ", "['MYCOLORSCREEN Zooper Widget Pro'][][][]"], "zvz": ["Possible Virus File", "Unknown file type typically downloaded from the Internet; may be transferred via the BitTorrent protocol along with .TORRENT files; no known file association.", "Windows, Mac, ", "[][]"], "zvt": ["Photoshop Zoomify Preset File", "Settings file created by Photoshop graphics editing software; saves presets for the Zoomify export feature, which allows large images to be exported for viewing as a zoomable widget in a Web browser; can be accessed through the File → Export → Zoomify... application menu option.", "Windows, Mac, ", "['Adobe Photoshop CC 2017']['Adobe Photoshop CC 2017']"], "zvr": ["SAFA Media Audio File", "Audio file created by SAFA mobile recording devices; contains audio data recorded by a mobile device user; can be played back on a SAFA device or in a software media player program with the appropriate codec.", "Windows, ", "['Microsoft Windows Media Player']"], "zvd": ["ZyXEL Voice File", "Audio format used for transferring voice over the Z-Fax fax/modem from ZyXEL Communications.", "Windows, ", "[]"], "zvi": ["Zeiss Vision Image", "A ZVI file is an image saved in the Zeiss Vision Image (ZVI) format.  It contains a high-resolution image captured by a Zeiss microscope that supports up to 3x16 bit color and 16 bit monochrome.   ZVI files also include metadata, such as camera and microscope settings.", "Windows, ", "['Carl Zeiss AxioVision']"], "zvpl": ["Visual Paradigm License File", "Software license file used by the Visual Paradigm Suite, a suite of diagramming and documentation applications; saves registration information for one or more programs; enables users to activate trial and purchased versions of the software.", "Windows, Mac, Linux, ", "['Visual Paradigm Suite']['Visual Paradigm Suite']['Visual Paradigm Suite']"], "zul": ["ZK User Interface File", "Web file created in the ZK User Interface Markup Language (ZUML), an XML-based language supported by Ajax technology and Java classes; contains definitions for user interface elements as well as zscript code.", "Windows, Mac, Linux, ", "['Microsoft Internet Explorer', 'Mozilla Firefox', 'Web browser']['Apple Safari', 'Mozilla Firefox']['Mozilla Firefox']"], "ztmp": ["Steam Compressed Game Resource File", "Game resource stored by Steam's Half-Life Dedicated Server Update Tool (HLDS), a network server application used for hosting game files; contains a compressed file, such as a game map, audio file, or other game data; used by game clients for automatically downloading updates and custom content within hosted multiplayer gaming environments.", "Windows, Linux, ", "['Valve Steam HLDS Update Tool']['Valve Steam HLDS Update Tool']"], "ztf": ["DVD Label Template File", "Avery template included with Digital Video Duplicator software; used for printing DVD labels on Avery-formatted disc label paper; saved in a proprietary format that is only recognized by Digital Video Duplicator.", "Windows, ", "[]"], "ztr": ["DVD Label Template Media File", "Contains images and artwork used by Digital Video Duplicator template (.ZTF) files; located in the /Tmplts/ directory along with the corresponding template files; saved in a proprietary format that is only used by Digital Video Duplicator.", "Windows, ", "[]"], "ztd": ["Zoo Tycoon Data Archive", "Game data file used by Zoo Tycoon, a zoo simulation game; serves as an add-on that adds extra features to the game; includes scenery, items, animals, and artificial intelligence data.", "Windows, ", "[]"], "zt": ["Mental Ray Image Depth File", "Contains a depth map for a 3D model created with Mental Ray, a high-performance rendering engine for generating photorealistic images; recognized by most Autodesk 3D software programs.", "Windows, ", "['Autodesk Maya 2017', 'Autodesk 3ds Max 2017']"], "zst": ["ZSNES Save File", "Game file saved by ZSNES, a Super Nintendo emulator for Windows and Linux; stores game progress in a saved state so that the game can be opened and resumed at a later time; now also supported by the Snes9x emulator. ", "Windows, Mac, Linux, ", "['ZSNES', 'Snes9x']['Snes9x']['ZSNES', 'Snes9x']"], "zsplit": ["Archiver Compressed Split File", "Compressed file created by Archiver, a program for Mac OS X users that helps them create archives, compress files, and extract archives; stores a file that has been split into \"chunks\" of user-specified size and compressed with Bzip compression in order to reduce the file size.", "Mac, ", "['Incredible Bee Archiver']"], "zs9": ["ZSNES Slot 9 Saved State File", "File saved by ZSNES, an SNES emulator for PCs; stores an emulated game save state that is stored in slot 9; used to store a snapshot of game progress; can be saved and loaded at any point during a game.", "Windows, ", "['ZSNES']"], "zsd": ["Dave Mirra Freestyle BMX Data File", "Game data file used by the Playstation games \"Dave Mirra Freestyle BMX\" and \"Dave Mirra Freestyle BMX 2;\" contains audio and video data that is referenced during gameplay; may be opened on a PC using a third-party utility such as Game Extractor or MFAudio.", "Windows, Mac, ", "['MFAudio']['MFAudio']"], "zs8": ["ZSNES Slot 8 Saved State File", "File saved by ZSNES, an SNES emulator for PCs; contains an emulated save state of game progress; can be used to save and load game progress at any point during a game.", "Windows, Linux, ", "['ZSNES']['ZSNES']"], "zs6": ["ZSNES Slot 6 Saved State File", "Save state file created by ZSNES, an SNES emulator program; contains a snapshot save state from an emulated SNES game; used for saving and loading game progress; may be used to save state at any point during gameplay.", "Windows, Linux, ", "['ZSNES']['ZSNES']"], "zs7": ["ZSNES Slot 7 Saved State File", "Save state file created by ZSNES, an SNES emulator program for PCs; contains an emulated save state snapshot of the game progress; may be used to save state at any point during gameplay.", "Windows, Linux, ", "['ZSNES']['ZSNES']"], "zs5": ["ZSNES Slot 5 Saved State File", "Save state file created by ZSNES, a Super Nintendo Entertainment System (SNES) emulator for PCs; stores a saved game snapshot that can be loaded at another time; used to save and load game progress.", "Windows, Linux, ", "['ZSNES']['ZSNES']"], "zs4": ["ZSNES Slot 4 Saved State File", "Save state file created by ZSNES, a Super Nintendo Entertainment System (SNES) emulator for PCs; stores a saved game snapshot that can be loaded at another time; used to save and load game progress.", "Windows, Linux, ", "['ZSNES']['ZSNES']"], "zs3": ["ZSNES Slot 3 Saved State File", "Save stat file created by ZSNES, an SNES emulator for PCs; stores a saved game snapshot for an emulated game; used to save and load game progress.", "Windows, Linux, ", "['ZSNES']['ZSNES']"], "zs2": ["ZSNES Slot 2 Saved State File", "Save state file created by ZSNES, an SNES emulator for PCs; contains a saved game snapshot; used to save and load game progress independent of the in-game save and load mechanisms.", "Windows, Linux, ", "['ZSNES']['ZSNES']"], "zs0": ["ZSNES Slot 0 Saved State File", "File saved by ZSNES, a Super Nintendo Entertainment System (SNES) emulator for PCs; contains a saved state snapshot of an emulated SNES game; used to save and load game progress at any point during a game.", "Windows, Linux, ", "['ZSNES']['ZSNES']"], "zs1": ["ZSNES Slot 1 Saved State File", "File saved by ZSNES, a computer-based SNES emulator; stores a saved game snapshot that can be loaded at another time; used to save and load game progress.", "Windows, Linux, ", "['ZSNES']['ZSNES']"], "zrtf": ["Nisus Compressed Rich Text File", "Text file created by Nisus Writer Pro, a word processor; contains rich text, shapes, tables, lists, comments, and other text editing features; compressed gzip (compression format) version of the .RTF file, which means it takes up less disk space and is more easily transferred.", "Mac, ", "['Nisus Writer Pro']"], "zps": ["Zebra Portable Safe File", "Encrypted archive created by ZPS Explorer, a program used for securely sharing files; contains one or more files (documents, pictures, etc.) that the user wants to protect and share; incorporates encryption, but uses a private key owned by the archive's creator rather than passwords.", "Windows, ", "['Zebra Digital Assets ZPS Explorer']"], "zpl": ["Zoom Player Play List", "Playlist format used by Zoom Player, a DVD and media player for Windows designed to work with home entertainment systems; saved in a text format that uses custom tags to define information about each item in the playlist.", "Windows, Windows, ", "['Inmatrix Zoom Player 8']['Microsoft Zune']"], "zpi": ["Zipped File", "Zip file created using Zip compression, but with a renamed file extension; commonly used to rename a .ZIP file extension for an email attachment in order to pass through an email filter.", "Windows, Mac, Linux, Windows, Mac, ", "['Smith Micro StuffIt Deluxe for Windows', 'Corel WinZip 21', 'WinRAR 5', '7-Zip', 'PKZip', 'E-merge WinAce', 'Zipeg', 'TUGZip', 'Microsoft Windows zip utility']['Smith Micro StuffIt Deluxe 16', 'MacItBetter BetterZip', 'Zipeg', 'Apple Archive Utility']['funzip', 'p7zip']['Nuance Power PDF Standard']['Nuance PDF Converter for Mac 6']"], "zpf": ["Form•Z Preferences File", "Application preferences file created by form•Z, a program used for 3D surface and solids modeling; created from the \"General\" section of the Preferences window (Edit → Preferences...) and stores application defaults that can be modified by the user.", "Windows, Mac, ", "['AutoDesSys form•Z']['AutoDesSys form•Z']"], "zpa": ["Vielklang Audio Metadata File", "File generated by vielklang, a digital audio workstation (DAW) plug-in tool used for automatically creating musical harmonies; contains melody properties about an imported audio file (often a .WAV file); includes notes, keys, and tuning frequency information; used by vielklang when computing harmonies.", "Windows, ", "['zplane vielklang', 'Image-Line FL Studio with zplane NewTone plug-in', 'Steinberg Cubase with zplane vielklang plug-in']"], "zoo": ["Zoo Compressed File", "Old compression format used on Unix systems; based on the Lempel-Ziv compression algorithm and reduces file size between 20 and 80 percent, depending on the file type; later replaced by .ARC compression.", "Windows, Mac, Linux, Windows, ", "['ESTsoft ALZip', 'E-merge WinAce']['The Unarchiver'][][]"], "zon": ["OmniPage Zone Template File", "File used by OmniPage, a program that uses OCR technology to transform images and other files into searchable text documents; stores framed areas, or zones, of an image that should be processed with OmniPage's OCR algorithm; allows the zones to be saved and reused across multiple documents, which is helpful when processing large sets of documents that have the same page layout template.", "Windows, Mac, Linux, ", "['Nuance OmniPage Ultimate']['Nuance OmniPage Ultimate'][]"], "zno": ["Zinio Electronic Magazine File", "Digital magazine format used for saving and distributing electronic versions of magazines and other publications; maintains all the formatting, text, and graphics from the original publication; can be viewed page by page like an actual magazine.", "Windows, Mac, ", "['Zinio Reader']['Zinio Reader']"], "zmv": ["ZSNES Movie File", "Video capture of a game played with ZSNES, a Super Nintendo emulation program; saves a recording of the gameplay in a proprietary format that can only be played back in ZSNES; may be shared with other users to show game secrets or demonstrate how to beat a level.", "Windows, Linux, ", "['ZSNES']['ZSNES']"], "zml": ["Zooming Markup Language File", "XML file that describes the position, state, and associated metadata of objects in a Zooming Space; typically contains information about Zooming Image (.ZIF) Files published on the Zoomorama website.", "Windows, ", "[]"], "zmc": ["ZoneAlarm Quarantine File", "File created by ZoneAlarm Antivirus, an antivirus program that protects computers against viruses, malware, and hackers; contains email file attachment contents that are flagged as suspicious; used for identifying and quarantining suspicious email attachments.", "Windows, ", "['ZoneAlarm Antivirus 2017']"], "zm9": ["ZoneAlarm MailSafe Renamed Zip File", "Zip file renamed by MailSafe, an e-mail security program that is included with ZoneAlarm software; typically received as an e-mail attachment and quarantined by MailSafe to make sure it does not contain any viruses or malicious code.", "Windows, ", "['ZoneAlarm Pro Firewall 2017', 'Corel WinZip 21']"], "zmap": ["Zombies Ate My Neighbors Map File", "Contains level data for Zombies Ate My Neighbors (ZAMN), an overhead action game initially released in the early 1990s; includes map data, items, characters, and monsters within the level; can be edited using the \"ZAMN Level Editor.\"", "Windows, ", "[]"], "zma": ["Impedance File", "Data file created by the SPL Tracer, a speaker frequency response and impedance graph tracer application; contains speaker data, such as impedance level units and phase information necessary for drivers; similar to .FRD files.", "Windows, ", "[]"], "zm3": ["ZoneAlarm Renamed NCH File", "Microsoft Outlook Express Folder (.NCH) file renamed by ZoneAlarm Mailsafe, part of the ZoneAlarm Internet Security Suite; renames the file extension of an Outlook Express folder as a safely precaution so that it cannot run malicious code.", "Windows, Windows, Linux, ", "['ZoneAlarm Internet Security Suite 2017']['ZSNES']['ZSNES']"], "zm2": ["ZoneAlarm Renamed MDZ File", "Microsoft Access Wizard (.MDZ) file renamed by ZoneAlarm Mailsafe, part of the ZoneAlarm Internet Security Suite; renames the file extension so that the Access Wizard, which is an executable file type, cannot be run directly from Windows.", "Windows, Windows, Linux, ", "['ZoneAlarm Internet Security Suite 2017']['ZSNES']['ZSNES']"], "zm1": ["ZoneAlarm Renamed MDA File", "Microsoft Access Add-in (.MDA) file renamed by ZoneAlarm Mailsafe, part of the ZoneAlarm Internet Security Suite; renames the file extension so that the Access Add-in, which is an executable file type, cannot be run directly by Windows.", "Windows, Windows, Linux, ", "['ZoneAlarm Internet Security Suite 2017']['ZSNES']['ZSNES']"], "zlb": ["Form•Z Symbol Library File", "File used by form•Z, an application used for 3D surface modeling; contains a symbol library of reusable drafting items, such as buildings, trees, furniture, cars, or other objects; enables symbols to be exported and imported with the software.", "Windows, Mac, Windows, Mac, Linux, ", "['AutoDesSys form•Z']['AutoDesSys form•Z']['Windows Frotz']['Zoom', 'Spatterlight']['Zoom']"], "zl9": ["ZoneAlarm Quarantined EXE File", "Quarantined .EXE file renamed by ZoneAlarm Antivirus, an antivirus program; contains the exact contents of an executable file, but with the extension renamed to \".zl9;\" used to quarantine potentially harmful executable files discovered in email attachments.", "Windows, ", "['ZoneAlarm Antivirus 2017']"], "zl": ["Zlib Compressed File", "File compressed by Zlib, an open source software compression library that uses the DEFLATE compression algorithm; contains a compressed file; not supported by common file compression and decompression utilities.", "Windows, Mac, Linux, ", "['Zlib']['Zlib']['Zlib']"], "zix": ["WinZix Compressed File", "File archive compressed using WinZix compression; claims to use a higher compression ratio and perform faster compression than comparable file archiving utilities.", "Windows, Linux, Windows, Mac, ", "[][]['Intuit Quicken']['Intuit Quicken']"], "zipx": ["Extended Zip File", "A ZIPX file is a compressed .ZIP file saved in the extended Zip format, which creates smaller files than the previous versions of the Zip format.  ZIPX files contain one or more files saved as a compressed file archive.", "Windows, Mac, Linux, Android, ", "['File Viewer Plus', 'Corel WinZip 21', 'PeaZip', 'ConeXware PowerArchiver', 'B1 Free Archiver']['Corel WinZip Mac 5', 'The Unarchiver', 'B1 Free Archiver']['B1 Free Archiver']['B1 Free Archiver', 'RARLAB RAR']"], "zip": ["Zipped File", "A ZIP file is an archive that contains one or more files compressed or \"zipped\" using Zip compression.  It stores files separately from each other allowing the files to be compressed using different methods and extracted without compressing or decompressing the entire archive.", "Windows, Mac, Linux, Android, Windows, Mac, ", "['File Viewer Plus', 'Corel WinZip 21', 'WinRAR 5', 'PeaZip', 'ConeXWare PowerArchiver', 'Smith Micro StuffIt Deluxe', '7-Zip', 'B1 Free Archiver']['Corel WinZip Mac 5', 'Smith Micro StuffIt Deluxe 16', 'Apple Archive Utility', 'Incredible Bee Archiver', 'The Unarchiver', 'B1 Free Archiver']['funzip', 'p7zip', 'B1 Free Archiver', 'File Roller', 'PeaZip']['File Viewer for Android', 'RARLAB RAR', 'ZDevs ZArchiver']['MAME', 'ExtraMAME']['MacMAME', 'MAME OS X']"], "zim": ["OpenZIM Wiki Archive", "Archive created in the OpenZIM format, a standard file format for storing Wiki content offline; organizes articles, references, and other Wiki information in a compact format; supported by readers such as Kiwix and ZIMReader.", "Windows, Mac, Linux, Android, ", "['Kiwix']['Kiwix']['Kiwix', 'ZIMReader', 'ZIMLib']['Kiwix']"], "zif": ["Zooming Image Format File", "Raster image file saved in the multi-resolution zooming image format used by Zoomorama software; designed to allow for effortless manipulation of HD images.", "Windows, ", "[]"], "zi": ["Renamed Zip File", "Zip archive that has been renamed from \".zip\" to \".zi;\" contains one or more files in a compressed archive; commonly used to bypass email filters that prevent the transmission of .ZIP files.", "Windows, Mac, Linux, ", "['Smith Micro StuffIt Deluxe for Windows', 'Corel WinZip 21', '7-Zip', 'PKZip', 'TUGZip']['Smith Micro StuffIt Deluxe 16'][]"], "zhtml": ["RabbitWeb Webpage", "Webpage parsed by RabbitWeb, a Web server that integrates .C program code with special HTML tags; contains \"ZHTML\" commands embedded within the webpage that are used to generate dynamic content for the webpage; can sometimes be seen as \".zhtml\" in a Web browser's URL.", "Windows, Windows, ", "['Digi International RabbitWeb', 'Web browser'][]"], "zgr": ["BeatSlicer Groove File", "Groove file created by BeatSlicer and BeatCreator, which are tools that allow users to slice beats to manipulate loops; contains the slicing scheme of a .WAV loop file; does not contain the actual audio data", "Windows, ", "['Image-Line FL Studio']"], "zgm": ["Zenographics Image File", "Image created by Zenographics graphic rendering software programs; typically used for storing prepared images for print; stored in a format designed to increase the speed at which office documents are printed.", "Windows, Mac, ", "[][]"], "zab": ["Zipped Audio Book", "Compressed audiobook unzipped by ZIP programs, such as WinZip and Pacifist; contains recorded audio for a book, which enables you to listen to the book; stored in the compressed ZIP format in order to transfer large audio files.", "Windows, Mac, Linux, ", "['Corel WinZip 21', 'VideoLAN VLC media player']['CharlesSoft Pacifist', 'MacItBetter BetterZip', 'VideoLAN VLC media player', 'PKZip']['VideoLAN VLC media player']"], "z80": ["TI-83 and 84 Plus Calculator File", "Data file used by the Texas Instruments TI-83 and TI-84 Plus series calculators; may be used for a variety of purposes, including storing information that describes characters, such as Falco, Fox, and Jigglypuff, used in the Super Smash Bros. Open game.", "Windows, Mac, ", "['Texas Instruments TI Connect']['Texas Instruments TI Connect']"], "z8": ["Z-machine Z-code Version 8 File", "File used by the Z-machine, a game engine developed by Infocom and used for running text adventure games (originally used for the game Zork); stores source code for the game; can be run by a Z-machine interpreter, several of which have been maintained by community members since the original Z-machine was discontinued.", "Windows, Mac, Linux, Web, Android, ", "['Windows Frotz']['Spatterlight', 'Zoom']['Zoom']['Parchment']['Onyxbits Text Fiction', 'Twisty']"], "z7": ["Z-machine Z-code Version 7 File", "Z-code game file used by the Z-machine game engine , which was used for playing text adventure games in the late 1970s and 80s; contains source code for the game;  includes graphics referenced in the game; commonly run by a Z-machine interpreter, examples of interpreters are listed in the programs section; similar to the .ULX file.", "Windows, Mac, Linux, Web, Android, ", "['Windows Frotz']['Spatterlight', 'Zoom']['Zoom']['Parchment']['Twisty']"], "z5": ["Z-machine Z-code Version 5 File", "Game file used by the game engine Z-machine, which was used for running text adventure games in the late 1970s and 80s; commonly run presently by a Z-machine interpreter, several of which have been maintained by community members since the Z-machine was discontinued; contains source code for the games and can hold up to 256K.", "Windows, Mac, Linux, Web, Android, ", "['Windows Frotz']['Spatterlight', 'Zoom']['Zoom']['Parchment']['Onyxbits Text Fiction', 'Twisty']"], "z64": ["Nintendo 64 Game ROM", "Video game ROM image from a Nintendo 64 game; contains an exact copy of the data from an N64 game cartridge; playable on a PC using N64 emulation software.", "Windows, Mac, Linux, Android, ", "['Project64', '1964', 'Mupen64Plus', 'UltraHLE', 'Nemu64', 'SupraHLE', 'Daedalus']['sixtyforce', 'Mupen64Plus']['Mupen64Plus']['N64oid']"], "z6": ["Z-machine Z-code Version 6 File", "Z-code file used by the Z-machine game engine , which was used for running text adventure games in the late 1970s and 80s; contains source code for the game; includes graphics referenced in the game unlike previous Z-code file versions; commonly run by a Z-machine interpreter, several programs are listed below.", "Windows, Mac, Linux, Web, Android, ", "['Windows Frotz']['Zoom']['Zoom']['Parchment']['Twisty']"], "z4": ["Z-machine Z-code Version 4 File", "Z-code file used by the game engine Z-machine, which ran text adventure games in the late 1970s and 80s; commonly run presently by a Z-machine interpreter, several of which have been maintained by community members since the Z-machine was discontinued; contains source code for the games; similar to the Glulx formatted .ULX file extension.", "Windows, Mac, Linux, Web, Android, ", "['Windows Frotz']['Spatterlight', 'Zoom']['Zoom']['Parchment']['Twisty']"], "z3d": ["ZModeler 3D File", "3D image file created by ZModeler, a free 3D modeling program; stores the three-dimensional geometry of one or more objects; can also include effects such as lighting; most often used for saving models of racing cars and other vehicles.", "Windows, ", "['Zanoza ZModeler']"], "z2s": ["Zoo Tycoon 2 Saved Game", "Saved game file created with Zoo Tycoon, a zoo simulation game that allows players to operate zoos.  It contains saved game progress so that the player can resume the game at another time.  Z2S should be stored in the \"Saved Games\" folder within the Zoo Tycoon directory.", "Windows, ", "[]"], "z3": ["Z-machine Z-code Version 3 File", "Game file used by the game engine Z-machine, which was used for running text adventure games in the late 1970s and 80s; commonly run presently by a Z-machine interpreter, several of which have been maintained by community members since the Z-machine was discontinued; contains source code for the games.", "Windows, Mac, Linux, Web, Android, ", "['Windows Frotz']['Spatterlight', 'Zoom']['Zoom']['Parchment']['Onyxbits Text Fiction', 'Twisty']"], "z2f": ["Zoo Tycoon 2 Object File", "File used by Zoo Tycoon 2, a video game that allows players to operate zoos; contains data used to display zoo animals, exhibits, and other scenery; typically used to extend game content with additional zoo animals.", "Windows, ", "[]"], "z2": ["Z-machine Z-code Version 2 File", "File used by Z-machine, a game engine used for running text adventure games in the late 1970s and 80s; contains source code for games developed for the Apple II and TRS-80 Model I computers; only run by a Z-machine interpreter presently, several of which have been maintained by community members since the Z-machine was discontinued.", "Windows, Mac, Linux, Web, Android, ", "['Windows Frotz']['Spatterlight', 'Zoom']['Zoom']['Parchment']['Twisty']"], "z04": ["WinZip Fourth Split Zip File", "The fourth part of a split archive created with the WinZip file compression program; uses the same compression as a standard .ZIP file, but must be decompressed with related split archives.", "Windows, Mac, ", "['Corel WinZip 21', 'Smith Micro StuffIt Deluxe for Windows', 'ConeXware PowerArchiver']['Smith Micro StuffIt Deluxe 16', 'The Unarchiver']"], "z1": ["ZoneAlarm Renamed VB File", "Visual Basic script (.VB file) renamed by ZoneAlarm anti-virus and system security software; the extension is changed so the file cannot be accidentally run.", "Windows, Windows, Mac, Linux, Web, Android, ", "['ZoneAlarm Antivirus 2017', 'ZoneAlarm Internet Security Suite 2017']['Windows Frotz']['Spatterlight', 'Zoom']['Zoom']['Parchment']['Twisty']"], "z03": ["WinZip Third Split Zip File", "The third file of a split archive created with WinZip, a popular file compression utility; uses the same compression as a standard .ZIP file, but is part of a collection of files that make up a single archive.", "Windows, Mac, ", "['Corel WinZip 21', 'Smith Micro StuffIt Deluxe for Windows', 'ConeXware PowerArchiver']['Smith Micro StuffIt Deluxe 16', 'The Unarchiver']"], "z02": ["WinZip Second Split Zip File", "The second part of a split archive created with WinZip; uses the same compression as a standard .ZIP file, but must be decompressed along with other related split archives.", "Windows, Mac, ", "['Corel WinZip 21', 'Smith Micro StuffIt Deluxe for Windows', 'ConeXware PowerArchiver']['Smith Micro StuffIt Deluxe 16', 'The Unarchiver']"], "z01": ["WinZip First Split Zip File", "The first of multiple files that make up a split archive created with WinZip; uses the same compression as a standard .ZIP file, but must be decompressed along with the related split archives (.Z02, .Z03, etc.).", "Windows, Mac, ", "['Corel WinZip 21', 'Smith Micro StuffIt Deluxe for Windows', 'ConeXware PowerArchiver']['Smith Micro StuffIt Deluxe 16', 'The Unarchiver']"]}